{
  "id": "itzamna",
  "name": "Itzamna",
  "displayName": "Itzamna - Supreme Creator Deity",
  "mythology": "mayan",
  "title": "Supreme Creator God of the Maya Pantheon",
  "archetypes": [
    "Creator God",
    "Sky Father",
    "Culture Hero",
    "Divine Sage",
    "Cosmic Ruler"
  ],
  "domains": [
    "Creation and cosmic order",
    "Sky, day, and night",
    "Writing and hieroglyphs",
    "Medicine and healing",
    "Learning and wisdom",
    "Priesthood and divination",
    "Agriculture and maize",
    "Kingship and rulership"
  ],
  "symbols": [
    "Cosmic caiman/crocodile (earth floating on waters)",
    "Ak'bal (darkness glyph)",
    "Writing implements (brush, inkpot)",
    "Jade (preciousness, life)",
    "Mirror (divination, seeing)",
    "Royal insignia and headdresses",
    "Muan bird (owl associated with death and knowledge)",
    "Iguana",
    "Principal Bird Deity (celestial aspect)"
  ],
  "epithets": [
    "Itzamnaaj (Classic Maya spelling)",
    "God D (scholarly designation in Schellhas system)",
    "Zamna (colonial period variant)",
    "Yaxcocahmut ('First Green Pheasant')",
    "Lord of the Heavens",
    "The One Who Receives and Possesses the Grace",
    "K'inich Ahau (as solar aspect)"
  ],
  "attributes": [
    "Supreme wisdom and knowledge",
    "Control over cosmic cycles",
    "Power of creation through word and thought",
    "Mastery of all arts and sciences",
    "Authority over other deities",
    "Eternal existence as the oldest god",
    "Shape-shifting (caiman, bird, aged human forms)"
  ],
  "relationships": {
    "consort": "Ix Chel (moon goddess, goddess of weaving and medicine)",
    "son": "K'inich Ahau (sun god, may also be an aspect of Itzamna)",
    "creation": "Father of the cosmos and establisher of the four directions",
    "priesthood": "Patron of the ahkin (priests/shamans)"
  },
  "primarySources": [
    "Dresden Codex",
    "Madrid Codex",
    "Paris Codex",
    "Classic Maya inscriptions and iconography",
    "Books of Chilam Balam",
    "Diego de Landa's Relacion de las cosas de Yucatan",
    "Popol Vuh (related K'iche' traditions)"
  ],
  "relatedEntities": [
    { "id": "ix-chel", "type": "deity", "mythology": "mayan", "relationship": "Consort, moon goddess" },
    { "id": "kinich-ahau", "type": "deity", "mythology": "mayan", "relationship": "Sun aspect or son" },
    { "id": "thoth", "type": "deity", "mythology": "egyptian", "relationship": "Comparative: god of wisdom and writing" },
    { "id": "brahma", "type": "deity", "mythology": "hindu", "relationship": "Comparative: creator god" },
    { "id": "quetzalcoatl", "type": "deity", "mythology": "aztec", "relationship": "Comparative: Mesoamerican culture hero deity" },
    { "id": "zeus", "type": "deity", "mythology": "greek", "relationship": "Comparative: supreme sky god" }
  ],
  "rawMetadata": {
    "relationships": {
      "consort": "Ix Chel",
      "son": "K'inich Ahau (possibly)"
    },
    "epithets": [
      "Itzamnaaj",
      "God D",
      "Zamna",
      "Yaxcocahmut",
      "Lord of the Heavens"
    ],
    "archetypes": ["Creator God", "Sky Father", "Culture Hero"],
    "displayName": "Itzamna",
    "domains": [
      "Creation",
      "sky",
      "day",
      "night",
      "writing",
      "medicine",
      "learning",
      "priesthood",
      "agriculture"
    ],
    "attributes": ["Supreme wisdom", "Creative power", "Cosmic authority"],
    "symbols": [
      "Cosmic caiman",
      "writing implements",
      "jade",
      "mirror",
      "Muan bird"
    ]
  },
  "metadata": {
    "createdBy": "system",
    "source": "migration_merge",
    "verified": false,
    "submissionType": "system",
    "createdAt": {
      "_seconds": 1765593881,
      "_nanoseconds": 765000000
    },
    "enrichedBy": "completeness_analyzer",
    "updatedAt": {
      "_seconds": 1766537049,
      "_nanoseconds": 711000000
    },
    "historicalPeriod": "Classic Maya (c. 250-900 CE) through Postclassic (900-1500 CE)",
    "primaryRegion": "Maya region (Yucatan, Guatemala, Belize, Honduras)"
  },
  "description": "Itzamna (Classic Maya: Itzamnaaj) is the supreme creator deity of the ancient Maya pantheon, embodying the ultimate source of cosmic order, knowledge, and civilization. Depicted as an aged man with a distinctive Roman nose, sunken cheeks, and a single tooth, Itzamna represents the accumulated wisdom of the ages. He created the world, established the calendar, invented writing and hieroglyphic script, taught humanity the arts of medicine and agriculture, and instituted the priestly class. As both the first shaman and the first king, Itzamna legitimated royal authority throughout the Maya world. His multiform nature allowed him to manifest as a cosmic caiman (whose body forms the earth floating on primordial waters), as the Principal Bird Deity (celestial aspect), and as the aged lord of scribes and priests. Paired with his consort Ix Chel, the moon goddess, Itzamna presided over the divine couple whose union ordered the cosmos. His name likely means 'Lizard House' or 'House of the Iguana,' referring to his reptilian aspects and his role as the cosmic dwelling that encompasses all reality. Throughout the Classic and Postclassic periods, Itzamna remained central to Maya religion, invoked in divination, healing, and royal accession rituals, embodying the Maya ideal of wisdom, creativity, and benevolent rulership.",
  "type": "deity",
  "sections": {
    "origins": "Itzamna's origins lie deep in Preclassic Maya religion, though our clearest evidence comes from Classic period (250-900 CE) inscriptions and iconography. His name appears in the earliest decipherable Maya texts, and his distinctive aged face is among the most commonly depicted deity images in Maya art. The etymology 'Itzam' (iguana/lizard) + 'Na' (house) suggests his role as the cosmic dwelling or the reptilian embodiment of the universe. Colonial-period sources like Diego de Landa's 'Relacion' preserve Postclassic traditions about Itzamna as the first priest and inventor of writing, while the Books of Chilam Balam record prophecies and histories attributed to his wisdom.",
    "attributes": "Itzamna possesses supreme divine attributes: he is the eldest of gods, the source of all knowledge, the inventor of civilization's essential arts, and the ultimate legitimator of royal power. His physical form as an aged man emphasizes wisdom and accumulated experience. His reptilian aspects (caiman, iguana) connect him to primordial creation and the earth's structure. As a celestial bird, he represents the sky and solar power. He controls the calendar and cosmic cycles, enabling divination and agricultural timing. His mastery of writing makes him patron of scribes, while his healing knowledge makes him patron of curers. Unlike many supreme gods who become remote, Itzamna remained actively worshipped and invoked throughout Maya history.",
    "significance": "Itzamna's significance to Maya civilization cannot be overstated. As the divine source of writing, he sanctified the scribal arts that recorded history, prophecy, and ritual knowledge. As patron of priests, he authorized the ritual specialists who mediated between humans and gods. As cosmic creator, he established the ordered universe within which Maya life unfolded. Maya kings claimed descent from or identification with Itzamna to legitimate their rule. His festivals marked crucial calendar transitions. Even today, elements of Itzamna's worship persist in syncretic Maya spirituality. Comparatively, Itzamna resembles other culture-hero creator deities like Egyptian Thoth, Hindu Brahma, and Aztec Quetzalcoatl, suggesting widespread Mesoamerican and global patterns of associating supreme divinity with wisdom, writing, and civilization's origins."
  },
  "corpusQueries": [
    "Itzamna Maya supreme creator god",
    "God D Maya deity iconography",
    "Maya writing invention Itzamna",
    "Itzamna Ix Chel divine couple",
    "Classic Maya religion creator deity"
  ],
  "sources": [
    {
      "title": "The Maya",
      "author": "Michael D. Coe and Stephen Houston",
      "type": "secondary",
      "year": 2015
    },
    {
      "title": "Maya Cosmos: Three Thousand Years on the Shaman's Path",
      "author": "David Freidel, Linda Schele, and Joy Parker",
      "type": "secondary",
      "year": 1993
    },
    {
      "title": "Relacion de las cosas de Yucatan",
      "author": "Diego de Landa",
      "type": "primary",
      "period": "c. 1566"
    },
    {
      "title": "The Gods and Symbols of Ancient Mexico and the Maya",
      "author": "Mary Miller and Karl Taube",
      "type": "secondary",
      "year": 1993
    }
  ]
}