{
  "id": "tsukuyomi",
  "name": "Tsukuyomi",
  "displayName": "Tsukuyomi-no-Mikoto (月読尊)",
  "mythology": "japanese",
  "title": "Japanese - Tsukuyomi",
  "archetypes": [
    "Moon God",
    "Night Ruler",
    "Celestial Divinity",
    "Cosmic Order"
  ],
  "domains": [
    "Moon",
    "night",
    "time (calendar)",
    "the passage of months",
    "tides",
    "hunting",
    "darkness",
    "divination"
  ],
  "symbols": [
    "Crescent moon",
    "full moon",
    "silver disc",
    "night sky",
    "rabbits (moon-rabbits)",
    "ocean tides",
    "Rabbit (usagi - associated with the moon in East Asian tradition)",
    "Owl",
    "Nocturnal creatures",
    "Susuki (pampas grass)",
    "Dango rice dumplings (offering during Tsukimi)",
    "Night hours",
    "the fifteenth night of the eighth month (harvest moon)",
    "all full moons"
  ],
  "epithets": [
    "Tsukuyomi-no-Mikoto (月読尊) - \"His Augustness Moon-Reader\" or \"Moon-Counter\"",
    "Tsukiyomi (月読)",
    "Tsukuyomi-no-Kami",
    "Tsuki-no-Kami (Moon God)",
    "Lord of Night",
    "The Silver One",
    "Counter of Months",
    "The Separated Brother",
    "Guardian of Darkness"
  ],
  "attributes": [
    "Mysterious",
    "Reclusive",
    "Orderly",
    "Calculating",
    "Aristocratic"
  ],
  "relationships": {
    "father": "Izanagi-no-Mikoto - born from his right eye during purification",
    "mother": "None directly - born from Izanagi alone after Izanami's death",
    "siblings": [
      {
        "id": "amaterasu-sister-sun-goddess",
        "name": "Amaterasu (sister, sun goddess)",
        "relationship": "sibling"
      },
      {
        "id": "susanoo-brother-storm-god",
        "name": "Susanoo (brother, storm god)",
        "relationship": "sibling"
      }
    ],
    "consort": "Various accounts mention no consort"
  },
  "primarySources": [
    "Kojiki (712 CE) - Record of Ancient Matters",
    "Nihon Shoki (720 CE) - Chronicles of Japan"
  ],
  "relatedEntities": [
    {
      "type": "deity",
      "id": "amaterasu",
      "name": "Amaterasu",
      "relationship": "sister",
      "mythology": "japanese"
    },
    {
      "type": "deity",
      "id": "susanoo",
      "name": "Susanoo",
      "relationship": "brother",
      "mythology": "japanese"
    },
    {
      "type": "deity",
      "id": "izanagi",
      "name": "Izanagi",
      "relationship": "father",
      "mythology": "japanese"
    },
    {
      "type": "deity",
      "id": "thoth",
      "name": "Thoth",
      "relationship": "parallel - Moon God",
      "mythology": "egyptian"
    },
    {
      "type": "deity",
      "id": "sin",
      "name": "Sin (Nanna)",
      "relationship": "parallel - Moon God",
      "mythology": "mesopotamian"
    },
    {
      "type": "deity",
      "id": "selene",
      "name": "Selene",
      "relationship": "parallel - Moon deity",
      "mythology": "greek",
      "_unverified": true,
      "_unverifiedReason": "Referenced entity not found in database"
    }
  ],
  "sections": {
    "origins": {
      "title": "Origins",
      "content": "Tsukuyomi was born from the primordial creator god Izanagi during his purification ritual after escaping from Yomi, the underworld. As Izanagi washed his face in the Tachibana River at Awagihara in Hyuga province, three noble kami emerged: Amaterasu from his left eye, Tsukuyomi from his right eye, and Susanoo from his nose. These three 'noble children' (mihashira no uzu no miko) were assigned to rule the celestial domains. Izanagi entrusted Tsukuyomi with the realm of night, making him the sovereign of darkness and the moon's cycles."
    },
    "mythology": {
      "title": "Mythology",
      "content": "The most significant myth involving Tsukuyomi explains the eternal separation of day and night. Amaterasu sent Tsukuyomi as her representative to visit Uke Mochi, the goddess of food. When Uke Mochi produced a feast by spitting fish from her mouth, rice from her nose, and various foods from other orifices, Tsukuyomi was so disgusted by this manner of producing food that he killed her in rage. When Amaterasu learned of this violence, she declared she would never again look upon her brother's face, and moved to a separate part of the sky. This divine separation is why the sun and moon never appear together, eternally chasing but never meeting in the heavens."
    },
    "attributes": {
      "title": "Attributes",
      "content": "Tsukuyomi embodies the mysterious, calculating nature of the moon itself. He governs the passage of time through lunar cycles, and his name literally means 'moon-reading' or 'moon-counting,' reflecting his role in the ancient Japanese lunar calendar. Unlike his boisterous brother Susanoo or his radiant sister Amaterasu, Tsukuyomi is characterized by restraint, order, and a strict sense of propriety - qualities that ironically led to his violent act against Uke Mochi. He rules over nocturnal activities including hunting, divination, and the mysterious transitions between day and night."
    },
    "culturalRole": {
      "title": "Cultural Role",
      "content": "Despite his relative obscurity compared to Amaterasu, Tsukuyomi holds deep cultural significance in Japan. The Tsukimi (moon-viewing) festival, traditionally held on the fifteenth night of the eighth lunar month, honors the harvest moon with offerings of dango and susuki grass. The moon rabbit (tsuki no usagi), a figure seen in the moon's surface, connects to East Asian folklore where a rabbit pounds mochi on the moon. Ancient Japanese time-keeping relied on lunar cycles, making Tsukuyomi's domain essential for agricultural planning, religious festivals, and the rhythms of daily life. His influence persists in Japanese aesthetics, where the moon represents wabi-sabi beauty, impermanence, and the poetic appreciation of nature's subtle transformations."
    }
  },
  "corpusQueries": [
    "Tsukuyomi moon god Japanese",
    "Shinto moon deity",
    "Kojiki Nihon Shoki moon kami",
    "Izanagi three noble children",
    "Uke Mochi death myth",
    "separation sun moon Japanese mythology",
    "Tsukimi moon viewing festival",
    "lunar calendar Japan ancient"
  ],
  "sources": [
    {
      "title": "Kojiki",
      "type": "primary",
      "date": "712 CE",
      "description": "Japan's oldest chronicle, containing the birth narrative of Tsukuyomi"
    },
    {
      "title": "Nihon Shoki",
      "type": "primary",
      "date": "720 CE",
      "description": "Official chronicle with variant accounts of the moon god's mythology"
    },
    {
      "title": "Shinto: The Way Home",
      "author": "Thomas Kasulis",
      "type": "secondary",
      "description": "Scholarly analysis of Shinto cosmology and kami relationships"
    }
  ],
  "metadata": {
    "createdBy": "system",
    "source": "migration_merge",
    "verified": false,
    "submissionType": "system",
    "createdAt": {
      "_seconds": 1765593881,
      "_nanoseconds": 550000000
    },
    "enrichedBy": "batch7_enrichment_agent",
    "enrichmentVersion": "2.0",
    "updatedAt": {
      "_seconds": 1766537049,
      "_nanoseconds": 484000000
    },
    "lastEnrichedAt": "2026-01-10"
  },
  "description": "Tsukuyomi-no-Mikoto is the Japanese Shinto god of the moon, night, and the passage of time. Born from the right eye of Izanagi during his purification ritual, Tsukuyomi is one of the three noble children alongside his sister Amaterasu (sun) and brother Susanoo (storms). He rules over the night realm and governs the lunar calendar that ordered ancient Japanese life. His killing of the food goddess Uke Mochi caused his eternal separation from Amaterasu, explaining why the sun and moon never share the sky. Though less prominently worshipped than his siblings, Tsukuyomi's influence pervades Japanese culture through moon-viewing traditions, the moon rabbit legend, and the aesthetic appreciation of nocturnal beauty.",
  "type": "deity"
}