[
  {
    "id": "eshu",
    "name": "Eshu",
    "displayName": "Eshu (Elegba, Elegua, Legba, Exu)",
    "mythology": "yoruba",
    "title": "Yoruba - Eshu - Orisha of Crossroads and Communication",
    "type": "deity",
    "color": "#DC143C",
    "icon": "crossroads",
    "orishaAttributes": {
      "sacredNumber": 3,
      "secondaryNumbers": [21],
      "sacredDay": "Monday",
      "colors": ["red", "black"],
      "hexColors": ["#FF0000", "#000000"],
      "element": "crossroads",
      "sacredAnimal": "rooster"
    },
    "domains": [
      "crossroads",
      "communication",
      "language",
      "messages",
      "chance",
      "choice",
      "doors",
      "keys",
      "duality",
      "transformation",
      "tricks",
      "fate",
      "divine messenger"
    ],
    "symbols": [
      "Crossroads",
      "laterite stone",
      "cowrie shells",
      "hooked staff (ogo)",
      "keys",
      "palm frond",
      "gourd",
      "phallus"
    ],
    "epithets": [
      "Esu Odara (Eshu the Good)",
      "Esu Laroye (Eshu the Talker)",
      "Alaroye (Owner of the Road)",
      "Onibode (Gatekeeper)",
      "Bara (Father of Roads)"
    ],
    "paths": [
      {
        "name": "Eshu Laroye",
        "aspect": "The Talker - master of communication and speech"
      },
      {
        "name": "Eshu Elegbara",
        "aspect": "The Powerful One - associated with power and chaos"
      },
      {
        "name": "Eshu Aye",
        "aspect": "Eshu of the World - master of earthly matters"
      },
      {
        "name": "Eshu Alaketu",
        "aspect": "Guardian of the Gate - opens and closes paths"
      },
      {
        "name": "Eshu Odara",
        "aspect": "Eshu the Good - brings good fortune when properly honored"
      },
      {
        "name": "Eshu Obasin",
        "aspect": "Eshu of the Night - works in darkness and shadow"
      }
    ],
    "ifaNarratives": [
      {
        "title": "Eshu at the Crossroads - The Two Friends",
        "content": "Two friends who were closer than brothers lived on opposite sides of a road and farmed adjacent fields. They vowed that nothing could ever come between them. Eshu, hearing this arrogant claim, decided to test them. He made a hat that was black on one side and red on the other. Wearing this hat, he walked between their fields. Later, one friend said, \"Did you see the man with the black hat?\" The other replied, \"What are you talking about? His hat was red!\" They argued, then fought, then tried to kill each other - their friendship destroyed over what they thought they knew. Eshu appeared and showed them the two-sided hat. \"Both of you were right, and both were wrong. You fought over your limited perspective.\" This pataki teaches that Eshu reveals the limitations of certainty and the importance of considering multiple viewpoints."
      },
      {
        "title": "Eshu Becomes the Divine Messenger",
        "content": "In the beginning, Olodumare needed a messenger to travel between Orun (heaven) and Aye (earth), carrying human prayers up and divine will down. Many Orisha applied for the position, but each had flaws - some were too proud, others too slow, others couldn't understand human speech. Eshu alone could travel freely between all realms, speak all languages, and deliver messages without altering them (unless he chose to). Olodumare appointed him divine messenger with one condition: all sacrifices must first give Eshu his portion as payment for delivery. This is why Eshu is honored first at every ceremony - without his service, no offering reaches the gods."
      },
      {
        "title": "Eshu and the King's Decision",
        "content": "A king ruled justly for many years but began to grow proud, believing he owed his success to his own wisdom rather than to the Orisha. He stopped making sacrifices. Eshu decided to humble him. First, Eshu whispered conflicting rumors to the king's advisors, setting them against each other. Then he caused the king to misunderstand a crucial message from a neighboring kingdom, nearly starting a war. Finally, when the king consulted a diviner, Eshu ensured the reading showed clearly: the king's troubles stemmed from neglecting the Orisha. The king repented, made generous offerings (especially to Eshu), and his kingdom prospered again. The lesson: no one is so wise or powerful that they can ignore the divine."
      },
      {
        "title": "Why Eshu Lives at the Crossroads",
        "content": "When the Orisha descended to earth, each claimed a domain. Mountains, rivers, forests, iron, thunder - all were taken. Eshu, instead of claiming a location, claimed the spaces between - the crossroads where all paths meet, the thresholds between inside and outside, the moments of transition between states. At the crossroads, all directions are possible, all choices present. Eshu guards these places of potential, where fate can go any way. This is why offerings to Eshu are left at crossroads, and why important decisions are made there under his witness."
      },
      {
        "title": "Eshu and the Sixteen Odu",
        "content": "Eshu plays a crucial role in Ifa divination. He learned the secrets of the 256 odu (sacred verses) by listening at Orunmila's door, and now he carries the odu's wisdom between the divine and human worlds. When a babalawo casts the ikin or opele, it is Eshu who determines which odu appears. He may deliver the truth you need to hear - or the truth you'd rather avoid. Some say Eshu invented lying, but in the context of Ifa, he reminds us that truth itself has many forms."
      }
    ],
    "worship": {
      "ritualProtocol": "Always honor Eshu first. Before any ceremony, divination, or offering to another Orisha, Eshu receives his portion. This ensures he will carry your message to the intended Orisha rather than disrupting the communication. Neglecting Eshu is the quickest way to ensure ritual failure.",
      "offerings": [
        { "item": "Rooster", "significance": "Primary blood sacrifice" },
        { "item": "Palm Oil (Epo pupa)", "significance": "Traditional offering" },
        { "item": "Rum/Aguardiente", "significance": "Strong alcohol" },
        { "item": "Tobacco/Cigars", "significance": "Traditional offering" },
        { "item": "Roasted Corn (Awuje)", "significance": "Favorite food" },
        { "item": "Candy/Sweets", "significance": "He loves treats" },
        { "item": "Coins", "significance": "Money offerings" },
        { "item": "Toys", "significance": "He is playful" }
      ],
      "sacredLocations": [
        "Crossroads - where paths meet, his primary domain",
        "Doorways/Thresholds - the space between inside and outside",
        "Market entrances - where commerce and exchange occur",
        "Behind the door - in homes, an Eshu shrine often sits behind the front door",
        "At the edge of the compound - guarding the boundary"
      ],
      "crossroadsSignificance": {
        "choice": "At the crossroads, you must choose a direction - you cannot go all ways at once",
        "possibility": "All paths are open before you make your choice",
        "transition": "The crossroads is between places, belonging to none",
        "communication": "Roads meet, travelers exchange news and goods",
        "danger": "The intersection is where accidents happen, where travelers are vulnerable"
      }
    },
    "diaspora": {
      "cuba": {
        "name": "Elegua/Eleggua",
        "syncretism": ["Holy Child of Atocha", "Saint Anthony", "Saint Martin de Porres"],
        "notes": "One of the 'Warriors' - first Orisha received by initiates along with Ogun, Ochosi, and Osun. His cement head with cowrie shells is kept behind the door. 21 paths recognized. Offerings of candy, toys, rum, and cigars."
      },
      "brazil": {
        "name": "Exu",
        "notes": "Strongly misidentified with the devil by colonial church, but practitioners know he is the messenger. Exu Bara, Exu Lonan, and many other forms. Associated with crossroads, communication, and sexuality. Red and black colors. Offerings at midnight at crossroads."
      },
      "haiti": {
        "name": "Papa Legba/Legba",
        "notes": "Absolutely essential - 'Legba, open the gate' begins every ceremony. Without Legba's permission, no lwa can be contacted. Often depicted as an old man with a cane (unlike the youthful Cuban Elegua). He stands at the cosmic crossroads between the human and spirit worlds."
      },
      "trinidad": {
        "name": "Eshu",
        "notes": "Honored first at every ceremony. Guardian of the doors and crossroads. His presence is essential for communication with all other Orisha. Offerings placed at crossroads and thresholds. Red and black remain his colors."
      }
    },
    "teachings": [
      "Humility: You are not in control of everything",
      "Perspective: There are always multiple viewpoints",
      "Respect: The divine must be honored properly",
      "Adaptation: Plans must be flexible; the universe changes",
      "Choice: Every decision has consequences",
      "Communication: Speak clearly; misunderstandings are dangerous"
    ],
    "clarification": {
      "notTheDevil": "When Christian missionaries encountered Eshu, they associated him with the Devil due to his trickster nature, his residence at crossroads (associated with demons in European folklore), and his red and black colors. This identification is fundamentally wrong and offensive to practitioners. Eshu is not evil - he is a necessary cosmic force who maintains balance, delivers messages, and teaches through challenges. Without Eshu, the universe would be static and deterministic. He introduces the possibility of change, choice, and growth. The equation of Eshu with Satan represents a colonial misunderstanding that practitioners actively reject."
    },
    "description": "The most complex and misunderstood of all Orisha, Eshu stands at the crossroads between the human and divine worlds. He is the messenger who carries sacrifices to Olodumare and brings divine responses to humanity. Master of language, chance, and transformation, Eshu opens and closes roads, creates chaos and opportunity, and reminds humans that the universe is fundamentally unpredictable. Without Eshu, no communication between worlds is possible - which is why every ritual begins with his acknowledgment.",
    "summary": "Divine Messenger and Trickster Orisha who guards the crossroads, facilitates communication between humans and the divine, and teaches through chaos and choice.",
    "archetypes": ["trickster", "divine messenger", "gatekeeper"],
    "relationships": {
      "divineRole": {
        "Olodumare": "Serves as Olodumare's primary messenger, carrying sacrifices to heaven",
        "AllOrisha": "Facilitates communication between all Orisha and between Orisha and humans",
        "Orunmila": "Special relationship - Eshu learned the secrets of Ifa and assists in divination",
        "Ogun": "Close allies - often honored together as 'warriors' in diaspora traditions"
      },
      "noEnemies": "Uniquely among the Orisha, Eshu has no enemies. He cannot - his role as messenger requires him to maintain relationships with all parties. Even when he creates conflict, it is to teach a lesson or restore balance, not from personal enmity. Eshu is neither good nor evil; he is the principle of choice and consequence."
    },
    "relatedEntities": [
      { "type": "deity", "id": "hermes", "mythology": "greek", "parallel": "messenger" },
      { "type": "deity", "id": "loki", "mythology": "norse", "parallel": "trickster" },
      { "type": "deity", "id": "mercury", "mythology": "roman", "parallel": "messenger" },
      { "type": "deity", "id": "thoth", "mythology": "egyptian", "parallel": "messenger" },
      { "type": "deity", "id": "coyote", "mythology": "native_american", "parallel": "trickster" }
    ],
    "extendedContent": {
      "importance": "In every ritual, ceremony, or offering to any Orisha, Eshu must receive his portion first. Failure to honor Eshu before other Orisha ensures that your prayers will not be delivered and may bring his mischief upon you. This is not because Eshu is evil, but because he is the gatekeeper and messenger without whom nothing reaches the divine realm.",
      "pathsNote": "Eshu is said to have 21 paths (or 121, or 201, depending on tradition) - more than any other Orisha. Each represents a different aspect of his nature."
    },
    "metadata": {
      "featured": true,
      "visibility": "public",
      "importance": 95,
      "verified": true,
      "source": "html_enrichment",
      "tags": ["orisha", "trickster", "messenger", "crossroads", "yoruba"],
      "submissionType": "system",
      "createdBy": "system",
      "enrichedBy": "yoruba_html_enrichment_v1",
      "category": "deity",
      "status": "published"
    },
    "search": {
      "aliases": ["Elegba", "Elegua", "Legba", "Exu", "Eleggua", "Papa Legba"],
      "keywords": ["eshu", "elegba", "elegua", "legba", "exu", "trickster", "crossroads", "messenger", "orisha", "yoruba", "santeria", "candomble", "vodou"],
      "facets": {
        "power": "high",
        "tradition": "yoruba"
      }
    },
    "rendering": {
      "defaultAction": "page",
      "modes": {
        "hyperlink": true,
        "subsection": true,
        "expandableRow": true,
        "fullPage": true,
        "panelCard": true
      },
      "defaultMode": "panelCard"
    }
  },
  {
    "id": "ogun",
    "name": "Ogun",
    "displayName": "Ogun (Oggun, Ogum)",
    "mythology": "yoruba",
    "title": "Yoruba - Ogun - Orisha of Iron and War",
    "type": "deity",
    "color": "#006400",
    "icon": "anvil",
    "orishaAttributes": {
      "sacredNumber": 7,
      "secondaryNumbers": [3],
      "sacredDay": "Tuesday",
      "secondaryDays": ["Wednesday"],
      "colors": ["green", "black"],
      "hexColors": ["#006400", "#000000"],
      "element": "iron",
      "sacredAnimal": "dog"
    },
    "domains": [
      "iron",
      "metalwork",
      "war",
      "hunting",
      "surgery",
      "technology",
      "labor",
      "justice",
      "truth",
      "clearing paths"
    ],
    "symbols": [
      "Machete (Ida)",
      "anvil",
      "iron tools",
      "chains",
      "railroad spikes",
      "dog",
      "palm fronds"
    ],
    "epithets": [
      "Ogun Onire (Ogun of Ire)",
      "Ogun Alara",
      "Ogun Onigbajamo",
      "Ogun Meji",
      "Osin Imole (Chief of the Orisha)"
    ],
    "ifaNarratives": [
      {
        "title": "The Path Clearer - Ogun Opens the Way",
        "content": "In the time when the Orisha wished to descend from Orun (heaven) to Aye (earth), they found their path blocked by impenetrable forest. None could pass through the dense vegetation. Ogun, with his iron machete, volunteered to clear the way. For seven years he labored, cutting through the bush, until at last a path was opened. The other Orisha descended to earth, but many forgot to thank Ogun for his sacrifice. Only Osanyin, Orisha of herbs, remembered - which is why Ogun and Osanyin remain close allies. This myth establishes Ogun as the pathfinder who makes all journeys possible and explains why Ogun must always be acknowledged before undertaking any new venture."
      },
      {
        "title": "Ogun and Ire - The Reluctant King",
        "content": "Ogun once ruled as king of the city of Ire. Despite his fierce nature, he governed justly. However, during a festival, Ogun was tricked into drinking palm wine (which was taboo for him). Intoxicated, he flew into a rage and killed many of his own subjects with his sword. When he realized what he had done, Ogun was overcome with grief and shame. He could not bear to remain among humans. Taking his sword, Ogun descended into the earth at Ire, vowing to help humans from below. This is why oaths sworn on iron in Yoruba courts invoke Ogun's presence - 'Ogun kill me if I lie' - and why metal objects are sacred to him."
      },
      {
        "title": "Ogun and Oshun - The Seduction from the Forest",
        "content": "After his tragedy at Ire, Ogun retreated into the deepest forest, refusing all contact with other Orisha and humans. The world suffered without his gifts of iron and technology. Olodumare sent several Orisha to coax Ogun back, but all failed. Finally, Oshun went to him. With her honey, her beauty, and her sweet songs, she seduced the fierce warrior. Smearing honey on her body, she danced at the edge of his forest. Entranced, Ogun followed her out of isolation and back to civilization. This pataki illustrates that even the fiercest warrior can be softened by sweetness, and establishes the special relationship between Ogun and Oshun."
      },
      {
        "title": "Ogun and the First Sacrifice",
        "content": "When humanity first needed iron tools, Ogun taught them the secrets of the forge. But iron demanded a price - it required blood. Ogun showed humans how to make offerings to the iron so that their tools would not turn against them. He sacrificed a dog, the animal that most loyally follows hunters into the bush. From this came the tradition of offering dogs to Ogun, and the understanding that all technology requires sacrifice to be used safely."
      }
    ],
    "worship": {
      "offerings": [
        { "item": "Dog", "significance": "Traditional blood sacrifice" },
        { "item": "Rooster", "significance": "Common offering" },
        { "item": "Palm Wine (Emu)", "significance": "Though he abstains from it" },
        { "item": "Roasted Yam", "significance": "Favorite food" },
        { "item": "Palm Oil (Epo pupa)", "significance": "Traditional offering" },
        { "item": "Cigars", "significance": "Tobacco offerings" },
        { "item": "Rum", "significance": "Strong spirits" },
        { "item": "Iron Items", "significance": "Nails, chains, tools" }
      ],
      "sacredPlaces": "Ogun's shrines are found at forges, along roads and paths, at the entrance to compounds, and in the wilderness. His primary sacred site is the city of Ire in Ekiti State, Nigeria, where he is said to have descended into the earth. Worshippers often place iron implements at crossroads or near forges as offerings.",
      "festivals": "The annual Ogun Festival in Ondo State, Nigeria, features processions of blacksmiths, hunters, and warriors. Dogs are sacrificed, palm wine flows, and devotees dance with machetes. In the diaspora, Ogun's day (usually Tuesday or Wednesday) is observed with offerings and prayers by those in his service."
    },
    "diaspora": {
      "cuba": {
        "name": "Oggun",
        "syncretism": ["Saint Peter", "Saint John the Baptist"],
        "notes": "Receives offerings of rum, cigars, railroad spikes. Colors: green and black. Warriors initiates receive Oggun along with Elegua, Ochosi, and Osun."
      },
      "brazil": {
        "name": "Ogum",
        "syncretism": ["Saint George", "Saint Anthony"],
        "notes": "Particularly strong in Bahia. His ritual day is Tuesday. Patron of the police and military. Colors: dark blue, green, red depending on nation."
      },
      "haiti": {
        "name": "Ogou",
        "aspects": ["Ogou Feray", "Ogou Badagri", "Ogou Shango"],
        "notes": "Associated with military power and revolutionary struggle. Played significant role in Haitian Revolution. Syncretized with Saint Jacques."
      },
      "trinidad": {
        "name": "Ogun",
        "notes": "Central to the tradition. Associated with strength, protection, and clearing obstacles. His feast is a major annual event. Worshippers may be possessed by his fierce energy during ceremonies."
      }
    },
    "modernRelevance": [
      "Truck and taxi drivers - who work with metal and travel roads",
      "Surgeons and doctors - who cut with steel to heal",
      "Mechanics and engineers - who shape metal and build machines",
      "Soldiers and police - who carry weapons and maintain order",
      "Athletes - especially those requiring strength and endurance",
      "Those seeking justice - oaths on iron invoke Ogun's witness"
    ],
    "description": "The fierce warrior Orisha who rules over iron, metalwork, and all technology. Ogun is the pathfinder who cleared the way for the other Orisha to descend from heaven to earth. Patron of blacksmiths, hunters, warriors, surgeons, truck drivers, and all who work with metal. His energy is raw, primal, and transformative - the force that shapes civilization through labor and struggle.",
    "summary": "Fierce warrior Orisha of iron, metalwork, war, and technology who cleared the path for all Orisha to descend to earth.",
    "archetypes": ["smith god", "warrior", "pathfinder"],
    "relationships": {
      "father": "Oduduwa (mythical ancestor of the Yoruba) in some traditions; Oranmiyan in others",
      "wives": ["Oya (who left him for Shango)", "Oshun (in some stories)", "Yemoja"],
      "brothers": "Often considered brother to Shango, Osoosi, and Elegba in some lineages",
      "allies": [
        { "name": "Osanyin", "role": "Orisha of herbs - they work together in the forest" },
        { "name": "Osoosi", "role": "Orisha of hunting - they hunt together" }
      ],
      "rivalries": {
        "Shango": "Great rivalry exists between these two warrior Orisha. Oya left Ogun to become Shango's wife, creating lasting tension. Their conflict represents different types of masculine power - Ogun's steady labor vs. Shango's royal authority."
      }
    },
    "relatedEntities": [
      { "type": "deity", "id": "hephaestus", "mythology": "greek", "parallel": "smith" },
      { "type": "deity", "id": "vulcan", "mythology": "roman", "parallel": "forge" },
      { "type": "deity", "id": "mars", "mythology": "roman", "parallel": "war" },
      { "type": "deity", "id": "thor", "mythology": "norse", "parallel": "strength" },
      { "type": "deity", "id": "goibniu", "mythology": "celtic", "parallel": "smith" }
    ],
    "extendedContent": {
      "oathsOnIron": "In Nigerian courts, witnesses traditionally swear oaths on iron objects, invoking Ogun to punish perjury. This practice acknowledges Ogun as a god of truth who cannot tolerate lies."
    },
    "metadata": {
      "featured": true,
      "visibility": "public",
      "importance": 90,
      "verified": true,
      "source": "html_enrichment",
      "tags": ["orisha", "warrior", "iron", "smith", "yoruba"],
      "submissionType": "system",
      "createdBy": "system",
      "enrichedBy": "yoruba_html_enrichment_v1",
      "category": "deity",
      "status": "published"
    },
    "search": {
      "aliases": ["Oggun", "Ogum", "Ogou"],
      "keywords": ["ogun", "iron", "war", "metalwork", "blacksmith", "orisha", "yoruba", "santeria", "candomble"],
      "facets": {
        "power": "high",
        "tradition": "yoruba"
      }
    },
    "rendering": {
      "defaultAction": "page",
      "modes": {
        "hyperlink": true,
        "subsection": true,
        "expandableRow": true,
        "fullPage": true,
        "panelCard": true
      },
      "defaultMode": "panelCard"
    }
  },
  {
    "id": "oshun",
    "name": "Oshun",
    "displayName": "Oshun (Osun, Ochun, Oxum)",
    "mythology": "yoruba",
    "title": "Yoruba - Oshun - Orisha of Rivers, Love, and Beauty",
    "type": "deity",
    "color": "#FFD700",
    "icon": "river",
    "orishaAttributes": {
      "sacredNumber": 5,
      "secondaryNumbers": [10, 15, 25],
      "sacredDay": "Saturday",
      "secondaryDays": ["Thursday", "Friday"],
      "colors": ["gold", "amber", "yellow", "coral"],
      "hexColors": ["#FFD700", "#FFA500", "#FFFF00"],
      "element": "fresh water",
      "sacredAnimal": "peacock",
      "sacredSubstance": "honey"
    },
    "domains": [
      "fresh water",
      "rivers",
      "love",
      "fertility",
      "beauty",
      "sensuality",
      "prosperity",
      "money",
      "diplomacy",
      "divination (diloggun)",
      "healing",
      "witchcraft"
    ],
    "symbols": [
      "Honey",
      "mirror",
      "fan (abebe)",
      "peacock feathers",
      "gold jewelry",
      "brass",
      "pumpkin",
      "cowrie shells",
      "river stones"
    ],
    "epithets": [
      "Yeye Kari (Mother of Riches)",
      "Iyalode (Queen of the Women)",
      "Laketi (She Who Responds)",
      "Yeye Osun (Mother Osun)",
      "Oore Yeye O (Kind Mother)"
    ],
    "powers": [
      { "name": "Love and Attraction", "description": "She governs all matters of the heart, romance, and seduction" },
      { "name": "Prosperity", "description": "She brings wealth, money, and material abundance to her children" },
      { "name": "Fertility", "description": "She opens the womb for those who wish to conceive" },
      { "name": "Witchcraft", "description": "She is the leader of the Aje (witches) and knows powerful magic" },
      { "name": "Healing", "description": "Her waters cure illness and soothe troubled minds" }
    ],
    "ifaNarratives": [
      {
        "title": "Oshun Saves the World - The Only Woman Among the Orisha",
        "content": "When Olodumare sent the Orisha to create the earth, they excluded Oshun from their councils because she was a woman. The sixteen male Orisha attempted to complete creation without her, but everything they tried failed. The earth remained barren, the rains would not fall, and life could not flourish. In desperation, they returned to Olodumare to ask what was wrong. Olodumare asked, 'Where is Oshun?' Realizing their error, the Orisha begged Oshun for help. She agreed, and through her power of fertility and attraction, she brought life to the earth. This pataki establishes that nothing can be accomplished without the feminine principle - Oshun's exclusion doomed creation to failure."
      },
      {
        "title": "Oshun Seduces Ogun from the Forest",
        "content": "When Ogun, the fierce Orisha of iron, retreated into the forest after his tragedy at Ire, he refused all contact with other Orisha and humans. Without his gifts of tools and technology, civilization suffered. Many tried to coax him out - warriors threatened, elders pleaded - but Ogun would not emerge. Finally, Oshun went to him. She covered her body with honey and danced at the edge of his forest, singing sweetly. Enchanted by her beauty and sweetness, Ogun followed her out of isolation. With five drops of her honey on his lips, she led the fierce warrior back to civilization. This story shows that Oshun's 'soft' power is stronger than force."
      },
      {
        "title": "Oshun and the Vulture - The Secret of Divination",
        "content": "Oshun wished to learn the secrets of divination from Orunmila, but he would not teach a woman. She transformed herself into a vulture and flew to Orunmila's house. Perching nearby, she observed his divination sessions day after day, memorizing the odu (sacred verses) and their meanings. When she had learned enough, she revealed herself and demonstrated her knowledge. Orunmila, impressed by her dedication, accepted her as a student and gave her dominion over the cowrie shell divination system (diloggun). This is why Oshun's priestesses can divine with shells, and why the vulture is sacred to her."
      },
      {
        "title": "Oshun and Shango - The King's Favorite",
        "content": "Of all Shango's wives, Oshun was his favorite when he desired pleasure and joy. She won his heart not through force like Oya, but through sweetness, beauty, and the arts of seduction. She cooled his fire with her river waters and softened his temper with her honey. Their relationship represents the attraction between fire and water, between passionate power and sensual pleasure. However, Oshun was not merely submissive - she held her own in Shango's household through her wit and magical abilities."
      },
      {
        "title": "Oshun and Oba - A Tragic Rivalry",
        "content": "Oba, Shango's first wife, was desperately jealous of Oshun's hold on the king's heart. She asked Oshun how she made her soup so delicious that Shango loved it above all else. Oshun, out of cruelty or mischief, told Oba that she cut off her ear and added it to the soup. Oba, foolish in her desperation, actually did this. When Shango discovered her mutilation, he was horrified and rejected her forever. Oba fled in shame and became the Orisha of the Oba River, forever weeping. This dark pataki shows that Oshun can be cruel when crossed, and that desperation leads to tragedy."
      }
    ],
    "worship": {
      "offerings": [
        { "item": "Honey", "significance": "Her sacred substance (always taste first)", "warning": "Always taste honey before offering it to Oshun. According to pataki, an enemy once tried to poison her with tainted honey. Tasting it first proves it is safe and shows respect." },
        { "item": "Pumpkin (Elegede)", "significance": "Her favorite" },
        { "item": "Oranges", "significance": "Sweet citrus fruits" },
        { "item": "Yellow Hen", "significance": "Traditional sacrifice" },
        { "item": "Cinnamon", "significance": "Sweet spice" },
        { "item": "Sunflowers", "significance": "Yellow flowers" },
        { "item": "Perfume", "significance": "Sweet fragrances" },
        { "item": "Gold Jewelry", "significance": "Brass and gold items" }
      ],
      "taboos": ["Never offer Oshun anything bitter or sour"],
      "sacredSite": {
        "name": "Osun-Osogbo Sacred Grove",
        "location": "Osun River, Osun State, Nigeria",
        "status": "UNESCO World Heritage Site",
        "description": "The most important shrine to Oshun. The grove contains shrines, sculptures, and sacred spaces dating back centuries."
      },
      "festivals": {
        "name": "Osun-Osogbo Festival",
        "timing": "August, annually",
        "description": "Draws hundreds of thousands of devotees who come to honor Oshun, make offerings to the river, and receive her blessings for fertility and prosperity. The festival begins with the lighting of the sixteen-point lamp and proceeds through several days of rituals culminating in a procession to the river. The Arugba (virgin votary) carries the sacred calabash on her head to the river, where it is offered to Oshun. Devotees wade into the river to receive blessings, and the waters are believed to heal illness and grant fertility."
      }
    },
    "witchcraft": {
      "role": "Head of the Aje (witches)",
      "abilities": [
        "Transformation - She can change her form (became a vulture to learn divination)",
        "Love magic - She controls attraction and can bind hearts together or tear them apart",
        "Prosperity magic - She can open or close the roads to wealth",
        "Healing and cursing - Her waters can heal or drown, depending on her will",
        "Protection - As leader of the Aje, she can shield her children from witchcraft"
      ],
      "warning": "Those who disrespect Oshun discover that the smiling river goddess has teeth. Her revenge on Oba shows she can be cruel. Her seductions are also strategic victories. Never underestimate the woman who smiles."
    },
    "diaspora": {
      "cuba": {
        "name": "Ochun/Oshun",
        "syncretism": ["Our Lady of Charity (La Caridad del Cobre)"],
        "notes": "Cuba's patron saint. Her sanctuary at El Cobre receives millions of pilgrims. She has many 'caminos' (paths) - Ochun Yeyemorowo, Ochun Ibu Kole, etc. Colors: gold and amber. Offerings of honey, pumpkin, and cinnamon."
      },
      "brazil": {
        "name": "Oxum",
        "syncretism": ["Our Lady of Candelaria", "Nossa Senhora da Conceicao"],
        "notes": "One of the most popular Orixa in Brazil. Her feast day celebrations feature elaborate golden costumes and river processions. She represents feminine beauty, fertility, and maternal love. Colors: yellow and gold."
      },
      "haiti": {
        "name": "Erzulie Freda (associated)",
        "notes": "While not a direct equivalent, Erzulie shares Oshun's association with love, beauty, and feminine power. Both are associated with rivers, sweetness, and the color gold. Some traditions recognize Oshun directly."
      },
      "trinidad": {
        "name": "Oshun",
        "notes": "Honored at rivers and streams. Her devotees dress in yellow and gold. Associated with love, fertility, and prosperity. Ceremonies for her involve offerings of honey, flowers, and sweet foods thrown into flowing water."
      }
    },
    "description": "The irresistible Orisha of rivers, sensuality, and abundance, Oshun embodies the beauty and generosity of fresh water. She is the essence of feminine grace, the power of attraction, and the sweetness of life itself. Associated with the Osun River in Nigeria, she rules over love, fertility, money, and all that makes life pleasurable. But beneath her golden sweetness lies profound depths - Oshun is also a powerful sorceress and diplomat whose gentle appearance masks formidable power.",
    "summary": "Beautiful and powerful Orisha of fresh water, love, fertility, and prosperity who saved creation and leads the witches.",
    "archetypes": ["love goddess", "river goddess", "fertility goddess", "witch queen"],
    "relationships": {
      "consorts": [
        { "name": "Shango", "nature": "Her most famous lover. Their passionate relationship represents the union of fire and water. She cools his temper and delights him with her sweetness." },
        { "name": "Ogun", "nature": "She seduced him from his forest exile. Their relationship shows the power of gentleness over force." },
        { "name": "Orunmila", "nature": "Teacher of divination. Their relationship gave Oshun her divinatory powers." },
        { "name": "Erinle", "nature": "Orisha of healing and the forest. Some traditions consider him Oshun's husband." }
      ],
      "family": [
        { "name": "Yemoja", "relation": "Often described as her sister or mother. Together they represent salt water and fresh water, ocean and river." },
        { "name": "Oba", "relation": "Her rival for Shango's love. Their conflict represents jealousy and its tragic consequences." },
        { "name": "Nana Buruku", "relation": "Sometimes described as her grandmother. Ancient swamp goddess." }
      ]
    },
    "relatedEntities": [
      { "type": "deity", "id": "aphrodite", "mythology": "greek", "parallel": "love" },
      { "type": "deity", "id": "venus", "mythology": "roman", "parallel": "beauty" },
      { "type": "deity", "id": "freya", "mythology": "norse", "parallel": "love/magic" },
      { "type": "deity", "id": "lakshmi", "mythology": "hindu", "parallel": "prosperity" },
      { "type": "deity", "id": "ishtar", "mythology": "babylonian", "parallel": "love" }
    ],
    "extendedContent": {
      "praiseNameMeaning": "Oshun's praise name 'Oore Yeye O' means 'Kind Mother' - she is generous to those who honor her, blessing them with children, love, and prosperity. Her sacred substance is honey (oyin), which represents the sweetness she brings to life. Yet honey can also intoxicate and trap - a reminder that Oshun's gifts come with expectations of devotion and respect."
    },
    "metadata": {
      "featured": true,
      "visibility": "public",
      "importance": 90,
      "verified": true,
      "source": "html_enrichment",
      "tags": ["orisha", "love", "fertility", "river", "beauty", "yoruba"],
      "submissionType": "system",
      "createdBy": "system",
      "enrichedBy": "yoruba_html_enrichment_v1",
      "category": "deity",
      "status": "published"
    },
    "search": {
      "aliases": ["Osun", "Ochun", "Oxum"],
      "keywords": ["oshun", "osun", "ochun", "oxum", "love", "beauty", "river", "fertility", "honey", "orisha", "yoruba", "santeria", "candomble"],
      "facets": {
        "power": "high",
        "tradition": "yoruba"
      }
    },
    "rendering": {
      "defaultAction": "page",
      "modes": {
        "hyperlink": true,
        "subsection": true,
        "expandableRow": true,
        "fullPage": true,
        "panelCard": true
      },
      "defaultMode": "panelCard"
    }
  },
  {
    "id": "shango",
    "name": "Shango",
    "displayName": "Shango (Sango, Xango, Chango)",
    "mythology": "yoruba",
    "title": "Yoruba - Shango - Orisha of Thunder, Fire, and Justice",
    "type": "deity",
    "color": "#DC143C",
    "icon": "lightning",
    "orishaAttributes": {
      "sacredNumber": 6,
      "secondaryNumbers": [12],
      "sacredDay": "Thursday",
      "secondaryDays": ["Friday", "Saturday"],
      "colors": ["red", "white"],
      "hexColors": ["#DC143C", "#FFFFFF"],
      "element": "thunder/fire",
      "sacredAnimal": "ram",
      "historicalOrigin": "Fourth Alaafin (king) of the Oyo Empire"
    },
    "domains": [
      "thunder",
      "lightning",
      "fire",
      "justice",
      "kingship",
      "dance",
      "drumming",
      "male virility",
      "strategy"
    ],
    "symbols": [
      "Oshe (double-headed axe)",
      "thunderstones (edun ara)",
      "bata drums",
      "crown",
      "ram",
      "mortar"
    ],
    "epithets": [
      "Oba Koso (The King Did Not Hang)",
      "Jakuta (Stone Thrower)",
      "Oba Gbodo Kole (The King Who Climbs to the Roof)",
      "Alagbara (The Powerful One)"
    ],
    "wives": [
      {
        "name": "Oya",
        "description": "His most beloved wife, whom he stole from his brother Ogun. Oya matched Shango's ferocity and rode into battle alongside him. She controls the wind that precedes his storms."
      },
      {
        "name": "Oshun",
        "description": "His favorite wife when he desired sweetness and pleasure. Oshun seduced Shango with her beauty and honey. She cools his fire with her river waters."
      },
      {
        "name": "Oba",
        "description": "His first wife, whom he eventually rejected. In her desperation to win back his love, Oba mutilated herself based on bad advice from Oshun, leading to her eternal sorrow."
      }
    ],
    "ifaNarratives": [
      {
        "title": "Shango's Mortal Life - The Fourth Alaafin",
        "content": "Shango was born to Oranmiyan, founder of Oyo, and Torosi, a princess of the Nupe people. From childhood, he demonstrated extraordinary abilities - it was said that fire came from his mouth when he spoke in anger. He became the fourth Alaafin of Oyo and was renowned as a powerful warrior and skilled strategist. Shango had a notorious temper and was known for his multiple wives and his love of dance and drumming. He was a fearsome king who demanded absolute loyalty."
      },
      {
        "title": "Oba Koso - The King Did Not Hang",
        "content": "The most famous pataki explains how Shango became an Orisha. Two of Shango's generals, Gbonka and Timi, had grown too powerful and began to threaten his authority. Shango set them against each other, but his scheme backfired when Gbonka killed Timi and turned against the king himself. Facing defeat and abandonment by his people, Shango went into the forest and hanged himself from an ayan tree. However, his followers refused to accept his death. They proclaimed 'Oba koso!' - 'The king did not hang!' - declaring that he had not died but ascended to Orun (heaven) to become an Orisha. Thunder and lightning became his weapons, sent from the sky to punish liars, thieves, and those who offend him."
      },
      {
        "title": "Shango Acquires the Power of Fire",
        "content": "Before he mastered thunder, Shango sought the power of fire. He consulted a babalawo who prepared a powerful medicine for him. Shango was instructed not to eat it, but his curiosity overcame him. Upon swallowing the medicine, fire began to pour from his mouth - but he could not control it. He accidentally burned his own palace and several of his wives. Desperate, Shango sought help from Osanyin, who taught him to channel the fire into the sky as lightning. This is why lightning comes from the clouds when Shango speaks in anger, and why those struck by lightning are considered to have offended him."
      },
      {
        "title": "Shango and His Three Wives",
        "content": "Shango had three principal wives, each representing different aspects of feminine power: Oya - His most beloved wife, whom he stole from his brother Ogun. Oya matched Shango's ferocity and rode into battle alongside him. She controls the wind that precedes his storms. Oshun - His favorite wife when he desired sweetness and pleasure. Oshun seduced Shango with her beauty and honey. She cools his fire with her river waters. Oba - His first wife, whom he eventually rejected. In her desperation to win back his love, Oba mutilated herself based on bad advice from Oshun, leading to her eternal sorrow."
      }
    ],
    "worship": {
      "offerings": [
        { "item": "Ram", "significance": "Primary blood offering" },
        { "item": "Rooster", "significance": "Common sacrifice" },
        { "item": "Amala", "significance": "Yam flour pudding" },
        { "item": "Gbegiri", "significance": "Bean soup" },
        { "item": "Okra", "significance": "With palm oil" },
        { "item": "Bitter Kola (Orogbo)", "significance": "Traditional offering" },
        { "item": "Red Palm Oil (Epo pupa)", "significance": "Traditional offering" },
        { "item": "Bananas (Ogede)", "significance": "Favorite fruit" }
      ],
      "sacredObjects": {
        "thunderstones": "Prehistoric stone axes and celts found in the ground after lightning strikes are believed to be Shango's thunderbolts. These are kept on his shrine and are central to his worship. The sound of thunder is Shango's voice; the lightning is his weapon striking the earth.",
        "oshe": "The double-headed axe is Shango's primary symbol. It represents his ability to deliver justice from any direction and the duality of his power - creative and destructive. Priests carry elaborately carved oshe during ceremonies."
      },
      "sacredMusic": "Shango is intimately connected with the bata drums - a set of three double-headed drums that 'speak' the Yoruba language. The bata drums were first played for Shango during his reign in Oyo and remain essential to his worship. The drums call the Orisha and induce possession in devotees. Each Orisha has specific rhythms; Shango's rhythms are particularly powerful and complex.",
      "festivals": "The annual Shango Festival in Oyo State, Nigeria, is one of the most spectacular Yoruba festivals. For several days, devotees dance, drum, and make offerings. Priests carrying the oshe demonstrate possession by Shango, sometimes handling fire without being burned. The festival commemorates the king who became a god."
    },
    "justice": {
      "role": "Orisha of divine justice",
      "punishment": "Those struck by lightning are believed to have committed secret crimes or offenses against the Orisha. When lightning strikes a house, special priests search the rubble for thunderstones and may exact fines from the family. However, if the victim was truly innocent, Shango's priests will perform rituals to rehabilitate their reputation.",
      "punishes": [
        "Liars and oath-breakers - Those who swear falsely by his name",
        "Thieves - Especially those who steal from his devotees",
        "The wicked - Those who abuse power or harm the innocent",
        "Disrespect - Those who mock the Orisha or their worship"
      ]
    },
    "diaspora": {
      "cuba": {
        "name": "Chango",
        "syncretism": ["Saint Barbara"],
        "notes": "Saint Barbara is depicted with a crown, sword, and tower - and whose feast day brings thunderstorms. One of the most popular Orisha in Cuban Santeria. His children are known for their charisma, temper, and love of dance."
      },
      "brazil": {
        "name": "Xango",
        "syncretism": ["Saint Jerome", "Saint John"],
        "notes": "Gave his name to an entire tradition - Xango do Recife in northeastern Brazil. The annual festa de Xango features elaborate processions and offerings. Colors: red and white."
      },
      "haiti": {
        "name": "Ogou Shango (aspect of Ogou)",
        "notes": "Appears as aspects of Ogou (particularly Ogou Shango) and is associated with revolutionary power. The blend of Ogun and Shango reflects the martial nature valued in Haitian tradition. Connected to the thunder and revolutionary fire."
      },
      "trinidad": {
        "name": "Shango",
        "notes": "The tradition itself is often called 'Shango Baptist' reflecting his central importance. Thunder is his voice speaking to his children. Annual Shango feasts feature elaborate drumming and possession ceremonies."
      }
    },
    "description": "The mighty Orisha of thunder and lightning, Shango embodies royal power, virility, and divine justice. Once a mortal king of the Oyo Empire, he became deified after death. His thunderstones (edun ara) fall from the sky when lightning strikes, and his double-headed axe (oshe) channels the power of storms. Shango is passion, power, and righteous fury made manifest - the king who speaks with the voice of the thunder.",
    "summary": "Mighty Orisha of thunder, lightning, fire, and divine justice who was once the fourth king of Oyo before ascending to become a god.",
    "archetypes": ["thunder god", "divine king", "judge"],
    "relationships": {
      "family": {
        "father": "Oranmiyan (founder of Oyo) in historical accounts; sometimes listed as Obatala in purely mythological accounts",
        "mother": "Torosi (Nupe princess) or Yemoja in some traditions",
        "wives": ["Oya (storm)", "Oshun (river)", "Oba (river)"]
      },
      "rivalries": {
        "Ogun": "Fierce rivalry. Shango stole Oya from Ogun. The two represent different types of power - Ogun's steady labor vs. Shango's royal authority and sudden violence."
      },
      "alliances": {
        "Oya": "His most powerful ally and complement. Together they command the full fury of the storm - she the wind, he the lightning.",
        "Obatala": "Sometimes considered Shango's father. Obatala represents cool wisdom; Shango represents passionate action."
      }
    },
    "relatedEntities": [
      { "type": "deity", "id": "thor", "mythology": "norse", "parallel": "thunder" },
      { "type": "deity", "id": "zeus", "mythology": "greek", "parallel": "thunder/kingship" },
      { "type": "deity", "id": "indra", "mythology": "hindu", "parallel": "storm" },
      { "type": "deity", "id": "jupiter", "mythology": "roman", "parallel": "thunder" },
      { "type": "deity", "id": "perun", "mythology": "slavic", "parallel": "thunder" }
    ],
    "metadata": {
      "featured": true,
      "visibility": "public",
      "importance": 95,
      "verified": true,
      "source": "html_enrichment",
      "tags": ["orisha", "thunder", "fire", "justice", "king", "yoruba"],
      "submissionType": "system",
      "createdBy": "system",
      "enrichedBy": "yoruba_html_enrichment_v1",
      "category": "deity",
      "status": "published"
    },
    "search": {
      "aliases": ["Sango", "Xango", "Chango"],
      "keywords": ["shango", "sango", "xango", "chango", "thunder", "lightning", "fire", "justice", "king", "orisha", "yoruba", "santeria", "candomble"],
      "facets": {
        "power": "high",
        "tradition": "yoruba"
      }
    },
    "rendering": {
      "defaultAction": "page",
      "modes": {
        "hyperlink": true,
        "subsection": true,
        "expandableRow": true,
        "fullPage": true,
        "panelCard": true
      },
      "defaultMode": "panelCard"
    }
  },
  {
    "id": "yemoja",
    "name": "Yemoja",
    "displayName": "Yemoja (Yemoja, Yemaya, Iemanja)",
    "mythology": "yoruba",
    "title": "Yoruba - Yemoja - Mother of Waters and Fertility",
    "type": "deity",
    "color": "#1E90FF",
    "icon": "ocean",
    "orishaAttributes": {
      "sacredNumber": 7,
      "secondaryNumbers": [14, 21],
      "sacredDay": "Saturday",
      "secondaryDays": ["Monday"],
      "colors": ["blue", "white", "silver", "crystal"],
      "hexColors": ["#1E90FF", "#FFFFFF", "#C0C0C0"],
      "element": "ocean/water",
      "sacredAnimal": "duck"
    },
    "domains": [
      "ocean",
      "rivers",
      "motherhood",
      "fertility",
      "pregnancy",
      "childbirth",
      "women",
      "children",
      "the moon",
      "dreams",
      "the unconscious"
    ],
    "symbols": [
      "Ocean waves",
      "fish",
      "seashells",
      "pearls",
      "mirrors",
      "fans",
      "anchor",
      "crescent moon",
      "mermaid imagery"
    ],
    "epithets": [
      "Yeye Omo Eja (Mother Whose Children Are Fish)",
      "Mama Wata",
      "Olokun Omo (Child of Olokun)",
      "Yemowo",
      "Ibu"
    ],
    "children": [
      { "name": "Shango", "domain": "Thunder and Lightning" },
      { "name": "Ogun", "domain": "Iron and War" },
      { "name": "Oshun", "domain": "Fresh Water and Love" },
      { "name": "Oya", "domain": "Wind and Transformation" },
      { "name": "Dada", "domain": "Vegetables and Gardens" },
      { "name": "Osoosi", "domain": "Hunting and Justice" }
    ],
    "ifaNarratives": [
      {
        "title": "Yemoja Gives Birth to the Orisha",
        "content": "In one origin story, Yemoja's body swelled until it could contain no more. When she burst, the waters flooded forth to create the rivers and oceans. From her womb came many of the major Orisha - Shango, Ogun, Oshun, Oya, and others (the specific children vary by tradition). Her body became the earth, and her breasts became two hills from which flow the source of the Ogun River. This myth establishes Yemoja as the primordial mother from whom life itself flows."
      },
      {
        "title": "Yemoja and Orunmila - The Origin of Divination",
        "content": "Yemoja was once married to Orunmila, the Orisha of wisdom and divination. She was his first wife and helped him establish the Ifa system. However, Orunmila forbade her from touching his sacred divination implements. One day, curious about her husband's powers, Yemoja secretly used the ikin (palm nuts). When Orunmila discovered this, he banished her. Heartbroken, Yemoja went to live in the river, taking with her knowledge of divination. This is why women can become Iyanifa (female diviners) and why water is used in many divination rituals."
      },
      {
        "title": "Yemoja's Protection of Women",
        "content": "A young woman was being pursued by an evil spirit who wished to steal her unborn child. She ran and ran until she reached the river's edge with nowhere to go. Crying out to Yemoja, she threw herself into the water. But instead of drowning, she felt the Great Mother's arms embrace her. Yemoja carried her downstream to safety and killed the evil spirit with her waves. When the woman gave birth, Yemoja blessed the child. This is why pregnant women pray to Yemoja for protection, and why births in Yoruba tradition are often accompanied by offerings to the water."
      },
      {
        "title": "Yemoja and Olokun - The Depths and the Surface",
        "content": "Yemoja and Olokun (Orisha of the deep ocean) have a complex relationship. In some traditions, Olokun is Yemoja's mother or father; in others, they are aspects of the same force. Olokun rules the unfathomable depths - the mysteries beyond human comprehension. Yemoja rules the surface and the waters that touch the shore - the aspect of the sea that interacts with humanity. Together they represent the full power of the ocean, from sunlit waves to the abyss where no light reaches."
      },
      {
        "title": "The Middle Passage - Yemoja's Grief",
        "content": "When her children were stolen from Africa and forced onto slave ships, Yemoja wept. Her tears filled the Atlantic Ocean with her sorrow. But she did not abandon her children - she followed them across the water, protecting those she could, receiving those who died at sea into her watery embrace. In the Americas, she is honored as the spirit who accompanied the enslaved across the ocean and who continues to protect her children in the diaspora. This is why she is so powerfully venerated in Cuba, Brazil, and throughout the Caribbean."
      }
    ],
    "worship": {
      "offerings": [
        { "item": "Duck", "significance": "Primary offering" },
        { "item": "Fish", "significance": "Her sacred creatures" },
        { "item": "Watermelon", "significance": "Her favorite fruit" },
        { "item": "Molasses", "significance": "Sweet offerings" },
        { "item": "White Flowers", "significance": "Especially white roses" },
        { "item": "Coconut (Obi)", "significance": "Traditional offering" },
        { "item": "Corn", "significance": "White corn" },
        { "item": "Perfume", "significance": "Floral scents" }
      ],
      "sacredSites": {
        "nigeria": "In Nigeria, Yemoja's primary sacred site is the Ogun River in Ogun State, where an annual festival is held. The river's source at the hills is considered especially sacred.",
        "diaspora": "In the diaspora, the ocean itself is her shrine - devotees make offerings at the beach, especially at sunset or during the full moon."
      },
      "festivals": {
        "nigeria": "The Yemoja Festival in Abeokuta, Nigeria, is a major annual celebration featuring processions to the river, offerings of food and flowers, and prayers for fertility and protection.",
        "brazil": "In Brazil, Festa de Iemanja on February 2nd sees millions of people at beaches offering flowers, perfume, and mirrors to the sea. In Rio, boats carry offerings to be thrown into the ocean."
      }
    },
    "protection": {
      "invocations": [
        "Fertility - Women who cannot conceive pray to Yemoja",
        "Safe pregnancy and childbirth - She protects mothers and newborns",
        "Protection of children - All children are under her care",
        "Emotional healing - She soothes grief and depression",
        "Dreams and intuition - She rules the unconscious depths",
        "Protection at sea - Sailors and fishermen honor her",
        "Abundance - As mother of fish, she provides sustenance"
      ],
      "warning": "But Yemoja is not only gentle. Like the sea, she can be terrible in her wrath. Those who harm children or mothers may feel her fury in drownings, floods, and storms. The ocean that nurtures can also destroy."
    },
    "diaspora": {
      "cuba": {
        "name": "Yemaya",
        "syncretism": ["Our Lady of Regla"],
        "notes": "Syncretized with a Black Madonna whose church is at Havana's harbor. She has many 'caminos' (paths) - Yemaya Okute (warrior aspect), Yemaya Olokun (deep ocean), Yemaya Asesu (messenger). Colors: blue and white. Initiation involves elaborate ceremonies near water."
      },
      "brazil": {
        "name": "Iemanja",
        "syncretism": ["Our Lady of the Immaculate Conception"],
        "notes": "Queen of the sea, one of the most popular Orixa. February 2nd (Festa de Iemanja) is a national celebration. Offerings of flowers, mirrors, and perfume are sent to sea on small boats. The mermaid image is strongly associated with her."
      },
      "haiti": {
        "name": "La Siren (The Mermaid)",
        "notes": "She represents the sea itself. Ceremonies include offerings to the ocean. She may possess devotees during rituals, causing them to move as if swimming. Her songs are among the most beautiful in the tradition. Also associated with Agwe's wife."
      },
      "trinidad": {
        "name": "Yemanja/Emanja",
        "notes": "Associated with the sea and motherhood. Ceremonies for her are held at beaches. She is called upon for fertility, protection of children, and safe sea travel. Her colors are blue and white."
      }
    },
    "description": "The universal mother who gave birth to many of the Orisha, Yemoja is the great nurturer and protector. Her realm is the ocean and the Ogun River in Nigeria. She embodies the deep, mysterious, life-giving power of the waters. Yemoja fiercely protects women, especially pregnant women and mothers, and all who dwell near the sea. Her embrace is like the ocean - vast, nurturing, and capable of tremendous power when her children are threatened.",
    "summary": "Great Mother Orisha of the ocean and rivers who gave birth to many Orisha and fiercely protects women, children, and all who honor her.",
    "archetypes": ["great mother", "sea goddess", "fertility goddess"],
    "relationships": {
      "consorts": [
        { "name": "Obatala", "nature": "Considered her husband in many traditions. Their union represents the union of water and land, creation and form." },
        { "name": "Orunmila", "nature": "Her husband in some stories. Their separation explains aspects of divination tradition." },
        { "name": "Olokun", "nature": "In some lineages, not a spouse but closely connected - representing different aspects of the sea." }
      ],
      "withOshun": "Yemoja (salt water/ocean) and Oshun (fresh water/rivers) are often considered sisters or mother and daughter. Where rivers meet the sea is sacred to both - a place of special power. They represent different aspects of feminine water power - Yemoja the deep mother, Oshun the sweet lover."
    },
    "relatedEntities": [
      { "type": "deity", "id": "isis", "mythology": "egyptian", "parallel": "mother" },
      { "type": "deity", "id": "demeter", "mythology": "greek", "parallel": "mother" },
      { "type": "deity", "id": "danu", "mythology": "celtic", "parallel": "mother" },
      { "type": "deity", "id": "lakshmi", "mythology": "hindu", "parallel": "abundance" },
      { "type": "deity", "id": "virgin_mary", "mythology": "christian", "parallel": "syncretic" }
    ],
    "extendedContent": {
      "nameOrigin": "Yemoja's name derives from 'Yeye omo eja' - 'Mother whose children are the fish.' As fish are countless in the sea, so are her children countless among humanity. She represents the primordial womb from which all life emerged - the salt water of the ocean that mirrors the salt water of the womb."
    },
    "metadata": {
      "featured": true,
      "visibility": "public",
      "importance": 95,
      "verified": true,
      "source": "html_enrichment",
      "tags": ["orisha", "mother", "ocean", "fertility", "yoruba"],
      "submissionType": "system",
      "createdBy": "system",
      "enrichedBy": "yoruba_html_enrichment_v1",
      "category": "deity",
      "status": "published"
    },
    "search": {
      "aliases": ["Yemaya", "Iemanja", "Yemanja", "La Siren", "Mama Wata"],
      "keywords": ["yemoja", "yemaya", "iemanja", "ocean", "mother", "fertility", "sea", "orisha", "yoruba", "santeria", "candomble"],
      "facets": {
        "power": "high",
        "tradition": "yoruba"
      }
    },
    "rendering": {
      "defaultAction": "page",
      "modes": {
        "hyperlink": true,
        "subsection": true,
        "expandableRow": true,
        "fullPage": true,
        "panelCard": true
      },
      "defaultMode": "panelCard"
    }
  }
]
