{
  "id": "geomancy",
  "type": "magic",
  "name": "Geomancy",
  "icon": "🌍",
  "slug": "geomancy",
  "mythologies": [
    "arabic",
    "african",
    "chinese",
    "universal"
  ],
  "primaryMythology": "arabic",
  "shortDescription": "Earth divination system using sixteen figures generated through dots or marks, encompassing both Arabic/European geomancy (sand divination with astrological correlations) and Chinese Feng Shui (spatial energy harmonization)",
  "fullDescription": "Geomancy (from Greek 'geo' meaning earth and 'manteia' meaning divination) encompasses multiple distinct divinatory traditions unified by their use of earth, land features, or earth-derived patterns. The term applies primarily to Arabic/European geomancy (sand divination creating sixteen figures), Chinese Feng Shui (spatial energy analysis), and various African earth divination practices. The diversity of geomantic practices reflects humanity's universal recognition of earth as sacred, powerful, and communicative—whether through patterns revealed in cast sand, energy flows through landscape, or messages from earth spirits. The Arabic/European system of sixteen figures appears to have originated in North Africa or the Middle East by the 9th-10th centuries CE, systematized by Arabic scholars who integrated it with astrology, numerology, and Islamic cosmology. It entered medieval Europe through translations during the 12th-13th centuries, where it gained semi-respectability due to its mathematical nature and astrological associations.",
  "category": "divination",
  "subCategory": "earth-divination",
  "method": "figure-casting",
  "colors": {
    "primary": "#8B7355",
    "secondary": "#D4A574",
    "primaryRgb": "139, 115, 85"
  },
  "tags": [
    "geomancy",
    "earth-divination",
    "sixteen-figures",
    "arabic",
    "feng-shui",
    "chinese",
    "african",
    "astrology",
    "sand-divination",
    "spatial-energy"
  ],
  "requirements": {
    "location": {
      "id": "quiet-space",
      "name": "Quiet Space",
      "type": "place",
      "description": "For Arabic geomancy: any location with surface for marking; For Feng Shui: the site being analyzed"
    },
    "timing": "Any time for Arabic geomancy; Feng Shui considers temporal cycles and planetary hours",
    "practitioner": "Arabic geomancy accessible to studious learners; Feng Shui requires extensive training in classical methods",
    "preparation": "Learning the sixteen figures and their meanings; understanding house system; studying astrological correspondences",
    "items": [
      {
        "id": "sand-earth",
        "name": "Sand or Earth",
        "description": "Clean surface for traditional casting method"
      },
      {
        "id": "pen-paper",
        "name": "Pen and Paper",
        "description": "For modern mark-making method"
      },
      {
        "id": "dice-coins",
        "name": "Dice or Coins (modern)",
        "description": "Alternative randomization tools"
      },
      {
        "id": "luo-pan",
        "name": "Luo Pan (Feng Shui)",
        "description": "Geomantic compass for Feng Shui practice"
      }
    ]
  },
  "steps": [
    {
      "order": 1,
      "action": "Formulate Clear Question",
      "description": "Frame a specific question suitable for binary or situational answer, focusing clearly on the matter at hand"
    },
    {
      "order": 2,
      "action": "Generate Randomness",
      "description": "Traditional: Make sixteen random marks in sand without counting; Modern: Use dice, coins, or random strokes on paper"
    },
    {
      "order": 3,
      "action": "Count Marks",
      "description": "Count each row of marks. Even number = two dots, odd number = one dot. Record the pattern"
    },
    {
      "order": 4,
      "action": "Create Four Mothers",
      "description": "Generate four separate sets of four rows to produce the four Mother figures"
    },
    {
      "order": 5,
      "action": "Derive Four Daughters",
      "description": "Read the Mothers vertically: top row of all Mothers becomes First Daughter, and so on"
    },
    {
      "order": 6,
      "action": "Generate Four Nieces",
      "description": "Add Mother-Daughter pairs (1st+2nd, 3rd+4th, etc.) to create four Niece figures"
    },
    {
      "order": 7,
      "action": "Create Two Witnesses",
      "description": "Add Niece pairs to produce Right Witness and Left Witness"
    },
    {
      "order": 8,
      "action": "Form the Judge",
      "description": "Add the two Witnesses together to create the Judge figure, representing the final outcome"
    },
    {
      "order": 9,
      "action": "Arrange Geomantic Shield",
      "description": "Place the sixteen figures in the house chart, assigning each to astrological houses"
    },
    {
      "order": 10,
      "action": "Interpret Figures",
      "description": "Read each figure's meaning based on its inherent significance and house placement"
    },
    {
      "order": 11,
      "action": "Analyze Relationships",
      "description": "Consider aspects between houses, planetary hours, triplicities, and overall pattern"
    },
    {
      "order": 12,
      "action": "Synthesize Answer",
      "description": "Integrate the Judge, Witnesses, and relevant house figures into a coherent response"
    }
  ],
  "effects": "Arabic geomancy provides clear, structured divination for specific questions, particularly effective for practical matters, timing, and yes/no queries. The system's integration with astrology allows sophisticated analysis of situations. Practitioners develop understanding of symbolic correspondences and pattern recognition. Feng Shui practice harmonizes living and working spaces with natural energy flows, optimizing qi circulation for health, prosperity, and well-being. Regular practice deepens awareness of environmental energies and spatial relationships.",
  "warnings": "Arabic geomancy requires study to interpret accurately—misunderstanding figure meanings leads to poor guidance. Avoid fatalistic interpretations; figures show probabilities, not fixed fate. Birth time inaccuracy affects horary applications. Don't use geomancy as substitute for professional advice in medical, legal, or financial matters. Feng Shui: Beware of simplified 'New Age' versions that omit essential classical principles. Traditional Feng Shui requires years of study—amateur applications may be ineffective or counterproductive. Avoid making major architectural changes based solely on untrained analysis. Some Feng Shui 'cures' are modern inventions without classical precedent.",
  "mythologyContexts": [
    {
      "mythology": "arabic",
      "usage": "The sixteen-figure geomantic system developed in North Africa or the Middle East, systematized by Arabic scholars by the 9th-10th centuries CE. Known as 'ilm al-raml' (science of the sand), it integrated with Islamic astrology, numerology, and cosmology. Medieval Arabic texts like those translated by Gerard of Cremona brought the practice to European scholars.",
      "associatedDeities": [],
      "mythicalOrigins": "Arabic tradition attributes geomancy to ancient wisdom, though its precise origins remain unclear. The systematic sixteen-figure pattern suggests development from earlier African divination practices involving casting seeds or bones",
      "textReferences": [
        {
          "text": "De Geomantia",
          "author": "Gerard of Cremona (translator)",
          "passage": "Complete work",
          "context": "12th century Latin translation of Arabic geomantic texts, foundational to medieval European practice",
          "corpusUrl": "/corpus-search.html?term=de+geomantia"
        }
      ],
      "symbolism": "The sixteen figures represent cosmic forces channeled through earth. Each figure embodies planetary and elemental energies, making geomancy a bridge between celestial influences and terrestrial manifestation",
      "culturalSignificance": "Arabic geomancy maintained high status as a 'legitimate' divinatory science alongside astrology, accepted by many Islamic scholars as a valid means of seeking guidance. It influenced medieval European magic profoundly"
    },
    {
      "mythology": "chinese",
      "usage": "Feng Shui (風水, 'wind-water') developed in ancient China as a system for harmonizing buildings, graves, and cities with the natural environment and cosmic forces. Originating during the Han Dynasty (206 BCE - 220 CE) or earlier, it evolved from shamanic practices, cosmology, and observation of natural patterns. Unlike Arabic geomancy's divination focus, Feng Shui aims to optimize qi (vital energy) flow through strategic placement and orientation",
      "associatedDeities": [],
      "mythicalOrigins": "Feng Shui arose from Chinese cosmological observation and the belief that humans exist within flowing cosmic energies. Proper alignment with these forces brings harmony, while opposition creates misfortune",
      "textReferences": [
        {
          "text": "Qing Nang Jing (Canon of the Green Bag)",
          "passage": "Complete text",
          "context": "One of the oldest Feng Shui texts (c. 300 CE), establishing foundational principles of geomantic practice",
          "corpusUrl": "/corpus-search.html?term=qing+nang+jing"
        },
        {
          "text": "Zang Shu (Book of Burial)",
          "author": "Guo Pu",
          "passage": "Complete work",
          "context": "Influential early text (276-324 CE) on grave site selection and yin Feng Shui, describing qi flow and landform analysis",
          "corpusUrl": "/corpus-search.html?term=zang+shu"
        }
      ],
      "symbolism": "Feng Shui sees the landscape as a living organism with qi flowing through 'dragon veins' (mountain ridges). Buildings must align with these natural currents to receive beneficial energy. The eight trigrams (bagua) represent directional forces and life areas",
      "culturalSignificance": "Feng Shui profoundly influenced Chinese architecture, urban planning, and burial customs throughout East Asia. Emperors employed court geomancers to site palaces and tombs. The practice continues today in both traditional and adapted forms"
    }
  ],
  "relatedEntities": {
    "practices": [
      {
        "id": "i-ching",
        "name": "I Ching",
        "type": "magic",
        "mythology": "chinese",
        "icon": "☯",
        "url": "/magic/divination/i-ching.html"
      },
      {
        "id": "astrology",
        "name": "Astrology",
        "type": "magic",
        "mythology": "universal",
        "icon": "♈",
        "url": "/magic/divination/astrology.html"
      },
      {
        "id": "qigong",
        "name": "Qigong",
        "type": "magic",
        "mythology": "chinese",
        "icon": "🌊",
        "url": "/magic/energy/qigong.html"
      },
      {
        "id": "tarot",
        "name": "Tarot",
        "type": "magic",
        "mythology": "universal",
        "icon": "🃏",
        "url": "/magic/divination/tarot.html"
      }
    ],
    "texts": [
      {
        "id": "picatrix",
        "name": "Picatrix",
        "type": "magic",
        "mythology": "arabic",
        "icon": "📖",
        "url": "/magic/texts/picatrix.html"
      }
    ]
  },
  "archetypes": [
    {
      "category": "sage-wisdom",
      "score": 70,
      "strength": "moderate",
      "analysis": "Geomancy embodies the Sage archetype through its systematic pursuit of earthly wisdom and pattern recognition. The geomancer interprets hidden structures in randomness, revealing cosmic order"
    },
    {
      "category": "earth-mother",
      "score": 80,
      "strength": "strong",
      "analysis": "The practice connects directly to Earth as source of wisdom and power. Whether through sand casting or Feng Shui's landscape reading, geomancy recognizes Earth as communicative and sacred"
    }
  ],
  "sources": [
    {
      "text": "The Oracle of Geomancy",
      "author": "Stephen Skinner",
      "mythology": "arabic",
      "date": "1977, revised 1986",
      "type": "modern-scholarship"
    },
    {
      "text": "The Art and Practice of Geomancy",
      "author": "John Michael Greer",
      "mythology": "arabic",
      "date": "2009",
      "type": "modern-scholarship"
    },
    {
      "text": "Qing Nang Jing (Canon of the Green Bag)",
      "author": "Various (compiled c. 300 CE)",
      "mythology": "chinese",
      "date": "c. 300 CE",
      "type": "primary-text"
    },
    {
      "text": "An Introduction to Feng Shui",
      "author": "Ole Bruun",
      "mythology": "chinese",
      "date": "2008",
      "type": "modern-scholarship"
    }
  ],
  "linguistic": {
    "originalName": "γεωμαντεία / 風水",
    "originalScript": "greek / chinese",
    "transliteration": "geomanteia / feng shui",
    "pronunciation": "/ˌdʒiːoʊˈmænsi/ / /fʌŋ ʃweɪ/",
    "etymology": {
      "rootLanguage": "Greek / Chinese",
      "meaning": "Earth divination / Wind-water",
      "derivation": "Geo (earth) + manteia (divination) / Feng (wind) + Shui (water)"
    },
    "cognates": [
      {
        "language": "Arabic",
        "term": "علم الرمل",
        "script": "'ilm al-raml",
        "meaning": "Science of the sand"
      },
      {
        "language": "Latin",
        "term": "geomantia",
        "script": "geomantia"
      }
    ],
    "languageCode": "grc/zh"
  },
  "geographical": {
    "region": "North Africa/Middle East (Arabic); China (Feng Shui)",
    "culturalArea": "Islamic world, Medieval Europe, East Asia",
    "originPoint": {
      "name": "Multiple Origins",
      "coordinates": {
        "latitude": 30.0,
        "longitude": 31.0,
        "accuracy": "regional"
      }
    },
    "modernCountries": [
      "Morocco",
      "Egypt",
      "China",
      "Global practice"
    ]
  },
  "temporal": {
    "timelinePosition": "Medieval",
    "culturalPeriod": "9th-10th century CE (Arabic systematization); Han Dynasty onward (Feng Shui)",
    "firstAttestation": {
      "date": {
        "year": 900,
        "circa": true,
        "uncertainty": 100,
        "display": "c. 900 CE",
        "confidence": "probable"
      },
      "source": "Arabic geomantic texts",
      "type": "literary"
    },
    "historicalDate": {
      "start": {
        "year": 900,
        "circa": true,
        "display": "c. 900 CE"
      },
      "end": {
        "year": 2025,
        "circa": false,
        "display": "Present"
      },
      "display": "c. 900 CE - Present (Arabic); c. 206 BCE - Present (Feng Shui)"
    }
  }
}
