{
  "id": "i-ching",
  "type": "magic",
  "name": "I Ching (Yijing)",
  "icon": "☯",
  "slug": "i-ching",
  "mythologies": [
    "chinese",
    "taoist",
    "confucian"
  ],
  "primaryMythology": "chinese",
  "shortDescription": "Ancient Chinese divination and philosophical text based on 64 hexagrams composed of yin and yang lines, known as the Book of Changes, dating back over 3,000 years to the Western Zhou Dynasty",
  "fullDescription": "The I Ching (Wade-Giles) or Yijing (Pinyin), known as the Book of Changes, is one of the oldest Chinese classical texts and divination systems, with origins dating back over 3,000 years to the Western Zhou Dynasty (1000-750 BCE) and possibly earlier. It consists of 64 hexagrams, each composed of six stacked lines that are either broken (yin) or unbroken (yang), representing the fundamental binary forces underlying all existence. The text evolved through several historical layers: the hexagrams themselves (believed to derive from even older oracle bone divination), the brief hexagram and line statements attributed to King Wen and the Duke of Zhou, and later philosophical commentaries known as the Ten Wings, traditionally attributed to Confucius. The central principle is that reality constantly transforms through the dynamic interplay of yin and yang, and the hexagrams capture moments in this continuous cycle, providing insight into present situations and indicating how change will unfold.",
  "category": "divination",
  "subCategory": "symbol-system",
  "method": "hexagram-interpretation",
  "colors": {
    "primary": "#C41E3A",
    "secondary": "#FFD700",
    "primaryRgb": "196, 30, 58"
  },
  "tags": [
    "i-ching",
    "yijing",
    "chinese",
    "hexagrams",
    "yin-yang",
    "divination",
    "tao",
    "confucian",
    "yarrow-stalks",
    "coins",
    "book-of-changes"
  ],
  "requirements": {
    "location": {
      "id": "quiet-contemplative-space",
      "name": "Quiet Contemplative Space",
      "type": "place",
      "description": "Any quiet location conducive to meditation and focus"
    },
    "timing": "Any time; the oracle responds to sincere inquiry",
    "practitioner": "Anyone willing to study and approach with sincerity; requires philosophical understanding and symbolic thinking",
    "preparation": "Learning the 64 hexagrams and their meanings; understanding yin-yang philosophy; studying the commentaries",
    "items": [
      {
        "id": "yarrow-stalks",
        "name": "50 Yarrow Stalks",
        "description": "Traditional method requiring 49 stalks (one set aside)"
      },
      {
        "id": "three-coins",
        "name": "Three Coins",
        "description": "Simplified method using identical coins"
      },
      {
        "id": "i-ching-text",
        "name": "I Ching Text",
        "description": "Translation or original text for hexagram interpretation"
      }
    ]
  },
  "steps": [
    {
      "order": 1,
      "action": "Formulate Question Mindfully",
      "description": "Frame a clear, open-ended question seeking understanding rather than yes/no answers. Consider timing and proper approach"
    },
    {
      "order": 2,
      "action": "Enter Contemplative State",
      "description": "Center yourself through meditation or breathing, creating receptivity and respect for the oracle"
    },
    {
      "order": 3,
      "action": "Generate Hexagram (Coin Method)",
      "description": "Toss three coins six times. Heads=3, Tails=2. Sum: 6=changing yin, 7=stable yang, 8=stable yin, 9=changing yang"
    },
    {
      "order": 4,
      "action": "Generate Hexagram (Yarrow Method)",
      "description": "Complex traditional method using 49 yarrow stalks through elaborate counting process repeated 18 times to build six lines"
    },
    {
      "order": 5,
      "action": "Record Lines Bottom to Top",
      "description": "Build the hexagram from bottom line upward, noting which lines are changing (6 or 9)"
    },
    {
      "order": 6,
      "action": "Identify Primary Hexagram",
      "description": "Determine which of the 64 hexagrams you have received based on the line pattern"
    },
    {
      "order": 7,
      "action": "Read Judgment and Image",
      "description": "Study the overall hexagram commentary for the broad situation assessment"
    },
    {
      "order": 8,
      "action": "Read Changing Lines",
      "description": "If lines are changing, read the specific line texts (bottom to top) for detailed guidance"
    },
    {
      "order": 9,
      "action": "Generate Future Hexagram",
      "description": "Transform changing lines (yin becomes yang, yang becomes yin) to see the situation's likely development"
    },
    {
      "order": 10,
      "action": "Read Future Hexagram",
      "description": "Study the resultant hexagram's Judgment and Image for the outcome or evolution"
    },
    {
      "order": 11,
      "action": "Contemplate and Synthesize",
      "description": "Integrate all readings into coherent understanding, allowing insights to emerge naturally"
    },
    {
      "order": 12,
      "action": "Record and Reflect",
      "description": "Document the reading and allow wisdom to unfold over time through observation"
    }
  ],
  "effects": "The I Ching provides profound guidance on situations through archetypal wisdom patterns, emphasizing timing, natural flow, and proper action. Regular practice develops understanding of change cycles, enhances intuitive wisdom, and cultivates alignment with Tao (natural way). The oracle serves as teacher rather than fortune-teller, encouraging contemplation of universal principles. Practitioners gain perspective on challenges, clarity about timing, and insight into the natural unfolding of events. The system fosters philosophical understanding of yin-yang dynamics and cyclical transformation.",
  "warnings": "Approach the I Ching with sincerity and respect—frivolous consultation receives unclear answers. Don't consult repeatedly on the same question seeking preferred responses. The oracle speaks in symbolic, philosophical language requiring contemplation; avoid demanding literal predictions. Accept challenging or unexpected readings as valuable teaching. Use insights to inform decisions while maintaining personal responsibility. Don't substitute I Ching guidance for professional medical, legal, or financial advice. The text's archaic language can be difficult; use reputable translations and avoid oversimplified versions. Different translation philosophies (Wilhelm, Blofeld, Lynn, Rutt) emphasize different aspects—study multiple versions for depth.",
  "mythologyContexts": [
    {
      "mythology": "chinese",
      "usage": "The I Ching served as foundational text for both Confucian and Taoist thought, bridging divination and philosophy. Used for royal decision-making, military strategy, agricultural timing, and personal cultivation. The hexagrams derive from observation of cosmic patterns—yin-yang interaction underlying all reality",
      "associatedDeities": [],
      "mythicalOrigins": "Traditionally attributed to legendary sage-kings: Fu Xi created the eight trigrams by observing patterns in nature; King Wen arranged the 64 hexagrams and wrote the Judgments while imprisoned; the Duke of Zhou added line statements; Confucius contributed the Ten Wings commentaries",
      "textReferences": [
        {
          "text": "Zhou Yi (Book of Changes Core)",
          "passage": "Complete 64 hexagrams",
          "context": "Original text of hexagram and line statements, c. 1000-750 BCE",
          "corpusUrl": "/corpus-search.html?term=zhou+yi"
        },
        {
          "text": "Shi Yi (Ten Wings)",
          "passage": "Complete commentaries",
          "context": "Later philosophical elaborations traditionally attributed to Confucius and his school",
          "corpusUrl": "/corpus-search.html?term=ten+wings"
        }
      ],
      "symbolism": "The eight trigrams represent fundamental forces: Qian (Heaven/Creative), Kun (Earth/Receptive), Zhen (Thunder/Arousing), Kan (Water/Abyss), Gen (Mountain/Stillness), Xun (Wind/Gentle), Li (Fire/Clinging), Dui (Lake/Joyous). Combined into 64 hexagrams, they map all possible situations and transformations",
      "culturalSignificance": "The I Ching ranks among the Five Classics of Confucianism, considered essential wisdom literature. It profoundly influenced Chinese philosophy, cosmology, medicine, martial arts, and strategic thinking. The yin-yang symbolism became fundamental to East Asian thought"
    },
    {
      "mythology": "taoist",
      "usage": "Taoist interpretation emphasizes wu wei (effortless action), naturalness, and flowing with circumstances rather than forcing outcomes. The text reveals the Tao's natural unfolding, teaching when to act and when to refrain, how to maintain balance, and recognizing transformation patterns",
      "associatedDeities": [],
      "mythicalOrigins": "Taoists see the I Ching as revealing the Tao's inherent patterns—the natural way that cannot be fully expressed in words but can be apprehended through contemplation of hexagram symbolism",
      "textReferences": [],
      "symbolism": "The constant transformation of hexagrams reflects Taoist cosmology: the Tao producing yin and yang, which produce the four symbols, then eight trigrams, then 64 hexagrams—the unfolding of reality from primordial unity",
      "culturalSignificance": "Taoist practitioners use the I Ching for spiritual cultivation, alchemical timing, and understanding natural cycles. The text supports Taoist values of spontaneity, acceptance, and harmonious adaptation"
    },
    {
      "mythology": "confucian",
      "usage": "Confucian interpretation emphasizes moral development, social harmony, proper conduct, and the Mandate of Heaven. The hexagrams provide guidance for ethical behavior, self-cultivation, and fulfilling one's role in society. Emphasis on virtue (de), righteousness (yi), and proper action according to circumstances",
      "associatedDeities": [],
      "mythicalOrigins": "Confucians revere the I Ching as wisdom from sage-kings, representing accumulated moral and cosmological understanding transmitted through millennia",
      "textReferences": [
        {
          "text": "Da Zhuan (Great Commentary)",
          "passage": "Complete text",
          "context": "One of the Ten Wings, philosophical elaboration of I Ching principles, Confucian perspective",
          "corpusUrl": "/corpus-search.html?term=da+zhuan"
        }
      ],
      "symbolism": "Hexagrams represent stages of moral development and social relationships. The superior person (junzi) studies changes to understand proper timing and action in fulfilling social and cosmic responsibilities",
      "culturalSignificance": "Essential Confucian text for understanding moral order, self-cultivation, and governance. Examined by civil service candidates for centuries. Represents the integration of divination with ethical philosophy"
    }
  ],
  "relatedEntities": {
    "practices": [
      {
        "id": "oracle-bones",
        "name": "Oracle Bones",
        "type": "magic",
        "mythology": "chinese",
        "icon": "🦴",
        "url": "/magic/divination/oracle-bones.html"
      },
      {
        "id": "geomancy",
        "name": "Geomancy (Feng Shui)",
        "type": "magic",
        "mythology": "chinese",
        "icon": "🌍",
        "url": "/magic/divination/geomancy.html"
      },
      {
        "id": "qigong",
        "name": "Qigong",
        "type": "magic",
        "mythology": "chinese",
        "icon": "🌊",
        "url": "/magic/energy/qigong.html"
      },
      {
        "id": "tarot",
        "name": "Tarot",
        "type": "magic",
        "mythology": "universal",
        "icon": "🃏",
        "url": "/magic/divination/tarot.html"
      }
    ]
  },
  "archetypes": [
    {
      "category": "sage-wisdom",
      "score": 95,
      "strength": "strong",
      "analysis": "The I Ching embodies the Sage archetype as ancient wisdom teacher, providing philosophical guidance through symbolic patterns. The oracle as wise counselor interpreting cosmic patterns"
    },
    {
      "category": "cycles-and-seasons",
      "score": 90,
      "strength": "strong",
      "analysis": "The system fundamentally concerns cyclical transformation, constant change through yin-yang interaction, reflecting eternal rhythms of nature and cosmos"
    },
    {
      "category": "hero-journey",
      "score": 75,
      "strength": "strong",
      "analysis": "The hexagram sequence maps the journey through life's challenges and transformations, from difficulty at the beginning through completion and return"
    }
  ],
  "sources": [
    {
      "text": "The I Ching or Book of Changes (Wilhelm-Baynes)",
      "author": "Richard Wilhelm (trans.), Cary Baynes (English trans.)",
      "mythology": "chinese",
      "date": "1923 (German), 1950 (English)",
      "type": "translation"
    },
    {
      "text": "The Classic of Changes: Wang Bi Commentary",
      "author": "Richard John Lynn (trans.)",
      "mythology": "chinese",
      "date": "1994",
      "type": "translation"
    },
    {
      "text": "Fathoming the Cosmos and Ordering the World: The Yijing",
      "author": "Richard J. Smith",
      "mythology": "chinese",
      "date": "2008",
      "type": "modern-scholarship"
    }
  ],
  "linguistic": {
    "originalName": "易經",
    "originalScript": "chinese",
    "transliteration": "Yijing (Pinyin) / I Ching (Wade-Giles)",
    "pronunciation": "/iː tʃɪŋ/",
    "etymology": {
      "rootLanguage": "Chinese",
      "meaning": "Book of Changes",
      "derivation": "Yi (change, ease) + Jing (classic, canon)"
    },
    "cognates": [
      {
        "language": "Korean",
        "term": "역경",
        "script": "Yeokgyeong",
        "meaning": "Book of Changes"
      },
      {
        "language": "Japanese",
        "term": "易経",
        "script": "Ekikyō",
        "meaning": "Book of Changes"
      }
    ],
    "languageCode": "zh"
  },
  "geographical": {
    "region": "China",
    "culturalArea": "East Asia",
    "originPoint": {
      "name": "Yellow River Valley, China",
      "coordinates": {
        "latitude": 34.5,
        "longitude": 113.5,
        "accuracy": "regional"
      }
    },
    "modernCountries": [
      "China",
      "Taiwan",
      "Korea",
      "Japan",
      "Global practice"
    ]
  },
  "temporal": {
    "timelinePosition": "Ancient",
    "culturalPeriod": "Western Zhou Dynasty (1000-750 BCE), with earlier origins",
    "firstAttestation": {
      "date": {
        "year": -1000,
        "circa": true,
        "uncertainty": 200,
        "display": "c. 1000 BCE",
        "confidence": "probable"
      },
      "source": "Earliest textual layers (King Wen, Duke of Zhou)",
      "type": "literary"
    },
    "historicalDate": {
      "start": {
        "year": -1000,
        "circa": true,
        "uncertainty": 200,
        "display": "c. 1000 BCE"
      },
      "end": {
        "year": 2025,
        "circa": false,
        "display": "Present"
      },
      "display": "c. 1000 BCE - Present"
    }
  }
}
