{
  "id": "picatrix",
  "type": "magic",
  "name": "Picatrix",
  "icon": "🌙",
  "slug": "picatrix",
  "mythologies": [
    "islamic",
    "hermetic",
    "medieval-european",
    "arabic"
  ],
  "primaryMythology": "islamic",
  "shortDescription": "Comprehensive Arabic astrological magic grimoire (Ghāyat al-Ḥakīm, c. 1000 CE) teaching talismanic magic, planetary invocations, lunar mansion operations, spirit conjuration, and Hermetic philosophy, translated into Latin as Picatrix (1256)",
  "fullDescription": "The Picatrix (Arabic: Ghāyat al-Ḥakīm, 'The Aim of the Sage') is the most comprehensive and influential treatise on astrological magic ever written, a massive synthesis of Hermetic philosophy, Neoplatonic theurgy, Arabic astrology, and practical talismanic magic composed in Arabic around 1000 CE (attributed to the mathematician al-Majriti of Cordoba, though authorship debated). The text integrates theoretical philosophy with practical magical techniques, teaching that the cosmos is a unified living organism connected through sympathetic correspondences, and that by understanding and manipulating these connections through properly timed talismans, invocations, suffumigations, and images, the magician can draw down celestial influences and command spirits. The grimoire is organized into four books covering: (1) philosophical foundations and cosmology, (2) images and talismans for all purposes, (3) the 28 lunar mansions with their specific magical operations, and (4) planetary spirits, invocations, and suffumigations. The Picatrix provides detailed instructions for creating powerful talismans aligned with planetary and stellar forces, invoking planetary spirits and angels, working with the lunar mansions for timing operations, using magical images and symbols, performing ritual invocations with precise ceremonial requirements, and employing herbs, stones, and animal materials in sympathetic magic. Translated into Latin in 1256 at the court of Alfonso X of Castile, the Picatrix profoundly influenced Renaissance magic (Ficino, Agrippa, Bruno) and remains central to contemporary astrological magic and planetary work. Its combination of sophisticated astrological theory with practical magical application makes it unparalleled in the grimoire tradition.",
  "category": "grimoire",
  "subCategory": "astrological-magic",
  "textType": "philosophical-practical",
  "colors": {
    "primary": "#8B4789",
    "secondary": "#9966CC",
    "primaryRgb": "139, 71, 137"
  },
  "tags": [
    "picatrix",
    "astrological-magic",
    "talismans",
    "lunar-mansions",
    "planetary-spirits",
    "arabic-magic",
    "hermetic",
    "medieval-magic",
    "image-magic",
    "renaissance-influence",
    "suffumigation",
    "celestial-magic"
  ],
  "textStructure": {
    "arabicTitle": "Ghāyat al-Ḥakīm (غاية الحكيم)",
    "latinTitle": "Picatrix",
    "form": "Comprehensive treatise combining philosophy and practical magic",
    "language": "Arabic (original); Latin (1256); Spanish (parallel); modern English (2002, 2008)",
    "organization": "Four books, multiple chapters each",
    "totalLength": "Approximately 400 pages in modern translation",
    "book1": {
      "title": "Theoretical Foundations",
      "chapters": "7 chapters",
      "contents": [
        "Nature of magic and its legitimacy",
        "Hermetic philosophy and cosmology",
        "Structure of the universe and celestial spheres",
        "Correspondences between celestial and terrestrial realms",
        "Neoplatonic emanation and return",
        "Properties of planets and their influences",
        "Philosophical justification for talismanic magic"
      ],
      "significance": "Provides theoretical framework grounding magic in natural philosophy and Hermetic cosmology"
    },
    "book2": {
      "title": "Images and Talismans",
      "chapters": "12 chapters",
      "contents": [
        "Talismanic images for each planet",
        "Decan images (36 decans of the zodiac)",
        "Specific talismans for various purposes (love, wealth, power, protection, victory, healing)",
        "Materials for talismans (metals, stones, herbs)",
        "Timing of talisman creation",
        "Consecration procedures",
        "Examples of historical magical operations"
      ],
      "significance": "Practical manual for creating astrological talismans; most frequently consulted section"
    },
    "book3": {
      "title": "Lunar Mansions",
      "chapters": "9 chapters",
      "contents": [
        "The 28 lunar mansions (manāzil al-qamar)",
        "Specific magical operations for each mansion",
        "Timing based on moon's position",
        "Talismans and images for lunar mansions",
        "Spirits and angels of each mansion",
        "Practical experiments organized by mansion",
        "Electional astrology for magic"
      ],
      "significance": "Most detailed treatment of lunar mansion magic in Western tradition; essential for magical timing"
    },
    "book4": {
      "title": "Planetary Spirits and Invocations",
      "chapters": "9 chapters",
      "contents": [
        "Spirits and angels of the seven planets",
        "Invocations and prayers to planetary powers",
        "Suffumigations (incenses) for each planet",
        "Ritual procedures for planetary operations",
        "Properties and sympathies of materials",
        "Magical recipes and compoundings",
        "Advanced talismanic operations",
        "Integration of all previous teachings"
      ],
      "significance": "Culmination of the grimoire; combines all elements into complete magical system"
    }
  },
  "historicalContext": {
    "arabicComposition": {
      "date": "c. 1000 CE (10th-11th century)",
      "location": "Al-Andalus (Islamic Spain) or Middle East",
      "attribution": "Attributed to Abū-Maslama Muhammad ibn Ibrahim ibn 'Abd al-da'im al-Majriti (Maslama al-Majriti), mathematician of Cordoba (d. 1007)",
      "authorship": "Actual authorship disputed; possibly compiled by student or later figure using al-Majriti's name",
      "sources": "Synthesizes over 200 earlier sources including Hermetic texts, Neoplatonic philosophy, Indian astronomy, Sabian star worship, Persian magic"
    },
    "culturalContext": {
      "environment": "Islamic Golden Age scholarship in al-Andalus and Abbasid centers; translation movement bringing Greek, Persian, Indian texts into Arabic",
      "philosophy": "Blends Aristotelianism, Neoplatonism, and Hermeticism within Islamic framework",
      "practice": "Astrological magic widely practiced among educated elites; talismans used by rulers, scholars, physicians",
      "legitimacy": "Controversial within Islamic law but defended as 'natural magic' working through celestial causes, not demons"
    },
    "latinTranslation": {
      "date": "1256 CE",
      "location": "Toledo, Spain (translation center at court of Alfonso X 'the Wise' of Castile)",
      "translator": "Possibly Aegidius de Tebaldis of Parma or Jewish scholars in Alfonso's scriptorium",
      "title": "'Picatrix'—etymology uncertain, possibly corruption of Buqratis (Hippocrates) or another Arabic name",
      "impact": "Made Arabic astrological magic available to Latin Europe; influenced Renaissance magic profoundly"
    },
    "renaissanceInfluence": {
      "ficino": "Marsilio Ficino drew on Picatrix for De Vita Coelitus Comparanda (drawing down celestial life)",
      "agrippa": "Heinrich Cornelius Agrippa incorporated Picatrix material throughout De Occulta Philosophia",
      "bruno": "Giordano Bruno's image magic and mnemonics influenced by Picatrix's talismanic theories",
      "context": "Considered dangerous and powerful; manuscript circulation restricted; printed editions rare until modern era"
    },
    "modernRediscovery": {
      "critical": "Warburg Institute scholars (Aby Warburg, Fritz Saxl, Frances Yates) studied its Renaissance influence",
      "translations": "Hashem Atallah partial translation (1933); Ouroboros Press edition (2002); Attrell & Porreca critical translation (2011)",
      "revival": "Contemporary astrological magicians (Christopher Warnock, Austin Coppock, others) revived Picatrix practices"
    }
  },
  "keyTeachings": [
    "Celestial Causation: All earthly phenomena are caused by celestial influences flowing from planets, stars, and constellations; understanding these influences enables the magician to harness them",
    "Sympathetic Correspondences: Cosmos is unified through chains of sympathy (minerals, plants, animals, body parts, colors, scents all correspond to specific planets); using correct correspondences channels celestial power",
    "Lunar Mansion System: The 28 lunar mansions (moon's daily positions against fixed stars) are crucial for magical timing; each mansion has specific spirits, powers, and appropriate operations",
    "Talismanic Theory: Properly constructed talismans created at astrologically elected times become vessels for celestial virtues, continuing to radiate specific influences (healing, protection, love, wealth, etc.)",
    "Planetary Hours and Days: All magical operations must be performed during appropriate planetary hours when the desired planet rules; timing is more important than will or belief",
    "Suffumigation and Invocation: Burning specific incenses attracts planetary spirits; combining suffumigation with invocations and talismans creates complete ceremonial operation",
    "Hermetic Cosmology: Universe emanates from One (God) through celestial spheres to material world; magic works by aligning with this structure, not opposing it; magician is microcosm containing all cosmic forces",
    "Spirit Hierarchies: Each planet has ruling spirits, angels, and intelligences that can be invoked through proper names, prayers, and ceremonial conditions; spirits willingly aid the properly prepared magician"
  ],
  "practicalApplications": [
    "Talismanic Creation: Making astrological talismans for specific purposes (love, wealth, protection, power, healing, learning) using planetary metals, stones, images, and characters at elected times",
    "Lunar Mansion Magic: Timing operations by lunar mansions for maximum efficacy; specific mansions for specific goals (1st mansion for journeys, 9th for illness, 23rd for divorce, etc.)",
    "Planetary Invocations: Ceremonial invocations of planetary spirits using prescribed prayers, suffumigations, offerings, and timing to gain favor, knowledge, or specific benefits",
    "Electional Astrology: Selecting optimal astrological moments for any important undertaking—magical or mundane—based on planetary positions, aspects, and dignities",
    "Image Magic: Creating and consecrating powerful images (statues, drawings, engravings) representing planetary or stellar forces to serve as perpetual talismans",
    "Renaissance Magic Revival: Foundation for Ficino's spiritual magic, Agrippa's three books of occult philosophy, and Bruno's memory systems",
    "Modern Astrological Magic: Contemporary planetary magic practitioners use Picatrix as primary source for traditional methods, especially lunar mansion and talisman work",
    "Herbal and Material Magic: Extensive lists of planetary correspondences used by herbalists, gemstone workers, and folk magicians for sympathetic magic"
  },
  "manuscriptHistory": {
    "arabic": {
      "manuscripts": "Multiple Arabic manuscripts survive in libraries (Cairo, Istanbul, London, Paris)",
      "variations": "Some textual variation between manuscripts",
      "circulation": "Widely copied and studied in Islamic world; controversial but influential"
    },
    "latin": {
      "translation": "1256 CE at Toledo under Alfonso X",
      "manuscripts": "Over 20 medieval and Renaissance Latin manuscripts survive",
      "circulation": "Limited circulation due to controversial content; owned by scholars and nobility"
    },
    "printed": {
      "early": "No complete medieval printed edition; excerpts in magical compilations",
      "modern": "First complete print edition in modern era"
    },
    "modern": {
      "editions": [
        {
          "year": 2002,
          "publisher": "Ouroboros Press",
          "description": "First complete English translation from Latin (anonymous translator)"
        },
        {
          "year": 2008,
          "publisher": "Ouroboros Press",
          "description": "Revised edition with improved translation"
        },
        {
          "year": 2011,
          "translators": "Dan Attrell and David Porreca",
          "description": "Critical scholarly translation from Latin with extensive annotations, published by Penn State Press"
        }
      ],
      "significance": "Modern translations sparked revival of traditional astrological magic practice"
    }
  },
  "relatedEntities": {
    "practices": [
      {
        "id": "astrology",
        "name": "Astrology",
        "type": "magic",
        "mythology": "universal",
        "icon": "♈",
        "url": "/magic/divination/astrology.html"
      },
      {
        "id": "alchemy",
        "name": "Alchemy",
        "type": "magic",
        "mythology": "hermetic",
        "icon": "🜃",
        "url": "/magic/alchemy.html"
      },
      {
        "id": "planetary-magic",
        "name": "Planetary Magic",
        "type": "magic",
        "mythology": "hermetic",
        "icon": "🪐",
        "url": "/magic/planetary-magic.html"
      }
    ],
    "texts": [
      {
        "id": "corpus-hermeticum",
        "name": "Corpus Hermeticum",
        "type": "text",
        "mythology": "hermetic",
        "icon": "☿",
        "url": "/texts/corpus-hermeticum.html"
      },
      {
        "id": "key-of-solomon",
        "name": "Key of Solomon",
        "type": "text",
        "mythology": "medieval-european",
        "icon": "🔑",
        "url": "/texts/key-of-solomon.html"
      },
      {
        "id": "emerald-tablet",
        "name": "Emerald Tablet",
        "type": "text",
        "mythology": "hermetic",
        "icon": "💎",
        "url": "/texts/emerald-tablet.html"
      }
    ],
    "concepts": [
      {
        "id": "lunar-mansions",
        "name": "Lunar Mansions",
        "type": "concept",
        "mythology": "arabic",
        "icon": "🌙",
        "url": "/concepts/lunar-mansions.html"
      },
      {
        "id": "planetary-hours",
        "name": "Planetary Hours",
        "type": "concept",
        "mythology": "astrological",
        "icon": "⏰",
        "url": "/concepts/planetary-hours.html"
      },
      {
        "id": "talismans",
        "name": "Talismans",
        "type": "concept",
        "mythology": "universal",
        "icon": "🔮",
        "url": "/concepts/talismans.html"
      }
    ]
  },
  "sources": [
    {
      "text": "Picatrix: A Medieval Treatise on Astral Magic",
      "author": "Dan Attrell and David Porreca (translators)",
      "mythology": "islamic",
      "date": "2011",
      "type": "primary-translation"
    },
    {
      "text": "The Picatrix: Liber Atratus Edition",
      "author": "John Michael Greer and Christopher Warnock (editors)",
      "mythology": "islamic",
      "date": "2011",
      "type": "annotated-edition"
    },
    {
      "text": "Picatrix (Ghâyat al-Hakîm): The Goal of the Wise",
      "author": "Hashem Atallah and Gerhard Endress",
      "mythology": "islamic",
      "date": "1933/2002",
      "type": "partial-translation"
    },
    {
      "text": "Astral Magic in Babylonia",
      "author": "Erica Reiner",
      "mythology": "mesopotamian",
      "date": "1995",
      "type": "comparative-scholarship"
    },
    {
      "text": "The Arabic Hermes: From Pagan Sage to Prophet of Science",
      "author": "Kevin van Bladel",
      "mythology": "islamic",
      "date": "2009",
      "type": "modern-scholarship"
    },
    {
      "text": "Picatrix: Between Magic and Natural Philosophy in Al-Andalus",
      "author": "Antonella Sannino (editor)",
      "mythology": "islamic",
      "date": "2011",
      "type": "modern-scholarship"
    },
    {
      "text": "The Warburg Institute Archive: Picatrix Studies",
      "author": "Frances Yates, Fritz Saxl, et al.",
      "mythology": "renaissance",
      "date": "1930s-1980s",
      "type": "modern-scholarship"
    },
    {
      "text": "Practical Planetary Magick: Working the Magick of the Classical Planets in the Western Esoteric Tradition",
      "author": "David Rankine and Sorita d'Este",
      "mythology": "modern-practical",
      "date": "2007",
      "type": "modern-practice"
    }
  ],
  "linguistic": {
    "originalName": "غاية الحكيم (Ghāyat al-Ḥakīm)",
    "originalScript": "arabic",
    "transliteration": "Ghāyat al-Ḥakīm",
    "pronunciation": "/pɪˈkeɪtrɪks/ (Latin); /ɣaːjat alħakiːm/ (Arabic)",
    "etymology": {
      "rootLanguage": "Arabic (original); Latin (translation)",
      "meaning": "Ghāyat al-Ḥakīm = 'The Aim/Goal of the Sage/Wise One' in Arabic; Picatrix etymology uncertain, possibly corruption of Buqratis (Hippocrates), Baqrāṭīs, or other Arabic name",
      "derivation": "Arabic title describes content; Latin title possibly scribal error or deliberate obscuration"
    },
    "cognates": [
      {
        "language": "Arabic",
        "term": "غاية الحكيم",
        "script": "Ghāyat al-Ḥakīm"
      },
      {
        "language": "Latin",
        "term": "Picatrix",
        "script": "Picatrix"
      },
      {
        "language": "Spanish",
        "term": "Picatrix",
        "script": "Picatrix (El Fin del Sabio)"
      }
    ],
    "languageCode": "ar"
  },
  "geographical": {
    "region": "Al-Andalus (Islamic Spain) or Middle East (composition); Spain (translation)",
    "culturalArea": "Islamic world; later Medieval Christian Europe",
    "originPoint": {
      "name": "Possibly Cordoba, Al-Andalus (modern Spain)",
      "coordinates": {
        "latitude": 37.8882,
        "longitude": -4.7794,
        "accuracy": "city-estimate"
      }
    },
    "modernCountries": [
      "Spain (composition and translation)",
      "Islamic world (Arabic tradition)",
      "Italy (Renaissance influence)",
      "Global (modern practice)"
    ]
  },
  "temporal": {
    "timelinePosition": "Islamic Golden Age (composition); High Middle Ages (translation); ongoing influence",
    "culturalPeriod": "c. 1000 CE (Arabic); 1256 CE (Latin); to present",
    "firstAttestation": {
      "date": {
        "year": 1000,
        "circa": true,
        "uncertainty": 50,
        "display": "c. 1000 CE",
        "confidence": "probable"
      },
      "source": "Arabic composition attributed to al-Majriti era",
      "type": "textual-dating"
    },
    "historicalDate": {
      "arabic": {
        "year": 1000,
        "circa": true,
        "display": "c. 1000 CE"
      },
      "latin": {
        "year": 1256,
        "circa": false,
        "display": "1256 CE"
      },
      "influence": {
        "start": {
          "year": 1000,
          "circa": true,
          "display": "c. 1000 CE"
        },
        "end": {
          "year": 2025,
          "circa": false,
          "display": "Present"
        },
        "display": "c. 1000 CE - Present"
      }
    }
  }
}
