{
  "id": "reiki",
  "type": "magic",
  "name": "Reiki",
  "icon": "✋",
  "slug": "reiki",
  "mythologies": [
    "japanese",
    "universal"
  ],
  "primaryMythology": "japanese",
  "shortDescription": "Japanese energy healing technique where practitioner channels universal life force energy (ki/qi) through their hands to activate natural healing processes; founded by Mikao Usui in 1922 after spiritual experience on Mount Kurama; transmitted through attunement rather than training alone",
  "fullDescription": "Reiki is a Japanese healing technique based on the principle that a practitioner can channel universal life force energy (ki/qi) through their hands to activate the natural healing processes of a recipient's body and restore physical and emotional well-being. The practice was developed by Mikao Usui (臼井甕男) in early 20th century Japan and has since spread worldwide as one of the most popular complementary healing modalities. The word Reiki is composed of two Japanese kanji: 'rei' (霊) meaning 'spirit' or 'sacred,' and 'ki' (気) meaning 'energy' or 'life force' (equivalent to Chinese 'qi' or Indian 'prana'). Thus Reiki translates as 'spiritual energy,' 'universal life force,' or 'sacred energy.' Unlike some energy healing systems, Reiki does not require the practitioner to use their own energy; instead, they serve as a channel or conduit for universal healing energy. After receiving attunement (initiation) from a Reiki Master, practitioners gain the permanent ability to channel Reiki. The system includes three degrees of training, sacred symbols, hand positions for treatment, distance healing techniques, and ethical principles (the Five Reiki Precepts). Reiki is practiced in hospitals, hospices, and wellness centers globally for stress reduction, pain management, emotional healing, and spiritual development.",
  "category": "energy-work",
  "subCategory": "hands-on-healing",
  "practiceType": "energy-channeling",
  "method": "laying-on-of-hands",
  "colors": {
    "primary": "#F59E0B",
    "secondary": "#FCD34D",
    "primaryRgb": "245, 158, 11"
  },
  "tags": [
    "reiki",
    "energy-healing",
    "hands-on-healing",
    "ki",
    "japanese",
    "universal-life-force",
    "mikao-usui",
    "attunement",
    "distance-healing",
    "chakra-balancing",
    "complementary-medicine"
  ],
  "requirements": {
    "location": {
      "id": "comfortable-healing-space",
      "name": "Comfortable Healing Space",
      "type": "place",
      "description": "Quiet, peaceful environment conducive to relaxation; massage table or comfortable chair/bed for recipient"
    },
    "timing": "Any time suitable; consistent self-treatment and regular practice recommended",
    "practitioner": "Must receive attunement from qualified Reiki Master; Level 1 for basic hands-on healing, Level 2 for distance healing and symbols, Level 3/Master for advanced work and teaching",
    "preparation": "Attunement to Reiki energy from Master; study of hand positions, symbols (Level 2+), and Reiki principles; setting intention to be clear channel; brief meditation before sessions",
    "items": [
      {
        "id": "massage-table",
        "name": "Massage Table or Comfortable Surface",
        "description": "For recipient to lie down during full treatment"
      },
      {
        "id": "blanket-pillow",
        "name": "Blanket and Pillows",
        "description": "For recipient's comfort and warmth during treatment"
      },
      {
        "id": "calm-music",
        "name": "Soft Music (optional)",
        "description": "Gentle background music to enhance relaxation"
      },
      {
        "id": "candles-incense",
        "name": "Candles or Incense (optional)",
        "description": "To create sacred healing atmosphere"
      }
    ]
  },
  "steps": [
    {
      "order": 1,
      "action": "Receive Reiki Attunement",
      "description": "Essential first step: receive attunement from qualified Reiki Master. During this sacred ceremony, Master opens and aligns student's energy channels to receive and transmit Reiki. This permanent connection cannot be lost and is what distinguishes Reiki from other healing methods. Level 1 for hands-on healing, Level 2 for symbols and distance healing, Level 3/Master for advanced practice and teaching ability."
    },
    {
      "order": 2,
      "action": "Practice the Five Reiki Principles (Gokai)",
      "description": "Recite daily, traditionally morning and evening with hands in gassho (prayer position): Just for today: Do not anger, Do not worry, Be grateful, Work diligently, Be kind to others. These ethical precepts form the spiritual foundation of Reiki practice."
    },
    {
      "order": 3,
      "action": "Establish Daily Self-Treatment Practice",
      "description": "Perform self-Reiki daily for 20-60 minutes. Lie down comfortably, place hands in standard positions covering head, front body, back body. This maintains your own energy balance and deepens your connection to Reiki. 21-day self-treatment especially important after attunement."
    },
    {
      "order": 4,
      "action": "Prepare for Giving Reiki to Others",
      "description": "Before treatment: 1) Set intention to be clear channel, 2) Gassho meditation (hands together at heart, brief centering), 3) Invoke Reiki to flow through you, 4) Self-cleanse using Cho Ku Rei symbol (Level 2) or dry bathing technique, 5) Ground and center in your heart."
    },
    {
      "order": 5,
      "action": "Position Recipient and Obtain Consent",
      "description": "Have recipient lie face-up on massage table, remove shoes, loosen restrictive clothing. Always ask permission before touching. Explain what they may experience (warmth, tingling, deep relaxation, emotional release). Recipient remains fully clothed."
    },
    {
      "order": 6,
      "action": "Begin with Scanning or Reiji-Ho",
      "description": "Option 1: Scan energy field with hands 2-6 inches above body, sensing heat, cold, tingling, or density indicating areas needing attention. Option 2: Reiji-ho (traditional Japanese technique): hands in gassho, ask Reiki to guide hands to where healing is needed, trust intuitive guidance."
    },
    {
      "order": 7,
      "action": "Perform Standard Head Positions",
      "description": "Place hands gently on or slightly above: 1) Eyes/forehead (third eye and root chakras), 2) Temples (brain balance), 3) Back of head (occipital), 4) Throat (thyroid, throat chakra). Hold each position 3-5 minutes or until energy shift felt. Hands remain still, allowing Reiki to flow."
    },
    {
      "order": 8,
      "action": "Treat Front of Body",
      "description": "Continue with positions on: 5) Upper chest (heart/thymus), 6) Solar plexus, 7) Lower abdomen (sacral chakra), 8) V-shape on pelvis (root chakra), 9) Knees, 10) Ankles/feet (grounding). Each position 3-5 minutes. Maintain professional boundaries; use hover technique for sensitive areas."
    },
    {
      "order": 9,
      "action": "Treat Back of Body (if time permits)",
      "description": "Ask recipient to turn over. Treat: 11) Shoulders, 12) Upper back (heart from back), 13) Mid-back (solar plexus), 14) Lower back/sacrum (kidneys, sacral), 15) Back of knees, 16) Soles of feet. Full treatment typically 60-90 minutes total."
    },
    {
      "order": 10,
      "action": "Use Reiki Symbols for Enhanced Healing (Level 2+)",
      "description": "For Level 2 practitioners: Draw or visualize symbols over body or in palms: Cho Ku Rei (power, amplifies energy), Sei He Ki (mental/emotional healing), Hon Sha Ze Sho Nen (distance healing, past/future work). For Level 3: Dai Ko Myo (master symbol for soul-level healing). Symbols focus and direct Reiki for specific purposes."
    },
    {
      "order": 11,
      "action": "Practice Distance Healing (Level 2+)",
      "description": "For absent recipients, use Hon Sha Ze Sho Nen (distance symbol). Methods: 1) Hold photo/name, draw symbol, send Reiki 15-30 min; 2) Use proxy (pillow/teddy bear) representing recipient; 3) Visualize person and treat visualization. Always send with permission or 'for highest good.' Time and space are transcended."
    },
    {
      "order": 12,
      "action": "Close Treatment and Ground",
      "description": "After treatment: 1) Smooth aura with sweeping motion, 2) Ground recipient (place hands on feet briefly), 3) Give thanks for Reiki, 4) Recipient rests a few minutes before rising, 5) Offer water, 6) Discuss experience if appropriate. Practitioner: wash hands energetically, ground own energy, maintain detachment from outcomes. Journal session."
    }
  ],
  "effects": "Reiki produces deep relaxation and activates the body's natural healing responses. Recipients commonly experience: warmth or tingling under practitioner's hands, deep peace and relaxation, emotional release (tears, laughter), pain reduction, accelerated healing of injuries, improved sleep, reduced anxiety and stress, enhanced clarity and well-being. Long-term effects include: stronger immune function, emotional balance, spiritual connection, greater self-awareness, release of trauma patterns. Practitioners gain: permanent ability to channel healing energy, heightened intuition, enhanced spiritual development, deeper meditation, sense of purpose through service. Reiki works holistically, addressing physical, emotional, mental, and spiritual dimensions simultaneously. Benefits accumulate with regular treatment. Research shows Reiki reduces pain, anxiety, and fatigue in clinical settings, though mechanism remains under investigation. Reiki cannot cause harm—energy automatically adjusts to recipient's needs and highest good.",
  "warnings": "Reiki is complementary therapy, NOT substitute for medical care. Never diagnose, prescribe, or make medical claims unless licensed healthcare provider. Always refer serious conditions to qualified medical professionals. Obtain informed consent before treatment; never treat someone without permission (except in emergencies with good intention). Maintain appropriate professional and personal boundaries—no sexual contact or inappropriate touching. Respect client privacy and confidentiality. Practice self-care through regular self-Reiki; cannot pour from empty cup. Release attachment to outcomes—Reiki goes where needed, not necessarily where practitioner thinks best. Some recipients experience detoxification or temporary intensification of symptoms (healing crisis) as body purges toxins and trauma—this is usually temporary. Emotional releases (crying, anger) may occur during treatment—hold compassionate space, allow process. Pregnant women should receive Reiki only from experienced practitioners aware of pregnancy considerations. Those with pacemakers or electronic implants should inform practitioner (though Reiki generally safe, some debate exists). Cultural sensitivity: honor Japanese origins; Reiki is spiritual practice, not mere technique. Continue learning; Reiki practice evolves throughout lifetime. Avoid commercial exploitation or charging excessive fees. Traditional suggestion: exchange energy (payment, barter, service) to honor sacred exchange, but never let money prevent giving Reiki to those in need.",
  "mythologyContexts": [
    {
      "mythology": "japanese",
      "usage": "Reiki originates from Mikao Usui's spiritual experience on Mount Kurama (sacred mountain near Kyoto) in 1922. After 21 days of fasting, meditation, and prayer seeking enlightenment and healing ability, Usui experienced a powerful spiritual awakening and received the knowledge and capacity to heal through touch. He founded Usui Reiki Ryoho (Usui Spiritual Energy Healing Method) and began healing and teaching in Tokyo. The practice synthesizes elements of Japanese Buddhism, Shintoism, martial arts energy cultivation (ki), and traditional healing. Original Japanese Reiki emphasizes intuitive treatment guided by byosen (energy sensing) rather than fixed hand positions, uses Reiju (spiritual blessing) rather than Western 'attunement,' and focuses on spiritual development (satori/enlightenment) as much as healing ability.",
      "associatedDeities": [],
      "mythicalOrigins": "Mount Kurama is considered spiritually powerful in Japanese tradition. Usui's experience there connects Reiki to Japan's sacred geography and spiritual heritage. The exact nature of his revelation remains somewhat mysterious—he discovered or remembered the Reiki symbols and method to pass the ability to others through attunement.",
      "textReferences": [
        {
          "text": "The Original Reiki Handbook of Dr. Mikao Usui",
          "author": "Mikao Usui (translated by Christine M. Grimm)",
          "passage": "Complete manual",
          "context": "Usui's original teaching materials translated from Japanese",
          "corpusUrl": "/corpus-search.html?term=usui+original+handbook"
        },
        {
          "text": "The Hayashi Reiki Manual",
          "author": "Chujiro Hayashi (translated by Frank Arjava Petter)",
          "passage": "Complete manual",
          "context": "Systematic Reiki techniques from Usui's student Hayashi",
          "corpusUrl": "/corpus-search.html?term=hayashi+reiki+manual"
        },
        {
          "text": "Reiki Fire: New Information about the Origins of Reiki",
          "author": "Frank Arjava Petter",
          "passage": "Complete work",
          "context": "Historical research into Reiki's Japanese origins",
          "corpusUrl": "/corpus-search.html?term=petter+reiki+fire"
        }
      ],
      "symbolism": "The four traditional symbols (five with master symbol) are considered sacred and were traditionally kept secret. They function as keys unlocking specific frequencies or qualities of universal energy. Rei (spirit/sacred) represents universal consciousness; Ki (energy) represents individual life force. Reiki practice unites individual with universal, human with divine.",
      "culturalSignificance": "Reiki spread from Japan to Hawaii (via Hawayo Takata, 1937) and throughout the West (1970s-80s). Western Reiki evolved somewhat differently from Japanese traditions, becoming more systematized with fixed hand positions and emphasis on chakras. Modern Reiki bridging Japanese and Western approaches honors both lineages. Today Reiki is offered in many hospitals and healthcare settings, demonstrating integration of Eastern energy medicine into Western medical paradigm."
    }
  ],
  "relatedEntities": {
    "practices": [
      {
        "id": "qigong",
        "name": "Qigong",
        "type": "magic",
        "mythology": "chinese",
        "icon": "☯",
        "url": "/magic/energy/qigong.html"
      },
      {
        "id": "chakra-work",
        "name": "Chakra Work",
        "type": "magic",
        "mythology": "hindu",
        "icon": "🌈",
        "url": "/magic/energy/chakra-work.html"
      },
      {
        "id": "breathwork",
        "name": "Pranayama",
        "type": "magic",
        "mythology": "hindu",
        "icon": "🌬️",
        "url": "/magic/energy/breathwork.html"
      },
      {
        "id": "therapeutic-touch",
        "name": "Therapeutic Touch",
        "type": "magic",
        "mythology": "modern-western",
        "icon": "✋",
        "url": "/magic/energy/therapeutic-touch.html"
      }
    ],
    "concepts": [
      {
        "id": "ki-life-force",
        "name": "Ki (Life Force)",
        "type": "concept",
        "mythology": "japanese",
        "icon": "⚡",
        "url": "/concepts/ki.html"
      },
      {
        "id": "universal-energy",
        "name": "Universal Life Energy",
        "type": "concept",
        "mythology": "universal",
        "icon": "✨",
        "url": "/concepts/universal-energy.html"
      },
      {
        "id": "energy-healing",
        "name": "Energy Healing",
        "type": "concept",
        "mythology": "universal",
        "icon": "💫",
        "url": "/concepts/energy-healing.html"
      }
    ]
  },
  "archetypes": [
    {
      "category": "healer-archetype",
      "score": 95,
      "strength": "strong",
      "analysis": "Reiki embodies the universal Healer archetype—the wounded healer who channels divine healing power to restore wholeness. The practitioner serves as compassionate vessel for universal love and healing energy."
    },
    {
      "category": "laying-on-of-hands",
      "score": 92,
      "strength": "strong",
      "analysis": "Hands-on healing appears across all cultures and traditions—from Jesus's healings to shamanic practices to royal touch. Reiki participates in this ancient human gesture of healing through sacred touch."
    },
    {
      "category": "initiation-transmission",
      "score": 88,
      "strength": "strong",
      "analysis": "The attunement process reflects universal initiatory patterns—transmission of spiritual power from teacher to student, permanent transformation of consciousness, entrance into sacred lineage connecting back to founder and source."
    }
  ],
  "sources": [
    {
      "text": "Essential Reiki: A Complete Guide to an Ancient Healing Art",
      "author": "Diane Stein",
      "mythology": "modern-western",
      "date": "1995",
      "type": "modern-teaching"
    },
    {
      "text": "The Reiki Manual: A Training Guide",
      "author": "Penelope Quest & Kathy Roberts",
      "mythology": "modern-western",
      "date": "2009",
      "type": "modern-teaching"
    },
    {
      "text": "The Original Reiki Handbook of Dr. Mikao Usui",
      "author": "Mikao Usui (translated)",
      "mythology": "japanese",
      "date": "1999 (translation)",
      "type": "primary-source"
    },
    {
      "text": "The Reiki Sourcebook",
      "author": "Bronwen & Frans Stiene",
      "mythology": "research",
      "date": "2003",
      "type": "modern-scholarship"
    },
    {
      "text": "Reiki for Life: The Complete Guide",
      "author": "Penelope Quest",
      "mythology": "modern-western",
      "date": "2002",
      "type": "modern-teaching"
    },
    {
      "text": "Light on the Origins of Reiki",
      "author": "Tadao Yamaguchi",
      "mythology": "japanese",
      "date": "2007",
      "type": "traditional-teaching"
    }
  ],
  "linguistic": {
    "originalName": "靈氣",
    "originalScript": "japanese-kanji",
    "transliteration": "reiki",
    "pronunciation": "/ˈreɪki/",
    "etymology": {
      "rootLanguage": "Japanese",
      "meaning": "Spiritual energy, sacred life force",
      "derivation": "From 'rei' (霊 = spirit/sacred) + 'ki' (気 = energy/life force)"
    },
    "cognates": [
      {
        "language": "Chinese",
        "term": "靈氣",
        "script": "língqì",
        "meaning": "Spiritual energy"
      },
      {
        "language": "Sanskrit",
        "term": "प्राण",
        "script": "prāṇa",
        "meaning": "Life force (cognate concept)"
      },
      {
        "language": "Chinese",
        "term": "氣",
        "script": "qì",
        "meaning": "Life energy (cognate: ki derives from qi)"
      }
    ],
    "languageCode": "ja"
  },
  "geographical": {
    "region": "Japan",
    "culturalArea": "East Asia; global spread",
    "originPoint": {
      "name": "Mount Kurama, Kyoto, Japan",
      "coordinates": {
        "latitude": 35.1211,
        "longitude": 135.7684,
        "accuracy": "specific"
      }
    },
    "modernCountries": [
      "Japan (origin)",
      "United States (major development via Takata)",
      "Global (practiced worldwide)"
    ]
  },
  "temporal": {
    "timelinePosition": "Modern (20th century)",
    "culturalPeriod": "1922 to present",
    "firstAttestation": {
      "date": {
        "year": 1922,
        "circa": false,
        "uncertainty": 0,
        "display": "1922",
        "confidence": "certain"
      },
      "source": "Mikao Usui's spiritual experience on Mount Kurama",
      "type": "foundational-event"
    },
    "historicalDate": {
      "start": {
        "year": 1922,
        "circa": false,
        "display": "1922"
      },
      "end": {
        "year": 2025,
        "circa": false,
        "display": "Present"
      },
      "display": "1922 - Present"
    }
  }
}
