{
  "id": "shroud-of-turin",
  "migratedFrom": "legacy-repository",
  "createdBy": [],
  "symbolism": "For believers, the Shroud represents tangible evidence of the Resurrection. The image's formation\n                    is thought to have occurred at the moment of Christ's rising, an imprint left by divine energy.\n                    The Shroud serves as what Pope John Paul II called \"a mirror of the Gospel,\" reflecting the\n                    Passion narrative in physical form.\n                \n                \n                    The Catholic Church maintains an officially neutral position on the Shroud's authenticity,\n                    permitting its veneration as an icon regardless of its origin. Public exhibitions draw millions\n                    of pilgrims, with the most recent display in 2015 attracting over two million visitors.",
  "_enhanced": true,
  "extendedContent": [
    {
      "title": "Description and Physical Characteristics",
      "content": "The Shroud of Turin is a length of linen cloth bearing the faint image of a crucified man, believed\n                    by millions to be Jesus Christ himself. The image displays anatomically correct details of a man\n                    who suffered wounds consistent with the Gospel accounts of Christ's crucifixion, including marks\n                    from scourging, a crown of thorns, and wounds in the wrists and feet.\n                \n                \n                    What makes the Shroud extraordinary is the nature of the image itself. Unlike a painting, the image\n                    appears as a photographic negative, a property not discovered until the first photographs were taken\n                    in 1898. The image does not penetrate the cloth and appears to be formed by a subtle degradation of\n                    the linen fibers themselves. No pigments, dyes, or stains fully account for the image's formation."
    },
    {
      "content": "Biblical Connection\n                \n                    The Gospels describe Joseph of Arimathea wrapping Jesus's body in clean linen before placing it\n                    in the tomb. The Gospel of John specifically mentions the burial cloths being found in the empty\n                    tomb. Whether the Shroud of Turin is this burial cloth remains one of the most debated questions\n                    in religious scholarship.\n                \n\n                The Image of Edessa Connection\n                \n                    Some scholars identify the Shroud with the Mandylion or Image of Edessa, a holy relic venerated\n                    in the early church. According to tradition, this was a cloth bearing Christ's facial image,\n                    possibly the same cloth folded to display only the face. The Mandylion was kept in Edessa (modern\n                    Turkey) until 944 CE, when it was transferred to Constantinople.\n                \n\n                Medieval Documentation\n                \n                    The Shroud's documented history begins in 1354, when French knight Geoffrey de Charny displayed\n                    it at a church in Lirey, France. Questions about its authenticity arose immediately, with the\n                    local bishop claiming it was a painted forgery. Despite controversy, the Shroud attracted\n                    enormous numbers of pilgrims.\n                \n                \n                    In 1453, the Shroud passed to the House of Savoy, who built the Royal Chapel of the Holy Shroud\n                    in Turin specifically to house it. It survived a fire in 1532 that left scorch marks and water\n                    stains now visible on the cloth.",
      "title": "Historical Journey and Provenance"
    },
    {
      "content": "The 1988 Carbon Dating\n                \n                    In 1988, carbon-14 dating conducted by three independent laboratories dated the Shroud to\n                    1260-1390 CE, seemingly proving medieval origin. This dating has been challenged by numerous\n                    researchers who point to potential contamination, the effects of the 1532 fire, and questions\n                    about sample location.\n                \n\n                STURP Investigation\n                \n                    The Shroud of Turin Research Project (STURP) conducted extensive testing in 1978. Their findings\n                    concluded that the image is not a painting, that real blood is present, and that no known\n                    artistic or natural process can explain the image's formation. The mystery remains scientifically\n                    unresolved.\n                \n\n                Ongoing Research\n                \n                    Modern research continues to reveal intriguing details: pollen from Palestinian plants, traces\n                    of first-century coins over the eyes, and evidence of a violent death. Whether these support\n                    authenticity or can be explained otherwise remains actively debated.",
      "title": "Scientific Investigation and Controversy"
    },
    {
      "content": "For believers, the Shroud represents tangible evidence of the Resurrection. The image's formation\n                    is thought to have occurred at the moment of Christ's rising, an imprint left by divine energy.\n                    The Shroud serves as what Pope John Paul II called \"a mirror of the Gospel,\" reflecting the\n                    Passion narrative in physical form.\n                \n                \n                    The Catholic Church maintains an officially neutral position on the Shroud's authenticity,\n                    permitting its veneration as an icon regardless of its origin. Public exhibitions draw millions\n                    of pilgrims, with the most recent display in 2015 attracting over two million visitors.",
      "title": "Spiritual Significance and Veneration"
    }
  ],
  "searchTerms": [
    "shroud of turin",
    "shroud-of-turin",
    "christian",
    "catholic",
    "burial relic",
    "miraculous image",
    "relic"
  ],
  "tags": [
    "christian",
    "catholic",
    "burial relic",
    "miraculous image",
    "relic",
    "shroud-of-turin"
  ],
  "itemType": "artifact",
  "wielders": [],
  "type": "item",
  "colors": null,
  "cultural": null,
  "subtype": "sacred-object",
  "longDescription": "The Holy Burial Cloth Bearing Christ's Miraculous Image The Shroud of Turin is a length of linen cloth bearing the faint image of a crucified man, believed\n                    by millions to be Jesus Christ himself. The image displays anatomically correct details of a man\n                    who suffered wounds consistent with the Gospel accounts of Christ's crucifixion, including marks\n                    from scourging, a crown of thorns, and wounds in the wrists and feet.",
  "slug": "shroud-of-turin",
  "icon": "⚔️",
  "name": "Shroud of Turin",
  "relatedEntities": null,
  "geographical": null,
  "linguistic": null,
  "mythologyContexts": [],
  "migrationDate": "2025-12-13T10:16:35.925Z",
  "powers": [],
  "visibility": "public",
  "mediaReferences": {
    "images": [],
    "diagrams": []
  },
  "shortDescription": "The Holy Burial Cloth Bearing Christ's Miraculous Image",
  "_uploadedAt": "2025-12-25T15:46:34.134328",
  "sources": [],
  "temporal": null,
  "status": "published",
  "primaryMythology": "christian",
  "metaphysicalProperties": null,
  "mythologies": [
    "christian",
    "miraculous image",
    "burial relic"
  ],
  "materials": [
    "Linen with herringbone weave"
  ]
}