{
  "id": "totsuka-no-tsurugi",
  "itemType": "weapon",
  "icon": "⚔️",
  "createdBy": [],
  "materials": [],
  "migrationDate": "2025-12-13T10:16:36.076Z",
  "longDescription": "The Sword of Ten Hand-Breadths - Slayer of Serpents and Fire Totsuka-no-Tsurugi (Japanese: \"Sword of Ten Hand-Breadths\" or \"Ten-Span Sword\")\n                    is a class of divine swords in Japanese Shinto mythology, with several legendary\n                    blades bearing this designation. The name describes not a single weapon but a\n                    type - a sword whose blade measures ten fists (approximately 75-80 centimeters)\n                    in length. These swords appear at crucial moments in Japanese mythology, wielded\n                    by the most powerful deities to accomplish deeds that shaped the cosmic order.",
  "searchTerms": [
    "totsuka-no-tsurugi",
    "japanese",
    "shinto",
    "kojiki",
    "divine weapon",
    "weapon"
  ],
  "tags": [
    "japanese",
    "shinto",
    "kojiki",
    "divine weapon",
    "weapon",
    "totsuka-no-tsurugi"
  ],
  "subtype": "divine-weapon",
  "status": "published",
  "mythologies": [
    "divine weapon",
    "shinto",
    "kojiki"
  ],
  "colors": null,
  "mediaReferences": {
    "images": [],
    "diagrams": []
  },
  "metaphysicalProperties": null,
  "mythologyContexts": [],
  "temporal": null,
  "type": "item",
  "_enhanced": true,
  "shortDescription": "The Sword of Ten Hand-Breadths - Slayer of Serpents and Fire",
  "geographical": null,
  "wielders": [
    "Izanagi, Susanoo"
  ],
  "symbolism": "Divine Justice\n                \n                    The Totsuka-no-Tsurugi represents the power of the kami to enforce cosmic order.\n                    Both Izanagi's slaying of Kagutsuchi and Susanoo's defeat of the Orochi demonstrate\n                    that even divine beings are subject to consequences for disrupting the proper\n                    order of things.\n                \n\n                Monster-Slaying\n                \n                    As a serpent-slaying sword, the Totsuka-no-Tsurugi connects to a worldwide\n                    pattern of dragon/serpent-slaying myths. Susanoo's victory over the Orochi\n                    parallels stories like St. George and the Dragon, Siegfried and Fafnir, and\n                    Indra's defeat of Vritra.\n                \n\n                Imperial Authority\n                \n                    The discovery of Kusanagi within the Orochi's body, found using a Totsuka-no-Tsurugi,\n                    links these divine swords to the foundation of Japanese imperial authority. The\n                    sword of divine justice literally produces the sword of imperial sovereignty.",
  "relatedEntities": null,
  "linguistic": null,
  "primaryMythology": "divine weapon",
  "powers": [],
  "extendedContent": [
    {
      "content": "Totsuka-no-Tsurugi (Japanese: \"Sword of Ten Hand-Breadths\" or \"Ten-Span Sword\")\n                    is a class of divine swords in Japanese Shinto mythology, with several legendary\n                    blades bearing this designation. The name describes not a single weapon but a\n                    type - a sword whose blade measures ten fists (approximately 75-80 centimeters)\n                    in length. These swords appear at crucial moments in Japanese mythology, wielded\n                    by the most powerful deities to accomplish deeds that shaped the cosmic order.\n                \n                \n                    The most famous Totsuka-no-Tsurugi is the Ama-no-Habakiri (\"Slash of Heavenly\n                    Wings\" or \"Heaven's Tail-Feathers-Cutter\"), the sword used by Susanoo to slay\n                    the eight-headed serpent Yamata no Orochi. Another is the Ama-no-Ohabari\n                    (\"Divine Blade of Heaven\"), used by Izanagi to kill the fire god Kagutsuchi.\n                \n                \n                    These divine swords represent the power of the kami to impose order upon chaos,\n                    to slay monsters and rebellious spirits, and to establish the sacred authority\n                    of the heavenly lineage.",
      "title": "Description and Nature"
    },
    {
      "content": "The first major mythological use of a Totsuka-no-Tsurugi occurs in the tragic\n                    story of Izanami's death. The creator goddess, wife of Izanagi, died giving\n                    birth to Kagutsuchi, the god of fire. The flames of his birth burned her fatally,\n                    and she descended to Yomi, the land of the dead.\n                \n                \n                    In his grief and rage, Izanagi drew his Totsuka-no-Tsurugi (called Ama-no-Ohabari\n                    in some versions) and struck down his own son. With three strokes, he cut\n                    Kagutsuchi into pieces. From the god's body and blood sprang numerous new kami,\n                    including gods of thunder, mountains, and various aspects of fire itself.\n                \n                \n                    This act demonstrates the creative-destructive nature of divine violence in\n                    Shinto mythology. Even the murder of a god by his father leads to new creation -\n                    the universe continues to expand and differentiate through such sacred violence.",
      "title": "The Slaying of Kagutsuchi"
    },
    {
      "content": "The most famous story involving a Totsuka-no-Tsurugi is Susanoo's battle with\n                    Yamata no Orochi, the eight-headed, eight-tailed serpent that terrorized the\n                    land of Izumo. This myth contains one of Japanese mythology's most beloved\n                    heroic narratives.\n                \n\n                The Setup\n                \n                    After being expelled from heaven for his tempestuous behavior, Susanoo descended\n                    to the mortal realm. There he encountered an elderly couple weeping beside a\n                    beautiful young woman, Kushinadahime. They explained that each year for seven\n                    years, the Orochi had come to devour one of their eight daughters. Kushinadahime\n                    was the last, and the serpent was coming for her.\n                \n\n                The Battle\n                \n                    Susanoo devised a plan. He had the couple prepare eight vats of sake (rice wine)\n                    and a fence with eight gates. When the Orochi arrived, it found the sake and\n                    drank greedily from each vat with each of its eight heads. Drunk and stupefied,\n                    the serpent was helpless when Susanoo attacked.\n                \n                \n                    With his Totsuka-no-Tsurugi (the Ama-no-Habakiri), Susanoo cut the serpent to\n                    pieces. As he carved through one of the tails, his blade struck something hard\n                    and chipped. Cutting open the tail, he discovered another sword - the legendary\n                    Kusanagi (Grass-Cutting Sword), which would become one of the Three Imperial\n                    Regalia of Japan.",
      "title": "The Slaying of Yamata no Orochi"
    },
    {
      "content": "Divine Justice\n                \n                    The Totsuka-no-Tsurugi represents the power of the kami to enforce cosmic order.\n                    Both Izanagi's slaying of Kagutsuchi and Susanoo's defeat of the Orochi demonstrate\n                    that even divine beings are subject to consequences for disrupting the proper\n                    order of things.\n                \n\n                Monster-Slaying\n                \n                    As a serpent-slaying sword, the Totsuka-no-Tsurugi connects to a worldwide\n                    pattern of dragon/serpent-slaying myths. Susanoo's victory over the Orochi\n                    parallels stories like St. George and the Dragon, Siegfried and Fafnir, and\n                    Indra's defeat of Vritra.\n                \n\n                Imperial Authority\n                \n                    The discovery of Kusanagi within the Orochi's body, found using a Totsuka-no-Tsurugi,\n                    links these divine swords to the foundation of Japanese imperial authority. The\n                    sword of divine justice literally produces the sword of imperial sovereignty.",
      "title": "Symbolism and Significance"
    }
  ],
  "_uploadedAt": "2025-12-25T15:46:34.160668",
  "visibility": "public",
  "slug": "totsuka-no-tsurugi",
  "sources": [],
  "cultural": null,
  "migratedFrom": "legacy-repository",
  "name": "Totsuka-no-Tsurugi",
  "owner": "",
  "significance": "",
  "enhancedBy": "agent8",
  "origin": "",
  "primarySources": [],
  "relatedItems": [],
  "description": "The Sword of Ten Hand-Breadths - Slayer of Serpents and Fire",
  "deities": [
    "susanoo",
    "izanagi",
    "index"
  ],
  "updatedAt": "2025-12-26T05:13:53.647Z"
}