{
  "id": "trishula",
  "itemType": "weapon",
  "extendedContent": [
    {
      "content": "The Trishula (Sanskrit: three-spear) is the legendary trident of Lord Shiva, the\n                    Supreme Being in Shaivism and one of the principal deities of the Hindu Trimurti\n                    (trinity) alongside Brahma the Creator and Vishnu the Preserver. As the weapon of\n                    the Destroyer, the Trishula represents Shiva's power to end cosmic cycles, dissolve\n                    the universe, and transform all existence. It is among the most powerful and\n                    symbolically rich weapons in Hindu mythology.\n                \n                \n                    The Trishula's three prongs carry profound spiritual significance, representing\n                    numerous triadic concepts fundamental to Hindu philosophy. Most commonly, they\n                    symbolize the three gunas (qualities of nature): sattva (creation/purity), rajas\n                    (preservation/activity), and tamas (destruction/darkness). The central prong,\n                    representing Shiva's power to transcend all three gunas, rises above the others,\n                    signifying liberation (moksha) from the cycle of existence.\n                \n                \n                    Unlike weapons forged by craftsmen, even divine ones, the Trishula is often described\n                    as primordial or self-manifested (svayambhu), existing from the beginning of time as\n                    an aspect of Shiva's very nature. Just as Shiva is both destroyer and transformer,\n                    the Trishula is both weapon and symbol, capable of annihilating entire universes while\n                    simultaneously representing the path to spiritual liberation.",
      "title": "Description and Appearance"
    },
    {
      "content": "The Trishula's origin varies across different Puranic (mythological) texts and\n                    sectarian traditions. As with many divine weapons in Hindu mythology, multiple\n                    accounts exist, each emphasizing different aspects of the weapon's nature and the\n                    deity who wields it. These varying accounts reflect the organic development of\n                    Hindu tradition across millennia and regions.\n                \n\n                Primordial Existence\n                \n                    In Shaiva tradition, the Trishula is often described as co-eternal with Shiva himself.\n                    Just as Shiva exists before creation and continues after dissolution, so too does\n                    his weapon. The Trishula is not made but always is, an aspect of Shiva's power\n                    (shakti) given distinct form. When Shiva manifests, the Trishula manifests with him;\n                    when the universe dissolves into Shiva, the Trishula dissolves as well, only to\n                    reappear when creation begins anew.\n                \n                \n                    This understanding emphasizes that the Trishula is not separate from Shiva but an\n                    extension of his essential nature. The weapon is Shiva's will given form, his power\n                    to transform made tangible. In this view, asking where the Trishula came from is\n                    like asking where Shiva came from, the question itself misunderstands the nature\n                    of the eternal divine.\n                \n\n                The Gift from the Devas\n                \n                    Another tradition describes the Trishula as a collective gift from the devas (gods)\n                    to Shiva when the cosmos faced a threat that only he could overcome. According to\n                    this account, each deva contributed a portion of their divine power (tejas), which\n                    combined to form the Trishula. This narrative parallels the creation of other divine\n                    weapons, such as the Sudarshana Chakra given to Vishnu.\n                \n                \n                    In some versions, this gift occurred when Shiva prepared to battle the demon\n                    Tripurasura, who had created three impregnable flying cities that threatened the\n                    cosmos. The combined power of all the gods, channeled through the Trishula, enabled\n                    Shiva to destroy the three cities with a single shot. This legend explains both\n                    the weapon's triple form (matching the three cities) and its incomprehensible power.\n                \n\n                The Churning of the Ocean\n                \n                    The Samudra Manthan (churning of the cosmic ocean) provides another context for\n                    the Trishula's significance. When the devas and asuras (demons) churned the ocean\n                    of milk to obtain the nectar of immortality (amrita), both treasures and terrors\n                    emerged. Among the terrors was Halahala, the deadly poison that threatened to\n                    destroy all existence.\n                \n                \n                    Shiva alone was willing and able to consume this poison, holding it in his throat\n                    (which turned blue, giving him the epithet Neelakantha). Some traditions describe\n                    Shiva using the Trishula to contain and direct the poison's power, transforming\n                    destructive toxicity into controlled divine energy. This demonstrates the Trishula's\n                    role not just in destruction but in transformation and protection.",
      "title": "Origin and Mythological History"
    },
    {
      "title": "Powers and Abilities",
      "content": "The Trishula possesses cosmic-scale powers befitting the weapon of the Supreme\n                    Destroyer. Unlike weapons that merely damage or kill, the Trishula can unmake\n                    reality itself, dissolving the fundamental structures of existence. Yet it is\n                    also a weapon of transformation and liberation, capable of destroying obstacles\n                    to spiritual advancement as easily as it destroys demons or universes."
    },
    {
      "content": "Lord Shiva - The Mahadeva\n                \n                    Shiva (whose name means \"the auspicious one\") is one of the supreme deities of\n                    Hinduism, worshipped by hundreds of millions as the highest god. In Shaivism,\n                    the largest denomination of Hinduism, Shiva is Brahman itself, the ultimate\n                    reality from which all existence emanates and to which all returns. The\n                    Trishula is his most distinctive attribute, identifying him in art and\n                    representing his essential nature.\n                \n                \n                    Shiva's character combines seeming opposites. He is the great ascetic who\n                    meditates for eons on Mount Kailash, yet also the passionate husband of Parvati.\n                    He is the destroyer of the universe, yet also its protector. He appears as a\n                    fearsome figure smeared with ashes from cremation grounds, yet also as the\n                    beautiful youth Sundareshwara. The Trishula symbolizes his ability to embody\n                    and transcend all dualities.\n                \n                \n                    In his aspect as Nataraja (Lord of the Dance), Shiva performs the Tandava,\n                    the cosmic dance of creation and destruction. Though the Trishula is not always\n                    depicted in Nataraja images (which typically show Shiva with drum and fire),\n                    the weapon's power is implicit in the dance itself. Every step of the Tandava\n                    carries the Trishula's transformative energy.\n                \n\n                Iconographic Traditions\n                \n                    The Trishula appears in virtually every iconographic tradition depicting Shiva:\n                \n                \n                    Standing Shiva: Often holds the Trishula in one of his\n                    hands, typically the upper right, with the prongs pointed upward\n                    Seated Shiva: The Trishula may lean against him or be\n                    held loosely, suggesting power at rest\n                    Bhairava (Fierce Form): The Trishula is actively wielded,\n                    sometimes dripping with the blood of demons\n                    Ardhanarishvara (Half-Male/Half-Female): The Trishula\n                    appears on Shiva's male side, representing active power\n                    Dakshinamurti (Teaching Form): The Trishula may be present\n                    as a symbol of the wisdom that destroys ignorance\n                    Lingam Worship: Trishula symbols often accompany the\n                    abstract lingam form of Shiva worship\n                \n\n                Other Deities Associated with Tridents\n                \n                    While the Trishula is primarily Shiva's weapon, other Hindu and Buddhist\n                    deities carry similar tridents or receive the Trishula on occasion:\n                \n                \n                    Durga: The warrior goddess wields a Trishula given by\n                    Shiva among her many weapons, using it to battle the buffalo demon Mahishasura\n                    Kali: Sometimes depicted with a trident, embodying\n                    Shiva's destructive power in feminine form\n                    Shaktis: Various goddess forms associated with Shiva\n                    may carry tridents representing their connection to his power\n                    Buddhist Wrathful Deities: Figures like Hayagriva and\n                    certain dharmapalas carry tridents derived from the Hindu Trishula\n                    Shaiva Saints: Nayanars and other great devotees are\n                    sometimes depicted holding tridents to show their attainment of Shiva's grace",
      "title": "Associated Deity and Worship"
    },
    {
      "content": "Destruction as Transformation\n                \n                    The Trishula's primary symbolism centers on the nature of destruction in\n                    Hindu philosophy. Unlike Western conceptions that often view destruction\n                    negatively, Hindu thought recognizes destruction as essential to the cosmic\n                    cycle. Without the destruction represented by the Trishula, the universe\n                    would stagnate, unable to renew itself.\n                \n                \n                    Shiva's destruction is never meaningless violence but purposeful transformation.\n                    When the Trishula strikes, it does not merely end but transforms. The demon\n                    destroyed becomes energy returned to the cosmos. The universe dissolved becomes\n                    potential for new creation. Even ignorance destroyed becomes the foundation for\n                    wisdom. The weapon thus represents the necessity and value of endings.\n                \n\n                Transcendence of Duality\n                \n                    The three prongs of the Trishula, with the central one rising above the\n                    others, represent the transcendence of duality. The two side prongs may\n                    symbolize any pair of opposites: male and female, creation and destruction,\n                    pleasure and pain. The central prong represents the state beyond opposites,\n                    the non-dual awareness (advaita) that is Shiva's true nature.\n                \n                \n                    In yogic symbolism, this corresponds to the three nadis. Ida (left) carries\n                    lunar, cooling energy; Pingala (right) carries solar, heating energy. When\n                    these are balanced, kundalini energy rises through Sushumna (central channel),\n                    leading to enlightenment. The Trishula thus becomes a map of spiritual\n                    anatomy and the path to liberation.\n                \n\n                Mastery Over Time\n                \n                    As the prongs represent past, present, and future, the Trishula symbolizes\n                    Shiva's mastery over time itself. While beings are bound by temporal sequence,\n                    experiencing only the present moment, Shiva stands outside time, viewing all\n                    three periods simultaneously. The weapon represents this timeless perspective\n                    and Shiva's power over the flow of causality.\n                \n                \n                    For devotees, meditating on the Trishula can help develop detachment from\n                    the urgencies of temporal existence. If past and future are equally present\n                    to the divine, then the anxieties born of remembering the past and fearing\n                    the future lose their grip. The Trishula offers freedom from time's tyranny.\n                \n\n                Integration of Opposites\n                \n                    While the central prong transcends duality, the two side prongs must also be\n                    understood positively. They represent necessary complementary forces that,\n                    when balanced, support cosmic order. The Trishula does not deny duality but\n                    integrates it, showing how opposites work together under the guidance of the\n                    transcendent center.\n                \n                \n                    This has practical implications for spiritual life. Rather than rejecting\n                    the material world or escaping from embodied existence, the Trishula's\n                    symbolism suggests integrating all aspects of experience. The devotee learns\n                    to see Shiva's presence in both creation and destruction, in both pleasure\n                    and pain, finding the transcendent center within all dualities.\n                \n\n                Protection Through Destruction\n                \n                    Paradoxically, the Trishula protects through its destructive power. By\n                    destroying demons, it protects the cosmos. By destroying ego, it protects\n                    the soul from continued suffering. By destroying attachment, it protects\n                    the devotee from the pain of inevitable loss. The weapon that seems purely\n                    negative serves ultimately positive purposes.\n                \n                \n                    This protective aspect is why devotees invoke the Trishula against\n                    negative forces. The symbol appears on protective amulets, in home\n                    shrines, and wherever Shiva's protection is sought. The great destroyer\n                    is also the great protector, and his weapon serves both functions.",
      "title": "Symbolism and Philosophical Meaning"
    },
    {
      "content": "Contemporary Hindu Practice\n                \n                    The Trishula remains a vital symbol in contemporary Hinduism:\n                \n                \n                    Thousands of temples across India and the global Hindu diaspora display\n                    the Trishula prominently\n                    The symbol appears on religious merchandise, from jewelry to clothing\n                    to home decorations\n                    Politicians and public figures sometimes invoke the Trishula symbolically\n                    to appeal to Hindu identity\n                    Modern guru movements and ashrams incorporate the Trishula in their\n                    iconography and teachings\n                    The Trishula emoji has become a way for Hindus to express their faith\n                    on social media\n                \n\n                Literature and Mythology Retellings\n                \n                    Modern authors have engaged with the Trishula in various ways:\n                \n                \n                    Amish Tripathi's \"Shiva Trilogy\": Reimagines Shiva as\n                    a tribal warrior who becomes divine, with the Trishula as his signature weapon\n                    in an alternative history setting\n                    Devdutt Pattanaik's works: Scholarly yet accessible\n                    retellings of Hindu mythology that explain the Trishula's symbolism\n                    Ashok Banker's mythological fiction: Features the Trishula\n                    in dramatic action sequences while maintaining religious authenticity\n                    Amar Chitra Katha comics: Introduced generations of\n                    children to Hindu mythology, including stories featuring Shiva's trident\n                \n\n                Video Games and Animation\n                \n                    The Trishula appears in various digital media:\n                \n                \n                    Smite: Features Shiva as a playable character wielding\n                    the Trishula with various abilities\n                    Shin Megami Tensei series: Includes Shiva as a powerful\n                    demon/persona, always depicted with his trident\n                    Final Fantasy series: The Trident weapon sometimes\n                    references the Trishula in name or design\n                    Indian animation: Series like \"The Legend of Hanuman\"\n                    and \"Mahabharat\" depict the Trishula in traditional contexts\n                    Yu-Gi-Oh! and other card games: Feature trident-themed\n                    cards inspired by the Trishula\n                \n\n                Film and Television\n                \n                    Indian cinema frequently depicts the Trishula:\n                \n                \n                    Mythological films: Bollywood and regional cinema have\n                    produced countless films depicting Shiva and his weapon\n                    Television serials: Shows like \"Devon Ke Dev Mahadev\"\n                    present elaborate depictions of the Trishula's use in mythological narratives\n                    Documentary productions: National Geographic and similar\n                    networks have featured the Trishula in programs about Hindu religion and culture\n                \n\n                Symbol in Global Context\n                \n                    The trident symbol has spread beyond Hindu religious contexts:\n                \n                \n                    Yoga and wellness businesses often incorporate the Trishula to signal\n                    connection to Eastern spiritual traditions\n                    The symbol appears in tattoo culture worldwide, sometimes stripped of\n                    religious meaning and used for aesthetic purposes\n                    Comparative mythology studies connect the Trishula to Poseidon/Neptune's\n                    trident and other similar symbols across cultures\n                    Some New Age movements have adopted the symbol as representing spiritual\n                    transformation more generally",
      "title": "Modern Depictions in Culture"
    },
    {
      "title": "Related Weapons and Items",
      "content": "Other Weapons of Shiva\n                \n                    Pinaka (Bow): Shiva's great bow, broken by Rama in the\n                    Ramayana to prove his worthiness to marry Sita\n                    Parashu (Axe): Given to Parashurama, the warrior avatar,\n                    used to destroy corrupt kshatriyas twenty-one times\n                    Pashupatastra: The most powerful celestial weapon (astra),\n                    capable of destroying all creation, used only in direst circumstances\n                    Khatvanga (Skull-Staff): A staff topped with a skull,\n                    associated with Shiva's tantric and cremation ground aspects\n                \n\n                Other Divine Weapons in Hindu Mythology\n                \n                    Sudarshana Chakra (Vishnu): The spinning discus of\n                    Vishnu, representing the mind and the cycle of time\n                    Vajra (Indra): The thunderbolt of the king of gods,\n                    representing irresistible force\n                    Brahmastra: The weapon of Brahma, capable of destroying\n                    worlds, invoked through mantras rather than physical form\n                    Agneyastra: The weapon of Agni, the fire god, that\n                    releases divine flames\n                    Vel (Murugan): The spear of Shiva's son Kartikeya/Murugan,\n                    representing spiritual victory\n                \n\n                Cross-Cultural Tridents\n                \n                    Poseidon's Trident (Greek): The three-pronged weapon of\n                    the sea god, causing earthquakes and controlling waters\n                    Neptune's Trident (Roman): The Roman equivalent, similarly\n                    associated with maritime power\n                    Britannia's Trident (British): Symbolic of British naval\n                    supremacy, derived from classical models\n                    Buddhist Trisula: Adapted from the Hindu original,\n                    representing the Three Jewels (Buddha, Dharma, Sangha)\n                    Taoist Three-Pronged Weapons: Various Chinese traditions\n                    incorporate trident-like implements in ritual and martial contexts"
    }
  ],
  "subtype": "divine-weapon",
  "mediaReferences": {
    "images": [],
    "diagrams": []
  },
  "migrationDate": "2025-12-13T10:16:36.092Z",
  "_enhanced": true,
  "linguistic": {
    "etymology": {
      "derivation": "From 'tri' (three) + 'śūla' (spike)",
      "meaning": "Three-pointed spear, trident",
      "rootLanguage": "Sanskrit"
    },
    "cognates": [
      {
        "language": "Pali",
        "term": "tisūla",
        "script": "𑀢𑀺𑀲𑀽𑀮"
      },
      {
        "term": "त्रिशूल",
        "language": "Hindi",
        "script": "triśūl"
      },
      {
        "term": "ত্রিশূল",
        "language": "Bengali",
        "script": "triśul"
      },
      {
        "term": "திரிசூலம்",
        "language": "Tamil",
        "script": "tiricūlam"
      }
    ],
    "originalScript": "devanagari",
    "pronunciation": "/triʃuːlə/",
    "transliteration": "Trishula",
    "originalName": "त्रिशूल",
    "languageCode": "sa"
  },
  "relatedEntities": {
    "deities": [
      {
        "url": "/mythos/hindu/deities/shiva.html",
        "mythology": "hindu",
        "id": "shiva",
        "icon": "🔱",
        "type": "deity",
        "name": "Shiva"
      },
      {
        "id": "durga",
        "mythology": "hindu",
        "icon": "🐅",
        "url": "/mythos/hindu/deities/durga.html",
        "name": "Durga",
        "type": "deity"
      }
    ],
    "places": [
      {
        "mythology": "hindu",
        "url": "/mythos/hindu/places/mount-kailash.html",
        "id": "mount-kailash",
        "name": "Mount Kailash",
        "type": "place",
        "icon": "⛰️"
      }
    ],
    "concepts": [
      {
        "icon": "🕉️",
        "id": "trimurti",
        "mythology": "hindu",
        "name": "Trimurti",
        "type": "concept",
        "url": "/mythos/hindu/concepts/trimurti.html"
      },
      {
        "url": "/mythos/hindu/concepts/moksha.html",
        "id": "moksha",
        "mythology": "hindu",
        "icon": "🕉️",
        "name": "Moksha",
        "type": "concept"
      }
    ]
  },
  "primaryMythology": "hindu",
  "name": "Trishula",
  "sources": [
    {
      "passage": "Multiple sections",
      "mythology": "hindu",
      "text": "Shiva Purana",
      "corpusUrl": "/corpus-search.html?term=shiva+purana"
    },
    {
      "passage": "Multiple sections",
      "mythology": "hindu",
      "text": "Skanda Purana",
      "corpusUrl": "/corpus-search.html?term=skanda+purana"
    },
    {
      "corpusUrl": "/corpus-search.html?term=linga+purana",
      "passage": "Various sections",
      "text": "Linga Purana",
      "mythology": "hindu"
    }
  ],
  "tags": [
    "trident",
    "shiva",
    "weapon",
    "three-prongs",
    "trimurti",
    "destruction",
    "gunas",
    "trinity"
  ],
  "usage": "The Trishula possesses cosmic-scale powers befitting the weapon of the Supreme\n                    Destroyer. Unlike weapons that merely damage or kill, the Trishula can unmake\n                    reality itself, dissolving the fundamental structures of existence. Yet it is\n                    also a weapon of transformation and liberation, capable of destroying obstacles\n                    to spiritual advancement as easily as it destroys demons or universes.",
  "shortDescription": "Shiva's three-pronged trident representing creation, preservation, and destruction",
  "powers": [
    "Destruction of evil, control over three worlds, mastery of time"
  ],
  "mythologies": [
    "hindu"
  ],
  "slug": "trishula",
  "materials": [
    "Divine metal, infused with cosmic energy"
  ],
  "wielders": [
    "Lord Shiva",
    "shiva",
    "durga"
  ],
  "cultural": {
    "modernLegacy": {
      "culturalImpact": "The Trishula is one of the most recognizable symbols in Hinduism, appearing in temples, shrines, and iconography throughout India and Southeast Asia. Shaivite ascetics and sadhus carry tridents as symbols of their devotion to Shiva. The symbol is also used in meditation practices to focus on transcending the three gunas and achieving spiritual liberation."
    },
    "worshipPractices": [
      "The Trishula is Shiva's primary weapon and symbol, used to destroy demons and evil forces. It represents his role as the destroyer in the Trimurti and his transcendence over the three gunas and three worlds. The weapon is often depicted with a damaru (drum) on the opposite hand, together representing the rhythm of creation and destruction."
    ]
  },
  "colors": {
    "primary": "#4169E1",
    "primaryRgb": "65, 105, 225",
    "secondary": "#1E90FF"
  },
  "visibility": "public",
  "geographical": {
    "region": "India",
    "originPoint": {
      "coordinates": {
        "accuracy": "approximate",
        "latitude": 31.0667,
        "longitude": 81.3167
      },
      "name": "Indian Subcontinent"
    },
    "culturalArea": "Indian Subcontinent",
    "modernCountries": [
      "India",
      "Nepal",
      "Sri Lanka",
      "Bangladesh"
    ]
  },
  "status": "published",
  "searchTerms": [
    "trishula",
    "त्रिशूल",
    "trishula (three-spear)",
    "trisula",
    "tripura-antaka (destroyer of the three cities)",
    "trident",
    "shiva",
    "weapon",
    "three-prongs",
    "trimurti",
    "destruction",
    "gunas",
    "trinity",
    "hindu"
  ],
  "symbolism": "Destruction as Transformation\n                \n                    The Trishula's primary symbolism centers on the nature of destruction in\n                    Hindu philosophy. Unlike Western conceptions that often view destruction\n                    negatively, Hindu thought recognizes destruction as essential to the cosmic\n                    cycle. Without the destruction represented by the Trishula, the universe\n                    would stagnate, unable to renew itself.\n                \n                \n                    Shiva's destruction is never meaningless violence but purposeful transformation.\n                    When the Trishula strikes, it does not merely end but transforms. The demon\n                    destroyed becomes energy returned to the cosmos. The universe dissolved becomes\n                    potential for new creation. Even ignorance destroyed becomes the foundation for\n                    wisdom. The weapon thus represents the necessity and value of endings.\n                \n\n                Transcendence of Duality\n                \n                    The three prongs of the Trishula, with the central one rising above the\n                    others, represent the transcendence of duality. The two side prongs may\n                    symbolize any pair of opposites: male and female, creation and destruction,\n                    pleasure and pain. The central prong represents the state beyond opposites,\n                    the non-dual awareness (advaita) that is Shiva's true nature.\n                \n                \n                    In yogic symbolism, this corresponds to the three nadis. Ida (left) carries\n                    lunar, cooling energy; Pingala (right) carries solar, heating energy. When\n                    these are balanced, kundalini energy rises through Sushumna (central channel),\n                    leading to enlightenment. The Trishula thus becomes a map of spiritual\n                    anatomy and the path to liberation.\n                \n\n                Mastery Over Time\n                \n                    As the prongs represent past, present, and future, the Trishula symbolizes\n                    Shiva's mastery over time itself. While beings are bound by temporal sequence,\n                    experiencing only the present moment, Shiva stands outside time, viewing all\n                    three periods simultaneously. The weapon represents this timeless perspective\n                    and Shiva's power over the flow of causality.\n                \n                \n                    For devotees, meditating on the Trishula can help develop detachment from\n                    the urgencies of temporal existence. If past and future are equally present\n                    to the divine, then the anxieties born of remembering the past and fearing\n                    the future lose their grip. The Trishula offers freedom from time's tyranny.\n                \n\n                Integration of Opposites\n                \n                    While the central prong transcends duality, the two side prongs must also be\n                    understood positively. They represent necessary complementary forces that,\n                    when balanced, support cosmic order. The Trishula does not deny duality but\n                    integrates it, showing how opposites work together under the guidance of the\n                    transcendent center.\n                \n                \n                    This has practical implications for spiritual life. Rather than rejecting\n                    the material world or escaping from embodied existence, the Trishula's\n                    symbolism suggests integrating all aspects of experience. The devotee learns\n                    to see Shiva's presence in both creation and destruction, in both pleasure\n                    and pain, finding the transcendent center within all dualities.\n                \n\n                Protection Through Destruction\n                \n                    Paradoxically, the Trishula protects through its destructive power. By\n                    destroying demons, it protects the cosmos. By destroying ego, it protects\n                    the soul from continued suffering. By destroying attachment, it protects\n                    the devotee from the pain of inevitable loss. The weapon that seems purely\n                    negative serves ultimately positive purposes.\n                \n                \n                    This protective aspect is why devotees invoke the Trishula against\n                    negative forces. The symbol appears on protective amulets, in home\n                    shrines, and wherever Shiva's protection is sought. The great destroyer\n                    is also the great protector, and his weapon serves both functions.",
  "_uploadedAt": "2025-12-25T15:46:34.230119",
  "longDescription": "The Trishula (Sanskrit: त्रिशूल, 'three spear') is Lord Shiva's most iconic weapon, a three-pronged trident that symbolizes his supreme power over the three fundamental aspects of existence. The three prongs represent various trinities: creation-preservation-destruction, past-present-future, the three gunas (sattva-rajas-tamas), and the three states of consciousness (waking-dreaming-deep sleep). The Trishula is said to have the power to destroy the three worlds (physical, astral, and causal) and represents Shiva's complete mastery over time and karma. According to legend, Shiva uses the Trishula to destroy evil, protect dharma, and maintain cosmic balance. The weapon is so powerful that it cannot be stopped once thrown and always returns to Shiva's hand.",
  "temporal": {
    "firstAttestation": {
      "date": {
        "uncertainty": 200,
        "confidence": "probable",
        "circa": true,
        "year": -1000,
        "display": "c. 1000 BCE"
      },
      "source": "Vedic texts",
      "type": "literary"
    },
    "culturalPeriod": "Vedic Period (1500-500 BCE)",
    "timelinePosition": "Vedic",
    "historicalDate": {
      "end": {
        "display": "Present",
        "year": 2025,
        "circa": false
      },
      "start": {
        "circa": true,
        "display": "c. 1000 BCE",
        "uncertainty": 200,
        "year": -1000
      },
      "display": "c. 1000 BCE - Present"
    }
  },
  "createdBy": [],
  "type": "item",
  "mythologyContexts": [
    {
      "textReferences": [
        {
          "corpusUrl": "/corpus-search.html?term=shiva+purana+trishula",
          "passage": "Various sections",
          "text": "Shiva Purana",
          "context": "Describes the power and significance of Shiva's Trishula"
        },
        {
          "context": "Stories of Shiva wielding the Trishula",
          "corpusUrl": "/corpus-search.html?term=skanda+purana+trishula",
          "text": "Skanda Purana",
          "passage": "Various sections"
        }
      ],
      "symbolism": "The three prongs symbolize Shiva's power over the three fundamental aspects of existence: creation (Brahma), preservation (Vishnu), and destruction (Shiva himself). They also represent the three gunas that bind the soul: sattva (goodness), rajas (passion), and tamas (ignorance). The Trishula's ability to destroy all three demonstrates the path to moksha - transcending material bondage. Additionally, it represents the three nadis (energy channels) in the subtle body: ida, pingala, and sushumna.",
      "mythology": "hindu",
      "names": [
        "Trishula (Three-Spear)",
        "Trisula",
        "Tripura-antaka (Destroyer of the Three Cities)"
      ],
      "usage": "The Trishula is Shiva's primary weapon and symbol, used to destroy demons and evil forces. It represents his role as the destroyer in the Trimurti and his transcendence over the three gunas and three worlds. The weapon is often depicted with a damaru (drum) on the opposite hand, together representing the rhythm of creation and destruction.",
      "culturalSignificance": "The Trishula is one of the most recognizable symbols in Hinduism, appearing in temples, shrines, and iconography throughout India and Southeast Asia. Shaivite ascetics and sadhus carry tridents as symbols of their devotion to Shiva. The symbol is also used in meditation practices to focus on transcending the three gunas and achieving spiritual liberation.",
      "associatedDeities": [
        {
          "id": "shiva",
          "type": "deity",
          "mythology": "hindu",
          "name": "Shiva",
          "icon": "🔱",
          "url": "/mythos/hindu/deities/shiva.html"
        },
        {
          "type": "deity",
          "mythology": "hindu",
          "icon": "🐅",
          "url": "/mythos/hindu/deities/durga.html",
          "id": "durga",
          "name": "Durga"
        }
      ]
    }
  ],
  "migratedFrom": "legacy-repository",
  "metaphysicalProperties": {
    "energyType": "divine",
    "element": "fire"
  },
  "owner": "",
  "significance": "",
  "enhancedBy": "agent8",
  "origin": "",
  "primarySources": [],
  "relatedItems": [],
  "deities": [
    "shiva",
    "durga"
  ],
  "updatedAt": "2025-12-26T05:13:53.706Z",
  "_created": "2025-12-27T07:06:16.499Z",
  "icon": "<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 64 64\">\n  <circle cx=\"32\" cy=\"32\" r=\"28.8\" fill=\"#6a5acd\" opacity=\"0.2\"/>\n  <circle cx=\"32\" cy=\"32\" r=\"16\" fill=\"none\" stroke=\"#6a5acd\" stroke-width=\"2\"/>\n  <text x=\"32\" y=\"44.8\" text-anchor=\"middle\" font-size=\"22.4\" fill=\"#6a5acd\">💎</text>\n</svg>",
  "description": "Shiva's three-pronged trident representing creation, preservation, and destruction",
  "mythology": "hindu",
  "iconType": "svg",
  "_modified": "2025-12-27T07:07:14.508Z",
  "createdAt": "2025-12-27T07:06:16.499Z",
  "metadata": {
    "created": {
      "_seconds": 1766819244,
      "_nanoseconds": 101000000
    },
    "updated": {
      "_seconds": 1766819244,
      "_nanoseconds": 101000000
    }
  },
  "updated_at": "2025-12-27T07:06:55.967Z"
}