{
  "metadata": {
    "polishedBy": "Agent_11",
    "htmlExtracted": true,
    "polished": true
  },
  "domains": "Regeneration, poison, chaos, the swamps of Lerna, venomous destruction",
  "type": "creature",
  "completeness": 88,
  "name": "The Lernaean Hydra",
  "_uploadedAt": "2025-12-25T15:46:33.276662",
  "authorId": "official",
  "icon": "🐍",
  "mythology_story": "The Hydra was born to Typhon , the most terrifying monster in all Greek mythology, and Echidna , the half-woman half-serpent known as the \"Mother of All Monsters.\" The Hydra's monstrous siblings included many of the most fearsome creatures in myth: The goddess Hera , ever hostile to Heracles , raised the Hydra specifically to be his doom. She placed the creature in the swamps of Lerna, where it terrorized the surrounding countryside.",
  "status": "published",
  "lair": [
    "Lake Lerna in the Argolid",
    "believed to be an entrance to the Underworld"
  ],
  "createdAt": {
    "_nanoseconds": 738000000,
    "_seconds": 1765797566
  },
  "updatedAt": {
    "_nanoseconds": 738000000,
    "_seconds": 1765797566
  },
  "symbolism": "The Lernaean Hydra has been interpreted as a symbol of many profound concepts throughout history:",
  "physicalDescription": "The Many-Headed Serpent",
  "primarySources": [
    "Bibliotheca (The Library) by Pseudo-Apollodorus (1st-2nd century CE)",
    "Theogony by Hesiod (c. 700 BCE)",
    "Metamorphoses by Ovid (8 CE)",
    "Odes by Pindar (c. 518-438 BCE)",
    "Description of Greece by Pausanias (c. 110-180 CE)"
  ],
  "mythology": "greek",
  "_enhanced": true,
  "habitats": [
    "Lake Lerna in the Argolid, believed to be an entrance to the Underworld"
  ],
  "searchTerms": [
    "the lernaean hydra",
    "the",
    "lernaean",
    "hydra",
    "greek_creature_hydra",
    "greek",
    "creature",
    "regeneration",
    "poison",
    "chaos",
    "the swamps of lerna",
    "venomous destruction"
  ],
  "abilities": [
    "Deadly venom (breath and blood)",
    "regenerating heads (cut one",
    "two grow back)",
    "one immortal head impervious to all harm",
    "Deadly venom (breath and blood), regenerating heads (cut one, two grow back), one immortal head impervious to all harm",
    "Cerberus : The three-headed hound who guards the gates of the Underworld",
    "The Chimera : The fire-breathing lion-goat-serpent hybrid slain by Bellerophon",
    "The Sphinx : The riddling monster of Thebes",
    "The Nemean Lion: The invulnerable beast slain by Heracles in his First Labor",
    "Orthrus: The two-headed dog who guarded the cattle of Geryon"
  ],
  "subtitle": "The Many-Headed Serpent",
  "nature": "Multi-headed water serpent (typically nine heads, one of which was immortal and could not be killed by any mortal means)",
  "symbols": "Multiple serpent heads, poisonous breath, toxic blood, the swamp, regenerating stumps",
  "id": "greek_creature_hydra",
  "description": "A monstrous water serpent with multiple heads and deadly venom, the Lernaean Hydra was one of the most fearsome creatures of Greek mythology. Dwelling in the swamps of Lake Lerna, this immortal horror possessed the terrifying ability to regenerate - for every head severed, two more would sprout in its place. Only through the combined efforts of Heracles and his nephew Iolaus was this seemingly invincible beast finally defeated.",
  "origin": "Child of Typhon (father of monsters) and Echidna (mother of monsters)"
}