{
  "symbolism": "The Minotaur has proven one of mythology's most symbolically rich figures, inspiring interpretation from antiquity to the present day:",
  "id": "greek_minotaur",
  "_uploadedAt": "2025-12-25T15:46:33.279109",
  "domains": "Monstrosity, the labyrinth, human sacrifice, divine punishment, the beast within humanity",
  "symbols": "Bull horns, the labyrinth spiral, the double axe (labrys), Cretan palace iconography",
  "completeness": 88,
  "attributes": [
    "Asterion (\"Starry One\") - a name shared with Minos's stepfather, the previous king of Crete",
    "Half-man, half-bull - with the head and tail of a bull upon a massive human body; a creature of unnatural birth, neither fully beast nor man",
    "Born of Queen Pasiphae and the Cretan Bull, through Poseidon's curse upon King Minos",
    "Monstrosity, the labyrinth, human sacrifice, divine punishment, the beast within humanity",
    "Bull horns, the labyrinth spiral, the double axe (labrys), Cretan palace iconography",
    "The Labyrinth at Knossos - an inescapable maze constructed by Daedalus",
    "Asterion (\"Starry One\") - a name shared with Minos's stepfather",
    "the previous king of Crete",
    "Half-man",
    "half-bull - with the head and tail of a bull upon a massive human body; a creature of unnatural birth",
    "neither fully beast nor man",
    "Born of Queen Pasiphae and the Cretan Bull",
    "through Poseidon's curse upon King Minos",
    "Monstrosity",
    "the labyrinth",
    "human sacrifice",
    "divine punishment",
    "the beast within humanity",
    "Bull horns",
    "the labyrinth spiral",
    "the double axe (labrys)",
    "Cretan palace iconography"
  ],
  "type": "beast",
  "origin": "Born of Queen Pasiphae and the Cretan Bull, through Poseidon 's curse upon King Minos",
  "habitats": [
    "The Labyrinth at Knossos - an inescapable maze constructed by Daedalus"
  ],
  "relationships": {},
  "primarySources": [
    "Bibliotheca (Library) by Pseudo-Apollodorus (1st-2nd century CE)",
    "Metamorphoses by Ovid (8 CE)",
    "Life of Theseus by Plutarch (c. 75 CE)",
    "Heroides by Ovid (c. 5 BCE)"
  ],
  "mythology": "greek",
  "_enhanced": true,
  "weaknesses": [],
  "physicalDescription": "The Bull of Minos",
  "mythology_story": "The tale of the Minotaur is one of broken vows, divine vengeance, and ultimately heroic triumph. It begins not with the monster itself, but with a king's hubris and a god's wrath. When the time came for the third tribute, Theseus , the young prince of Athens and son of King Aegeus (or of Poseidon himself, by some accounts), volunteered to join the sacrificial group. He swore to his father that he would slay the monster and end Athens's shame forever. If he succeeded, he would raise white sails on his return; if he perished, the ship would bear black sails of mourning.",
  "filename": "minotaur",
  "abilities": [
    "The Beast Within: The Minotaur represents the animal nature that lurks within every human - the instinctual, savage, consuming aspect of the self that civilization and reason must contain. Theseus 's victory symbolizes the triumph of the rational mind over base impulses.",
    "The Labyrinth of the Unconscious: In Jungian psychology, the Labyrinth represents the depths of the unconscious mind, with the Minotaur as the Shadow - the repressed, denied aspects of the self that must be confronted for psychological wholeness. Ariadne 's thread represents the conscious connection that allows safe return from the depths.",
    "The Price of Broken Vows: The entire tragedy stems from Minos 's broken promise to Poseidon . The Minotaur embodies the monstrous consequences that arise when sacred obligations are betrayed.",
    "The Scapegoat: The creature, born through no fault of its own, becomes the receptacle for collective guilt and shame - hidden away, fed with sacrificial victims, ultimately destroyed.",
    "Historical Memory: Some scholars see in the myth a distant memory of Minoan Crete's dominance over Mycenaean Greece, with the tribute representing actual political subjugation. The bull-worship prominent in Minoan art may have seemed monstrous to later Greeks."
  ],
  "name": "Greek Mythology",
  "nature": "Half-man, half-bull - with the head and tail of a bull upon a massive human body; a creature of unnatural birth, neither fully beast nor man",
  "description": "Also known as The Minotaur.",
  "displayName": "The Minotaur",
  "metadata": {
    "polishedBy": "Agent_11",
    "createdBy": "system",
    "polished": true,
    "updatedAt": {
      "_nanoseconds": 714000000,
      "_seconds": 1766539876
    },
    "createdAt": "2025-12-13T02:38:01.313Z",
    "source": "html_parser",
    "sourceFile": "mythos/greek/creatures/minotaur.html",
    "finalEnrichment": true,
    "verified": false,
    "htmlExtracted": true
  }
}