{
  "metadata": {
    "source_file": "mythos/japanese/deities/okuninushi.html",
    "extraction_date": "2025-12-15T21:21:59.996982",
    "extraction_version": "2.6",
    "mythology": "japanese",
    "completeness_score": 65
  },
  "entity": {
    "name": "Japanese - Okuninushi",
    "mythology": "japanese",
    "type": "deity",
    "icon": "🌏",
    "subtitle": "Great Master of the Land",
    "css_colors": {}
  },
  "attributes": {},
  "mythology_stories": {
    "intro": "Okuninushi's myths chronicle the transformation of a youngest son, bullied and overlooked, into the master of the Japanese archipelago. Recorded in the <em>Kojiki</em> and <em>Nihon Shoki</em>, his tales emphasize compassion, cleverness, perseverance through trials, and the wisdom to know when to yield power for the greater good.",
    "key_myths": [
      {
        "name": "The White Rabbit of Inaba",
        "description": "In his youth as Onamuji, he traveled with his eighty elder brothers (the Yasogami) to court Princess Yakami of Inaba. Along the road, they encountered a skinless rabbit suffering in agony. The cruel brothers told the rabbit to bathe in salt water, which only increased its pain. When Onamuji arrived, carrying his brothers' baggage like a servant, he showed compassion. He instructed the rabbit to wash in fresh water and roll in cattail pollen, which healed its wounds. The grateful rabbit revealed it was a divine messenger and prophesied that Onamuji, not his brothers, would win the princess. This tale establishes Okuninushi's core virtue: compassion for the suffering, which brings divine favor. The White Rabbit of Inaba remains one of Japan's most beloved mythological figures."
      },
      {
        "name": "The Trials of Susanoo",
        "description": "After winning Princess Yakami, Onamuji faced the murderous jealousy of his brothers, who killed him twice (once by crushing him with a red-hot boulder, once by splitting him in a tree). Each time, his mother and divine intervention restored him to life. Seeking protection and greater power, he descended to Ne-no-Kuni (the Root Land) to meet the storm god Susanoo. There he encountered Suseri-hime, Susanoo's daughter, and the two fell deeply in love. Susanoo, testing the young god, subjected him to three impossible trials: sleeping in a room full of snakes, then scorpions and centipedes, then being trapped in a burning field while searching for an arrow. With Suseri-hime's help and his own cleverness, Onamuji survived each ordeal. On the final night, as Susanoo slept, Onamuji tied the storm god's hair to the rafters and fled with Suseri-hime, Susanoo's sword, bow, and koto (zither). When Susanoo awoke and gave chase to the border of the Root Land, he grudgingly acknowledged Onamuji's worthiness, bestowed the name \"Okuninushi\" upon him, and commanded him to build a great nation."
      },
      {
        "name": "Building the Nation of Izumo",
        "description": "With Susanoo's weapons and blessings, Okuninushi returned to the mortal world and set about civilizing the land. He defeated his murderous brothers, established agricultural practices, taught medicine and healing arts, introduced sericulture (silk cultivation), and brought order to the chaotic landscape. Working alongside the dwarf deity Sukunabikona (a tiny kami of medicine, hot springs, and brewing), Okuninushi traveled throughout Japan, establishing shrines, creating rice paddies, and teaching humanity the skills of civilization. When Sukunabikona departed to the eternal land, Okuninushi completed the nation-building alone, weeping at the loss of his companion but continuing the sacred work."
      },
      {
        "name": "The Transfer of the Land (Kuniyuzuri)",
        "description": "After Okuninushi had pacified and civilized the land, Amaterasu in Takamagahara determined that the terrestrial realm should be ruled by her descendants. She sent multiple messengers to demand that Okuninushi cede control. After his son Kotoshironushi agreed to the transfer and his other son Takeminakata was defeated in a contest of strength, Okuninushi negotiated the terms. He would yield rulership of the visible world (utsushiyo) but retain dominion over the hidden world (kakuriyo) - the realm of spirits, mysteries, fate, and the afterlife. In exchange, Amaterasu's descendants would build for him a magnificent shrine at Izumo. This myth explains the political ascendancy of the Yamato court (claiming descent from Amaterasu) while preserving the ancient religious significance of Izumo. It also establishes the dual nature of Shinto: the manifest world governed by imperial authority, and the hidden world of spirits governed by Okuninushi."
      },
      {
        "name": "The Many Wives of Okuninushi",
        "description": "Okuninushi is unusual among Japanese kami for his many romantic relationships, which produced numerous divine offspring. His primary consort Suseri-hime remained his chief wife, but he also married Yakami-hime of Inaba, Nunakawa-hime of Koshi, and Takiri-bime-no-mikoto, among others. One famous myth tells of his journey to Koshi (modern Niigata) to court the beautiful Nunakawa-hime through poetry, demonstrating that eloquence and art, not just strength, define a true deity. These marriages symbolize the unification of various regional deities and clans under Okuninushi's nation-building project."
      }
    ],
    "sources": "Kojiki(Record of Ancient Matters, 712 CE),Nihon Shoki(Chronicles of Japan, 720 CE),Izumo Fudoki(Regional Chronicles of Izumo, 733 CE),Sendai Kuji Hongi(Ancient Chronicles)"
  },
  "relationships": {
    "enemies": "Amaterasu and the heavenly kami - to whom he ceded the visible world",
    "family": {
      "children": "Over 180 children according to some accounts, including Kotoshironushi-no-kami (god of oracles and fishing) and Takeminakata-no-kami (god of wind and hunting)"
    }
  },
  "worship": {
    "izumo taisha (grand shrine of izumo)": "Izumo Taisha in Shimane Prefecture is the most sacred site dedicated to Okuninushi and one of the oldest and most important shrines in Japan. According to the Kuniyuzuri myth, Amaterasu promised to build this magnificent shrine as part of the agreement for Okuninushi to cede the visible world. The main hall (honden) is the tallest shrine building in Japan, and ancient records suggest it was once even more massive, possibly reaching over 48 meters in height with enormous pillars. The shrine uses the unique taisha-zukuri architectural style, the oldest shrine construction method in Japan. During the 10th lunar month (Kannazuki - \"Month Without Gods\"), all the kami of Japan are believed to gather at Izumo Taisha for a divine assembly where Okuninushi presides over determining the romantic fates and marriages for the coming year. Thus, in Izumo, the 10th month is called Kamiarizuki (\"Month With Gods\"), and Okuninushi is especially venerated as the deity of matchmaking and marriage.",
    "other major shrines": "<li><strong>Miho Shrine (Shimane):</strong> Dedicated to Okuninushi and his wife Mihotsuhime, overlooking Miho Bay</li>\n<li><strong>Hakuto Shrine (Tottori):</strong> Located at the legendary site of the White Rabbit of Inaba story</li>\n<li><strong>Oomiwa Shrine (Nara):</strong> One of Japan's oldest shrines, identifies Okuninushi with Omononushi, the mountain deity</li>\n<li><strong>Keta Taisha (Ishikawa):</strong> Major shrine in the Hokuriku region honoring Okuninushi</li>\n<li><strong>Numerous regional shrines:</strong> As the nation-builder, Okuninushi is honored throughout Japan, particularly in agricultural and coastal communities</li>",
    "festivals": "<li><strong>Kamiari-sai (November):</strong> The Divine Assembly festival at Izumo Taisha welcoming the gathering of all kami</li>\n<li><strong>Reisai (May 14-16):</strong> The Grand Festival of Izumo Taisha with processions and sacred performances</li>\n<li><strong>Shinjiko Festival (August):</strong> Celebrating Okuninushi's nation-building and blessing of the harvest</li>\n<li><strong>Marriage Blessing Ceremonies:</strong> Year-round rituals for couples seeking Okuninushi's blessing for successful marriages</li>",
    "worship practices": "Worship of Okuninushi emphasizes gratitude for civilization's gifts - agriculture, medicine, and social harmony. Uniquely at Izumo Taisha, devotees perform four claps instead of the standard two during prayer (two claps to call the kami, two to express gratitude). Offerings include rice, sake, salt, and medicinal herbs. Couples seeking marriage blessings or marital harmony frequently visit Izumo Taisha, as Okuninushi governs the invisible threads of fate that bind people together. Farmers pray to him for abundant harvests, healers invoke him for medical knowledge, and merchants seek his blessing for prosperity in commerce. The ritual of \"musubi\" (divine connection and binding) is central to his worship, reflecting his role in creating harmonious relationships between humans, nature, and the divine."
  },
  "interlinks": {
    "archetype": {
      "name": "🔧 CULTURE HERO",
      "description": "Okuninushi represents the Culture Hero archetype - the divine figure who teaches humanity essential skills, establishes civilization, and transforms chaos into order.",
      "url": "../../../archetypes/culture-hero/index.html"
    },
    "cross_cultural_parallels": [
      {
        "name": "Prometheus",
        "mythology": "Greek - Bringer of Civilization",
        "url": "../../greek/deities/prometheus.html"
      },
      {
        "name": "Osiris",
        "mythology": "Egyptian - Agriculture & Afterlife",
        "url": "../../egyptian/deities/osiris.html"
      },
      {
        "name": "Lugh",
        "mythology": "Celtic - Many-Skilled God",
        "url": "../../celtic/deities/lugh.html"
      },
      {
        "name": "Enki",
        "mythology": "Sumerian - Wisdom & Crafts",
        "url": "../../mesopotamian/deities/enki.html"
      },
      {
        "name": "Quetzalcoatl",
        "mythology": "Aztec - Culture Bringer",
        "url": "../../aztec/deities/quetzalcoatl.html"
      }
    ]
  },
  "see_also": [
    {
      "text": "🌊Susanoo",
      "url": "susanoo.html"
    },
    {
      "text": "☀️Amaterasu",
      "url": "amaterasu.html"
    },
    {
      "text": "✨Izanagi",
      "url": "izanagi.html"
    },
    {
      "text": "🌟Sukunabikona",
      "url": "../../../index.html"
    },
    {
      "text": "🐇White Rabbit of Inaba",
      "url": "../myths/index.html"
    },
    {
      "text": "📜Kuniyuzuri (Transfer of the Land)",
      "url": "../myths/index.html"
    },
    {
      "text": "🔧Culture Hero Archetype",
      "url": "../../../archetypes/culture-hero/index.html"
    }
  ]
}