{
  "metadata": {
    "source_file": "mythos/japanese/deities/raijin.html",
    "extraction_date": "2025-12-15T21:22:00.003240",
    "extraction_version": "2.6",
    "mythology": "japanese",
    "completeness_score": 55
  },
  "entity": {
    "name": "Japanese - Raijin",
    "mythology": "japanese",
    "type": "deity",
    "icon": "⛈️",
    "subtitle": "God of Thunder and Lightning",
    "css_colors": {}
  },
  "attributes": {},
  "mythology_stories": {
    "intro": "Raijin's mythology is less about narrative myths and more about his essential nature as the personification of thunder itself. He appears in art, folklore, and religious practice as the embodiment of storms' terrifying yet necessary power.",
    "key_myths": [
      {
        "name": "Birth from Izanami",
        "description": "According to some traditions, Raijin was born from the corpse of the goddess Izanami while she decayed in Yomi, the underworld. This origin connects him to the frightening, transformative power of death and rebirth, making him a liminal deity between life and death, sky and earth."
      },
      {
        "name": "The Thunder Drums (Taiko)",
        "description": "Raijin is invariably depicted surrounded by a ring of taiko drums, traditionally numbering eight, arranged in a circle around him. When he beats these drums with his stick-like hands or drumsticks, the reverberations create thunder. The timing and intensity of the thunder correspond to how furiously he drums. This visual metaphor makes the invisible phenomenon of thunder comprehensible and personified."
      },
      {
        "name": "Companion to Fujin",
        "description": "Raijin is most famous for his pairing with Fujin, the wind god. Together, they represent the fundamental forces of storms - wind and thunder working in concert. Their joint appearance in the celebrated Tawaraya Sotatsu screen at Kennin-ji Temple (17th century) epitomizes this partnership and has become one of the most iconic images in Japanese art. While Fujin brings the wind that scatters and disrupts, Raijin brings the thunder and lightning that terrify and awe."
      },
      {
        "name": "Guardian Against Evil",
        "description": "Despite his frightening appearance, Raijin serves a protective function. Thunder and lightning are believed to frighten away evil spirits (yokai and oni). Farmers welcomed Raijin's storms because lightning-rich rains brought nitrogen to the soil, enriching it. Thus, he is both feared and revered - dangerous but beneficial when properly respected."
      },
      {
        "name": "Popular Folklore",
        "description": "Japanese folklore contains numerous tales of Raijin's mischievous or wrathful nature. Children are warned to cover their belly buttons during storms, as Raijin supposedly likes to steal them. Rice farmers would pray to Raijin for rain in times of drought, offering sake and prayers, but would also pray for him to hold back his fury during harvest time, when storms could destroy crops."
      },
      {
        "name": "The Raijin in Battle",
        "description": "During periods of warfare, Raijin and Fujin were invoked as protectors of Japan. The divine wind (kamikaze) that destroyed the Mongol invasion fleets was attributed to their combined power - Fujin's typhoon winds and Raijin's destructive lightning working together to defend the nation."
      }
    ],
    "sources": "Kojiki(indirectly, through association with Izanami), Buddhist temple iconography, Edo-period art scrolls, Tawaraya Sotatsu's \"Wind God and Thunder God\" (early 17th century), regional folklore collections"
  },
  "relationships": {},
  "worship": {
    "sacred sites & shrines": "While Raijin doesn't have major shrines exclusively dedicated to him like some other major kami, he appears prominently in many Buddhist temples and Shinto shrines as a guardian figure: <li><strong>Kennin-ji Temple (Kyoto):</strong> Home to the most famous artistic depiction of Raijin and Fujin in the Tawaraya Sotatsu screen painting</li>\n<li><strong>Sanjusangendo Temple (Kyoto):</strong> Features statues of both Raijin and Fujin as guardian deities flanking the main hall</li>\n<li><strong>Kaminarimon (Thunder Gate) at Senso-ji (Tokyo):</strong> The famous gate features large lanterns and guardian statues including representations of thunder deities</li>\n<li><strong>Local thunder shrines:</strong> Small shrines throughout rice-farming regions where Raijin is petitioned for rain and protection from destructive storms</li>",
    "festivals & worship practices": "<li><strong>Rain-summoning rituals (amagoi):</strong> During droughts, farmers would perform rituals invoking Raijin to bring thunderstorms</li>\n<li><strong>Storm appeasement ceremonies:</strong> Before harvest season, prayers offered asking Raijin to spare the crops from destructive lightning</li>\n<li><strong>Artistic veneration:</strong> Raijin appears in countless art forms - paintings, sculptures, woodblock prints, tattoos - as both subject of reverence and aesthetic power</li>\n<li><strong>Protective amulets:</strong> Charm papers (ofuda) invoking Raijin's protective power against evil and misfortune</li>",
    "cultural impact": "Raijin's influence extends far beyond religious worship into Japanese culture broadly. His image appears in traditional tattoo art (irezumi), where he symbolizes power, protection, and respect for nature's forces. In modern popular culture, Raijin-inspired characters appear in video games, manga, and anime as thunder-wielding warriors. The aesthetic of the demonic thunder god beating drums has become one of Japan's most recognizable mythological images worldwide, representing the Japanese understanding that nature's most terrifying forces can also be protective and necessary."
  },
  "interlinks": {
    "archetype": {
      "name": "⛈️ THUNDER DEITY",
      "description": "Raijin represents the Thunder God archetype - the divine personification of lightning, storms, and the awesome power of the sky's fury.",
      "url": "../../../archetypes/storm-god/index.html"
    },
    "cross_cultural_parallels": [
      {
        "name": "Thor",
        "mythology": "Norse - God of Thunder",
        "url": "../../norse/deities/thor.html"
      },
      {
        "name": "Zeus",
        "mythology": "Greek - Sky & Lightning",
        "url": "../../greek/deities/zeus.html"
      },
      {
        "name": "Indra",
        "mythology": "Hindu - Thunderbolt God",
        "url": "../../hindu/deities/indra.html"
      },
      {
        "name": "Lei Gong",
        "mythology": "Chinese - Thunder God",
        "url": "../../chinese/deities/lei-gong.html"
      },
      {
        "name": "Tlaloc",
        "mythology": "Aztec - Storm & Rain",
        "url": "../../aztec/deities/tlaloc.html"
      }
    ]
  },
  "see_also": [
    {
      "text": "🌬Fujin",
      "url": "fujin.html"
    },
    {
      "text": "🌊Susanoo",
      "url": "susanoo.html"
    },
    {
      "text": "🌈Izanami",
      "url": "izanami.html"
    },
    {
      "text": "🎨Wind-Thunder Gods Screen",
      "url": "../../../index.html"
    },
    {
      "text": "⚡Weather Deities",
      "url": "../../../index.html"
    },
    {
      "text": "⛈️Thunder Deity Archetype",
      "url": "../../../archetypes/storm-god/index.html"
    }
  ]
}