{
  "metadata": {
    "source_file": "mythos/japanese/deities/tsukuyomi.html",
    "extraction_date": "2025-12-15T21:22:00.017978",
    "extraction_version": "2.6",
    "mythology": "japanese",
    "completeness_score": 60
  },
  "entity": {
    "name": "Japanese - Tsukuyomi",
    "mythology": "japanese",
    "type": "deity",
    "icon": "🌙",
    "subtitle": "God of the Moon and the Night",
    "css_colors": {}
  },
  "attributes": {},
  "mythology_stories": {
    "intro": "Unlike his siblings Amaterasu and Susanoo, whose myths fill volumes, Tsukuyomi appears relatively rarely in the ancient texts. This very absence adds to his mystique - a god so aligned with silence and darkness that even the stories about him are few. Yet the myths that do exist are powerful, explaining nothing less than why day and night are forever separated.",
    "key_myths": [
      {
        "name": "Birth from Izanagi's Right Eye",
        "description": "During the purification rite (misogi) at the river mouth of Tachibana in Himuka, Izanagi washed his face to cleanse the pollution of Yomi. As he washed his right eye, the luminous Tsukuyomi was born, complementing Amaterasu who emerged from the left eye. Izanagi assigned him to rule the realms of night, making him co-regent of the heavens with his sister. In some versions, he was born equal in beauty and brightness to Amaterasu, differing only in the coolness of his silver light."
      },
      {
        "name": "The Murder of Uke Mochi (The Goddess of Food)",
        "description": "This myth explains the eternal separation of sun and moon. Amaterasu sent Tsukuyomi to visit Uke Mochi, the goddess of food, on her behalf. When Tsukuyomi arrived, Uke Mochi prepared a feast for him using her divine power: she faced the sea and spat out fish, faced the forest and expelled game from her mouth, and facing the rice paddies, coughed up bowls of rice. Though the food was divine and pure, Tsukuyomi was so disgusted by the manner of its creation that he drew his sword and killed her. From Uke Mochi's corpse sprang the five grains (rice, wheat, millet, beans, and hemp) as well as silkworms and cattle - blessings for humanity born from divine death. When Amaterasu learned of this killing, she was so horrified by his violence against a fellow kami that she declared she would never look upon his face again. From that moment, sun and moon have been separated - Amaterasu ruling day, Tsukuyomi banished to eternal night, forever chasing his sister across the sky but never catching her."
      },
      {
        "name": "The Counting of Time",
        "description": "As the \"Moon-Reader,\" Tsukuyomi's passage across the night sky became the basis for the lunar calendar. His waxing and waning mark the months, his cycles determining the timing of festivals, plantings, and ceremonies. This role as cosmic timekeeper makes him essential to the order of the world despite his isolation - even in exile, he serves a vital function in maintaining the rhythm of existence."
      },
      {
        "name": "The Moon Rabbit",
        "description": "While not exclusively about Tsukuyomi, the Japanese moon-rabbit (Tsuki no Usagi) legend connects to his domain. The rabbit seen \"pounding mochi in the moon\" represents the kami's celestial court, companions to the lonely moon god in his eternal journey through the night."
      }
    ],
    "sources": "Kojiki(712 CE),Nihon Shoki(720 CE),Man'yoshupoetry references, lunar calendar traditions"
  },
  "relationships": {
    "family": {
      "consorts": "Various accounts mention no consort, contributing to his solitary nature"
    }
  },
  "worship": {
    "major shrines": "Compared to other major kami, Tsukuyomi has relatively few dedicated shrines, reflecting his mysterious and isolated nature: <li><strong>Tsukiyomi Shrine (Ise, Mie):</strong> A subsidiary shrine (Betsugu) of Ise Jingu, located within the inner shrine grounds, one of the most sacred Tsukuyomi sites</li>\n<li><strong>Tsukiyomi Shrine (Kyoto):</strong> Located in Matsuo, dedicated to the moon god</li>\n<li><strong>Tsukiyomi Shrine (Nagasaki, Iki Island):</strong> Claims to be the original Tsukuyomi shrine from which the Ise branch derives</li>\n<li><strong>Tsukiyomi-no-Miya (Matsuyama):</strong> Important regional shrine in Shikoku</li>",
    "festivals & practices": "<li><strong>Tsukimi (Moon-Viewing):</strong> The autumn moon-viewing festival, particularly on the fifteenth night of the eighth lunar month. Offerings of tsukimi dango (rice dumplings), susuki grass, and seasonal produce are made while viewing the harvest moon</li>\n<li><strong>Jusan-ya (Thirteenth Night):</strong> A second moon-viewing night about a month after the main Tsukimi</li>\n<li><strong>New Year lunar observations:</strong> Traditional calendrical calculations honoring Tsukuyomi's role as time-keeper</li>",
    "worship practices": "Tsukuyomi's worship tends toward contemplation and quiet observation rather than the active festivals associated with other kami. Moon-viewing parties (tsukimi) combine aesthetic appreciation with spiritual acknowledgment. Offerings of white rice, sake, and autumn vegetables honor both the moon and the harvest his actions enabled. Prayers to Tsukuyomi often concern the passage of time, the cycles of nature, and guidance through dark periods of life."
  },
  "interlinks": {
    "archetype": {
      "name": "🌙 MOON DEITY",
      "description": "Tsukuyomi represents the Moon Deity archetype - the keeper of night, measurer of time, and guardian of secrets hidden from the sun.",
      "url": "../../../archetypes/celestial/index.html"
    },
    "sacred_items": [
      {
        "name": "Amaterasu",
        "type": "Sun Goddess",
        "url": "amaterasu.html"
      }
    ],
    "cross_cultural_parallels": [
      {
        "name": "Selene",
        "mythology": "Greek - Moon Goddess",
        "url": "../../greek/deities/index.html"
      },
      {
        "name": "Thoth",
        "mythology": "Egyptian - Moon God",
        "url": "../../egyptian/deities/thoth.html"
      },
      {
        "name": "Chandra",
        "mythology": "Hindu - Moon God",
        "url": "../../hindu/deities/index.html"
      },
      {
        "name": "Mani",
        "mythology": "Norse - Moon God",
        "url": "../../norse/deities/index.html"
      },
      {
        "name": "Sin",
        "mythology": "Mesopotamian - Moon God",
        "url": "../../babylonian/deities/sin.html"
      }
    ]
  },
  "see_also": [
    {
      "text": "☀️Amaterasu",
      "url": "amaterasu.html"
    },
    {
      "text": "🌊Susanoo",
      "url": "susanoo.html"
    },
    {
      "text": "✨Izanagi",
      "url": "izanagi.html"
    },
    {
      "text": "🌈Izanami",
      "url": "izanami.html"
    },
    {
      "text": "🌾Uke Mochi",
      "url": "../../../index.html"
    },
    {
      "text": "🌽Origin of Grains",
      "url": "../myths/index.html"
    },
    {
      "text": "🌙Moon Deity Archetype",
      "url": "../../../archetypes/celestial/index.html"
    }
  ]
}