{
  "id": "conch-shell",
  "migrationDate": "2025-12-13T10:16:35.259Z",
  "geographical": null,
  "migratedFrom": "legacy-repository",
  "wielders": [],
  "status": "published",
  "sources": [],
  "_uploadedAt": "2025-12-25T15:46:34.225133",
  "tags": [
    "hindu",
    "buddhist",
    "sacred",
    "ritual",
    "ritual-object",
    "conch-shell"
  ],
  "cultural": null,
  "relatedEntities": null,
  "mythologies": [
    "hindu",
    "buddhist"
  ],
  "name": "Shankha (Conch Shell)",
  "createdBy": [],
  "colors": null,
  "mythologyContexts": [],
  "shortDescription": "Shankha (Conch Shell)",
  "materials": [],
  "visibility": "public",
  "metaphysicalProperties": null,
  "subtype": "ceremonial",
  "itemType": "artifact",
  "mediaReferences": {
    "images": [],
    "diagrams": []
  },
  "longDescription": "The shankha or sacred conch shell is a ritual object of profound importance in Hindu and Buddhist traditions, used as both a musical instrument and a container for sacred water. This large sea shell, typically from the Turbinella pyrum species, produces a deep, resonant sound when blown through an opening at its apex. The shell's natural beauty and acoustic properties combine to create an object of both practical and symbolic significance.",
  "searchTerms": [
    "shankha (conch shell)",
    "conch-shell",
    "hindu",
    "buddhist",
    "sacred",
    "ritual",
    "ritual-object"
  ],
  "slug": "conch-shell",
  "primaryMythology": "hindu",
  "type": "item",
  "extendedContent": [],
  "temporal": null,
  "linguistic": null,
  "_enhanced": true,
  "owner": "",
  "significance": "significance. Conch shells are naturally occurring objects harvested from the Indian Ocean, particularly around the coasts of India, Sri Lanka, and the Maldives. The Turbinella pyrum conch grows large enough for ritual use, typically reaching 10-20 centimeters (4-8 inches) in length. The shell's characteristic spiral structure provides both its visual appeal and its acoustic resonance chamber. Most conch shells spiral to the right (dakshinavarti), opening on the right side when the shell is held with its apex pointing upward. Extremely rare left-spiraling shells (vamavarti) are considered especially sacred, believed to house the power of the goddess Lakshmi. Such rare specimens command high prices and receive special veneration. Preparation for ritual use involves cleaning the shell, possibly polishing or decorating it, and often fitting it with a metal mouthpiece for easier blowing. Elaborate ritual conches may be encased in precious metals, decorated with gemstones, or inscribed with mantras. Simple shells serve equally well for basic ritual purposes, with decoration reflecting economic means and ceremonial status. The sound produced by blowing a conch varies by shell and technique. Skilled practitioners produce a steady, pure tone; less experienced blowers create wavering or harsh sounds. The pitch depends on shell size and shape. Large shells produce deeper tones, while smaller shells sound higher. The characteristic conch sound is immediately recognizable and carries considerable distance. Origin and Creation Story According to Hindu mythology, the shankha emerged from the Samudra Manthan (Churning of the Ocean), the cosmic event in which devas (gods) and asuras (demons) churned the primordial ocean to obtain the nectar of immortality. The shankha rose from these primal waters along with other treasures including the goddess Lakshmi and the moon. This origin establishes the conch as a product of cosmic creative action. Vishnu, the Preserver deity, claimed the shankha as one of his attributes. His conch, named Panchajanya, was obtained by defeating a demon of that name and taking his shell. Vishnu's four hands characteristically hold the conch, discus (chakra), mace (gada), and lotus, each representing aspects of his divine function. The conch represents the primordial sound from which creation emerged. The Mahabharata epic describes great conch shells belonging to the major warriors. Krishna blew Panchajanya, Arjuna possessed Devadatta, Bhima owned Paundra, Yudhishthira held Anantavijaya, and others had their named conchs. The blowing of these shells at the battle of Kurukshetra announced the great war's beginning, making the conch sound iconic of epic conflict and heroic resolve. Buddhist tradition received the conch from Hindu culture, reinterpreting it within Buddhist symbolism. In Buddhism, the conch represents the sound of dharma teachings spreading throughout the world. Its inclusion among the eight auspicious symbols (ashtamangala) establishes it as fundamental to Buddhist iconography across Asia. Tibetan Buddhism particularly developed conch symbolism and use. The white right-spiraling conch appears in offerings, rituals, and decorative motifs throughout Tibetan Buddhist culture. Tradition holds that the Buddha's teachings spread in all directions like the conch's sound, blessing all who hear. Ritual Uses and Practices Hindu temple worship employs the conch shell to mark key ritual moments. The sound announces the beginning and end of puja (worship service), accompanies the offering of lights during aarti, and marks transitions between ritual segments. Blowing the conch at dawn and dusk accompanies the opening and closing of temple doors, calling devotees to worship and bidding farewell to the divine for the night. The conch serves as a vessel for sacred water in Hindu ceremonies. Water offered through the conch receives special blessing, believed to carry the shell's sacred vibrations. This water may be sprinkled on devotees for purification, poured over sacred images, or used in other ritual applications. The shell's interior, never fully dry, becomes naturally sanctified through repeated use. Life-cycle ceremonies incorporate conch blowing. Weddings, namings, investitures, and funerals all may include conch sound as auspicious element. The sound drives away evil influences, invokes divine blessing, and marks the ceremony's sacredness. Hearing the conch at such moments signals that important ritual action is occurring. Buddhist ceremonies employ the conch in monastic and temple contexts. The sound may call monks to assembly, accompany chanting, or mark ritual transitions. Tibetan Buddhist practice includes conch offerings among the standard offerings presented to Buddha images. The white right-spiraling conch appears in elaborate offering arrangements. Military and royal contexts historically employed conch sound. Armies sounded conchs before battle and upon victory. Royal ceremonies included conch blowing as sign of sovereignty and divine sanction. Though these uses have diminished, ceremonial occasions may still feature conch sound as mark of traditional authority. Personal practice may include regular conch blowing, believed to purify the home environment and the practitioner's respiratory system. The physical act of blowing requires controlled breath, creating a form of pranayama (breath discipline). Daily conch blowing establishes rhythm and purification in household religious practice. Symbolism and Meaning The shankha symbolizes the primordial sound (Nada Brahma) from which the universe emerged. Hindu cosmology describes creation proceeding from vibration, from sound; the conch's deep tone evokes this original creative impulse. Blowing the conch participates in ongoing creation, renewing the world through sacred sound. The shell's spiral structure symbolizes the expansion of consciousness from a single point to infinite extent. This expansion parallels the universe's emergence from unity into multiplicity. Contemplating the spiral leads the mind from manifest diversity back toward primordial unity, making the conch a meditation object. The conch represents the five elements (pancha mahabhuta). Its sound emerges from air, the shell is a product of water and earth, it reflects fire (light), and its inner space represents ether. This comprehensive symbolism makes the conch a complete representation of material creation. In Buddhist symbolism, the conch represents the sound of dharma teachings spreading in all directions. Just as conch sound carries far, Buddha's wisdom reaches all beings. The right-spiraling shell represents the fortunate way that dharma practice spirals toward enlightenment rather than further into samsara. The conch symbolizes victory and auspiciousness. Its sound announces triumph over enemies, over obstacles, over ignorance. Beginning any endeavor with conch sound invokes success. This auspicious association makes the conch appropriate for ceremonies marking transitions and beginnings. Purity symbolism attaches to the conch's white color and its oceanic origin. Water is universally purifying; the conch, born of primal waters, carries that purity. Offerings made through the conch are purified by contact with its sacred substance. The sound itself purifies the atmosphere through which it travels. Associated Deities and Figures Vishnu, the Preserver deity of the Hindu trinity, holds the conch as one of his four primary attributes. His conch, Panchajanya, produces the cosmic sound that creates and sustains the universe. Images of Vishnu invariably include the conch among his attributes, identifying him as the deity who preserves cosmic order through sacred vibration. Krishna, as an avatar of Vishnu, inherited the conch Panchajanya. His blowing of this shell at the opening of the Kurukshetra battle in the Bhagavad Gita marks one of the conch's most famous mythological appearances. Krishna's conch sound announced the beginning of sacred warfare, dharma yuddha. Lakshmi, goddess of wealth and Vishnu's consort, associates with the conch through her emergence alongside it from the churning ocean. The rare left-spiraling conch is particularly sacred to her, believed to contain her presence and blessings. Worship seeking material prosperity may specifically employ such shells. The Buddha himself, according to iconographic tradition, possessed the marks of a great being including a conch-shaped throat capable of producing teachings that spread throughout the world. This physical characteristic connects the historical Buddha to conch symbolism even before the shell became a Buddhist ritual object. Bodhisattvas in Buddhist tradition may appear holding or associated with conches. The sound of dharma they spread is symbolized by the conch's far-reaching tone. Their compassionate activity reaches all beings just as conch sound penetrates all directions. Hindu temple priests (pujaris) who blow the conch occupy sacred roles. Their skill determines the quality of the ritual sound. Proper technique, proper timing, and proper intention make their service effective. The conch-blower represents the human voice raised in service of divine communication. Historical Accounts and Records The Atharva Veda, among the oldest Hindu scriptures (c. 1200-1000 BCE), mentions the conch as a talisman and ritual object. This early reference establishes the conch's sacred status in Vedic religion, predating later developments in Hindu and Buddhist tradition. The conch has thus been sacred in South Asian culture for three millennia. The Mahabharata (composed between 4th century BCE and 4th century CE) features extended descriptions of warrior conchs and their sounding before battle. These passages establish conch symbolism in epic literature and provide named examples that become touchstones of later tradition. The Kurukshetra conch chorus became archetypal. Buddhist sutras describe the eight auspicious symbols including the conch from early centuries CE. These symbols appear throughout Buddhist Asia in varying configurations. The conch's inclusion demonstrates its importance in Buddhist as well as Hindu tradition. Archaeological finds confirm conch use across South and Southeast Asia from ancient times. Temple sites yield conch shells prepared for ritual use. Iconography in sculpture and painting depicts conch offerings and use. This material evidence corroborates textual accounts. Medieval Hindu texts, particularly Puranas and Agamas, detail proper conch use in temple worship. These texts specify how, when, and by whom conchs should be blown. Such systematic treatment demonstrates developed ritual traditions requiring detailed instruction for proper execution. European observers from the colonial period documented conch use in Hindu and Buddhist ceremonies. These accounts, though sometimes dismissive or misunderstanding, provide external documentation of continuing practice. They show that conch ritual remained vital through the modern period. Modern Use and Replicas Contemporary Hindu temples worldwide continue employing conch shells in worship. Traditional practices persist in India while diaspora communities maintain rituals in their new homelands. The conch's sound remains familiar to practicing Hindus regardless of location, a constant element in diverse ceremonial contexts. Buddhist monasteries and temples, particularly in Tibetan Buddhist traditions, continue conch ritual use. Dharma centers in the West include conchs among ritual implements. The sound accompanies practices from simple daily observances to elaborate initiations and teachings. Conch shells remain available through religious goods suppliers. Quality varies widely, from simple cleaned shells to elaborately decorated specimens. Rare left-spiraling shells command premium prices. The market serves religious practitioners seeking functional ritual objects. Yoga and meditation contexts increasingly incorporate conch sound, sometimes separate from traditional religious frameworks. The deep tone aids focus and marks transitions in practice sessions. Some wellness centers include conch blowing in sound healing offerings. Cultural events celebrating Hindu and Buddhist traditions may feature conch blowing. Festival processions, cultural performances, and religious commemorations include the characteristic sound. Such public events introduce conch tradition to wider audiences. Academic study of conch symbolism, acoustics, and ritual use continues in religious studies, musicology, and anthropology. Scholars document both historical traditions and contemporary practice. This research contributes to understanding the conch's enduring significance across Asian religious cultures. Related Objects and Practices The other attributes of Vishnu, the chakra (discus), gada (mace), and padma (lotus), complement the conch's symbolism. Together they represent protection (chakra), strength (gada), purity (lotus), and primordial sound (shankha). Vishnu iconography consistently includes all four, making them an integrated symbolic set. The eight auspicious symbols (ashtamangala) of Buddhism include the conch alongside the endless knot, lotus, parasol, wheel, vase, fish, and victory banner. These symbols appear together in offerings, decorations, and ritual objects. The conch represents the spread of dharma among these interrelated symbols. Other ritual sound-makers include bells, drums, cymbals, and horns. These instruments create the sonic environment of worship. The conch's unique deep tone complements higher-pitched bells and rhythmic percussion. Together they produce the full soundscape of traditional ceremony. The prayer wheel in Tibetan Buddhism shares the conch's function of spreading dharma. Spinning the wheel multiplies mantras just as the conch's sound spreads in all directions. Both objects embody compassionate activity extending benefit throughout space. Ritual vessels for sacred water include the kalash (pot) alongside the conch. While the conch sanctifies water poured through it, the kalash contains water for offerings. These vessels complement each other in puja and other ceremonies. The shofar of Jewish tradition presents an interesting cross-cultural parallel: a natural horn blown for religious purposes. While culturally distinct, both shofar and shankha represent the voice of tradition calling communities to sacred attention. Comparative study illuminates both specific traditions and broader patterns. Bibliography Primary Sources Bhagavad Gita . Various translations Mahabharata . Various translations Vishnu Purana . Translated by H.H. Wilson. London, 1840 Secondary Sources Eck, Diana L. Darsan: Seeing the Divine Image in India . New York: Columbia University Press, 1998 Beer, Robert. The Handbook of Tibetan Buddhist Symbols . Boston: Shambhala, 2003 Stutley, Margaret. An Illustrated Dictionary of Hindu Iconography . London: Routledge, 1985 Pal, Pratapaditya. Hindu Religion and Iconology . Los Angeles: Vichitra Press, 1981 Online Resources Himalayan Art Resources: Buddhist iconography British Museum: South Asian Collection Victoria and Albert Museum: Indian Art &#128279; Related Across the Mythos Associated Deities &#128331; Vishnu The Preserver Holds Panchajanya conch &#128279; Krishna Avatar of Vishnu Related Items &#128142; Vajra Buddhist/Hindu Symbol &#128276; Bell and Dorje Tibetan Buddhist Traditions &#9758; Hindu/Buddhist Shared Tradition Used in both traditions",
  "enhancedBy": "agent8",
  "origin": "",
  "primarySources": [
    "Bhagavad Gita. Various translations",
    "Mahabharata. Various translations",
    "Vishnu Purana. Translated by H.H. Wilson. London, 1840"
  ],
  "relatedItems": [],
  "description": "The shankha or sacred conch shell is a ritual object of profound importance in Hindu and Buddhist traditions, used as both a musical instrument and a container for sacred water. This large sea shell, typically from the Turbinella pyrum species, produces a deep, resonant sound when blown through an opening at its apex. The shell's natural beauty and acoustic properties combine to create an object of both practical and symbolic significance.",
  "deities": [
    "vishnu",
    "krishna"
  ],
  "updatedAt": "2025-12-26T05:13:50.895Z",
  "_created": "2025-12-27T07:06:12.085Z",
  "icon": "<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 64 64\">\n  <circle cx=\"32\" cy=\"32\" r=\"28.8\" fill=\"#6a5acd\" opacity=\"0.2\"/>\n  <circle cx=\"32\" cy=\"32\" r=\"16\" fill=\"none\" stroke=\"#6a5acd\" stroke-width=\"2\"/>\n  <text x=\"32\" y=\"44.8\" text-anchor=\"middle\" font-size=\"22.4\" fill=\"#6a5acd\">💎</text>\n</svg>",
  "powers": [
    "Mystical properties"
  ],
  "mythology": "hindu",
  "iconType": "svg",
  "_modified": "2025-12-27T07:07:10.459Z",
  "createdAt": "2025-12-27T07:06:12.085Z",
  "metadata": {
    "created": {
      "_seconds": 1766819244,
      "_nanoseconds": 101000000
    },
    "updated": {
      "_seconds": 1766819244,
      "_nanoseconds": 101000000
    }
  },
  "updated_at": "2025-12-27T07:06:55.967Z",
  "history": "historically employed conch sound. Armies sounded conchs before battle and upon victory. Royal ceremonies included conch blowing as sign of sovereignty and divine sanction. Though these uses have diminished, ceremonial occasions may still feature conch sound as mark of traditional authority. Personal practice may include regular conch blowing, believed to purify the home environment and the practitioner's respiratory system. The physical act of blowing requires controlled breath, creating a form of pranayama (breath discipline). Daily conch blowing establishes rhythm and purification in household religious practice. Symbolism and Meaning The shankha symbolizes the primordial sound (Nada Brahma) from which the universe emerged. Hindu cosmology describes creation proceeding from vibration, from sound; the conch's deep tone evokes this original creative impulse. Blowing the conch participates in ongoing creation, renewing the world through sacred sound. The shell's spiral structure symbolizes the expansion of consciousness from a single point to infinite extent. This expansion parallels the universe's emergence from unity into multiplicity. Contemplating the spiral leads the mind from manifest diversity back toward primordial unity, making the conch a meditation object. The conch represents the five elements (pancha mahabhuta). Its sound emerges from air, the shell is a product of water and earth, it reflects fire (light), and its inner space represents ether. This comprehensive symbolism makes the conch a complete representation of material creation. In Buddhist symbolism, the conch represents the sound of dharma teachings spreading in all directions. Just as conch sound carries far, Buddha's wisdom reaches all beings. The right-spiraling shell represents the fortunate way that dharma practice spirals toward enlightenment rather than further into samsara. The conch symbolizes victory and auspiciousness. Its sound announces triumph over enemies, over obstacles, over ignorance. Beginning any endeavor with conch sound invokes success. This auspicious association makes the conch appropriate for ceremonies marking transitions and beginnings. Purity symbolism attaches to the conch's white color and its oceanic origin. Water is universally purifying; the conch, born of primal waters, carries that purity. Offerings made through the conch are purified by contact with its sacred substance. The sound itself purifies the atmosphere through which it travels. Associated Deities and Figures Vishnu, the Preserver deity of the Hindu trinity, holds the conch as one of his four primary attributes. His conch, Panchajanya, produces the cosmic sound that creates and sustains the universe. Images of Vishnu invariably include the conch among his attributes, identifying him as the deity who preserves cosmic order through sacred vibration. Krishna, as an avatar of Vishnu, inherited the conch Panchajanya. His blowing of this shell at the opening of the Kurukshetra battle in the Bhagavad Gita marks one of the conch's most famous mythological appearances. Krishna's conch sound announced the beginning of sacred warfare, dharma yuddha. Lakshmi, goddess of wealth and Vishnu's consort, associates with the conch through her emergence alongside it from the churning ocean. The rare left-spiraling conch is particularly sacred to her, believed to contain her presence and blessings. Worship seeking material prosperity may specifically employ such shells. The Buddha himself, according to iconographic tradition, possessed the marks of a great being including a conch-shaped throat capable of producing teachings that spread throughout the world. This physical characteristic connects the historical Buddha to conch symbolism even before the shell became a Buddhist ritual object. Bodhisattvas in Buddhist tradition may appear holding or associated with conches. The sound of dharma they spread is symbolized by the conch's far-reaching tone. Their compassionate activity reaches all beings just as conch sound penetrates all directions. Hindu temple priests (pujaris) who blow the conch occupy sacred roles. Their skill determines the quality of the ritual sound. Proper technique, proper timing, and proper intention make their service effective. The conch-blower represents the human voice raised in service of divine communication. Historical Accounts and Records The Atharva Veda, among the oldest Hindu scriptures (c. 1200-1000 BCE), mentions the conch as a talisman and ritual object. This early reference establishes the conch's sacred status in Vedic religion, predating later developments in Hindu and Buddhist tradition. The conch has thus been sacred in South Asian culture for three millennia. The Mahabharata (composed between 4th century BCE and 4th century CE) features extended descriptions of warrior conchs and their sounding before battle. These passages establish conch symbolism in epic literature and provide named examples that become touchstones of later tradition. The Kurukshetra conch chorus became archetypal. Buddhist sutras describe the eight auspicious symbols including the conch from early centuries CE. These symbols appear throughout Buddhist Asia in varying configurations. The conch's inclusion demonstrates its importance in Buddhist as well as Hindu tradition. Archaeological finds confirm conch use across South and Southeast Asia from ancient times. Temple sites yield conch shells prepared for ritual use. Iconography in sculpture and painting depicts conch offerings and use. This material evidence corroborates textual accounts. Medieval Hindu texts, particularly Puranas and Agamas, detail proper conch use in temple worship. These texts specify how, when, and by whom conchs should be blown. Such systematic treatment demonstrates developed ritual traditions requiring detailed instruction for proper execution. European observers from the colonial period documented conch use in Hindu and Buddhist ceremonies. These accounts, though sometimes dismissive or misunderstanding, provide external documentation of continuing practice. They show that conch ritual remained vital through the modern period. Modern Use and Replicas Contemporary Hindu temples worldwide continue employing conch shells in worship. Traditional practices persist in India while diaspora communities maintain rituals in their new homelands. The conch's sound remains familiar to practicing Hindus regardless of location, a constant element in diverse ceremonial contexts. Buddhist monasteries and temples, particularly in Tibetan Buddhist traditions, continue conch ritual use. Dharma centers in the West include conchs among ritual implements. The sound accompanies practices from simple daily observances to elaborate initiations and teachings. Conch shells remain available through religious goods suppliers. Quality varies widely, from simple cleaned shells to elaborately decorated specimens. Rare left-spiraling shells command premium prices. The market serves religious practitioners seeking functional ritual objects. Yoga and meditation contexts increasingly incorporate conch sound, sometimes separate from traditional religious frameworks. The deep tone aids focus and marks transitions in practice sessions. Some wellness centers include conch blowing in sound healing offerings. Cultural events celebrating Hindu and Buddhist traditions may feature conch blowing. Festival processions, cultural performances, and religious commemorations include the characteristic sound. Such public events introduce conch tradition to wider audiences. Academic study of conch symbolism, acoustics, and ritual use continues in religious studies, musicology, and anthropology. Scholars document both historical traditions and contemporary practice. This research contributes to understanding the conch's enduring significance across Asian religious cultures. Related Objects and Practices The other attributes of Vishnu, the chakra (discus), gada (mace), and padma (lotus), complement the conch's symbolism. Together they represent protection (chakra), strength (gada), purity (lotus), and primordial sound (shankha). Vishnu iconography consistently includes all four, making them an integrated symbolic set. The eight auspicious symbols (ashtamangala) of Buddhism include the conch alongside the endless knot, lotus, parasol, wheel, vase, fish, and victory banner. These symbols appear together in offerings, decorations, and ritual objects. The conch represents the spread of dharma among these interrelated symbols. Other ritual sound-makers include bells, drums, cymbals, and horns. These instruments create the sonic environment of worship. The conch's unique deep tone complements higher-pitched bells and rhythmic percussion. Together they produce the full soundscape of traditional ceremony. The prayer wheel in Tibetan Buddhism shares the conch's function of spreading dharma. Spinning the wheel multiplies mantras just as the conch's sound spreads in all directions. Both objects embody compassionate activity extending benefit throughout space. Ritual vessels for sacred water include the kalash (pot) alongside the conch. While the conch sanctifies water poured through it, the kalash contains water for offerings. These vessels complement each other in puja and other ceremonies. The shofar of Jewish tradition presents an interesting cross-cultural parallel: a natural horn blown for religious purposes. While culturally distinct, both shofar and shankha represent the voice of tradition calling communities to sacred attention. Comparative study illuminates both specific traditions and broader patterns. Bibliography Primary Sources Bhagavad Gita . Various translations Mahabharata . Various translations Vishnu Purana . Translated by H.H. Wilson. London, 1840 Secondary Sources Eck, Diana L. Darsan: Seeing the Divine Image in India . New York: Columbia University Press, 1998 Beer, Robert. The Handbook of Tibetan Buddhist Symbols . Boston: Shambhala, 2003 Stutley, Margaret. An Illustrated Dictionary of Hindu Iconography . London: Routledge, 1985 Pal, Pratapaditya. Hindu Religion and Iconology . Los Angeles: Vichitra Press, 1981 Online Resources Himalayan Art Resources: Buddhist iconography British Museum: South Asian Collection Victoria and Albert Museum: Indian Art &#128279; Related Across the Mythos Associated Deities &#128331; Vishnu The Preserver Holds Panchajanya conch &#128279; Krishna Avatar of Vishnu Related Items &#128142; Vajra Buddhist/Hindu Symbol &#128276; Bell and Dorje Tibetan Buddhist Traditions &#9758; Hindu/Buddhist Shared Tradition Used in both traditions",
  "_htmlEnrichment": {
    "enrichedAt": "2026-01-01T09:42:10.944Z",
    "sourceFile": "_recovered-html\\FIREBASE\\spiritual-items\\ritual\\conch-shell.html",
    "enrichmentVersion": "1.0"
  }
}