{
  "id": "green-dragon-crescent-blade",
  "longDescription": "Qinglong Yanyue Dao - The Legendary Glaive of Guan Yu The Green Dragon Crescent Blade (Chinese: Qinglong Yanyue Dao) is perhaps the most\n                    famous weapon in Chinese literature and folklore, the legendary glaive wielded by\n                    Guan Yu during the tumultuous Three Kingdoms period (220-280 CE). This massive\n                    pole weapon has become an enduring symbol of Chinese martial tradition, loyalty,\n                    and righteousness.",
  "migrationDate": "2025-12-13T10:16:35.561Z",
  "geographical": null,
  "itemType": "weapon",
  "sources": [],
  "searchTerms": [
    "green dragon crescent blade",
    "green-dragon-crescent-blade",
    "chinese",
    "three kingdoms",
    "historical legend",
    "guan di",
    "weapon"
  ],
  "icon": "⚔️",
  "type": "item",
  "colors": null,
  "linguistic": null,
  "subtype": "divine-weapon",
  "extendedContent": [
    {
      "title": "Description and Appearance",
      "content": "The Green Dragon Crescent Blade (Chinese: Qinglong Yanyue Dao) is perhaps the most\n                    famous weapon in Chinese literature and folklore, the legendary glaive wielded by\n                    Guan Yu during the tumultuous Three Kingdoms period (220-280 CE). This massive\n                    pole weapon has become an enduring symbol of Chinese martial tradition, loyalty,\n                    and righteousness.\n                \n                \n                    The weapon's name derives from its distinctive crescent-shaped blade, said to\n                    resemble a dragon's sweeping form. The \"Green Dragon\" refers both to the azure-green\n                    color traditionally associated with the blade and to the dragon imagery that\n                    symbolizes power, wisdom, and divine favor in Chinese culture.\n                \n                \n                    According to the Romance of the Three Kingdoms, the blade weighed 82 jin\n                    (approximately 41 kilograms or 90 pounds in modern measurements). This extraordinary\n                    weight meant that only someone of Guan Yu's legendary strength could effectively\n                    wield it in battle - the weapon itself became proof of his superhuman prowess."
    },
    {
      "title": "Guan Yu and His Blade",
      "content": "The Historical and Legendary Figure\n                \n                    Guan Yu (died 220 CE) was a general serving under the warlord Liu Bei during the\n                    late Eastern Han dynasty and Three Kingdoms period. While historically documented,\n                    Guan Yu's legend has grown far beyond historical records through centuries of\n                    storytelling, culminating in the 14th-century novel Romance of the Three Kingdoms.\n                \n                \n                    In both history and legend, Guan Yu is remembered as the paragon of loyalty and\n                    righteousness. His bond with Liu Bei and Zhang Fei - the famous \"Oath of the Peach\n                    Garden\" - became the model of sworn brotherhood. His refusal to betray Liu Bei\n                    even when offered wealth and position by Cao Cao exemplifies the Chinese ideal\n                    of yi (righteousness/loyalty).\n                \n\n                Famous Deeds with the Blade\n                \n                    The Romance of the Three Kingdoms describes numerous legendary feats performed by\n                    Guan Yu with his Green Dragon Crescent Blade:\n                \n                \n                    Slaying Hua Xiong: In his first major battle, Guan Yu killed\n                    the feared general Hua Xiong before the wine offered to him had cooled - a feat\n                    that established his reputation overnight\n                    Passing Five Passes: When returning to Liu Bei's service,\n                    Guan Yu fought his way through five passes, killing six generals who blocked his\n                    path, all with his great blade\n                    Single Combat Victories: Guan Yu defeated numerous champions\n                    in single combat, with his blade cleaving through opponents and their weapons alike\n                    Night Operations: The blade was said to glow with ethereal\n                    light during night battles, visible across the battlefield"
    },
    {
      "title": "Symbolism and Cultural Impact",
      "content": "Deification of Guan Yu\n                \n                    Following his death, Guan Yu was gradually deified, eventually becoming known as\n                    Guan Di (Emperor Guan) or Guan Gong (Lord Guan). He is worshipped as the God of\n                    War, patron of soldiers and martial artists, but also paradoxically as a god of\n                    literature and wealth. Temples to Guan Di exist throughout China and wherever\n                    Chinese communities have settled.\n                \n                \n                    The Green Dragon Crescent Blade appears in virtually every depiction of Guan Di,\n                    becoming inseparable from his image. The weapon represents not just martial power\n                    but the righteous application of force - violence in service of justice and loyalty.\n                \n\n                Martial Arts Influence\n                \n                    The guandao (a generic term for this type of weapon, literally \"Guan's blade\")\n                    became a standard weapon in Chinese martial arts, inspired by Guan Yu's legendary\n                    weapon. Numerous martial arts schools teach guandao techniques, and the weapon\n                    appears in traditional forms and demonstrations.\n                \n                \n                    In martial arts symbolism, the guandao represents mastery over great power. The\n                    difficulty of wielding such a heavy, long weapon makes it a test of strength,\n                    skill, and dedication - qualities associated with Guan Yu himself.\n                \n\n                Symbol of Righteousness\n                \n                    The blade has come to symbolize righteous power throughout Chinese culture. Police\n                    stations, government buildings, and even businesses often display images of Guan Yu\n                    with his blade as protection against evil and corruption. The weapon represents\n                    justice that is strong enough to enforce itself."
    },
    {
      "title": "Modern Depictions",
      "content": "Film and Television\n                \n                    Red Cliff (2008-2009): Features Guan Yu wielding the blade in\n                    spectacular battle sequences\n                    Numerous Three Kingdoms Adaptations: Every film and TV version\n                    prominently features Guan Yu and his iconic weapon\n                    Dynasty Warriors Series: The video game franchise features\n                    Guan Yu as a playable character with his signature weapon\n                \n\n                Video Games\n                \n                    Dynasty Warriors/Warriors Orochi: Guan Yu is a central character\n                    SMITE: Features Guan Yu as a playable god\n                    Total War: Three Kingdoms: Guan Yu appears as a legendary general\n                    Honor of Kings: Popular Chinese mobile game featuring Guan Yu\n                \n\n                Cultural Presence\n                \n                    Statues of Guan Yu with his blade stand throughout the Chinese-speaking world.\n                    The largest, in Jingzhou, China, stands 58 meters tall. The weapon continues to\n                    be a popular subject for traditional craftsmen, martial arts practitioners, and\n                    modern artists alike."
    }
  ],
  "mythologies": [
    "three kingdoms",
    "historical legend",
    "chinese",
    "guan di"
  ],
  "slug": "green-dragon-crescent-blade",
  "temporal": null,
  "primaryMythology": "three kingdoms",
  "visibility": "public",
  "shortDescription": "Qinglong Yanyue Dao - The Legendary Glaive of Guan Yu",
  "mythologyContexts": [],
  "tags": [
    "chinese",
    "three kingdoms",
    "historical legend",
    "guan di",
    "weapon",
    "green-dragon-crescent-blade"
  ],
  "wielders": [
    "Guan Yu (Lord Guan / Guan Di)"
  ],
  "cultural": null,
  "mediaReferences": {
    "images": [],
    "diagrams": []
  },
  "migratedFrom": "legacy-repository",
  "createdBy": [],
  "materials": [],
  "name": "Green Dragon Crescent Blade",
  "powers": [],
  "relatedEntities": null,
  "metaphysicalProperties": null,
  "status": "published"
}