{
  "id": "laevateinn",
  "longDescription": "The Damage Twig - Loki's Mysterious Weapon of Destruction Laevateinn (Old Norse: \"Damage Twig\" or \"Wounding Wand\") is one of the most\n                    enigmatic weapons in Norse mythology, mentioned only in the Eddic poem Fjolsvinnsmal.\n                    This mysterious weapon was forged by Loki (called Lopt in the poem) and is kept\n                    locked in a chest guarded by Sinmara, often identified as the wife of the fire\n                    giant Surtr.",
  "migrationDate": "2025-12-13T10:16:35.703Z",
  "geographical": null,
  "itemType": "weapon",
  "sources": [],
  "searchTerms": [
    "laevateinn",
    "norse",
    "eddic",
    "magical weapon",
    "weapon"
  ],
  "icon": "⚔️",
  "type": "item",
  "colors": null,
  "linguistic": null,
  "subtype": "divine-weapon",
  "extendedContent": [
    {
      "title": "Description and Nature",
      "content": "Laevateinn (Old Norse: \"Damage Twig\" or \"Wounding Wand\") is one of the most\n                    enigmatic weapons in Norse mythology, mentioned only in the Eddic poem Fjolsvinnsmal.\n                    This mysterious weapon was forged by Loki (called Lopt in the poem) and is kept\n                    locked in a chest guarded by Sinmara, often identified as the wife of the fire\n                    giant Surtr.\n                \n                \n                    The exact nature of Laevateinn is debated by scholars. The name suggests either\n                    a wand or staff (\"damage twig\"), but many interpretations and later traditions\n                    present it as a sword. Some scholars believe it may be the same weapon as Surtr's\n                    flaming sword, which will be used to destroy the world at Ragnarok.\n                \n                \n                    What makes Laevateinn particularly significant is its stated purpose: it is the\n                    only weapon capable of killing Vidofnir, the golden rooster that sits atop the\n                    world tree Yggdrasil (or, in some interpretations, another cosmic tree called\n                    Mimameidr). This specificity suggests the weapon was created for a particular\n                    cosmic purpose."
    },
    {
      "title": "Source: Fjolsvinnsmal",
      "content": "Laevateinn appears in only one source: the Eddic poem Fjolsvinnsmal (The Lay of\n                    Fjolsvinnr), which takes the form of a question-and-answer dialogue. In this poem,\n                    the hero Svipdag questions the giant Fjolsvinnr about the mysteries of a fortress\n                    and its surroundings.\n                \n                \n                    The relevant passage describes Laevateinn as the only weapon that can kill Vidofnir:"
    },
    {
      "title": "Scholarly Interpretations",
      "content": "Surtr's Flaming Sword\n                \n                    Some scholars identify Laevateinn with the flaming sword that Surtr will wield at\n                    Ragnarok to destroy the gods and set the world on fire. If Sinmara is indeed Surtr's\n                    wife, it makes sense that she would guard her husband's weapon. The idea that Loki\n                    made this weapon aligns with his role as the instigator of Ragnarok.\n                \n\n                Mistletoe Theory\n                \n                    Another interpretation connects Laevateinn to the mistletoe that killed Baldr.\n                    Loki fashioned the mistletoe dart that Hodr used to kill the beloved god. The\n                    name \"damage twig\" could describe this small but deadly weapon. This theory\n                    positions Laevateinn as an instrument of Loki's betrayal.\n                \n\n                Magical Staff\n                \n                    Taking the name literally as \"wounding wand,\" some interpret Laevateinn as a\n                    magical staff or scepter rather than a sword. Such an object would fit Loki's\n                    sorcerous nature better than a conventional blade and aligns with the tradition\n                    of powerful magical implements in Norse mythology.\n                \n\n                Symbol of Inevitable Doom\n                \n                    From a mythological perspective, Laevateinn may represent the inevitability of\n                    cosmic destruction. Just as Vidofnir cannot be killed without it, the destruction\n                    of the world at Ragnarok cannot occur without Loki's machinations. The circular\n                    paradox of obtaining the weapon reflects the inescapable nature of fate."
    },
    {
      "title": "Modern Depictions",
      "content": "Despite its obscurity in the original sources, Laevateinn has become popular in\n                    modern fantasy and gaming:\n                \n                \n                    Fate Series: Features Laevateinn as a powerful flaming sword,\n                    one of the more prominent modern depictions\n                    Final Fantasy: Various entries include Laevateinn as a weapon\n                    Shin Megami Tensei: Features the weapon in connection with\n                    Norse mythology references\n                    Various Anime/Manga: Often depicted as a flaming sword or\n                    magical weapon associated with fire and destruction\n                    Fantasy Literature: Appears in numerous Norse-inspired\n                    fantasy works, usually as a sword of fire\n                \n                \n                    Most modern depictions interpret Laevateinn as a flaming sword, reflecting the\n                    connection to Surtr and Ragnarok rather than the \"wand\" interpretation suggested\n                    by the original name."
    }
  ],
  "mythologies": [
    "norse",
    "magical weapon",
    "eddic"
  ],
  "slug": "laevateinn",
  "temporal": null,
  "primaryMythology": "norse",
  "visibility": "public",
  "shortDescription": "The Damage Twig - Loki's Mysterious Weapon of Destruction",
  "mythologyContexts": [],
  "tags": [
    "norse",
    "eddic",
    "magical weapon",
    "weapon",
    "laevateinn"
  ],
  "wielders": [],
  "cultural": null,
  "mediaReferences": {
    "images": [],
    "diagrams": []
  },
  "migratedFrom": "legacy-repository",
  "createdBy": [
    "Lopt (Loki)"
  ],
  "materials": [],
  "name": "Laevateinn",
  "powers": [
    "Only weapon capable of killing Vidofnir"
  ],
  "relatedEntities": null,
  "metaphysicalProperties": null,
  "status": "published"
}