{
  "id": "poseidon-trident",
  "longDescription": "The Three-Pronged Scepter of the Sea Lord The Trident of Poseidon stands as one of the most recognizable divine weapons\n                    in Greek mythology, the three-pronged spear that symbolizes the sea god's\n                    dominion over the oceans, earthquakes, and horses. This mighty weapon is\n                    inseparable from Poseidon's identity - in virtually every ancient depiction,\n                    the god holds his trident as both weapon and scepter of his underwater kingdom.",
  "migrationDate": "2025-12-13T10:16:35.813Z",
  "geographical": null,
  "itemType": "weapon",
  "sources": [],
  "searchTerms": [
    "poseidon's trident",
    "poseidon-trident",
    "greek",
    "olympian",
    "divine weapon",
    "weapon"
  ],
  "icon": "⚔️",
  "type": "item",
  "colors": null,
  "linguistic": null,
  "subtype": "divine-weapon",
  "extendedContent": [
    {
      "title": "Description and Nature",
      "content": "The Trident of Poseidon stands as one of the most recognizable divine weapons\n                    in Greek mythology, the three-pronged spear that symbolizes the sea god's\n                    dominion over the oceans, earthquakes, and horses. This mighty weapon is\n                    inseparable from Poseidon's identity - in virtually every ancient depiction,\n                    the god holds his trident as both weapon and scepter of his underwater kingdom.\n                \n                \n                    The trident's three prongs represent Poseidon's threefold domain: the surface\n                    of the sea, its depths, and the creatures within it. Some interpretations\n                    connect the prongs to past, present, and future, or to birth, life, and death\n                    as they relate to the sea's power to give and take life.\n                \n                \n                    As a symbol, the trident transcended Greek religion to become a universal\n                    emblem of maritime power. Roman Neptune inherited the weapon along with\n                    Poseidon's attributes, and the trident remains associated with naval imagery\n                    to this day."
    },
    {
      "title": "Origin and the Titanomachy",
      "content": "Forged by the Cyclopes\n                \n                    The trident was forged by the Elder Cyclopes - Brontes (Thunder), Steropes\n                    (Lightning), and Arges (Brightness) - during the Titanomachy, the great war\n                    between the Olympian gods and the Titans. These three sons of Uranus and\n                    Gaia had been imprisoned in Tartarus by Cronus but were freed by Zeus to\n                    aid the Olympians.\n                \n                \n                    In gratitude and as weapons for the war, the Cyclopes forged three divine\n                    instruments: the thunderbolt for Zeus, the helm of invisibility for Hades,\n                    and the trident for Poseidon. These weapons proved decisive in the Olympians'\n                    victory, each embodying dominion over a realm of the cosmos.\n                \n\n                Symbol of Cosmic Division\n                \n                    After the Titans' defeat, the three brothers - Zeus, Poseidon, and Hades -\n                    divided the universe among themselves. Zeus received the sky, Hades the\n                    underworld, and Poseidon the seas. The trident became both weapon and\n                    symbol of Poseidon's sovereignty over his watery domain, just as the\n                    thunderbolt represented Zeus's rule of the heavens."
    },
    {
      "title": "Famous Mythological Appearances",
      "content": "The Contest for Athens\n                \n                    When Poseidon and Athena competed for patronage of the city that would\n                    become Athens, both offered gifts. Poseidon struck the Acropolis with\n                    his trident, producing either a saltwater spring or (in some versions)\n                    the first horse. Athena offered the olive tree. The citizens chose\n                    Athena's gift, and Poseidon's anger at losing caused him to flood the\n                    Thriasian plain.\n                \n\n                The Odyssey\n                \n                    Throughout the Odyssey, Poseidon uses his trident's powers to torment\n                    Odysseus for blinding the Cyclops Polyphemus, Poseidon's son. The god\n                    raises storms and shipwrecks that extend Odysseus's journey for years.\n                \n\n                The Trojan War\n                \n                    During the Trojan War, Poseidon used his trident to aid the Greeks,\n                    building the walls of Troy (which he later helped destroy) and\n                    intervening in various battles. His earthquake powers shook the\n                    battlefield when he walked."
    }
  ],
  "mythologies": [
    "olympian",
    "greek",
    "divine weapon"
  ],
  "slug": "poseidon-trident",
  "temporal": null,
  "primaryMythology": "olympian",
  "visibility": "public",
  "shortDescription": "The Three-Pronged Scepter of the Sea Lord",
  "mythologyContexts": [],
  "tags": [
    "greek",
    "olympian",
    "divine weapon",
    "weapon",
    "poseidon-trident"
  ],
  "wielders": [
    "Poseidon, God of the Sea"
  ],
  "cultural": null,
  "mediaReferences": {
    "images": [],
    "diagrams": []
  },
  "migratedFrom": "legacy-repository",
  "createdBy": [
    "The Cyclopes (Elder Cyclopes)"
  ],
  "materials": [],
  "name": "Poseidon's Trident",
  "powers": [
    "Control over seas, earthquakes, and horses"
  ],
  "relatedEntities": null,
  "metaphysicalProperties": null,
  "status": "published"
}