{
  "id": "love",
  "type": "archetype",
  "name": "The Love Goddess Archetype",
  "definition": "",
  "mythology": {
    "crossCulturalComparisons": [
      {
        "tradition": "Greek",
        "deity": "Aphrodite",
        "attributes": "Goddess of love, beauty, desire, sexuality, born from sea foam",
        "matchPercent": null
      },
      {
        "tradition": "Roman",
        "deity": "Venus",
        "attributes": "Love, beauty, fertility, victory; mother of Rome via Aeneas",
        "matchPercent": null
      },
      {
        "tradition": "Sumerian/Babylonian",
        "deity": "Inanna/Ishtar",
        "attributes": "Queen of Heaven, love, sex, war, fertility, political power",
        "matchPercent": null
      },
      {
        "tradition": "Norse",
        "deity": "Freyja",
        "attributes": "Love, beauty, fertility, magic, war, death; keeper of Brísingamen",
        "matchPercent": null
      },
      {
        "tradition": "Yoruba",
        "deity": "Oshun",
        "attributes": "River goddess, love, beauty, sensuality, fertility, wealth",
        "matchPercent": null
      },
      {
        "tradition": "Egyptian",
        "deity": "Hathor",
        "attributes": "Love, joy, motherhood, music, dance; Eye of Ra destroyer aspect",
        "matchPercent": null
      },
      {
        "tradition": "Phoenician/Canaanite",
        "deity": "Astarte",
        "attributes": "Fertility, sexuality, war; evening star, sacred prostitution",
        "matchPercent": null
      },
      {
        "tradition": "Aztec",
        "deity": "Xochiquetzal",
        "attributes": "Flowers, love, beauty, pregnancy, weaving, female sexuality",
        "matchPercent": null
      },
      {
        "tradition": "Hindu",
        "deity": "Rati",
        "attributes": "Goddess of love, lust, carnal desire; consort of Kamadeva",
        "matchPercent": null
      },
      {
        "tradition": "Vodou",
        "deity": "Erzulie Freda",
        "attributes": "Love, beauty, luxury, flowers, jewelry, femininity, romance",
        "matchPercent": null
      },
      {
        "tradition": "Etruscan",
        "deity": "Turan",
        "attributes": "Love, vitality, beauty; equivalent to Aphrodite/Venus",
        "matchPercent": null
      },
      {
        "tradition": "Japanese",
        "deity": "Benzaiten",
        "attributes": "Love, music, eloquence, water, wisdom; adapted from Saraswati",
        "matchPercent": null
      }
    ],
    "universalPatterns": [
      "Divine Beauty",
      "Power of Desire",
      "Fertility & Procreation",
      "Unconventional Birth",
      "Sacred Sexuality",
      "Duality of Love",
      "Symbols of Beauty",
      "Springtime & Renewal",
      "Marriage & Union",
      "Shadow Aspects",
      "War + Love Paradox"
    ],
    "traditions": [
      "Greek",
      "Roman",
      "Sumerian/Babylonian",
      "Norse",
      "Yoruba",
      "Egyptian",
      "Phoenician/Canaanite",
      "Aztec",
      "Hindu",
      "Vodou",
      "Etruscan",
      "Japanese"
    ]
  },
  "examples": [
    {
      "tradition": "Greek",
      "name": "Aphrodite",
      "link": "../../mythos/greek/deities/aphrodite.html",
      "matchPercent": null,
      "attributes": "Goddess of love, beauty, desire, sexuality, born from sea foam",
      "domains": "Dove, rose, myrtle, swan, shell"
    },
    {
      "tradition": "Roman",
      "name": "Venus",
      "link": "../../mythos/roman/deities/venus.html",
      "matchPercent": null,
      "attributes": "Love, beauty, fertility, victory; mother of Rome via Aeneas",
      "domains": "Dove, rose, myrtle, shell"
    },
    {
      "tradition": "Sumerian/Babylonian",
      "name": "Inanna/Ishtar",
      "link": "../../mythos/sumerian/deities/inanna.html",
      "matchPercent": null,
      "attributes": "Queen of Heaven, love, sex, war, fertility, political power",
      "domains": "Eight-pointed star, lion, dove"
    },
    {
      "tradition": "Norse",
      "name": "Freyja",
      "link": "../../mythos/norse/deities/freya.html",
      "matchPercent": null,
      "attributes": "Love, beauty, fertility, magic, war, death; keeper of Brísingamen",
      "domains": "Cat, boar, falcon cloak, amber"
    },
    {
      "tradition": "Yoruba",
      "name": "Oshun",
      "link": "../../mythos/yoruba/deities/oshun.html",
      "matchPercent": null,
      "attributes": "River goddess, love, beauty, sensuality, fertility, wealth",
      "domains": "River, peacock, mirror, honey"
    },
    {
      "tradition": "Egyptian",
      "name": "Hathor",
      "link": "../../mythos/egyptian/deities/hathor.html",
      "matchPercent": null,
      "attributes": "Love, joy, motherhood, music, dance; Eye of Ra destroyer aspect",
      "domains": "Cow, sistrum, mirror, menat"
    },
    {
      "tradition": "Phoenician/Canaanite",
      "name": "Astarte",
      "link": "",
      "matchPercent": null,
      "attributes": "Fertility, sexuality, war; evening star, sacred prostitution",
      "domains": "Star, lion, horse, sphinx"
    },
    {
      "tradition": "Aztec",
      "name": "Xochiquetzal",
      "link": "../../mythos/aztec/deities/index.html",
      "matchPercent": null,
      "attributes": "Flowers, love, beauty, pregnancy, weaving, female sexuality",
      "domains": "Quetzal bird, marigolds, butterflies"
    },
    {
      "tradition": "Hindu",
      "name": "Rati",
      "link": "../../mythos/hindu/deities/rati.html",
      "matchPercent": null,
      "attributes": "Goddess of love, lust, carnal desire; consort of Kamadeva",
      "domains": "Lotus, parrot, bow and arrows"
    },
    {
      "tradition": "Vodou",
      "name": "Erzulie Freda",
      "link": "",
      "matchPercent": null,
      "attributes": "Love, beauty, luxury, flowers, jewelry, femininity, romance",
      "domains": "Heart, mirror, perfume, pink"
    },
    {
      "tradition": "Etruscan",
      "name": "Turan",
      "link": "",
      "matchPercent": null,
      "attributes": "Love, vitality, beauty; equivalent to Aphrodite/Venus",
      "domains": "Dove, swan, black wings"
    },
    {
      "tradition": "Japanese",
      "name": "Benzaiten",
      "link": "../../mythos/japanese/deities/index.html",
      "matchPercent": null,
      "attributes": "Love, music, eloquence, water, wisdom; adapted from Saraswati",
      "domains": "Biwa (lute), white snake, water"
    }
  ],
  "characteristics": [
    {
      "name": "Divine Beauty",
      "description": "Embodiment of physical and spiritual beauty, irresistible to mortals and immortals"
    },
    {
      "name": "Power of Desire",
      "description": "Commands attraction and sexual desire, even over supreme gods"
    },
    {
      "name": "Fertility & Procreation",
      "description": "Governs reproduction, childbirth, and life-giving forces"
    },
    {
      "name": "Unconventional Birth",
      "description": "Often born from extraordinary means (sea foam, cosmic egg, unusual circumstances)"
    },
    {
      "name": "Sacred Sexuality",
      "description": "Associated with temple prostitution, sacred marriage rites, ritual sexuality"
    },
    {
      "name": "Duality of Love",
      "description": "Both nurturing, tender love AND destructive, obsessive passion"
    },
    {
      "name": "Symbols of Beauty",
      "description": "Roses, doves, mirrors, shells, swans, myrtle, golden apples"
    },
    {
      "name": "Springtime & Renewal",
      "description": "Connected to seasonal rebirth, flowering, and natural cycles"
    },
    {
      "name": "Marriage & Union",
      "description": "Presides over sacred marriages, partnerships, and hierogamy"
    },
    {
      "name": "Shadow Aspects",
      "description": "Vanity, jealousy, possessiveness, destructive rage when scorned"
    },
    {
      "name": "War + Love Paradox",
      "description": "Many love goddesses also possess warrior/destructive aspects"
    }
  ],
  "symbolism": {
    "the_love_war_paradox": {
      "title": "The Love-War Paradox",
      "description": "One of the most striking patterns in the Love Goddess archetype is the frequent association with warfare and destruction: This paradox reveals a profound truth: passionate love and destructive rage spring from the same source. The intensity of desire, when thwarted or betrayed, transforms into consuming fury. The Love Goddess embodies the totality of erotic power—creative and destructive, life-giving and death-dealing.",
      "points": [
        "Inanna / Ishtar : \"Lady of Battle\" who rains fire on enemies while also being goddess of sexual love",
        "Freyja : Receives half of slain warriors in Fólkvangr; goddess of love, beauty, and death",
        "Hathor / Sekhmet : Transforms from nurturing mother to bloodthirsty destroyer (Eye of Ra )",
        "Astarte: Phoenician goddess of both love and war , riding into battle",
        "Aphrodite : Though primarily love goddess, some traditions show her armed and victorious"
      ]
    },
    "sacred_sexuality_and_temple_worship": {
      "title": "Sacred Sexuality and Temple Worship",
      "description": "Many Love Goddesses presided over sacred prostitution and ritualized sexuality: In these traditions, sexuality was not profane but sacred —a means of participating in divine creative power, ensuring fertility, and experiencing the goddess's transformative energy.",
      "points": [
        "Inanna / Ishtar : Temple prostitutes (qadishtu) served in her temples; sacred marriage rites",
        "Aphrodite : Temple courtesans at Corinth; sacred sexuality as worship",
        "Astarte: Sacred prostitution in Phoenician temples",
        "Freyja : Accused by Loki of sleeping with all gods and elves; sexuality as power"
      ]
    },
    "symbols_and_sacred_objects": {
      "title": "Symbols and Sacred Objects",
      "description": "Love Goddesses share remarkable symbolic consistency across cultures:",
      "points": [
        "Dove/Bird: Aphrodite, Inanna, Astarte—symbol of love, grace, and the soul",
        "Rose/Flowers: Aphrodite (rose), Xochiquetzal (flowers)—beauty, transience, unfolding love",
        "Mirror: Hathor, Oshun, Aphrodite—self-reflection, vanity, beauty, truth",
        "Shell: Aphrodite (scallop shell), Oshun (cowrie)—birth from water, vulva symbol, fertility",
        "Cat/Feline: Freyja (cats), Hathor (lioness)—sensuality, independence, predatory sexuality",
        "Star: Inanna (Venus/morning star), Astarte—celestial beauty, unreachable perfection",
        "Water: Oshun (river), Aphrodite (sea), Benzaiten (water)—fertility, fluidity, life-source"
      ]
    },
    "psychological_and_archetypal_significance": {
      "title": "Psychological and Archetypal Significance",
      "description": "The Love Goddess represents fundamental human experiences:",
      "points": [
        "Eros vs. Agape: Passionate, embodied desire (eros) versus spiritual, selfless love (agape)",
        "Beauty as Power: Physical beauty not as superficiality but as divine force that commands attention, desire, and devotion",
        "Sacred vs. Profane Love: Sexuality as path to the divine versus mere physical gratification",
        "Transformative Passion: Love's power to utterly transform the lover, for good or ill",
        "The Mirror (Self-Love): The goddess's vanity reflects necessity of self-love before loving others",
        "Creativity: Love as generative force—both biological (procreation) and artistic (beauty, art, poetry)",
        "Wounded Love: Many love goddesses experience rejection, loss, or betrayal (Aphrodite/Adonis, Freyja/Óðr, Inanna/Dumuzi)",
        "The Eternal Feminine: Anima figure in Jungian psychology; the idealized feminine that draws forth devotion"
      ]
    },
    "cross_cultural_parallels_and_connections": {
      "title": "Cross-Cultural Parallels and Connections",
      "description": "Historical and cultural diffusion patterns:",
      "points": [
        "Near Eastern Origin: Inanna → Ishtar → Astarte → Aphrodite → Venus (direct cultural transmission)",
        "Born from Water: Aphrodite (sea foam), Oshun (river), Benzaiten (water)—universal fertility symbolism",
        "Animal Companions: Dove (Mediterranean), cat (Norse/Egyptian), peacock (Yoruba)—beauty and grace",
        "Spring/Renewal: Associated with seasonal return, flowering, rebirth after winter death",
        "Music and Dance: Hathor (music), Benzaiten (biwa), Oshun (dance)—arts of seduction and joy"
      ]
    },
    "the_rose": {
      "title": "The Rose",
      "description": "The rose is the quintessential symbol of the Love Goddess, particularly Aphrodite and Venus:",
      "points": [
        "Beauty and Thorns: Love's beauty accompanied by pain; pleasure and suffering intertwined",
        "Unfolding Petals: The gradual revelation of beauty; the opening of the heart",
        "Red Color: Passion, blood, sacrifice (Aphrodite's blood stained white roses red mourning Adonis)",
        "Fragrance: Sensual allure; beauty perceived through senses beyond sight",
        "Transience: Beauty's fleeting nature; love's bloom and fade"
      ]
    },
    "the_mirror": {
      "title": "The Mirror",
      "description": "The mirror appears consistently in Love Goddess iconography (Hathor, Oshun, Aphrodite):",
      "points": [
        "Self-Reflection: Knowledge of one's own beauty; self-awareness",
        "Vanity: The shadow aspect—excessive self-regard, narcissism",
        "Truth: Mirrors reveal reality without flattery; honest self-perception",
        "Self-Love: Necessary foundation for loving others; divine self-regard",
        "Portal to the Soul: \"Mirror of the soul\"; seeing one's true self"
      ]
    },
    "the_dove": {
      "title": "The Dove",
      "description": "The dove is sacred to Aphrodite, Inanna, Astarte, and appears across Love Goddess traditions:",
      "points": [
        "Gentle Grace: Softness, peace, gentleness of love's nurturing aspect",
        "Mating for Life: Fidelity, partnership, devoted love",
        "Cooing Calls: Love's tender communication; the language of affection",
        "Flight: Love's transcendent, uplifting power",
        "White Feathers: Purity, innocence (though love goddesses are rarely \"innocent\")"
      ]
    },
    "sacred_marriage_hieros_gamos_": {
      "title": "Sacred Marriage (Hieros Gamos)",
      "description": "The Love Goddess often participates in sacred marriage rites, particularly evident with Inanna:",
      "points": [
        "Inanna & Dumuzi: Annual ritual reenacting divine union; ensuring fertility",
        "Aphrodite & Anchises: Divine-mortal union producing hero Aeneas",
        "Hathor & Horus: Annual sacred marriage at Dendera temple",
        "Cosmic Union: Heaven and earth, divine and mortal, masculine and feminine united",
        "Fertility Magic: Royal or priestly couples embodying deities to ensure land's abundance"
      ]
    },
    "related_content": {
      "title": "Related Content",
      "description": "",
      "points": [
        "Aphrodite - Greek foam-born goddess of love and beauty",
        "Inanna - Sumerian Queen of Heaven, love and war",
        "Freyja - Norse goddess of love, magic, and the slain",
        "Hathor - Egyptian goddess of love, joy, and music",
        "Oshun - Yoruba river goddess of love and fertility",
        "Great Goddess - Divine feminine power",
        "Earth Mother - Fertility and nurturing",
        "War God - Love-War paradox",
        "Dying God - Beloved consorts (Adonis, Dumuzi)",
        "Death & Underworld",
        "Trickster",
        "Divine Twins",
        "Moon Deity",
        "Cross-Reference Matrix"
      ]
    }
  },
  "primarySources": [
    {
      "citation": "Hesiod, Theogony:188-206",
      "text": "\"And so soon as he had cut off the members with flint and cast them from the land into the surging sea, they were swept away over the main a long time: and a white foam spread around them from the immortal flesh, and in it there grew a maiden. First she drew near holy Cythera, and from there, afterwards, she came to sea-girt Cyprus, and came forth an awful and lovely goddess, and grass grew up about her beneath her shapely feet. Her gods and men call Aphrodite, and the foam-born goddess because she grew amid the foam... and also Cytherea because she reached Cythera... Eros accompanied her, and comely Desire followed her at her birth at the first and as she went into the assembly of the gods.\"",
      "source": ""
    },
    {
      "citation": "Homeric Hymn to Aphrodite:1-6",
      "text": "\"Muse, tell me the deeds of golden Aphrodite the Cyprian, who stirs up sweet passion in the gods and subdues the tribes of mortal men and birds that fly in air and all the many creatures that the dry land rears, and all that the sea: all these love the deeds of rich-crowned Cytherea.\"",
      "source": ""
    },
    {
      "citation": "Homeric Hymn to Aphrodite:1-44",
      "text": "\"For though she is golden, yet even Zeus she bends to her will as she pleases, and mates the immortal gods with mortal women, and makes mortal women subject to the immortals... Only three she cannot persuade or deceive: the bright-eyed maiden Athena, daughter of Zeus who holds the aegis, nor Artemis, nor Hestia the pure. But of all the others there is none among the blessed gods or among mortal men that has escaped Aphrodite.\"",
      "source": ""
    },
    {
      "citation": "Homeric Hymn to Aphrodite:45-57",
      "text": "\"But Zeus put in her [Aphrodite's] heart sweet desire to mate with a mortal man, so that even she might not for long be innocent of a mortal's love, lest laughing Aphrodite should mock all the gods and goddesses and say that she had joined them in love with mortal women, who bore to the immortals mortal sons, and had mated the goddesses with mortal men. And so he put in her heart sweet desire for Anchises... When she saw him, Aphrodite, lover of smiles, loved him, and dreadful desire seized her in her heart.\"",
      "source": ""
    },
    {
      "citation": "Ovid, Metamorphoses:10.525-532",
      "text": "\"Even Venus [Aphrodite] was not proof against his [Adonis's] beauty; and as for him, he knew not what it was to love. While hunting through the woods, he started up a wild boar from its lair... The beast turned fiercely on him and buried its teeth deep in the young man's groin, and stretched him dying on the yellow sand. Venus, borne through the air in her light chariot drawn by swans... heard from afar his dying groans; and thither she turned her white birds... She saw him lying lifeless with his blood all streaming from his wound, and she leaped down... and upon his blood she sprinkled sweet-smelling nectar. And where the blood was touched by nectar, it began to seethe... and ere an hour had passed, from that blood there sprang a flower of blood-red hue.\"",
      "source": "Source: Ovid, Metamorphoses (c. 8 CE) - The anemone flower from Adonis's blood"
    },
    {
      "citation": "Inanna and Dumuzi:Lines 1-20",
      "text": "\"Last night as I, the queen, was shining bright, Last night as I, the Queen of Heaven, was shining bright, As I was shining bright and dancing, singing praises at the coming of the night— He met me, he met me! The Lord Dumuzi met me. He put his hand in my hand, he pressed his neck to my neck. 'My holy churn, my holy churn, with the cream inside— Inanna, I will drink your fresh milk!' 'My consort, my bridegroom, you are my delight! Dumuzi, you who are the honey-sweet, you who make my heart rejoice! You have captivated me, let me stand trembling before you. Bridegroom, I would be taken by you to the bedchamber! You have captivated me, let me stand trembling before you. Lion, I would be taken by you to the bedchamber!'\"",
      "source": ""
    },
    {
      "citation": "Hymn to Ishtar:Lines 1-15",
      "text": "\"I pray to thee, O Lady of ladies, goddess of goddesses. O Ishtar, queen of all peoples, who guides mankind aright... Thou art mighty, thou hast sovereign power, exalted is thy name! Thou art the light of heaven and earth... At the thought of thy name the heaven and earth quake... Where thou lookest in pity, the dead man lives again, the sick is healed; The afflicted is saved from his affliction when he beholds thy face! Thou art terrible in battle, thou makest strong the weak. In the strife of battle thou determinest the decision. O torch of heaven and earth, light of all dwellings, O goddess of men, goddess of women, whose counsel none can learn!\"",
      "source": "Source: Akkadian Hymn to Ishtar (c. 1900-1600 BCE)"
    },
    {
      "citation": "Prose Edda, Gylfaginning:35",
      "text": "\"Freyja is the most glorious of the goddesses. She has in heaven a dwelling which is called Fólkvangr, 'Field of the People,' and when she rides to battle, half the slain belong to her, and half to Odin... Her hall is called Sessrúmnir, and it is large and beautiful. When she travels, she drives two cats and sits in a chariot. She is most easily invoked, and from her name comes the title of honor whereby noble ladies are called Frue [Lady]. She delighted much in love-songs. It is good to call on her in matters of love. She had a husband whose name was Óðr. He went away on long journeys, and Freyja weeps for him, and her tears are red gold.\"",
      "source": "Source: Prose Edda, Gylfaginning (c. 1220 CE) - Snorri Sturluson"
    }
  ],
  "extendedContent": {
    "sources": [
      {
        "citation": "Hesiod, Theogony:188-206",
        "text": "\"And so soon as he had cut off the members with flint and cast them from the land into the surging sea, they were swept away over the main a long time: and a white foam spread around them from the immortal flesh, and in it there grew a maiden. First she drew near holy Cythera, and from there, afterwards, she came to sea-girt Cyprus, and came forth an awful and lovely goddess, and grass grew up about her beneath her shapely feet. Her gods and men call Aphrodite, and the foam-born goddess because she grew amid the foam... and also Cytherea because she reached Cythera... Eros accompanied her, and comely Desire followed her at her birth at the first and as she went into the assembly of the gods.\"",
        "source": ""
      },
      {
        "citation": "Homeric Hymn to Aphrodite:1-6",
        "text": "\"Muse, tell me the deeds of golden Aphrodite the Cyprian, who stirs up sweet passion in the gods and subdues the tribes of mortal men and birds that fly in air and all the many creatures that the dry land rears, and all that the sea: all these love the deeds of rich-crowned Cytherea.\"",
        "source": ""
      },
      {
        "citation": "Homeric Hymn to Aphrodite:1-44",
        "text": "\"For though she is golden, yet even Zeus she bends to her will as she pleases, and mates the immortal gods with mortal women, and makes mortal women subject to the immortals... Only three she cannot persuade or deceive: the bright-eyed maiden Athena, daughter of Zeus who holds the aegis, nor Artemis, nor Hestia the pure. But of all the others there is none among the blessed gods or among mortal men that has escaped Aphrodite.\"",
        "source": ""
      },
      {
        "citation": "Homeric Hymn to Aphrodite:45-57",
        "text": "\"But Zeus put in her [Aphrodite's] heart sweet desire to mate with a mortal man, so that even she might not for long be innocent of a mortal's love, lest laughing Aphrodite should mock all the gods and goddesses and say that she had joined them in love with mortal women, who bore to the immortals mortal sons, and had mated the goddesses with mortal men. And so he put in her heart sweet desire for Anchises... When she saw him, Aphrodite, lover of smiles, loved him, and dreadful desire seized her in her heart.\"",
        "source": ""
      },
      {
        "citation": "Ovid, Metamorphoses:10.525-532",
        "text": "\"Even Venus [Aphrodite] was not proof against his [Adonis's] beauty; and as for him, he knew not what it was to love. While hunting through the woods, he started up a wild boar from its lair... The beast turned fiercely on him and buried its teeth deep in the young man's groin, and stretched him dying on the yellow sand. Venus, borne through the air in her light chariot drawn by swans... heard from afar his dying groans; and thither she turned her white birds... She saw him lying lifeless with his blood all streaming from his wound, and she leaped down... and upon his blood she sprinkled sweet-smelling nectar. And where the blood was touched by nectar, it began to seethe... and ere an hour had passed, from that blood there sprang a flower of blood-red hue.\"",
        "source": "Source: Ovid, Metamorphoses (c. 8 CE) - The anemone flower from Adonis's blood"
      },
      {
        "citation": "Inanna and Dumuzi:Lines 1-20",
        "text": "\"Last night as I, the queen, was shining bright, Last night as I, the Queen of Heaven, was shining bright, As I was shining bright and dancing, singing praises at the coming of the night— He met me, he met me! The Lord Dumuzi met me. He put his hand in my hand, he pressed his neck to my neck. 'My holy churn, my holy churn, with the cream inside— Inanna, I will drink your fresh milk!' 'My consort, my bridegroom, you are my delight! Dumuzi, you who are the honey-sweet, you who make my heart rejoice! You have captivated me, let me stand trembling before you. Bridegroom, I would be taken by you to the bedchamber! You have captivated me, let me stand trembling before you. Lion, I would be taken by you to the bedchamber!'\"",
        "source": ""
      },
      {
        "citation": "Hymn to Ishtar:Lines 1-15",
        "text": "\"I pray to thee, O Lady of ladies, goddess of goddesses. O Ishtar, queen of all peoples, who guides mankind aright... Thou art mighty, thou hast sovereign power, exalted is thy name! Thou art the light of heaven and earth... At the thought of thy name the heaven and earth quake... Where thou lookest in pity, the dead man lives again, the sick is healed; The afflicted is saved from his affliction when he beholds thy face! Thou art terrible in battle, thou makest strong the weak. In the strife of battle thou determinest the decision. O torch of heaven and earth, light of all dwellings, O goddess of men, goddess of women, whose counsel none can learn!\"",
        "source": "Source: Akkadian Hymn to Ishtar (c. 1900-1600 BCE)"
      },
      {
        "citation": "Prose Edda, Gylfaginning:35",
        "text": "\"Freyja is the most glorious of the goddesses. She has in heaven a dwelling which is called Fólkvangr, 'Field of the People,' and when she rides to battle, half the slain belong to her, and half to Odin... Her hall is called Sessrúmnir, and it is large and beautiful. When she travels, she drives two cats and sits in a chariot. She is most easily invoked, and from her name comes the title of honor whereby noble ladies are called Frue [Lady]. She delighted much in love-songs. It is good to call on her in matters of love. She had a husband whose name was Óðr. He went away on long journeys, and Freyja weeps for him, and her tears are red gold.\"",
        "source": "Source: Prose Edda, Gylfaginning (c. 1220 CE) - Snorri Sturluson"
      }
    ],
    "analysis": []
  },
  "metadata": {
    "enrichedAt": "2026-01-01T09:41:53.775Z",
    "sourceFile": "H:/Github/EyesOfAzrael/_recovered-html/FIREBASE/archetypes/love/index.html"
  },
  "relatedEntities": {
    "archetypes": [
      {
        "id": "great-goddess",
        "name": "Great Goddess",
        "relationship": "related"
      },
      {
        "id": "earth-mother",
        "name": "Earth Mother",
        "relationship": "related"
      },
      {
        "id": "war",
        "name": "War God",
        "relationship": "related"
      },
      {
        "id": "dying-god",
        "name": "Dying God",
        "relationship": "related"
      },
      {
        "id": "death",
        "name": "Death & Underworld",
        "relationship": "related"
      },
      {
        "id": "trickster",
        "name": "Trickster",
        "relationship": "related"
      },
      {
        "id": "divine-twins",
        "name": "Divine Twins",
        "relationship": "related"
      },
      {
        "id": "moon-deity",
        "name": "Moon Deity",
        "relationship": "related"
      }
    ]
  }
}