{
  "id": "sun-god",
  "type": "archetype",
  "name": "The Sun God Archetype",
  "definition": "The Sun God represents the supreme celestial power—the source of light, life, and cosmic order. Across virtually every culture, the sun has been deified as the most visible manifestation of divine power, traversing the sky in an eternal journey that structures time itself. The Sun God embodies truth (for light reveals all), justice (for the sun sees everything), healing (for sunlight nurtures life), and sovereignty (for the sun rules the heavens). This archetype represents consciousness itself—the illuminating power that banishes darkness and makes understanding possible.",
  "mythology": {
    "crossCulturalComparisons": [
      {
        "tradition": "Egyptian",
        "deity": "Ra",
        "attributes": "Creator sun god, solar barque, battles Apophis nightly",
        "matchPercent": 100
      },
      {
        "tradition": "Greek",
        "deity": "Helios",
        "attributes": "Titan sun god, drives golden chariot, all-seeing witness",
        "matchPercent": 98
      },
      {
        "tradition": "Greek",
        "deity": "Apollo",
        "attributes": "God of light, prophecy, music, healing, later solar deity",
        "matchPercent": 90
      },
      {
        "tradition": "Roman",
        "deity": "Sol Invictus",
        "attributes": "\"Unconquered Sun,\" imperial cult, winter solstice rebirth",
        "matchPercent": 97
      },
      {
        "tradition": "Hindu",
        "deity": "Surya",
        "attributes": "Seven-horsed chariot, cosmic eye, father of Karna and Manu",
        "matchPercent": 99
      },
      {
        "tradition": "Hindu",
        "deity": "Vishnu",
        "attributes": "Solar aspects, pervades cosmos, preserves cosmic order",
        "matchPercent": 80
      },
      {
        "tradition": "Persian",
        "deity": "Mithra",
        "attributes": "Sun god of contracts, truth, warriors; mystery cult",
        "matchPercent": 95
      },
      {
        "tradition": "Mesopotamian",
        "deity": "Utu/Shamash",
        "attributes": "God of justice, gives law code to Hammurabi, all-seeing",
        "matchPercent": 98
      },
      {
        "tradition": "Japanese",
        "deity": "Amaterasu",
        "attributes": "Sun goddess (rare feminine form), ancestress of emperors",
        "matchPercent": 96
      },
      {
        "tradition": "Aztec",
        "deity": "Tonatiuh",
        "attributes": "Fifth Sun, requires blood sacrifice to continue moving",
        "matchPercent": 94
      },
      {
        "tradition": "Incan",
        "deity": "Inti",
        "attributes": "Sun father, ancestor of Inca emperors, golden disc",
        "matchPercent": 97
      },
      {
        "tradition": "Celtic",
        "deity": "Lugh",
        "attributes": "Shining One, master of all skills, spear of light",
        "matchPercent": 88
      },
      {
        "tradition": "Norse",
        "deity": "Sol",
        "attributes": "Goddess driving sun chariot, pursued by wolf Skoll",
        "matchPercent": 85
      },
      {
        "tradition": "Slavic",
        "deity": "Dazhbog",
        "attributes": "Giving god, white horses, ancestor of Slavic peoples",
        "matchPercent": 92
      }
    ],
    "universalPatterns": [
      "Daily Journey",
      "All-Seeing Eye",
      "Life-Giver",
      "Healer",
      "Sovereignty",
      "Truth and Revelation",
      "Cyclical Death and Rebirth",
      "Golden Imagery",
      "Seasonal Power",
      "Cosmic Order (Ma'at/Rita/Dharma)"
    ],
    "traditions": [
      "Egyptian",
      "Greek",
      "Roman",
      "Hindu",
      "Persian",
      "Mesopotamian",
      "Japanese",
      "Aztec",
      "Incan",
      "Celtic",
      "Norse",
      "Slavic"
    ]
  },
  "examples": [
    {
      "tradition": "Egyptian",
      "name": "Ra",
      "link": "../../mythos/egyptian/deities/ra.html",
      "matchPercent": 100,
      "attributes": "Creator sun god, solar barque, battles Apophis nightly",
      "domains": "Sun, creation, kingship, cosmic order"
    },
    {
      "tradition": "Greek",
      "name": "Helios",
      "link": "../../mythos/greek/deities/index.html",
      "matchPercent": 98,
      "attributes": "Titan sun god, drives golden chariot, all-seeing witness",
      "domains": "Sun, oaths, sight, time"
    },
    {
      "tradition": "Greek",
      "name": "Apollo",
      "link": "../../mythos/greek/deities/apollo.html",
      "matchPercent": 90,
      "attributes": "God of light, prophecy, music, healing, later solar deity",
      "domains": "Light, prophecy, healing, music, truth"
    },
    {
      "tradition": "Roman",
      "name": "Sol Invictus",
      "link": "../../mythos/roman/deities/index.html",
      "matchPercent": 97,
      "attributes": "\"Unconquered Sun,\" imperial cult, winter solstice rebirth",
      "domains": "Sun, military victory, imperial authority"
    },
    {
      "tradition": "Hindu",
      "name": "Surya",
      "link": "../../mythos/hindu/deities/index.html",
      "matchPercent": 99,
      "attributes": "Seven-horsed chariot, cosmic eye, father of Karna and Manu",
      "domains": "Sun, health, sight, time, truth"
    },
    {
      "tradition": "Hindu",
      "name": "Vishnu",
      "link": "../../mythos/hindu/deities/vishnu.html",
      "matchPercent": 80,
      "attributes": "Solar aspects, pervades cosmos, preserves cosmic order",
      "domains": "Preservation, cosmic order, avatars"
    },
    {
      "tradition": "Persian",
      "name": "Mithra",
      "link": "../../mythos/persian/deities/mithra.html",
      "matchPercent": 95,
      "attributes": "Sun god of contracts, truth, warriors; mystery cult",
      "domains": "Sun, oaths, truth, soldiers"
    },
    {
      "tradition": "Mesopotamian",
      "name": "Utu/Shamash",
      "link": "../../mythos/sumerian/deities/utu.html",
      "matchPercent": 98,
      "attributes": "God of justice, gives law code to Hammurabi, all-seeing",
      "domains": "Sun, justice, law, truth, divination"
    },
    {
      "tradition": "Japanese",
      "name": "Amaterasu",
      "link": "../../mythos/japanese/deities/amaterasu.html",
      "matchPercent": 96,
      "attributes": "Sun goddess (rare feminine form), ancestress of emperors",
      "domains": "Sun, sovereignty, weaving, heaven"
    },
    {
      "tradition": "Aztec",
      "name": "Tonatiuh",
      "link": "../../mythos/aztec/deities/index.html",
      "matchPercent": 94,
      "attributes": "Fifth Sun, requires blood sacrifice to continue moving",
      "domains": "Sun, war, sacrifice, time"
    },
    {
      "tradition": "Incan",
      "name": "Inti",
      "link": "../../mythos/index.html",
      "matchPercent": 97,
      "attributes": "Sun father, ancestor of Inca emperors, golden disc",
      "domains": "Sun, warmth, agriculture, royalty"
    },
    {
      "tradition": "Celtic",
      "name": "Lugh",
      "link": "../../mythos/celtic/deities/lugh.html",
      "matchPercent": 88,
      "attributes": "Shining One, master of all skills, spear of light",
      "domains": "Light, skills, harvest, kingship"
    },
    {
      "tradition": "Norse",
      "name": "Sol",
      "link": "../../mythos/norse/deities/index.html",
      "matchPercent": 85,
      "attributes": "Goddess driving sun chariot, pursued by wolf Skoll",
      "domains": "Sun, day, time"
    },
    {
      "tradition": "Slavic",
      "name": "Dazhbog",
      "link": "../../mythos/index.html",
      "matchPercent": 92,
      "attributes": "Giving god, white horses, ancestor of Slavic peoples",
      "domains": "Sun, fire, prosperity, ancestry"
    }
  ],
  "characteristics": [
    {
      "name": "Daily Journey",
      "description": "Travels across the sky from east to west, often in a chariot or boat, structuring day and night"
    },
    {
      "name": "All-Seeing Eye",
      "description": "Nothing escapes the sun's gaze—witnesses all human actions, enforces oaths and justice"
    },
    {
      "name": "Life-Giver",
      "description": "Source of warmth and light essential for agriculture, growth, and all living things"
    },
    {
      "name": "Healer",
      "description": "Sunlight purifies, heals diseases, and drives away evil spirits and darkness"
    },
    {
      "name": "Sovereignty",
      "description": "Supreme among celestial bodies, often king of the gods or source of royal authority"
    },
    {
      "name": "Truth and Revelation",
      "description": "Light as metaphor for knowledge, wisdom, and spiritual enlightenment"
    },
    {
      "name": "Cyclical Death and Rebirth",
      "description": "Sets each evening, travels through underworld, rises reborn each dawn"
    },
    {
      "name": "Golden Imagery",
      "description": "Associated with gold, fire, eagles, lions, and other symbols of radiant power"
    },
    {
      "name": "Seasonal Power",
      "description": "Strength waxes and wanes with seasons—solstices mark critical turning points"
    },
    {
      "name": "Cosmic Order (Ma'at/Rita/Dharma)",
      "description": "Sun's regular path maintains universal order against chaos"
    }
  ],
  "symbolism": {
    "the_solar_journey": {
      "title": "The Solar Journey",
      "description": "The sun's daily and annual cycles provide the universal template for divine narrative:",
      "points": [
        "Dawn: Birth/resurrection, emergence from darkness, hope and new beginning",
        "Noon: Full power, zenith of strength, maturity and sovereignty",
        "Sunset: Decline, descent, approach of death or transformation",
        "Night Journey: Underworld passage, confrontation with chaos, death before rebirth"
      ]
    },
    "the_all_seeing_eye": {
      "title": "The All-Seeing Eye",
      "description": "The sun's ability to illuminate everything makes it the natural symbol of divine omniscience:",
      "points": [
        "Shamash : Judge of heaven and earth, nothing escapes his gaze",
        "Helios : Reveals Hephaestus' wife's adultery, witnesses oaths",
        "Ra : Eye of Ra as instrument of divine surveillance and punishment"
      ]
    },
    "light_as_truth_and_consciousness": {
      "title": "Light as Truth and Consciousness",
      "description": "Solar symbolism extends into philosophy and spirituality:",
      "points": [
        "Plato's Sun: Form of the Good compared to sun—source of intelligibility",
        "Enlightenment: Spiritual awakening described as light dispelling ignorance",
        "Revelation: Divine truth \"shines forth\" or is \"brought to light\"",
        "Consciousness: Awareness itself as inner sun illuminating experience"
      ]
    },
    "solstices_death_and_rebirth_of_the_sun": {
      "title": "Solstices: Death and Rebirth of the Sun",
      "description": "The annual solar cycle provides the template for death-rebirth mythology:",
      "points": [
        "Winter Solstice: Sun's \"death\" and rebirth—celebrated across cultures (Yule, Saturnalia, later Christmas)",
        "Summer Solstice: Sun at maximum power—midsummer festivals, bonfire rituals",
        "Sol Invictus : \"Unconquered Sun\" celebrates sun's triumph over longest night"
      ]
    },
    "jungian_interpretation": {
      "title": "Jungian Interpretation",
      "description": "The Sun God represents essential psychological realities:",
      "points": [
        "Consciousness: The ego as inner sun—the light of awareness that illuminates experience",
        "The Hero: Solar journey as template for hero myth—descent, ordeal, triumphant return",
        "Individuation: Becoming \"enlightened\"—integrating unconscious contents into consciousness",
        "The Father: Sun as archetypal father figure—source of authority, order, direction"
      ]
    },
    "spiritual_dimensions": {
      "title": "Spiritual Dimensions",
      "description": "For devotees across traditions, the Sun God offers:",
      "points": [
        "Direct Experience: Unlike invisible gods, the sun can be seen, felt, worshipped directly",
        "Life Energy: Prana, chi, vital force associated with solar warmth",
        "Purification: Sunlight cleanses, disinfects, drives away darkness/evil",
        "Hope: Daily sunrise proves that darkness is always followed by light"
      ]
    },
    "modern_relevance": {
      "title": "Modern Relevance",
      "description": "The Sun God archetype continues to resonate:",
      "points": [
        "Solar Energy: Modern recognition of sun as literal source of Earth's energy",
        "Enlightenment Language: \"Seeing the light,\" \"illumination,\" \"dawning awareness\"",
        "Seasonal Affective Disorder: Modern acknowledgment of light's effect on mood",
        "Climate Consciousness: Sun worship as ecological awareness before its time"
      ]
    },
    "related_content": {
      "title": "Related Content",
      "description": "",
      "points": [
        "Ra - Egyptian lord of the solar barque",
        "Surya - Hindu seven-horsed chariot rider",
        "Apollo - Greek Phoebus, the shining one",
        "Amaterasu - Japanese heaven-illuminating goddess",
        "Inti - Incan father of emperors",
        "Moon Deity - Celestial complement to the sun",
        "Sky Father - Celestial sovereignty",
        "Cosmic Creator - Light as creation",
        "Dying God - Solar death and rebirth",
        "Healing (Solar Light)",
        "Fire Element",
        "Wisdom (Illumination)",
        "Celestial Archetypes",
        "Cross-Reference Matrix"
      ]
    }
  },
  "primarySources": [
    {
      "citation": "Book of the Dead, Hymn to Ra",
      "text": "\"Homage to you, Ra , at your rising, you Atum-Horakhty! Your beauty is worshipped in my eyes when the sunshine comes into being over my breast. You proceed at your pleasure in the Night-barque, and your heart is glad when the winds bring the Day-barque to the two Horizons... The lands are in festivity, they praise Ra when he appears. The Imperishable Stars sing hymns of praise to you. You rest in the evening in the Night-barque, you rise in the morning in the Day-barque. You traverse the heavens in peace, all your foes being cast down.\"",
      "source": ""
    },
    {
      "citation": "The Great Litany of Ra",
      "text": "\"O Ra in his egg, shining in his disc, rising in his horizon, swimming over his sky, without equal among the gods! You are the one who circles the underworld daily to give light to those who dwell in the West. Those in the Duat tremble at the sight of you. You create light for them that they may see you. You open the ways of the underworld that the dead may go forth by day.\"",
      "source": ""
    },
    {
      "citation": "Book of Overthrowing Apophis",
      "text": "\"Every night Ra must pass through the twelve hours of the Duat, and in the seventh hour he faces Apophis , the serpent of chaos who seeks to swallow the sun and end creation. The great cat of Heliopolis attacks the serpent, and Set , standing at the prow of the barque, spears the monster. But Apophis cannot be destroyed—only defeated. Each night the battle must be fought again. Should Ra fail, the sun would not rise, and all would return to the waters of Nun .\"",
      "source": ""
    },
    {
      "citation": "Rigveda 1.50.1-7",
      "text": "\"His brilliant banners draw upward the god who knows all creatures, so that everyone may see the Sun . The constellations, along with the nights, steal away like thieves, making way for the sun who gazes on everyone. His rays bear him up and make him visible, the far-seeing Sun , blazing the path for all... Rising today, O rich in friends, climbing to the highest sky, Sun , drive away my heart's disease and my yellow pallor. To parrots and to starlings let my yellowness be consigned; or let me transfer my yellowness to Haritala trees. With all his conquering splendour, this Sun has risen, giving me life and destroying my enemies.\"",
      "source": ""
    },
    {
      "citation": "The Gayatri Mantra",
      "text": "\"Om bhur bhuvah svah / tat savitur varenyam / bhargo devasya dhimahi / dhiyo yo nah prachodayat. 'We meditate on the glory of the Creator who has created the Universe, who is worthy of worship, who is the embodiment of Knowledge and Light, who is the remover of all Sin and Ignorance. May He enlighten our intellect.' This most sacred of all mantras is addressed to Savitar , the Impeller— Surya in his aspect as the divine light that illuminates consciousness.\"",
      "source": ""
    },
    {
      "citation": "Vishnu Purana: Description of Surya",
      "text": "\" Surya 's chariot is drawn by seven horses named after the Vedic meters: Gayatri, Brihati, Ushnik, Jagati, Trishtubh, Anushtubh, and Pankti. His charioteer is Aruna , the personification of dawn. The wheel of the chariot represents the year, its twelve spokes the months. Surya 's brilliance was so great that his wife Sanjna could not bear to look at him. She fled, leaving her shadow Chhaya in her place. When Surya discovered this, Vishwakarman the divine smith reduced his brilliance, and from the removed radiance fashioned divine weapons.\"",
      "source": ""
    },
    {
      "citation": "Homeric Hymn to Apollo",
      "text": "\"I will remember and not forget Apollo who shoots afar. As he goes through the house of Zeus , the gods tremble before him and all spring up from their seats when he draws near, as he bends his bright bow... But Leto alone stays by the side of Zeus who delights in thunder; and then she unstrings his bow, and closes his quiver, and takes his archery from his strong shoulders in her hands and hangs them on a golden peg against a pillar of his father's house... You go over all the earth, Phoebus , singing to your lyre.\"",
      "source": ""
    },
    {
      "citation": "Ovid, Metamorphoses: Apollo as Sun",
      "text": "\"The palace of the Sun stood high on lofty columns, bright with glittering gold and bronze that shone like fire. The roof was covered with ivory; the double doors gleamed with silver radiance. The workmanship surpassed the materials... There Phoebus sat, robed in purple, on a throne that glowed with emeralds. At his right and left stood Day and Month and Year, the Centuries and the Hours, each at equal distance set. There stood young Spring, wreathed in a crown of flowers...\"",
      "source": ""
    },
    {
      "citation": "Kojiki: The Cave of Heaven",
      "text": "\"When Amaterasu hid herself in the Heavenly Rock Cave, constant darkness covered the High Plain of Heaven and the Central Land of Reed Plains. The eight hundred myriad kami gathered in divine assembly to devise a plan. They set up the hard rocks of Heaven outside the cave entrance, made a mirror of the hardest iron, and hung strings of curved jewels. Then Ame-no-Uzume became divinely possessed, exposing her breasts and lowering her skirt to her private parts, dancing so wildly that the eight hundred myriad kami laughed as one. Curious, Amaterasu opened the cave door slightly. 'Why does Ame-no-Uzume sing and dance? Why do all the kami laugh?' 'We rejoice,' they said, 'because there is a kami more radiant than you.' They showed her the mirror—and as she looked, the mighty god Ame-no-Tajikarao seized her hand and drew her forth. Light returned to all the worlds.\"",
      "source": ""
    }
  ],
  "relatedArchetypes": [
    {
      "name": "Surya",
      "link": "../../mythos/hindu/deities/index.html",
      "description": ""
    },
    {
      "name": "Inti",
      "link": "../../mythos/index.html",
      "description": ""
    },
    {
      "name": "Moon Deity",
      "link": "../moon-deity/index.html",
      "description": ""
    },
    {
      "name": "Sky Father",
      "link": "../sky-father/index.html",
      "description": ""
    },
    {
      "name": "Cosmic Creator",
      "link": "../cosmic-creator/index.html",
      "description": ""
    },
    {
      "name": "Dying God",
      "link": "../dying-god/index.html",
      "description": ""
    },
    {
      "name": "Healing (Solar Light)",
      "link": "../healing/index.html",
      "description": ""
    },
    {
      "name": "Fire Element",
      "link": "../elemental-archetypes/fire/index.html",
      "description": ""
    },
    {
      "name": "Celestial Archetypes",
      "link": "../celestial/index.html",
      "description": ""
    }
  ],
  "extendedContent": {
    "sources": [
      {
        "citation": "Book of the Dead, Hymn to Ra",
        "text": "\"Homage to you, Ra , at your rising, you Atum-Horakhty! Your beauty is worshipped in my eyes when the sunshine comes into being over my breast. You proceed at your pleasure in the Night-barque, and your heart is glad when the winds bring the Day-barque to the two Horizons... The lands are in festivity, they praise Ra when he appears. The Imperishable Stars sing hymns of praise to you. You rest in the evening in the Night-barque, you rise in the morning in the Day-barque. You traverse the heavens in peace, all your foes being cast down.\"",
        "source": ""
      },
      {
        "citation": "The Great Litany of Ra",
        "text": "\"O Ra in his egg, shining in his disc, rising in his horizon, swimming over his sky, without equal among the gods! You are the one who circles the underworld daily to give light to those who dwell in the West. Those in the Duat tremble at the sight of you. You create light for them that they may see you. You open the ways of the underworld that the dead may go forth by day.\"",
        "source": ""
      },
      {
        "citation": "Book of Overthrowing Apophis",
        "text": "\"Every night Ra must pass through the twelve hours of the Duat, and in the seventh hour he faces Apophis , the serpent of chaos who seeks to swallow the sun and end creation. The great cat of Heliopolis attacks the serpent, and Set , standing at the prow of the barque, spears the monster. But Apophis cannot be destroyed—only defeated. Each night the battle must be fought again. Should Ra fail, the sun would not rise, and all would return to the waters of Nun .\"",
        "source": ""
      },
      {
        "citation": "Rigveda 1.50.1-7",
        "text": "\"His brilliant banners draw upward the god who knows all creatures, so that everyone may see the Sun . The constellations, along with the nights, steal away like thieves, making way for the sun who gazes on everyone. His rays bear him up and make him visible, the far-seeing Sun , blazing the path for all... Rising today, O rich in friends, climbing to the highest sky, Sun , drive away my heart's disease and my yellow pallor. To parrots and to starlings let my yellowness be consigned; or let me transfer my yellowness to Haritala trees. With all his conquering splendour, this Sun has risen, giving me life and destroying my enemies.\"",
        "source": ""
      },
      {
        "citation": "The Gayatri Mantra",
        "text": "\"Om bhur bhuvah svah / tat savitur varenyam / bhargo devasya dhimahi / dhiyo yo nah prachodayat. 'We meditate on the glory of the Creator who has created the Universe, who is worthy of worship, who is the embodiment of Knowledge and Light, who is the remover of all Sin and Ignorance. May He enlighten our intellect.' This most sacred of all mantras is addressed to Savitar , the Impeller— Surya in his aspect as the divine light that illuminates consciousness.\"",
        "source": ""
      },
      {
        "citation": "Vishnu Purana: Description of Surya",
        "text": "\" Surya 's chariot is drawn by seven horses named after the Vedic meters: Gayatri, Brihati, Ushnik, Jagati, Trishtubh, Anushtubh, and Pankti. His charioteer is Aruna , the personification of dawn. The wheel of the chariot represents the year, its twelve spokes the months. Surya 's brilliance was so great that his wife Sanjna could not bear to look at him. She fled, leaving her shadow Chhaya in her place. When Surya discovered this, Vishwakarman the divine smith reduced his brilliance, and from the removed radiance fashioned divine weapons.\"",
        "source": ""
      },
      {
        "citation": "Homeric Hymn to Apollo",
        "text": "\"I will remember and not forget Apollo who shoots afar. As he goes through the house of Zeus , the gods tremble before him and all spring up from their seats when he draws near, as he bends his bright bow... But Leto alone stays by the side of Zeus who delights in thunder; and then she unstrings his bow, and closes his quiver, and takes his archery from his strong shoulders in her hands and hangs them on a golden peg against a pillar of his father's house... You go over all the earth, Phoebus , singing to your lyre.\"",
        "source": ""
      },
      {
        "citation": "Ovid, Metamorphoses: Apollo as Sun",
        "text": "\"The palace of the Sun stood high on lofty columns, bright with glittering gold and bronze that shone like fire. The roof was covered with ivory; the double doors gleamed with silver radiance. The workmanship surpassed the materials... There Phoebus sat, robed in purple, on a throne that glowed with emeralds. At his right and left stood Day and Month and Year, the Centuries and the Hours, each at equal distance set. There stood young Spring, wreathed in a crown of flowers...\"",
        "source": ""
      },
      {
        "citation": "Kojiki: The Cave of Heaven",
        "text": "\"When Amaterasu hid herself in the Heavenly Rock Cave, constant darkness covered the High Plain of Heaven and the Central Land of Reed Plains. The eight hundred myriad kami gathered in divine assembly to devise a plan. They set up the hard rocks of Heaven outside the cave entrance, made a mirror of the hardest iron, and hung strings of curved jewels. Then Ame-no-Uzume became divinely possessed, exposing her breasts and lowering her skirt to her private parts, dancing so wildly that the eight hundred myriad kami laughed as one. Curious, Amaterasu opened the cave door slightly. 'Why does Ame-no-Uzume sing and dance? Why do all the kami laugh?' 'We rejoice,' they said, 'because there is a kami more radiant than you.' They showed her the mirror—and as she looked, the mighty god Ame-no-Tajikarao seized her hand and drew her forth. Light returned to all the worlds.\"",
        "source": ""
      }
    ],
    "analysis": []
  },
  "metadata": {
    "enrichedAt": "2026-01-01T09:41:53.789Z",
    "sourceFile": "H:/Github/EyesOfAzrael/_recovered-html/FIREBASE/archetypes/sun-god/index.html"
  }
}