{
  "metadata": {
    "source_file": "mythos/chinese/deities/erlang-shen.html",
    "extraction_date": "2025-12-15T21:21:57.653964",
    "extraction_version": "2.6",
    "mythology": "chinese",
    "completeness_score": 45
  },
  "entity": {
    "name": "Chinese - Erlang Shen",
    "mythology": "chinese",
    "type": "deity",
    "css_colors": {
      "primary": "#1E90FF",
      "secondary": "#FFD700"
    }
  },
  "attributes": {},
  "mythology_stories": {
    "intro": "Erlang Shen's mythology interweaves several traditions, including stories of flood control, family tragedy, and epic battles. He appears in both the <em>Journey to the West</em> and <em>Fengshen Yanyi</em>, where his prowess as a warrior is legendary.",
    "key_myths": [
      {
        "name": "Divine Birth and Family Tragedy",
        "description": "Erlang Shen (Yang Jian) was born from the union of a mortal man, Yang Tianyou, and the Jade Emperor's sister, the goddess Yaoji. This forbidden marriage enraged the Jade Emperor, who imprisoned Yaoji beneath Mount Tao. Young Erlang Shen eventually grew powerful enough to cleave the mountain with his axe and free his mother, only to witness her die from the Jade Emperor's punishment."
      },
      {
        "name": "Splitting the Mountain",
        "description": "The tale of Erlang Shen splitting Mount Tao to save his mother (or in some versions, Mount Hua) became one of the most beloved stories in Chinese folklore, symbolizing filial devotion and the willingness to defy heaven itself for family. This story inspired later tales of similar heroic rescues."
      },
      {
        "name": "Taming the Floods",
        "description": "In some traditions, Erlang Shen is credited with controlling devastating floods by channeling rivers and defeating water demons. He is associated with the ancient flood-control hero Li Bing of Sichuan and worshipped at Guankou (Dujiangyan), where he is believed to protect against flooding."
      },
      {
        "name": "Battle with Sun Wukong",
        "description": "In <em>Journey to the West</em>, when all other celestial warriors failed to capture the rebellious Monkey King, Erlang Shen was dispatched. The two engaged in an epic battle of transformations - Sun Wukong transformed into a sparrow, Erlang became a hawk; the monkey became a fish, the god became a cormorant. Erlang Shen's third eye could see through each disguise, making him the only warrior who could match Sun Wukong in combat."
      },
      {
        "name": "The War Against the Shang",
        "description": "In the <em>Fengshen Yanyi</em>, Yang Jian serves as one of the greatest generals in the campaign to overthrow the tyrannical King Zhou. He battles numerous powerful demons and sorcerers, using his transformations and combat skills to turn the tide of many battles."
      },
      {
        "name": "Conflict with the Jade Emperor",
        "description": "Despite being the Jade Emperor's nephew, Erlang Shen maintains a complicated relationship with heaven. He often acts independently, is said to \"listen to the celestial decrees but not the celestial summons\" (听调不听宣), and dwells at Guankou rather than in the celestial court. This independence reflects his resentment over his mother's fate."
      }
    ]
  },
  "relationships": {},
  "worship": {
    "sacred sites": "Erlang Shen's worship is particularly strong in Sichuan province: <li><strong>Erwang Temple, Dujiangyan (二王庙):</strong> The primary temple at Guankou, near the ancient irrigation works. Here he is worshipped as the deity who controls floods and protects the region.</li>\n<li><strong>Temples throughout Sichuan:</strong> Where he is venerated as a local protective deity</li>\n<li><strong>Temples across China:</strong> As a powerful demon-slaying god</li>",
    "festivals": "<li><strong>Erlang Shen's Birthday (二郎神诞):</strong> Celebrated on the 6th day of the 6th lunar month with temple fairs, opera performances, and offerings</li>\n<li><strong>Qingming Festival:</strong> Special rites at Dujiangyan honoring both Erlang Shen and Li Bing for flood control</li>",
    "offerings": "<li><strong>Meat offerings:</strong> As a hunting deity, he receives meat unlike purely Buddhist deities</li>\n<li><strong>Wine:</strong> Offerings of alcohol for the warrior god</li>\n<li><strong>Dog-related taboos:</strong> Some temples prohibit dog meat due to his companion Xiaotian</li>\n<li><strong>Weapons replicas:</strong> Model lances and other martial offerings</li>",
    "patronage": "Erlang Shen is particularly invoked by: <li>Those seeking protection from demons and evil spirits</li>\n<li>Hunters and those who work with dogs</li>\n<li>Communities threatened by floods</li>\n<li>Those seeking justice against powerful enemies</li>\n<li>Actors and performers (in some theatrical traditions)</li>"
  },
  "interlinks": {
    "archetype": {
      "name": "👁 DIVINE WARRIOR / DEMON SLAYER",
      "description": "Erlang Shen embodies the Divine Warrior archetype - celestial champion who hunts evil, possesses supernatural sight, and stands between humanity and demonic forces.",
      "url": "../../../archetypes/index.html"
    },
    "sacred_items": [
      {
        "name": "Three-Pointed Double-Edged Lance",
        "type": "Divine Weapon",
        "url": "../../../index.html"
      }
    ],
    "cross_cultural_parallels": [
      {
        "name": "Archangel Michael",
        "mythology": "Christian",
        "url": "../../christian/deities/michael.html"
      },
      {
        "name": "Indra",
        "mythology": "Hindu",
        "url": "../../hindu/deities/indra.html"
      },
      {
        "name": "Thor",
        "mythology": "Norse",
        "url": "../../norse/deities/thor.html"
      },
      {
        "name": "Horus",
        "mythology": "Egyptian",
        "url": "../../egyptian/deities/horus.html"
      },
      {
        "name": "Apollo",
        "mythology": "Greek",
        "url": "../../greek/deities/apollo.html"
      },
      {
        "name": "Bishamonten",
        "mythology": "Japanese",
        "url": "../../japanese/deities/index.html"
      }
    ]
  },
  "see_also": [
    {
      "text": "👑Jade Emperor",
      "url": "jade-emperor.html"
    },
    {
      "text": "🔥Nezha",
      "url": "nezha.html"
    },
    {
      "text": "🐵Sun Wukong",
      "url": "../heroes/index.html"
    },
    {
      "text": "🐉Dragon Kings",
      "url": "dragon-kings.html"
    },
    {
      "text": "🙏Guanyin",
      "url": "guanyin.html"
    },
    {
      "text": "📖Journey to the West",
      "url": "../texts/index.html"
    },
    {
      "text": "👁Divine Warrior Archetype",
      "url": "../../../archetypes/index.html"
    },
    {
      "text": "🐕Mythical Creatures",
      "url": "../creatures/index.html"
    }
  ]
}