{
  "metadata": {
    "source_file": "mythos/chinese/deities/xi-wangmu.html",
    "extraction_date": "2025-12-15T21:21:57.703014",
    "extraction_version": "2.6",
    "mythology": "chinese",
    "completeness_score": 45
  },
  "entity": {
    "name": "Chinese - Xi Wangmu",
    "mythology": "chinese",
    "type": "deity",
    "css_colors": {
      "primary": "#8B008B",
      "secondary": "#FFD700"
    }
  },
  "attributes": {},
  "mythology_stories": {
    "intro": "Xi Wangmu is one of the oldest deities in Chinese religion, appearing in texts from the Shang dynasty oracle bones through to contemporary worship. Her mythology evolved dramatically over millennia, from a fearsome goddess of plague and punishment to the benevolent Queen of Immortality.",
    "key_myths": [
      {
        "name": "Ancient Origins",
        "description": "In the earliest texts (Shanhaijing/Classic of Mountains and Seas), Xi Wangmu appears as a fearsome goddess with a human face, leopard's tail, and tiger's teeth. She dwells in a cave on Jade Mountain, controlling plague, punishment, and the five calamities. Her three blue birds bring her food."
      },
      {
        "name": "Meeting King Mu of Zhou",
        "description": "One of the most famous tales describes Emperor Mu of Zhou (c. 10th century BCE) who journeyed west in his chariot drawn by eight magical horses. He reached Mount Kunlun and was received by Xi Wangmu. They exchanged poems and gifts, and she hosted a banquet by the Jade Pool. When they parted, both expressed sorrow, and the king promised to return - but never did."
      },
      {
        "name": "Chang'e and the Moon",
        "description": "Xi Wangmu gave the elixir of immortality to the hero Houyi as a reward for shooting down nine of the ten suns. His wife Chang'e drank the elixir and floated to the moon, where she still dwells. This story connects Xi Wangmu to the Mid-Autumn Festival."
      },
      {
        "name": "Journey to the West",
        "description": "In the novel, Xi Wangmu's Peach Banquet is disrupted when Sun Wukong, appointed guardian of the orchard, eats all the ripened peaches, drinks the immortal wine, and consumes Laozi's pills of immortality. This triple offense contributed to the Monkey King's rebellion against heaven."
      },
      {
        "name": "The Weaver Girl (Zhinu)",
        "description": "In some versions of the famous Cowherd and Weaver Girl legend, Xi Wangmu is the grandmother or mother of Zhinu (the Weaver). She separated the lovers by creating the Milky Way with her jade hairpin, allowing them to meet only once per year on the seventh day of the seventh month."
      },
      {
        "name": "Han Dynasty Worship",
        "description": "During the Han dynasty, a messianic cult of Xi Wangmu swept across China, with people believing she would soon descend to grant immortality to her faithful. Worshippers wore special talismans and performed ecstatic rituals in her honor."
      }
    ]
  },
  "relationships": {},
  "worship": {
    "sacred sites": "Xi Wangmu worship remains active throughout the Chinese world: <li><strong>Mount Kunlun Region:</strong> Temples in the Kunlun Mountains area of western China</li>\n<li><strong>Tai Shan (Mount Tai):</strong> Bixia Yuanjun temple, where she is honored as a mother goddess</li>\n<li><strong>Taiwan:</strong> Numerous \"Golden Mother\" temples, particularly popular with female worshippers</li>\n<li><strong>Fujian Province:</strong> Major temple complexes dedicated to her worship</li>",
    "festivals": "<li><strong>Xi Wangmu's Birthday (王母娘娘圣诞):</strong> Third day of the third lunar month - celebrated with peach-shaped offerings and elaborate rituals</li>\n<li><strong>Double Seven Festival (七夕):</strong> Connected to her through the Weaver Girl story</li>\n<li><strong>Mid-Autumn Festival:</strong> Chang'e's story links this festival to Xi Wangmu's elixir</li>",
    "offerings": "<li><strong>Peaches:</strong> Both real and symbolic (peach-shaped buns, cakes, candies)</li>\n<li><strong>Longevity noodles:</strong> Symbolizing long life</li>\n<li><strong>Sweet foods:</strong> Cakes, candied fruits, sweet rice</li>\n<li><strong>Flowers:</strong> Especially orchids and other elegant blooms</li>\n<li><strong>Tea:</strong> Fine quality tea offerings</li>\n<li><strong>Incense:</strong> High-quality sandalwood or floral incense</li>",
    "patronage": "Xi Wangmu is particularly honored by: <li>Those seeking longevity and good health</li>\n<li>Women, especially mothers and grandmothers</li>\n<li>Daoist practitioners seeking immortality</li>\n<li>Those celebrating birthdays (especially milestone ages)</li>\n<li>People seeking feminine divine protection</li>"
  },
  "interlinks": {
    "archetype": {
      "name": "🍑 GREAT GODDESS / DIVINE QUEEN",
      "description": "Xi Wangmu embodies the Great Goddess archetype - primordial feminine power, keeper of life and death, guardian of immortality, dwelling in the sacred mountain paradise.",
      "url": "../../../archetypes/great-goddess/"
    },
    "sacred_items": [
      {
        "name": "Peaches of Immortality",
        "type": "Divine Fruit",
        "url": "../../../index.html"
      }
    ],
    "cross_cultural_parallels": [
      {
        "name": "Hera",
        "mythology": "Greek",
        "url": "../../greek/deities/hera.html"
      },
      {
        "name": "Frigg",
        "mythology": "Norse",
        "url": "../../norse/deities/frigg.html"
      },
      {
        "name": "Isis",
        "mythology": "Egyptian",
        "url": "../../egyptian/deities/isis.html"
      },
      {
        "name": "Amaterasu",
        "mythology": "Japanese",
        "url": "../../japanese/deities/amaterasu.html"
      },
      {
        "name": "Parvati",
        "mythology": "Hindu",
        "url": "../../hindu/deities/index.html"
      },
      {
        "name": "Idunn",
        "mythology": "Norse",
        "url": "../../norse/deities/index.html"
      }
    ]
  },
  "see_also": [
    {
      "text": "👑Jade Emperor",
      "url": "jade-emperor.html"
    },
    {
      "text": "🙏Guanyin",
      "url": "guanyin.html"
    },
    {
      "text": "🐵Sun Wukong",
      "url": "../heroes/index.html"
    },
    {
      "text": "🌈Celestial Realms",
      "url": "../cosmology/index.html"
    },
    {
      "text": "☯Path to Immortality",
      "url": "../path/index.html"
    },
    {
      "text": "🎉Festivals & Rituals",
      "url": "../rituals/index.html"
    },
    {
      "text": "🍑Great Goddess Archetype",
      "url": "../../../archetypes/great-goddess/"
    },
    {
      "text": "🍎Idunn (Norse)",
      "url": "../../norse/deities/index.html"
    }
  ]
}