{
  "quests": [],
  "displayName": "🔥 Zoroaster (Zarathustra)",
  "titles": [],
  "feats": [],
  "mythology": "persian",
  "relationships": {},
  "filename": "zoroaster",
  "companions": [],
  "name": "Zoroaster",
  "primarySources": [],
  "attributes": [],
  "id": "persian_zoroaster",
  "weapons": [],
  "metadata": {
    "createdAt": "2025-12-13T02:36:52.672Z",
    "createdBy": "system",
    "verified": false,
    "source": "html_parser",
    "sourceFile": "mythos/persian/heroes/zoroaster.html",
    "enrichedBy": "completeness_analyzer",
    "finalEnrichment": true,
    "polishedBy": "Agent_8_HeroFixer",
    "updatedAt": {
      "_seconds": 1766819149,
      "_nanoseconds": 794000000
    }
  },
  "deeds": [
    "Joyous Laughter: Instead of crying at birth, he laughed - the only infant in history to do so",
    "Heavenly Light: A radiant glow surrounded him",
    "Protected by Divine Forces: Attempts by evil priests to kill the infant were thwarted",
    "Fravashi's Glory: His divine spirit (fravashi) was visible to the spiritually aware",
    "Animal sacrifice and ritualistic violence",
    "The worship of daevas (demons) as gods",
    "Oppression of the weak by warrior clans",
    "Lack of ethical foundation in religious practice",
    "Cosmic injustice and suffering",
    "A shining figure appeared - Vohu Manah (Good Mind), the first Amesha Spenta"
  ],
  "icon": "🦸",
  "description": "The founding prophet of Zoroastrianism, who received divine revelation from Ahura Mazda and established the religion of truth. Zoroaster (Avestan: Zarathustra; Persian: Zartosht) is revered as humanity's greatest teacher, the one who revealed the cosmic conflict between Asha and Druj, and taught the Threefold Path of righteousness.\n\nZoroaster was born in northeastern Iran (possibly Airyana Vaejah, the legendary Aryan homeland). His birth was accompanied by miraculous signs:\n\nZoroaster served as a priest (zaotar) in the old polytheistic religion but became increasingly troubled by:",
  "type": "hero"
}