{
  "name": "Fujin - Japanese God of Wind",
  "mythology": "japanese",
  "type": "deity",
  "icon": "icons/deities/generic-deity.svg",
  "subtitle": "God of Wind and Storms",
  "css_colors": {},
  "id": "japanese_fujin",
  "entityType": "unknown",
  "searchTerms": [
    "fujin - japanese god of wind",
    "japanese",
    "wind",
    "storms"
  ],
  "sortName": "fujinjapanesegodofwind",
  "importance": 50,
  "popularity": 40,
  "gridDisplay": {
    "title": "Fujin - Japanese God of Wind",
    "subtitle": "God of Wind and Storms",
    "image": "icons/deities/generic-deity.svg",
    "badge": "Japanese",
    "stats": [
      {
        "label": "Domain",
        "value": "Unknown"
      },
      {
        "label": "Symbol",
        "value": "🌪️"
      }
    ],
    "hoverInfo": {
      "quick": "",
      "domains": []
    }
  },
  "tableDisplay": {
    "columns": {
      "name": {
        "label": "Name",
        "sortable": true
      },
      "mythology": {
        "label": "Mythology",
        "sortable": true
      },
      "domains": {
        "label": "Domains",
        "sortable": false
      },
      "importance": {
        "label": "Importance",
        "sortable": true
      }
    },
    "defaultSort": "importance",
    "defaultOrder": "desc"
  },
  "listDisplay": {
    "icon": "icons/deities/generic-deity.svg",
    "primary": "Fujin - Japanese God of Wind - God of Wind and Storms",
    "secondary": "",
    "meta": "Japanese Mythology",
    "expandable": false,
    "expandedContent": ""
  },
  "panelDisplay": {
    "layout": "hero",
    "sections": []
  },
  "corpusSearch": {
    "canonical": "fujinjapanesegodofwind",
    "variants": [
      "fujinjapanesegodofwind",
      "fujin - japanese god of wind"
    ],
    "epithets": [],
    "domains": [],
    "symbols": [],
    "places": [],
    "concepts": []
  },
  "_created": "2025-12-25T05:23:54.936Z",
  "_modified": "2025-12-25T05:23:54.936Z",
  "_enhanced": true,
  "_version": "2.0",
  "metadata": {
    "iconAssignedBy": "domain_icon_system",
    "iconAssignedAt": "2025-12-28T12:51:46.633Z",
    "enhanced_metadata": true,
    "enhancement_date": "2025-12-29T01:42:00.942Z",
    "enhancement_agent": "agent4_deity_enhancer_v1",
    "fields_added": [
      "description",
      "summary",
      "domains",
      "cultural_significance",
      "primary_sources",
      "geographic_region"
    ],
    "priority_deity": false,
    "topic_panels_added": true,
    "word_count": 211
  },
  "description": "Fujin - Japanese God of Wind stands as one of the most sacred and honored figures in Japanese mythology. Revered as the deity of wind is a deity from japanese mythology, Fujin - Japanese God of Wind embodies the fundamental forces that shape both the divine and mortal realms. Known as \"God of Wind and Storms\", this epithet captures the essence of their divine nature. \n\nAccording to Japanese sacred texts, Fujin - Japanese God of Wind's origins stem from the Age of the Gods, when kami first shaped the islands of Japan The worship of Fujin - Japanese God of Wind became central to Japanese religious practice, with devotees seeking their favor through shrine visits, purification rituals, and seasonal matsuri. \n\nThe mythology surrounding Fujin - Japanese God of Wind reveals deep insights into Japanese worldview, particularly concerning wind is a deity from japanese mythology and humanity's relationship with the divine. \n\nThe legacy of Fujin - Japanese God of Wind extends far beyond ancient Japanese civilization. Fujin - Japanese God of Wind remains actively worshipped at Shinto shrines throughout Japan. The deity's influence extends into anime, manga, and Japanese cultural exports Scholars continue to study Fujin - Japanese God of Wind's mythology for its profound insights into Japanese culture, religion, and philosophy.",
  "summary": "Fujin - Japanese God of Wind is a deity from japanese mythology.",
  "domains": [
    "wind is a deity from japanese mythology"
  ],
  "symbols": [],
  "epithets": [],
  "cultural_significance": "A deity in japanese mythology with specific cultural and religious importance.",
  "primary_sources": [
    {
      "text": "Kojiki",
      "tradition": "japanese",
      "type": "ancient_text"
    },
    {
      "text": "Nihon Shoki",
      "tradition": "japanese",
      "type": "ancient_text"
    },
    {
      "text": "Engishiki",
      "tradition": "japanese",
      "type": "ancient_text"
    }
  ],
  "geographic_region": "Japan, Japanese archipelago",
  "topic_panels": [
    {
      "title": "Origins & Mythology",
      "icon": "📜",
      "content": "### Sacred Origins\n\nFujin - Japanese God of Wind's mythology primordial deities, divine creation, kami nature. The deity's role in Japanese cosmology reflects fundamental aspects of how ancient peoples understood divine power and cosmic order.\n\n### Creation Accounts\n\nPrimary sources describe Fujin - Japanese God of Wind's emergence and divine nature through various sacred narratives. These origin stories served both religious and cultural functions, establishing divine authority and cosmic principles.\n\n**Time Period:** c. 600 CE - present"
    },
    {
      "title": "Worship & Practice",
      "icon": "🕯️",
      "content": "### Religious Practice\n\nWorship of Fujin - Japanese God of Wind involved shrine rituals, festivals, purification. These practices created sacred bonds between devotees and the divine realm.\n\n### Sacred Sites\n\nThroughout Japanese archipelago, temples and shrines dedicated to Fujin - Japanese God of Wind served as focal points for religious activity. Priests and priestesses maintained sacred rituals that ensured divine favor and cosmic balance.\n\n### Festivals & Ceremonies\n\nSpecial festivals celebrated Fujin - Japanese God of Wind's divine attributes and mythological deeds, bringing communities together in shared religious expression."
    },
    {
      "title": "Symbols & Iconography",
      "icon": "✨",
      "content": "### Sacred Symbols\n\nFujin - Japanese God of Wind is represented through various sacred symbols and iconographic elements that appear in ancient art and texts.\n\n### Divine Attributes\n\nAs deity of wind is a deity from japanese mythology, Fujin - Japanese God of Wind embodies these cosmic principles. The iconography reveals how ancient peoples visualized divine power and cosmic forces.\n\n### Artistic Representations\n\nAncient artworks depict Fujin - Japanese God of Wind with distinctive attributes that communicate divine identity and authority to worshippers."
    },
    {
      "title": "Modern Influence",
      "icon": "🌍",
      "content": "### Cultural Legacy\n\nState Shinto, anime/manga, nature reverence. The mythology of Fujin - Japanese God of Wind continues to resonate in contemporary culture, literature, and spiritual practices.\n\n### Academic Study\n\nModern scholars analyze Fujin - Japanese God of Wind's mythology through multiple lenses—religious studies, anthropology, archaeology, and comparative mythology—revealing insights into ancient worldviews.\n\n### Popular Culture\n\nFujin - Japanese God of Wind appears in modern media, from fantasy novels to video games, demonstrating the enduring power of ancient mythology to capture human imagination and address timeless questions."
    }
  ],
  "related_myths": [
    {
      "title": "The Birth of Fujin - Japanese God of Wind",
      "summary": "The sacred account of how Fujin - Japanese God of Wind came into being, establishing their divine authority and cosmic role in Japanese mythology.",
      "tags": [
        "origin",
        "cosmology",
        "divine birth"
      ]
    },
    {
      "title": "Fujin - Japanese God of Wind and the Sacred Quest",
      "summary": "A legendary tale of Fujin - Japanese God of Wind's heroic deeds or cosmic achievements that shaped the world and demonstrated divine power.",
      "tags": [
        "heroic deed",
        "divine power",
        "mythology"
      ]
    },
    {
      "title": "Fujin - Japanese God of Wind and the Divine Council",
      "summary": "Stories of Fujin - Japanese God of Wind's interactions with other deities, revealing the complex relationships and hierarchies of the Japanese pantheon.",
      "tags": [
        "divine relationships",
        "pantheon",
        "cosmic order"
      ]
    },
    {
      "title": "Fujin - Japanese God of Wind and the Gift of Wind is a deity from japanese mythology",
      "summary": "The mythological account of how Fujin - Japanese God of Wind became associated with wind is a deity from japanese mythology and bestowed this gift upon humanity or the cosmos.",
      "tags": [
        "wind is a deity from japanese mythology",
        "divine gift",
        "cultural foundation"
      ]
    },
    {
      "title": "The Legacy of Fujin - Japanese God of Wind",
      "summary": "How Fujin - Japanese God of Wind's actions and teachings continue to influence the world, establishing sacred traditions and cosmic principles.",
      "tags": [
        "legacy",
        "sacred tradition",
        "cultural impact"
      ]
    }
  ],
  "background_image_suggestion": "Cherry blossoms and shrine torii",
  "time_period": "c. 600 CE - present"
}