[
  {
    "id": "babylonian_akitu",
    "purpose": [
      "Celebrate the New Year and cosmic renewal",
      "Renew the king's divine mandate to rule",
      "Reenact Marduk's victory over chaos",
      "Ensure fertility and prosperity for the coming year",
      "Reaffirm the cosmic order established at creation",
      "Petition the gods to determine favorable destinies"
    ],
    "metadata": {
      "createdAt": "2025-12-13T02:38:18.907Z",
      "updatedAt": "2025-12-25T00:00:00.000Z",
      "completeness": "comprehensive",
      "sourceFile": "mythos/babylonian/rituals/akitu.html",
      "verified": true,
      "updatedBy": "Agent12",
      "enrichmentVersion": "1.0",
      "createdBy": "system",
      "source": "html_parser_enhanced"
    },
    "panelDisplay": {
      "sections": [
        {
          "type": "text",
          "content": "The Babylonian New Year Festival - A twelve-day celebration of cosmic renewal, royal legitimation, and the victory of order over chaos through the annual reenactment of Marduk's triumph over Tiamat.",
          "title": "Description"
        }
      ],
      "layout": "hero"
    },
    "_version": "2.0",
    "symbolism": {
      "creationReenactment": "By reciting Enuma Elish and reenacting Marduk's victory, the festival renewed the cosmos annually, preventing a return to primordial chaos.",
      "kingsHumiliation": "Demonstrated that royal power derived from divine favor, not inherent right. The king ruled as Marduk's representative on earth.",
      "sacredMarriage": "United heaven and earth, ensuring fertility, abundance, and the proper relationship between divine and human realms.",
      "tearOfAcceptance": "When the king's tears flowed after being struck, it showed his genuine humility and Marduk's acceptance of his rule for another year.",
      "processionalWay": "The journey from Esagila to Bit Akitu symbolized the cosmic journey from sacred center to the liminal space where chaos was conquered.",
      "destinyDetermination": "The gods' council meeting paralleled the divine assembly in myth, where fates were decreed at creation. This annual renewal ensured divine will for the coming year."
    },
    "modernPractice": null,
    "entityType": "unknown",
    "historicalContext": {
      "origins": "The Akitu festival dates to at least the early 2nd millennium BCE in Sumerian tradition, where it celebrated the New Year and agricultural renewal. Under Babylonian rule, it became centered on Marduk and incorporated the Enuma Elish creation narrative.",
      "decline": "The festival continued into the Seleucid period but eventually declined with the rise of Christianity and the abandonment of traditional Mesopotamian religion.",
      "persianPeriod": "After Cyrus the Great conquered Babylon (539 BCE), he restored the Akitu festival and proper worship of Marduk, as documented in the Cyrus Cylinder, to legitimize Persian rule.",
      "cancellations": "Historical records show the festival was suspended during periods of foreign occupation, royal absence, or political crisis - emphasizing its role in legitimating royal authority.",
      "significance": "The festival was so important that its cancellation was recorded in chronicles as a sign of political instability. The Akitu Chronicle documents that during King Nabonidus's absence (when he stayed in Tema in Arabia), the festival was not celebrated, causing public disturbance."
    },
    "searchTerms": [
      "akitu",
      "🎭 akitu festival",
      "babylonian",
      "year",
      "festival",
      "twelve",
      "celebration",
      "cosmic",
      "renewal",
      "royal",
      "legitimation",
      "victory",
      "order",
      "over",
      "chaos",
      "through",
      "annual",
      "reenactment",
      "marduk",
      "triumph",
      "tiamat"
    ],
    "sortName": "akitu",
    "prayers": [
      {
        "context": "Spoken by the king on Day 5 before Marduk after being stripped of royal insignia",
        "title": "The King's Negative Confession",
        "text": "I have not sinned, O lord of the lands, I have not been negligent regarding your divinity, I have not destroyed Babylon, I have not caused its dissolution, I have not shaken the Esagila, I have not forgotten your rites, I have not struck the face of a subordinate. I care for Babylon, I have not broken its walls."
      },
      {
        "title": "The Priest's Reassurance",
        "context": "Spoken by the high priest to restore the king's confidence after humiliation",
        "text": "Have no fear of what Marduk has spoken! Bel will hear your prayers. He will magnify your kingship. He will exalt your sovereignty."
      }
    ],
    "importance": 50,
    "_uploadedAt": "2025-12-25T15:46:38.040974",
    "primarySources": [
      {
        "excerpt": "On the fifth day, three and one-third hours after sunrise, the high priest shall come forth and take all the insignia of kingship—the crown, the scepter, the ring, and the mace...",
        "description": "Seleucid-era tablet describing the ritual procedures for Days 2-5 of the festival, including the king's humiliation and restoration",
        "source": "Akitu Ritual Tablet (BM 45749)",
        "date": "c. 300 BCE"
      },
      {
        "source": "Akitu Chronicle (ABC 16)",
        "excerpt": "Year 3 of Nabonidus: The king did not come to Babylon for the akitu festival. Nabu did not come to Babylon. Bel did not go out. The akitu festival was omitted. The population was disturbed...",
        "description": "Chronicles the years when the Akitu festival was not celebrated due to King Nabonidus's absence, showing the festival's political importance",
        "date": "c. 540 BCE"
      },
      {
        "source": "Enuma Elish",
        "description": "The Babylonian creation epic recited in full on Day 4 of the Akitu festival",
        "date": "c. 12th century BCE"
      },
      {
        "source": "Herodotus, Histories Book I:181-183",
        "excerpt": "On the greater altar the Chaldaeans burn a thousand talents' weight of frankincense yearly, when they keep the festival of this god.",
        "description": "Greek historian's eyewitness account of Babylonian temple practices and festival offerings",
        "date": "c. 440 BCE"
      },
      {
        "excerpt": "I returned the gods to their places and let them dwell in eternal abodes... at the command of Marduk, the great lord, I settled in their habitations, in pleasing abodes, the gods of Sumer and Akkad.",
        "date": "539 BCE",
        "source": "Cyrus Cylinder",
        "description": "Persian king's proclamation restoring proper worship and the Akitu festival after conquering Babylon"
      }
    ],
    "listDisplay": {
      "expandable": true,
      "meta": "Babylonian Mythology",
      "expandedContent": "The Babylonian New Year Festival - A twelve-day celebration of cosmic renewal, royal legitimation, and the victory of order over chaos through the annual reenactment of Marduk's triumph over Tiamat.",
      "primary": "Akitu - Deity",
      "secondary": "The Babylonian New Year Festival - A twelve-day celebration of cosmic renewal, royal legitimation, a...",
      "icon": "🔱"
    },
    "gridDisplay": {
      "image": "🔱",
      "badge": "Babylonian",
      "hoverInfo": {
        "domains": [],
        "quick": "The Babylonian New Year Festival - A twelve-day celebration of cosmic renewal, royal legitimation, a..."
      },
      "subtitle": "Deity",
      "title": "Akitu",
      "stats": [
        {
          "value": "Unknown",
          "label": "Domain"
        },
        {
          "value": "🔱",
          "label": "Symbol"
        }
      ]
    },
    "tools": [
      {
        "purpose": "Royal insignia temporarily surrendered by the king and placed before Marduk",
        "item": "Crown, Scepter, Ring, and Mace"
      },
      {
        "purpose": "Images of Marduk, Nabu, and other deities processed through the city",
        "item": "Cult Statues"
      },
      {
        "purpose": "The creation epic recited in full on Day 4",
        "item": "Enuma Elish Tablet"
      },
      {
        "purpose": "Carried divine statues along the Euphrates River and through canals",
        "item": "Processional Barges"
      },
      {
        "purpose": "Herodotus records that 1,000 talents of frankincense were burned annually during the festival",
        "item": "Incense and Offerings"
      },
      {
        "item": "Sacred Garments",
        "purpose": "Special ritual clothing for priests, king, and participants"
      },
      {
        "purpose": "For offerings in Marduk's temple (described by Herodotus)",
        "item": "Golden Altar and Table"
      }
    ],
    "mythology": "babylonian",
    "steps": [
      {
        "day": "Day 1-4",
        "details": "Priests purified the Esagila temple complex. Daily prayers and offerings to Marduk. Recitation of creation myths.",
        "action": "Temple Preparation and Purification"
      },
      {
        "details": "The complete Babylonian creation epic was recited in full, retelling Marduk's victory over Tiamat and the establishment of cosmic order.",
        "action": "Recitation of Enuma Elish",
        "day": "Day 4"
      },
      {
        "day": "Day 5",
        "action": "The King's Humiliation",
        "details": "The high priest removed all royal insignia (crown, scepter, ring, and mace) and placed them before Marduk. The priest struck the king's cheek and pulled his ears. If tears flowed, it was a favorable sign that Marduk accepted the king."
      },
      {
        "day": "Day 5",
        "details": "The king declared: 'I have not sinned, O lord of the lands, I have not been negligent regarding your divinity, I have not destroyed Babylon, I have not caused its dissolution, I have not shaken the Esagila, I have not forgotten your rites, I have not struck the face of a subordinate. I care for Babylon, I have not broken its walls.'",
        "action": "The Negative Confession"
      },
      {
        "action": "The King's Restoration",
        "details": "The priest reassured the king that Marduk would hear his prayers and magnify his kingship. The royal insignia were returned, and the king was struck again - this time to remind him of his mortality and dependence on the gods.",
        "day": "Day 5"
      },
      {
        "day": "Day 6-7",
        "details": "Statues of deities from surrounding cities (especially Nabu from Borsippa) were brought in sacred processions to Babylon to attend Marduk's festival.",
        "action": "Arrival of the Gods"
      },
      {
        "details": "The assembled gods met in council to determine the fates for the coming year. This mirrored the divine assembly described in Enuma Elish.",
        "day": "Day 8",
        "action": "The Determination of Destinies"
      },
      {
        "action": "The Great Procession",
        "day": "Day 9-11",
        "details": "Marduk's statue was carried from Esagila to the Bit Akitu (Festival House) outside the city. The king led the procession, 'taking the hand of Marduk.' Citizens lined the processional way celebrating."
      },
      {
        "day": "Day 11",
        "action": "The Sacred Marriage (Hieros Gamos)",
        "details": "The king enacted a ritual marriage with the high priestess representing Marduk's consort, ensuring fertility for the land. This may have occurred in the Bit Akitu."
      },
      {
        "day": "Day 11",
        "details": "Ritual reenactment of Marduk's battle against Tiamat, symbolizing the victory of order over chaos and the renewal of creation.",
        "action": "The Battle Against Chaos"
      },
      {
        "day": "Day 12",
        "action": "Return to the City",
        "details": "Triumphant return of Marduk's statue to Esagila. Final banquet and celebrations. The cosmic order was renewed for another year."
      }
    ],
    "popularity": 40,
    "filename": "akitu",
    "displayName": "🎭 Akitu Festival",
    "participants": [
      {
        "role": "High Priest (Šešgallu)",
        "description": "Led the ritual procedures, purified the temple, and orchestrated the humiliation and restoration of the king"
      },
      {
        "description": "Central participant who underwent ritual humiliation, confessed his innocence, and was restored to power by Marduk",
        "role": "The King"
      },
      {
        "role": "Priests of Marduk",
        "description": "Performed daily rituals, recited the Enuma Elish creation epic, and maintained temple services"
      },
      {
        "description": "Provided sacred music and hymns throughout the festival",
        "role": "Temple Musicians"
      },
      {
        "description": "Participated in processions, witnessed the sacred marriage rite, and celebrated the renewal of cosmic order",
        "role": "Citizens of Babylon"
      },
      {
        "description": "Brought the statue of Nabu from Borsippa to participate in the festival",
        "role": "Priests of Nabu"
      }
    ],
    "relatedConcepts": [
      "Enuma Elish",
      "Sacred Kingship",
      "Cosmic Renewal",
      "Divine Assembly",
      "Hieros Gamos"
    ],
    "_enhanced": true,
    "timing": "First twelve days of Nisannu (March-April), the Babylonian New Year month. The festival coincided with the spring equinox and agricultural renewal.",
    "name": "Akitu",
    "corpusSearch": {
      "domains": [],
      "variants": [
        "akitu",
        "🎭 akitu festival"
      ],
      "canonical": "akitu",
      "symbols": [],
      "epithets": [],
      "concepts": [],
      "places": []
    },
    "relatedDeities": [
      "Marduk",
      "Nabu",
      "Tiamat",
      "Ea",
      "Ishtar"
    ],
    "icon": "🔱",
    "_created": "2025-12-25T05:23:54.860Z",
    "_modified": "2025-12-25T05:23:54.860Z",
    "description": "The Babylonian New Year Festival - A twelve-day celebration of cosmic renewal, royal legitimation, and the victory of order over chaos through the annual reenactment of Marduk's triumph over Tiamat.",
    "tableDisplay": {
      "columns": {
        "domains": {
          "sortable": false,
          "label": "Domains"
        },
        "mythology": {
          "label": "Mythology",
          "sortable": true
        },
        "importance": {
          "label": "Importance",
          "sortable": true
        },
        "name": {
          "sortable": true,
          "label": "Name"
        }
      },
      "defaultOrder": "desc",
      "defaultSort": "importance"
    }
  },
  {
    "id": "babylonian_divination",
    "sortName": "babyloniandivination",
    "timing": "Performed as needed before important decisions, regularly for the king, during festivals, and when seeking guidance. Some forms like astrology were observed continuously.",
    "_modified": "2025-12-25T05:23:54.859Z",
    "gridDisplay": {
      "subtitle": "Deity",
      "title": "Babylonian Divination",
      "badge": "Babylonian",
      "image": "🔱",
      "stats": [
        {
          "value": "Unknown",
          "label": "Domain"
        },
        {
          "value": "🔱",
          "label": "Symbol"
        }
      ],
      "hoverInfo": {
        "domains": [],
        "quick": "The systematic practice of interpreting divine signs through various methods including extispicy (li..."
      }
    },
    "symbolism": {
      "celestialEarthly": "The principle 'As above, so below' - celestial events reflected divine intentions that would manifest on earth",
      "binaryOpposition": "Omens were classified as favorable (šulmu) or unfavorable (lumnu), often with apotropaic rituals prescribed to avert negative predictions",
      "divineWriting": "Signs in nature, organs, and sky were understood as divine writing - the gods communicated through the created world",
      "liver": "Considered the seat of life and emotions, the liver was the organ most directly connected to divine will. Its complex anatomy allowed for numerous interpretations."
    },
    "_uploadedAt": "2025-12-25T15:46:38.048366",
    "name": "Babylonian Divination",
    "historicalContext": {
      "origins": "Divination practices in Mesopotamia date to the 3rd millennium BCE. The Old Babylonian period (c. 2000-1600 BCE) saw the systematization of omen series and training of professional diviners.",
      "royalMonopoly": "Extispicy was primarily a royal prerogative - the king regularly consulted diviners before military campaigns, construction projects, and important decisions",
      "peakPeriod": "Neo-Assyrian and Neo-Babylonian periods (c. 911-539 BCE) when divination was highly developed, with vast libraries of omen texts at Nineveh and Babylon",
      "influence": "Babylonian divination, especially astrology, profoundly influenced Greek, Roman, Persian, and later Islamic astronomical and astrological traditions",
      "libraries": "King Ashurbanipal's library at Nineveh contained thousands of omen tablets, preserved when the library burned in 612 BCE, baking the clay tablets and preserving them for modern discovery"
    },
    "purpose": [
      "Determine the will and intentions of the gods",
      "Predict future events and outcomes",
      "Guide royal decisions on war, diplomacy, and policy",
      "Determine auspicious times for important actions",
      "Diagnose causes of misfortune or illness",
      "Interpret divine warnings and messages"
    ],
    "mythology": "babylonian",
    "relatedConcepts": [
      "Extispicy",
      "Astrology",
      "Omen Interpretation",
      "Sacred Knowledge",
      "Divine Will"
    ],
    "tableDisplay": {
      "columns": {
        "mythology": {
          "sortable": true,
          "label": "Mythology"
        },
        "domains": {
          "sortable": false,
          "label": "Domains"
        },
        "name": {
          "sortable": true,
          "label": "Name"
        },
        "importance": {
          "sortable": true,
          "label": "Importance"
        }
      },
      "defaultOrder": "desc",
      "defaultSort": "importance"
    },
    "displayName": "🔮 Babylonian Divination",
    "searchTerms": [
      "babylonian divination",
      "🔮 babylonian divination",
      "babylonian",
      "systematic",
      "practice",
      "interpreting",
      "divine",
      "signs",
      "through",
      "various",
      "methods",
      "including",
      "extispicy",
      "liver",
      "divination",
      "astrology",
      "dream",
      "interpretation",
      "omens",
      "primary",
      "means",
      "communication",
      "with",
      "realm",
      "used",
      "discern",
      "will",
      "gods",
      "like",
      "marduk",
      "shamash"
    ],
    "importance": 60,
    "primarySources": [
      {
        "content": "Systematic catalogue of liver and organ features with interpretations",
        "source": "Bārûtu Series",
        "description": "Massive compendium of over 100 tablets covering extispicy, compiled in the Neo-Assyrian period"
      },
      {
        "source": "Enūma Anu Enlil",
        "content": "Lunar, solar, planetary, and weather omens with earthly correspondences",
        "description": "70-tablet series on celestial omens, the foundational text of Mesopotamian astrology"
      },
      {
        "description": "24-tablet series on teratological omens (birth anomalies)",
        "content": "Catalogues malformations and unusual births with their significance",
        "source": "Šumma Izbu"
      },
      {
        "significance": "Training aids for student diviners, showing how to identify and interpret organ features",
        "description": "Clay models of sheep livers with cuneiform labels identifying anatomical features",
        "source": "Old Babylonian Liver Models"
      },
      {
        "content": "Actual divination queries and responses preserved in royal archives",
        "description": "Correspondence from diviners to Assyrian kings reporting divination results",
        "source": "Neo-Assyrian Oracle Reports"
      }
    ],
    "corpusSearch": {
      "symbols": [],
      "variants": [
        "babyloniandivination",
        "🔮 babylonian divination",
        "babylonian divination"
      ],
      "places": [],
      "concepts": [],
      "domains": [],
      "epithets": [],
      "canonical": "babyloniandivination"
    },
    "_enhanced": true,
    "relatedDeities": [
      "Shamash",
      "Adad",
      "Marduk",
      "Ea",
      "Sin",
      "Ishtar"
    ],
    "description": "The systematic practice of interpreting divine signs through various methods including extispicy (liver divination), astrology, dream interpretation, and omens. Divination was the primary means of communication with the divine realm, used to discern the will of gods like Marduk and Shamash.",
    "panelDisplay": {
      "sections": [
        {
          "type": "text",
          "content": "The systematic practice of interpreting divine signs through various methods including extispicy (liver divination), astrology, dream interpretation, and omens. Divination was the primary means of communication with the divine realm, used to discern the will of gods like Marduk and Shamash.",
          "title": "Description"
        }
      ],
      "layout": "hero"
    },
    "methods": [
      {
        "type": "Extispicy (Bārûtu)",
        "organs": "Liver (primary), gall bladder, coils of intestines, lungs, heart",
        "features": "Color, texture, size, markings, abnormalities, divisions, and positions of organs",
        "description": "Examination of animal entrails, especially the liver, which was considered the seat of life and divine communication. The most prestigious form of divination."
      },
      {
        "omens": "Lunar eclipses, planetary positions, Venus phenomena, comets, meteors, weather signs",
        "type": "Celestial Divination (Enūma Anu Enlil)",
        "description": "Observation of astronomical phenomena including planetary movements, eclipses, halos, and unusual events. Believed celestial events presaged earthly ones."
      },
      {
        "type": "Dream Interpretation",
        "description": "Analysis of dreams as divine messages. Dream omen manuals catalogued dream symbols and their meanings.",
        "sources": "The god Zaqīqu was patron of dream interpretation"
      },
      {
        "interpretation": "Shapes, movements, and interactions of oil with water predicted outcomes",
        "description": "Observing patterns formed by oil dropped into water in a bowl",
        "type": "Oil Divination (Lecanomancy)"
      },
      {
        "type": "Smoke Divination (Libanomancy)",
        "description": "Interpreting patterns and movements of incense smoke",
        "signs": "Direction, thickness, color, and behavior of smoke"
      },
      {
        "description": "Interpreting the significance of malformed newborns (human or animal) as divine messages",
        "type": "Birth Omens (Šumma Izbu)",
        "text": "Extensive omen series cataloguing birth abnormalities and their meanings"
      },
      {
        "type": "Terrestrial Omens",
        "description": "Signs from everyday occurrences, animal behavior, encounters on the road, sounds, and natural phenomena"
      }
    ],
    "listDisplay": {
      "icon": "🔱",
      "primary": "Babylonian Divination - Deity",
      "meta": "Babylonian Mythology",
      "expandable": true,
      "secondary": "The systematic practice of interpreting divine signs through various methods including extispicy (li...",
      "expandedContent": "The systematic practice of interpreting divine signs through various methods including extispicy (liver divination), astrology, dream interpretation, and omens. Divination was the primary means of communication with the divine realm, used to discern the will of gods like Marduk and Shamash."
    },
    "popularity": 40,
    "icon": "🔱",
    "participants": [
      {
        "description": "Highly trained specialist in extispicy and omen interpretation. The baru examined animal organs (especially livers) and consulted omen series to discern divine will.",
        "role": "Baru (Diviner-Priest)"
      },
      {
        "role": "Tupšar Enūma Anu Enlil (Astrologer-Scribe)",
        "description": "Scholar-priests who observed celestial phenomena and consulted astronomical omen texts to predict earthly events"
      },
      {
        "role": "Šabrû (Dream Interpreter)",
        "description": "Specialist in interpreting dreams as messages from the gods, consulting dream omen manuals"
      },
      {
        "role": "Āšipu (Exorcist-Priest)",
        "description": "Sometimes involved in divination to diagnose spiritual causes of illness or misfortune"
      },
      {
        "role": "The King or Petitioner",
        "description": "Person seeking divine guidance, often the king before military campaigns or major decisions"
      },
      {
        "role": "Temple Scribes",
        "description": "Recorded divination results and maintained vast omen libraries"
      }
    ],
    "filename": "divination",
    "_version": "2.0",
    "divinationDeities": [
      {
        "role": "Sun god, lord of justice and truth, primary deity invoked in extispicy",
        "deity": "Shamash"
      },
      {
        "role": "Storm god associated with divination and weather omens",
        "deity": "Adad"
      },
      {
        "role": "Supreme deity whose will was often sought through divination",
        "deity": "Marduk"
      },
      {
        "role": "God of wisdom and magic, associated with secret knowledge",
        "deity": "Ea (Enki)"
      },
      {
        "role": "Moon god, crucial for celestial divination and time-keeping",
        "deity": "Sin"
      },
      {
        "role": "Associated with the planet Venus, important in astronomical omens",
        "deity": "Ishtar"
      }
    ],
    "metadata": {
      "createdBy": "system",
      "verified": true,
      "completeness": "comprehensive",
      "createdAt": "2025-12-13T02:38:18.920Z",
      "updatedAt": "2025-12-25T00:00:00.000Z",
      "source": "html_parser_enhanced",
      "sourceFile": "mythos/babylonian/rituals/divination.html",
      "updatedBy": "Agent12",
      "enrichmentVersion": "1.0"
    },
    "_created": "2025-12-25T05:23:54.859Z",
    "prayers": [
      {
        "title": "Invocation to Shamash",
        "context": "Prayer spoken before extispicy to invoke the sun god Shamash (god of justice and truth) and Adad (storm god associated with divination)",
        "text": "O Shamash, lord of judgment, O Adad, lord of divination, I stand before you. Accept my offering, hear my prayer, and reveal the truth through this sacrifice."
      }
    ],
    "modernPractice": "While Babylonian divination is not practiced today, its influence persists in Western astrology, tarot, and other divinatory traditions. The zodiac, horoscopy, and association of planets with earthly events all derive from Babylonian celestial divination.",
    "steps": [
      {
        "details": "The baru priest underwent ritual purification, donned clean garments, and prepared the sacred space. The petitioner stated their question clearly.",
        "phase": "Preparation",
        "action": "Purification Rituals"
      },
      {
        "details": "A sheep or goat was sacrificed according to precise ritual procedures. The animal's acceptance by the gods was noted through its behavior during sacrifice.",
        "phase": "Sacrifice (for Extispicy)",
        "action": "Ritual Slaughter of Sacrificial Animal"
      },
      {
        "action": "Inspection of Organs (Extispicy)",
        "phase": "Examination",
        "details": "The baru carefully examined the liver, gall bladder, lungs, and intestines, noting any irregularities, markings, or unusual features. Each part of the liver had symbolic meaning."
      },
      {
        "action": "Reference to Omen Texts",
        "details": "The diviner consulted standardized omen compendia (like the Bārûtu series) that catalogued thousands of signs and their meanings: 'If the liver shows X feature, then Y will occur.'",
        "phase": "Consultation"
      },
      {
        "phase": "Interpretation",
        "details": "The baru synthesized multiple signs, considering favorable and unfavorable omens together, then pronounced the divine answer to the petitioner's question.",
        "action": "Synthesis and Pronouncement"
      },
      {
        "details": "Scribes recorded the question, method, omens observed, and interpretation on clay tablets for the royal archives.",
        "action": "Recording the Divination",
        "phase": "Documentation"
      },
      {
        "details": "Astrologer-priests observed the positions and movements of planets (especially Jupiter, Venus, Mars), lunar eclipses, and unusual celestial phenomena, consulting the Enūma Anu Enlil series.",
        "phase": "Astronomical Observation",
        "action": "Celestial Divination"
      }
    ],
    "tools": [
      {
        "purpose": "Primary animal for extispicy, believed to carry the divine message in its organs",
        "item": "Sacrificial Sheep or Goat"
      },
      {
        "purpose": "Ritual knife for making precise cuts to extract and examine organs",
        "item": "Bronze Divination Knife"
      },
      {
        "purpose": "Training aids showing anatomical features and their divinatory meanings. Many examples survive from Old Babylonian period.",
        "item": "Clay Liver Models"
      },
      {
        "item": "Omen Compendia Tablets",
        "purpose": "Reference texts like the Bārûtu series (100+ tablets), Enūma Anu Enlil (70 tablets on celestial omens), Šumma Izbu (teratological omens), and dream books"
      },
      {
        "item": "Astronomical Observation Platforms",
        "purpose": "Ziggurats and temple observatories for systematic sky watching"
      },
      {
        "purpose": "For ritual purification before divination",
        "item": "Incense and Purification Water"
      },
      {
        "item": "Stylus and Clay Tablets",
        "purpose": "For recording observations, questions, and interpretations"
      }
    ],
    "entityType": "unknown"
  },
  {
    "id": "buddhist_calendar",
    "name": "Buddhist Calendar",
    "uposathaObservances": {
      "eightPrecepts": [
        "Refrain from killing living beings",
        "Refrain from stealing",
        "Refrain from all sexual activity (celibacy for the day)",
        "Refrain from false speech",
        "Refrain from intoxicants",
        "Refrain from eating after noon",
        "Refrain from entertainment, adornment, and beautification",
        "Refrain from luxurious beds and seats"
      ],
      "purpose": "Temporarily live a life closer to monastic discipline, intensifying mindfulness and reducing worldly attachments"
    },
    "description": "The Buddhist liturgical calendar marking sacred days, festivals, and observances that commemorate key events in the Buddha's life and the history of Buddhism. The calendar varies by region (Theravada, Mahayana, Vajrayana) but shares core observances tied to lunar cycles.",
    "relatedConcepts": [
      "Uposatha",
      "Vassa",
      "Vesak",
      "Triple Gem",
      "Four Noble Truths",
      "Monastic Discipline"
    ],
    "importance": 60,
    "popularity": 40,
    "searchTerms": [
      "buddhist calendar",
      "📅 buddhist calendar",
      "buddhist",
      "liturgical",
      "calendar",
      "marking",
      "sacred",
      "days",
      "festivals",
      "observances",
      "that",
      "commemorate",
      "events",
      "buddha",
      "life",
      "history",
      "buddhism",
      "varies",
      "region",
      "theravada",
      "mahayana",
      "vajrayana",
      "shares",
      "core",
      "tied",
      "lunar",
      "cycles"
    ],
    "sortName": "buddhistcalendar",
    "majorFestivals": [
      {
        "celebrates": "The Buddha's birth, enlightenment, and parinirvana (death) - the three most sacred events in Buddhism",
        "practices": "Temple visits, offerings, Dharma talks, meditation, acts of generosity, lighting lamps, releasing animals, bathing Buddha statues",
        "name": "Vesak (Vaisakha Purnima)",
        "significance": "Most important Buddhist festival, recognized by the UN as 'Vesak Day'",
        "timing": "Full moon of Vaisakha (April-May)"
      },
      {
        "name": "Uposatha Days",
        "timing": "New moon, full moon, and quarter moons (four times monthly)",
        "monastic": "Monks recite the Patimokkha (monastic rules) and confess any infractions on new and full moon days",
        "practices": "Lay followers take the Eight Precepts (rather than usual Five), practice meditation, attend Dharma talks, make offerings, some fast from noon until dawn",
        "purpose": "Regular observance days for intensive practice, following the ancient monastic tradition"
      },
      {
        "timing": "Full moon of Asalha (July)",
        "name": "Asalha Puja (Dharma Day)",
        "practices": "Dharma talks focusing on the first sermon, meditation on the Four Noble Truths, offerings",
        "celebrates": "The Buddha's first sermon in the Deer Park at Sarnath, when he taught the Four Noble Truths and set the Wheel of Dharma in motion"
      },
      {
        "origin": "Instituted by the Buddha to prevent monks from traveling during rainy season when they might trample crops and insects",
        "timing": "Three lunar months during monsoon season (July-October)",
        "description": "Ancient monastic practice where monks cease wandering and remain in one monastery for intensive practice and study",
        "name": "Vassa (Rains Retreat)",
        "practices": "Intensified study, meditation, teaching. Lay people make special offerings to support monks during this period",
        "end": "Kathina ceremony where lay people offer new robes to monks"
      },
      {
        "celebrates": "Conclusion of the Rains Retreat",
        "timing": "Full moon of October (end of Vassa)",
        "name": "Pavarana/Kathina",
        "practices": "Kathina robe-offering ceremony - lay people donate cloth for monks' robes. Monks 'invite' feedback on their conduct during retreat."
      },
      {
        "practices": "Candlelit processions around temples, chanting, meditation, reaffirmation of commitment to Triple Gem",
        "name": "Magha Puja (Sangha Day)",
        "celebrates": "Miraculous assembly when 1,250 enlightened disciples spontaneously gathered to hear the Buddha teach the Ovada Patimokkha (core teachings)",
        "timing": "Full moon of Magha (February-March)"
      },
      {
        "celebrates": "The Buddha's final passing into parinirvana at age 80",
        "timing": "February 15 (Mahayana) or Vesak (Theravada, combined with other events)",
        "practices": "Meditation on impermanence, readings from the Mahaparinibbana Sutta, quiet reflection",
        "name": "Parinirvana Day (Nirvana Day)"
      }
    ],
    "_uploadedAt": "2025-12-25T15:46:38.055233",
    "metadata": {
      "verified": true,
      "createdAt": "2025-12-13T02:38:18.858Z",
      "updatedBy": "Agent12",
      "createdBy": "system",
      "enrichmentVersion": "1.0",
      "sourceFile": "mythos/buddhist/rituals/calendar.html",
      "completeness": "comprehensive",
      "source": "html_parser_enhanced",
      "updatedAt": "2025-12-25T00:00:00.000Z"
    },
    "_created": "2025-12-25T05:23:54.859Z",
    "icon": "🔱",
    "entityType": "unknown",
    "participants": [
      {
        "role": "Monks and Nuns",
        "description": "Lead ceremonies, give teachings, receive offerings from lay devotees"
      },
      {
        "role": "Lay Buddhists",
        "description": "Attend temple services, make offerings, take temporary vows, practice intensively"
      },
      {
        "role": "Temple Attendants",
        "description": "Prepare altars, offerings, and coordinate festival activities"
      }
    ],
    "regionalVariations": [
      {
        "unique": "Songkran (Thai New Year with water festivals), Tod Kathin (robe offering), Loi Krathong (floating lanterns)",
        "tradition": "Theravada (Thailand, Sri Lanka, Myanmar, Cambodia, Laos)",
        "calendar": "Lunar calendar, Vesak is supreme festival"
      },
      {
        "calendar": "Often follows solar calendar with lunar elements",
        "tradition": "Mahayana (China, Japan, Korea, Vietnam)",
        "unique": "Chinese New Year celebrations, Ullambana/Obon (honoring ancestors), Guanyin's birthday, various Bodhisattva commemoration days"
      },
      {
        "tradition": "Vajrayana (Tibet, Bhutan, Mongolia)",
        "unique": "Losar (Tibetan New Year), Monlam (Great Prayer Festival), Saga Dawa (month commemorating Buddha's birth, enlightenment, and death)",
        "calendar": "Tibetan lunar calendar"
      }
    ],
    "_enhanced": true,
    "displayName": "📅 Buddhist Calendar",
    "corpusSearch": {
      "symbols": [],
      "variants": [
        "buddhistcalendar",
        "📅 buddhist calendar",
        "buddhist calendar"
      ],
      "places": [],
      "epithets": [],
      "canonical": "buddhistcalendar",
      "domains": [],
      "concepts": []
    },
    "filename": "calendar",
    "purpose": [
      "Honor and remember key events in the Buddha's life",
      "Create regular opportunities for intensive practice",
      "Mark seasonal and agricultural transitions",
      "Strengthen monastic-lay community bonds",
      "Renew commitment to the Dharma"
    ],
    "_version": "2.0",
    "timing": "Follows the lunar calendar with variations between Theravada (Southeast Asian), Mahayana (East Asian), and Vajrayana (Tibetan) traditions. Most festivals fall on full moon (Purnima) or new moon (Amavasya) days.",
    "primarySources": [
      {
        "source": "Pali Canon (Tipitaka)",
        "relevance": "Describes Uposatha observances, Vassa retreat, and early Buddhist calendar practices"
      },
      {
        "source": "Mahaparinibbana Sutta",
        "relevance": "Account of the Buddha's final days, basis for Parinirvana Day commemorations"
      },
      {
        "relevance": "The Buddha's first sermon, commemorated on Asalha Puja",
        "source": "Dhammacakkappavattana Sutta"
      }
    ],
    "panelDisplay": {
      "sections": [
        {
          "type": "text",
          "title": "Description",
          "content": "The Buddhist liturgical calendar marking sacred days, festivals, and observances that commemorate key events in the Buddha's life and the history of Buddhism. The calendar varies by region (Theravada, Mahayana, Vajrayana) but shares core observances tied to lunar cycles."
        }
      ],
      "layout": "hero"
    },
    "modernPractice": "Buddhist calendar observances continue worldwide with both traditional and adapted forms. Vesak is recognized internationally. Modern urban Buddhists may observe Uposatha days with meditation groups rather than temple visits. Online communities enable global participation in festivals.",
    "_modified": "2025-12-25T05:23:54.859Z",
    "gridDisplay": {
      "hoverInfo": {
        "domains": [],
        "quick": "The Buddhist liturgical calendar marking sacred days, festivals, and observances that commemorate ke..."
      },
      "stats": [
        {
          "value": "Unknown",
          "label": "Domain"
        },
        {
          "value": "🔱",
          "label": "Symbol"
        }
      ],
      "title": "Buddhist Calendar",
      "image": "🔱",
      "badge": "Buddhist",
      "subtitle": "Deity"
    },
    "mythology": "buddhist",
    "listDisplay": {
      "expandedContent": "The Buddhist liturgical calendar marking sacred days, festivals, and observances that commemorate key events in the Buddha's life and the history of Buddhism. The calendar varies by region (Theravada, Mahayana, Vajrayana) but shares core observances tied to lunar cycles.",
      "expandable": true,
      "secondary": "The Buddhist liturgical calendar marking sacred days, festivals, and observances that commemorate ke...",
      "icon": "🔱",
      "primary": "Buddhist Calendar - Deity",
      "meta": "Buddhist Mythology"
    },
    "tableDisplay": {
      "columns": {
        "importance": {
          "sortable": true,
          "label": "Importance"
        },
        "domains": {
          "sortable": false,
          "label": "Domains"
        },
        "name": {
          "label": "Name",
          "sortable": true
        },
        "mythology": {
          "label": "Mythology",
          "sortable": true
        }
      },
      "defaultOrder": "desc",
      "defaultSort": "importance"
    }
  },
  {
    "id": "buddhist_offerings",
    "sortName": "buddhistofferings",
    "importance": 60,
    "_modified": "2025-12-25T05:23:54.858Z",
    "primarySources": [
      {
        "source": "Mangala Sutta",
        "relevance": "Describes various blessings including offering and giving"
      },
      {
        "relevance": "Buddha's teachings on generosity and types of giving",
        "source": "Dana Sutta"
      },
      {
        "source": "Vinaya Pitaka",
        "relevance": "Monastic code describing proper acceptance of offerings and alms"
      }
    ],
    "searchTerms": [
      "buddhist offerings",
      "🕯️ buddhist offerings",
      "buddhist",
      "traditional",
      "offerings",
      "made",
      "buddha",
      "bodhisattvas",
      "altars",
      "expressions",
      "devotion",
      "gratitude",
      "cultivation",
      "generosity",
      "dana",
      "unlike",
      "sacrificial",
      "other",
      "traditions",
      "symbolize",
      "spiritual",
      "qualities",
      "consumed",
      "deities",
      "represent",
      "giver",
      "practice"
    ],
    "_version": "2.0",
    "description": "Traditional offerings made to the Buddha, bodhisattvas, and on altars as expressions of devotion, gratitude, and the cultivation of generosity (dana). Unlike sacrificial offerings in other traditions, Buddhist offerings symbolize spiritual qualities and are not consumed by deities but represent the giver's practice.",
    "popularity": 40,
    "corpusSearch": {
      "canonical": "buddhistofferings",
      "domains": [],
      "symbols": [],
      "concepts": [],
      "epithets": [],
      "variants": [
        "buddhistofferings",
        "🕯️ buddhist offerings",
        "buddhist offerings"
      ],
      "places": []
    },
    "gridDisplay": {
      "stats": [
        {
          "value": "Unknown",
          "label": "Domain"
        },
        {
          "value": "🔱",
          "label": "Symbol"
        }
      ],
      "subtitle": "Deity",
      "image": "🔱",
      "badge": "Buddhist",
      "hoverInfo": {
        "domains": [],
        "quick": "Traditional offerings made to the Buddha, bodhisattvas, and on altars as expressions of devotion, gr..."
      },
      "title": "Buddhist Offerings"
    },
    "panelDisplay": {
      "layout": "hero",
      "sections": [
        {
          "type": "text",
          "content": "Traditional offerings made to the Buddha, bodhisattvas, and on altars as expressions of devotion, gratitude, and the cultivation of generosity (dana). Unlike sacrificial offerings in other traditions, Buddhist offerings symbolize spiritual qualities and are not consumed by deities but represent the giver's practice.",
          "title": "Description"
        }
      ]
    },
    "tools": [
      {
        "purpose": "Sacred space for offerings, often with Buddha statue or image",
        "item": "Altar/Shrine"
      },
      {
        "item": "Offering Bowls",
        "purpose": "Typically seven water bowls, food bowls, or flower vases"
      },
      {
        "purpose": "For burning incense sticks or coils",
        "item": "Incense Holder"
      },
      {
        "purpose": "For light offerings",
        "item": "Candle Stands or Butter Lamp Holders"
      },
      {
        "purpose": "Monks' bowls for receiving food offerings during alms rounds",
        "item": "Alms Bowl (Patra)"
      }
    ],
    "almsgiving": {
      "reciprocity": "The monk provides the layperson opportunity to practice dana (generosity), creating merit. The layperson supports the monk's renunciant life enabling Dharma study and teaching.",
      "modernAdaptation": "In urban areas, alms rounds may be replaced by food offered at temples, but the principle of dana remains central",
      "practice": "Monks leave monastery at dawn, walk designated routes barefoot with bowls. Laypeople wait to offer food, placing it directly in the bowl without touching the monk.",
      "etiquette": "Laypeople bow or kneel while offering. Monks accept silently without thanks (as the giver receives merit, not the monk). Monks eat only what is offered, owning nothing.",
      "description": "Pindapata - the daily alms round where monks walk silently receiving food from laity"
    },
    "traditionalOfferings": [
      {
        "practice": "Often seven water bowls placed on altar each morning, representing offerings to the seven types of noble beings",
        "significance": "Water is pure, freely available, and essential - representing universal accessibility of Dharma",
        "symbolism": "Purification, clarity, coolness (freedom from anger), flexibility",
        "item": "Water"
      },
      {
        "item": "Flowers",
        "symbolism": "Beauty, impermanence (they wilt), the bloom of enlightenment",
        "teaching": "As flowers fade, they teach the first Noble Truth of impermanence (anicca)",
        "practice": "Fresh flowers arranged on altars, often lotus flowers (symbol of enlightenment rising from mud)"
      },
      {
        "symbolism": "Devotion, discipline, moral conduct, purification, the spreading of the Dharma (as fragrance spreads)",
        "item": "Incense",
        "practice": "Incense sticks or coils burned continuously, the smoke representing prayers rising",
        "types": "Sandalwood, agarwood, jasmine - chosen for pure, non-intoxicating scents"
      },
      {
        "practice": "Candles or oil lamps lit on altars, especially butter lamps in Tibetan tradition",
        "significance": "As light dispels darkness, wisdom dispels ignorance",
        "symbolism": "Wisdom, enlightenment, dispelling ignorance, the Buddha as light of the world",
        "item": "Light (Candles, Butter Lamps)"
      },
      {
        "monastic": "Daily alms rounds (pindapata) where laity offer food to monks, enabling both monastic practice and lay merit-making",
        "symbolism": "Generosity, sustenance, the nourishment of Dharma",
        "practice": "Fresh fruit, rice, sweets offered to altars and given as alms to monks",
        "item": "Food"
      }
    ],
    "puja": {
      "description": "Formal offering ceremony (especially in Mahayana/Vajrayana)",
      "elements": "Prostrations, offerings, recitations, visualization, meditation",
      "sevenfoldPrayer": [
        "Prostration and homage",
        "Offering (material and imagined)",
        "Confession of negative actions",
        "Rejoicing in virtues of others",
        "Requesting teachings",
        "Requesting teachers remain",
        "Dedication of merit"
      ]
    },
    "participants": [
      {
        "role": "Lay Buddhists",
        "description": "Primary givers of offerings to altars and monastic community"
      },
      {
        "role": "Monks and Nuns",
        "description": "Receive alms and offerings from laity, enabling lay practice of generosity"
      },
      {
        "role": "Temple Attendants",
        "description": "Maintain altars and coordinate offering ceremonies"
      }
    ],
    "timing": "Daily practice for many Buddhists, intensified during festivals, Uposatha days, temple visits, and special occasions. Offerings to monks traditionally made in the morning.",
    "tableDisplay": {
      "defaultSort": "importance",
      "defaultOrder": "desc",
      "columns": {
        "importance": {
          "sortable": true,
          "label": "Importance"
        },
        "mythology": {
          "sortable": true,
          "label": "Mythology"
        },
        "domains": {
          "sortable": false,
          "label": "Domains"
        },
        "name": {
          "sortable": true,
          "label": "Name"
        }
      }
    },
    "_created": "2025-12-25T05:23:54.858Z",
    "entityType": "unknown",
    "name": "Buddhist Offerings",
    "listDisplay": {
      "primary": "Buddhist Offerings - Deity",
      "expandable": true,
      "meta": "Buddhist Mythology",
      "expandedContent": "Traditional offerings made to the Buddha, bodhisattvas, and on altars as expressions of devotion, gratitude, and the cultivation of generosity (dana). Unlike sacrificial offerings in other traditions, Buddhist offerings symbolize spiritual qualities and are not consumed by deities but represent the giver's practice.",
      "secondary": "Traditional offerings made to the Buddha, bodhisattvas, and on altars as expressions of devotion, gr...",
      "icon": "🔱"
    },
    "relatedConcepts": [
      "Dana (Generosity)",
      "Punya (Merit)",
      "Impermanence",
      "Triple Gem",
      "Mindfulness",
      "Non-attachment"
    ],
    "icon": "🔱",
    "filename": "offerings",
    "mythology": "buddhist",
    "modernPractice": "Buddhist offerings continue worldwide with regional variations. Many practitioners maintain home altars with daily offerings. Monastery support through food, robes (Kathina ceremony), and monetary donations sustains the sangha. Virtual offerings and online pujas have emerged in digital age.",
    "_uploadedAt": "2025-12-25T15:46:38.061469",
    "displayName": "🕯️ Buddhist Offerings",
    "metadata": {
      "sourceFile": "mythos/buddhist/rituals/offerings.html",
      "createdAt": "2025-12-13T02:38:18.863Z",
      "createdBy": "system",
      "enrichmentVersion": "1.0",
      "source": "html_parser_enhanced",
      "verified": true,
      "updatedAt": "2025-12-25T00:00:00.000Z",
      "updatedBy": "Agent12",
      "completeness": "comprehensive"
    },
    "_enhanced": true,
    "eightOfferings": {
      "items": [
        {
          "symbolism": "Purity of body",
          "name": "Water for drinking"
        },
        {
          "name": "Water for bathing",
          "symbolism": "Purity of speech"
        },
        {
          "name": "Flowers",
          "symbolism": "Beauty and impermanence"
        },
        {
          "symbolism": "Moral discipline",
          "name": "Incense"
        },
        {
          "name": "Light",
          "symbolism": "Wisdom"
        },
        {
          "symbolism": "Confidence and aspiration",
          "name": "Perfumed water"
        },
        {
          "name": "Food",
          "symbolism": "Meditation and samadhi"
        },
        {
          "symbolism": "Buddha's speech and teachings",
          "name": "Music"
        }
      ],
      "description": "Traditional Tibetan Buddhist eight-fold offering set"
    },
    "steps": [
      {
        "action": "Purify Intention",
        "details": "Before making offerings, cultivate proper motivation - not for worldly gain but to honor the Triple Gem and cultivate generosity"
      },
      {
        "details": "Arrange offerings mindfully with care and respect. Cleanliness and beauty matter - offers should be the best one can provide",
        "action": "Prepare Offerings"
      },
      {
        "details": "Place offerings on altar with prostrations, bows, or gestures of respect",
        "action": "Present with Reverence"
      },
      {
        "details": "Traditional offering verses or prayers may be recited, such as: 'I offer these flowers, lights, incense, water, and food to the Buddha, Dharma, and Sangha'",
        "action": "Recite Verses"
      },
      {
        "action": "Meditate on Impermanence",
        "details": "Reflect on the impermanent nature of the offerings themselves - flowers will wilt, incense will burn away, water will evaporate"
      },
      {
        "action": "Dedication of Merit",
        "details": "Conclude by dedicating any merit generated to the enlightenment of all beings"
      }
    ],
    "philosophicalContext": {
      "symbolism": "Offerings represent and cultivate inner qualities - generosity, purity, wisdom, discipline",
      "nontheistic": "Unlike devotional offerings in theistic religions, Buddhist offerings are not to appease or please a deity. The Buddha is not a god requiring offerings but an awakened teacher worthy of respect.",
      "emptiness": "Advanced practitioners contemplate the emptiness of giver, gift, and recipient - the 'threefold purity' of giving without attachment",
      "merit": "Offerings create positive karma (punya/merit) that supports spiritual progress, but ultimate goal transcends merit-making"
    },
    "purpose": [
      "Cultivate generosity (dana), the first paramita (perfection)",
      "Express reverence and gratitude to the Triple Gem",
      "Create merit (punya) for spiritual progress",
      "Symbolize impermanence through perishable offerings",
      "Support the monastic sangha",
      "Purify the mind through selfless giving"
    ]
  },
  {
    "id": "christian_baptism",
    "historicalContext": {
      "controversies": "Debates over infant vs believer baptism, validity of heretical baptism, rebaptism (forbidden), mode of baptism shaped church history.",
      "earlyChurch": "Baptism was immediate response to faith (Acts shows same-day baptisms). Initially by immersion. Adult catechumens prepared for months/years before Easter baptism.",
      "infantBaptism": "Evidence for infant baptism appears by 2nd century CE. Became standard practice as Christianity became familial/cultural rather than purely conversion-based.",
      "jewishRoots": "Christian baptism emerged from Jewish ritual immersion (mikveh) and John the Baptist's baptism of repentance"
    },
    "corpusSearch": {
      "symbols": [],
      "canonical": "baptism",
      "epithets": [],
      "variants": [
        "baptism",
        "💧 holy baptism"
      ],
      "concepts": [],
      "domains": [],
      "places": []
    },
    "_uploadedAt": "2025-12-25T15:46:38.068931",
    "modernPractice": "Baptism remains universal Christian practice across all denominations, though practices vary (infant vs believer, immersion vs affusion). Baptismal vows are often renewed at Easter. Ecumenical movement has increased mutual recognition of baptisms across denominations.",
    "listDisplay": {
      "expandedContent": "The foundational sacrament of Christian initiation - the door to life in the Spirit and entry into the Church. Through baptism, a person is incorporated into Christ's death and resurrection, dying to sin and rising to new life, washed clean of all sin and made a member of Christ's Body.",
      "primary": "Baptism - Deity",
      "meta": "Christian Mythology",
      "secondary": "The foundational sacrament of Christian initiation - the door to life in the Spirit and entry into t...",
      "icon": "🔱",
      "expandable": true
    },
    "_created": "2025-12-25T05:23:54.858Z",
    "filename": "baptism",
    "_enhanced": true,
    "_modified": "2025-12-25T05:23:54.858Z",
    "relatedDeities": [
      "God the Father",
      "Jesus Christ",
      "Holy Spirit",
      "John the Baptist"
    ],
    "purpose": [
      "Forgiveness of all sins (original and personal)",
      "Spiritual rebirth - becoming a new creation in Christ",
      "Incorporation into Christ's death and resurrection",
      "Adoption as a child of God and temple of the Holy Spirit",
      "Entrance into the Church, the Body of Christ",
      "Justification and sanctification before God",
      "Indelible spiritual marking as belonging to Christ"
    ],
    "name": "Baptism",
    "tableDisplay": {
      "columns": {
        "name": {
          "sortable": true,
          "label": "Name"
        },
        "importance": {
          "label": "Importance",
          "sortable": true
        },
        "domains": {
          "sortable": false,
          "label": "Domains"
        },
        "mythology": {
          "sortable": true,
          "label": "Mythology"
        }
      },
      "defaultOrder": "desc",
      "defaultSort": "importance"
    },
    "popularity": 40,
    "prayers": [
      {
        "title": "The Baptismal Formula",
        "text": "I baptize you in the name of the Father, and of the Son, and of the Holy Spirit. Amen.",
        "context": "Essential words spoken while applying water"
      },
      {
        "title": "Renunciation of Satan",
        "response": "I do renounce them.",
        "text": "Do you renounce Satan and all his works and pomps?",
        "context": "Asked before profession of faith"
      },
      {
        "text": "Do you believe in God the Father almighty, creator of heaven and earth? Do you believe in Jesus Christ, his only Son, our Lord? Do you believe in the Holy Spirit, the holy catholic Church, the communion of saints, the forgiveness of sins, the resurrection of the body, and life everlasting?",
        "context": "Trinitarian profession using Apostles' Creed structure",
        "response": "I do believe.",
        "title": "Profession of Faith"
      }
    ],
    "metadata": {
      "updatedBy": "Agent12",
      "completeness": "comprehensive",
      "enrichmentVersion": "1.0",
      "verified": true,
      "createdAt": "2025-12-13T02:38:18.965Z",
      "updatedAt": "2025-12-25T00:00:00.000Z",
      "source": "html_parser_enhanced",
      "createdBy": "system",
      "sourceFile": "mythos/christian/rituals/baptism.html"
    },
    "symbolism": {
      "immersion": "Burial with Christ in death (going under) and resurrection to new life (rising from water)",
      "trinitarian": "Invocation of Father, Son, and Holy Spirit reflects Trinitarian nature of God revealed at Jesus' baptism",
      "water": "Cleansing from sin, death and resurrection, new birth, the Spirit hovering over waters at creation"
    },
    "relatedConcepts": [
      "Salvation",
      "Grace",
      "New Birth",
      "Trinity",
      "Resurrection",
      "Church",
      "Holy Spirit"
    ],
    "importance": 65,
    "steps": [
      {
        "details": "Candidate (or godparents for infants) renounces Satan and professes faith in the Holy Trinity. Questions: 'Do you renounce Satan and all his works? Do you believe in God the Father, Son, and Holy Spirit?'",
        "action": "Renunciation and Profession"
      },
      {
        "details": "Minister prays over the baptismal water, asking God to sanctify it for this sacramental purpose",
        "action": "Blessing of the Water"
      },
      {
        "details": "Water is applied (by immersion, affusion, or aspersion) while minister says: 'I baptize you in the name of the Father, and of the Son, and of the Holy Spirit.'",
        "action": "The Baptism"
      },
      {
        "details": "Forehead anointed with sacred oil signifying the gift of the Holy Spirit and incorporation into Christ (the 'Anointed One')",
        "action": "Anointing with Chrism (Catholic/Orthodox)"
      },
      {
        "details": "White garment placed on the baptized, symbolizing putting on Christ and the new creation",
        "action": "Clothing with White Garment"
      },
      {
        "details": "Lit candle given (from the Paschal candle), representing Christ the Light and calling to walk as children of light",
        "action": "Presentation of Candle"
      },
      {
        "details": "Congregation welcomes the newly baptized. In some traditions, the person is carried or walks through the church as sign of full membership",
        "action": "Welcome into the Community"
      }
    ],
    "effects": [
      "Forgiveness of all sins (original sin and personal sins)",
      "New birth - becomes a new creation in Christ",
      "Justification - declared righteous before God through faith",
      "Sanctification - set apart as holy, dwelling place of the Holy Spirit",
      "Incorporation into Christ's Body, the Church",
      "Adoption as God's child and heir to eternal life",
      "Indelible spiritual mark - baptism cannot be repeated"
    ],
    "sortName": "baptism",
    "biblicalFoundation": [
      {
        "event": "Jesus' Baptism",
        "significance": "Though sinless, Jesus submitted to baptism by John. The heavens opened, the Holy Spirit descended as a dove, and the Father's voice declared 'This is my beloved Son.' This revealed the Trinity and consecrated water for baptism.",
        "quote": "And when Jesus was baptized, immediately he went up from the water, and behold, the heavens were opened to him, and he saw the Spirit of God descending like a dove and coming to rest on him; and behold, a voice from heaven said, 'This is my beloved Son, with whom I am well pleased.'",
        "reference": "Matthew 3:13-17, Mark 1:9-11"
      },
      {
        "event": "The Great Commission",
        "significance": "After his resurrection, Jesus commanded the apostles to baptize all nations, establishing baptism as universal means of entry into Christianity",
        "reference": "Matthew 28:18-20",
        "quote": "Go therefore and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit"
      },
      {
        "event": "Pentecost",
        "reference": "Acts 2:37-41",
        "significance": "Peter preached and 3,000 were baptized on the day of Pentecost, beginning the Church's practice of baptism",
        "quote": "Repent and be baptized every one of you in the name of Jesus Christ for the forgiveness of your sins, and you will receive the gift of the Holy Spirit"
      },
      {
        "quote": "Unless one is born of water and the Spirit, he cannot enter the kingdom of God",
        "reference": "John 3:3-5",
        "event": "Born of Water and Spirit",
        "significance": "Jesus told Nicodemus that baptism is necessary for entering the Kingdom"
      }
    ],
    "primarySources": [
      {
        "source": "Matthew 28:18-20",
        "content": "The Great Commission mandating baptism"
      },
      {
        "source": "Acts 2:38",
        "content": "Peter's Pentecost sermon on baptism"
      },
      {
        "source": "Romans 6:3-4",
        "content": "Paul's theology of baptism as participation in Christ's death and resurrection"
      },
      {
        "source": "Galatians 3:26-27",
        "content": "Baptism as putting on Christ"
      },
      {
        "source": "1 Peter 3:20-21",
        "content": "Baptism now saves you"
      },
      {
        "source": "Didache (c. 100 CE)",
        "content": "Early Christian manual describing baptismal practices"
      },
      {
        "content": "'We acknowledge one baptism for the forgiveness of sins'",
        "source": "Nicene Creed (325 CE)"
      }
    ],
    "icon": "🔱",
    "description": "The foundational sacrament of Christian initiation - the door to life in the Spirit and entry into the Church. Through baptism, a person is incorporated into Christ's death and resurrection, dying to sin and rising to new life, washed clean of all sin and made a member of Christ's Body.",
    "displayName": "💧 Holy Baptism",
    "infantVsBeliever": [
      {
        "practice": "Infant baptized into God's grace; faith will be nurtured as they grow. Confirmation later affirms faith personally.",
        "biblical": "Household baptisms in Acts; parallel between circumcision (given to infants) and baptism",
        "type": "Infant Baptism (Paedobaptism)",
        "practiced": "Catholic, Orthodox, Lutheran, Anglican, Reformed churches",
        "theology": "God's grace precedes human response. Children of believers should be included in the covenant community, parallel to circumcision in Old Covenant."
      },
      {
        "practiced": "Baptist, Pentecostal, many evangelical churches",
        "biblical": "New Testament examples show people believed then were baptized",
        "theology": "Baptism should follow personal profession of faith and conscious belief",
        "type": "Believer's Baptism (Credobaptism)",
        "practice": "Usually by immersion after person makes public profession of faith. Viewed as testimony of faith already received."
      }
    ],
    "timing": "Administered at any time, but traditionally during Easter Vigil (most fitting as celebrating Christ's resurrection). Infant baptism occurs soon after birth in traditions practicing it. Adult baptism follows period of catechesis.",
    "baptismalFormula": {
      "validity": "Both proper water and Trinitarian formula are essential for valid baptism. Baptism in Jesus' name alone (as mentioned in Acts) is considered valid by some denominations but not by others.",
      "essential": "'I baptize you in the name of the Father, and of the Son, and of the Holy Spirit' - the Trinitarian formula commanded by Christ in Matthew 28:19"
    },
    "gridDisplay": {
      "hoverInfo": {
        "quick": "The foundational sacrament of Christian initiation - the door to life in the Spirit and entry into t...",
        "domains": []
      },
      "title": "Baptism",
      "badge": "Christian",
      "image": "🔱",
      "stats": [
        {
          "value": "Unknown",
          "label": "Domain"
        },
        {
          "value": "🔱",
          "label": "Symbol"
        }
      ],
      "subtitle": "Deity"
    },
    "_version": "2.0",
    "tools": [
      {
        "purpose": "Contains the blessed water for baptism",
        "item": "Baptismal Font or Pool"
      },
      {
        "purpose": "Essential matter of the sacrament, symbolizing cleansing, death/rebirth, and the Spirit",
        "item": "Water"
      },
      {
        "purpose": "For post-baptismal anointing",
        "item": "Sacred Chrism Oil (Catholic/Orthodox)"
      },
      {
        "purpose": "Symbolizes new life in Christ and purity",
        "item": "White Garment"
      },
      {
        "item": "Baptismal Candle",
        "purpose": "Represents Christ as Light of the World"
      },
      {
        "purpose": "Used to pour water over the head in affusion baptism",
        "item": "Shell (traditional)"
      }
    ],
    "searchTerms": [
      "baptism",
      "💧 holy baptism",
      "christian",
      "foundational",
      "sacrament",
      "initiation",
      "door",
      "life",
      "spirit",
      "entry",
      "into",
      "church",
      "through",
      "person",
      "incorporated",
      "christ",
      "death",
      "resurrection",
      "dying",
      "rising",
      "washed",
      "clean",
      "made",
      "member",
      "body"
    ],
    "forms": [
      {
        "type": "Immersion",
        "symbolism": "Most clearly represents burial with Christ (going under water) and resurrection to new life (emerging)",
        "description": "Person fully submerged in water",
        "practice": "Common practice in early Church, required in Baptist, Orthodox, and some other traditions"
      },
      {
        "practice": "Widely practiced in Catholic and Protestant churches, became common in medieval period",
        "type": "Affusion (Pouring)",
        "symbolism": "Represents the outpouring of the Holy Spirit",
        "description": "Water poured over the person's head"
      },
      {
        "type": "Aspersion (Sprinkling)",
        "practice": "Least common form but valid in churches that practice it",
        "symbolism": "Symbolic cleansing",
        "description": "Water sprinkled on the person's head"
      }
    ],
    "entityType": "unknown",
    "mythology": "christian",
    "panelDisplay": {
      "sections": [
        {
          "content": "The foundational sacrament of Christian initiation - the door to life in the Spirit and entry into the Church. Through baptism, a person is incorporated into Christ's death and resurrection, dying to sin and rising to new life, washed clean of all sin and made a member of Christ's Body.",
          "type": "text",
          "title": "Description"
        }
      ],
      "layout": "hero"
    },
    "participants": [
      {
        "role": "Minister (Priest, Pastor, Deacon)",
        "description": "Ordinarily clergy perform baptism, but in emergency any Christian can baptize"
      },
      {
        "description": "Person being baptized - infant or adult believer",
        "role": "Candidate/Catechumen"
      },
      {
        "role": "Godparents/Sponsors",
        "description": "Witnesses who promise to support the baptized person's Christian life, especially important for infant baptism"
      },
      {
        "role": "Parents (for infant baptism)",
        "description": "Promise to raise child in Christian faith"
      },
      {
        "description": "Witnesses the baptism and welcomes new member into the Church",
        "role": "Congregation"
      }
    ]
  },
  {
    "id": "christian_sacraments",
    "metadata": {
      "createdAt": "2025-12-13T02:38:18.983Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/christian/rituals/sacraments.html",
      "updatedAt": "2025-12-13T02:38:18.983Z"
    },
    "purpose": [],
    "displayName": "✝️ The Seven Sacraments",
    "timing": "",
    "description": "The sacraments\nare sacred rites instituted by Christ through which divine grace\nis conveyed to believers. Catholic and Orthodox Christianity recognize seven sacraments marking the journey of Christian life from\nbirth to death, while Protestant traditions typically observe two (Baptism and Eucharist). Each sacrament combines visible sign with\ninvisible grace, sacred matter with spiritual power, making the divine tangibly present in human experience.",
    "steps": [],
    "tools": [],
    "mythology": "christian",
    "filename": "sacraments",
    "name": "Christian Tradition",
    "primarySources": [],
    "participants": []
  },
  {
    "id": "egyptian_mummification",
    "purpose": [],
    "displayName": "⚱️ Mummification",
    "timing": "",
    "steps": [],
    "tools": [],
    "mythology": "egyptian",
    "filename": "mummification",
    "name": "Egyptian Mythology",
    "primarySources": [],
    "participants": [],
    "metadata": {
      "createdAt": "2025-12-13T02:38:18.827Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/egyptian/rituals/mummification.html",
      "finalEnrichment": true,
      "updatedAt": {
        "_seconds": 1766539878,
        "_nanoseconds": 12000000
      }
    },
    "description": "Also known as ⚱️ Mummification."
  },
  {
    "id": "egyptian_opet-festival",
    "purpose": [],
    "displayName": "🎊 Opet Festival",
    "timing": "",
    "steps": [],
    "tools": [],
    "mythology": "egyptian",
    "filename": "opet-festival",
    "name": "Egyptian Mythology",
    "primarySources": [],
    "participants": [],
    "metadata": {
      "createdAt": "2025-12-13T02:38:18.843Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/egyptian/rituals/opet-festival.html",
      "finalEnrichment": true,
      "updatedAt": {
        "_seconds": 1766539878,
        "_nanoseconds": 88000000
      }
    },
    "description": "Also known as 🎊 Opet Festival."
  },
  {
    "id": "greek_dionysian-rites",
    "metadata": {
      "createdAt": "2025-12-13T02:38:18.574Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/greek/rituals/dionysian-rites.html",
      "updatedAt": "2025-12-13T02:38:18.574Z"
    },
    "purpose": [],
    "displayName": "🍇 Dionysian Mysteries",
    "timing": "",
    "description": "The Dionysian Mysteries\nwere secret religious rites dedicated to Dionysus, god of wine, fertility, and ecstatic liberation.\nThrough ritual intoxication, frenzied dance, and theatrical performance, initiates sought divine madness that dissolved boundaries between\nhuman and divine, civilization and nature, order and chaos.",
    "steps": [],
    "tools": [],
    "mythology": "greek",
    "filename": "dionysian-rites",
    "name": "Greek Mythology",
    "primarySources": [],
    "participants": []
  },
  {
    "id": "greek_eleusinian-mysteries",
    "metadata": {
      "createdAt": "2025-12-13T02:38:18.616Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/greek/rituals/eleusinian-mysteries.html",
      "updatedAt": "2025-12-13T02:38:18.616Z"
    },
    "purpose": [],
    "displayName": "🌾 Eleusinian Mysteries",
    "timing": "",
    "description": "The Eleusinian Mysteries\nwere the most famous and revered secret religious rites of ancient Greece, celebrated for nearly two millennia at Eleusis near Athens.\nDedicated to Demeter and Persephone, these mystery initiations\npromised initiates (mystai) a blessed afterlife and revealed secret knowledge about death, rebirth, and the cycle of life.\nThe rites remained so sacred that their exact content was never fully disclosed, protected by oath of secrecy under penalty of death.",
    "steps": [],
    "tools": [],
    "mythology": "greek",
    "filename": "eleusinian-mysteries",
    "name": "Greek Mythology",
    "primarySources": [],
    "participants": []
  },
  {
    "id": "greek_offerings",
    "metadata": {
      "createdAt": "2025-12-13T02:38:18.645Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/greek/rituals/offerings.html",
      "updatedAt": "2025-12-13T02:38:18.645Z"
    },
    "purpose": [],
    "displayName": "🔥 Greek Ritual Offerings",
    "timing": "",
    "description": "At the heart of Greek religious practice\nstood the offering - the fundamental transaction between mortals and immortals. Through animal sacrifice,\nlibations, dedications, and votive gifts, worshippers honored the gods, sought divine favor, fulfilled vows, and maintained the reciprocal\nrelationship (\"I give so that you may give\")\nthat sustained cosmic and social order.",
    "steps": [],
    "tools": [],
    "mythology": "greek",
    "filename": "offerings",
    "name": "World Mythos Explorer",
    "primarySources": [],
    "participants": []
  },
  {
    "id": "greek_olympic-games",
    "metadata": {
      "createdAt": "2025-12-13T02:38:18.681Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/greek/rituals/olympic-games.html",
      "updatedAt": "2025-12-13T02:38:18.681Z"
    },
    "purpose": [],
    "displayName": "🏆 The Olympic Games",
    "timing": "",
    "description": "The Olympic Games\nwere far more than athletic competitions - they were a sacred festival honoring Zeus, king of the gods,\nheld every four years at his great sanctuary in Olympia. For five days, the Greek world paused in sacred truce (ekecheiria) as athletes,\nspectators, and pilgrims gathered to witness human excellence dedicated to divine glory. The games combined religious ritual, artistic\nperformance, and physical contests, embodying the Greek ideal of kalokagathia\n(beauty and goodness united).",
    "steps": [],
    "tools": [],
    "mythology": "greek",
    "filename": "olympic-games",
    "name": "Greek Mythology",
    "primarySources": [],
    "participants": []
  },
  {
    "id": "hindu_diwali",
    "metadata": {
      "createdAt": "2025-12-13T02:38:18.851Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/hindu/rituals/diwali.html",
      "updatedAt": "2025-12-13T02:38:18.851Z"
    },
    "purpose": [],
    "displayName": "🪔 Diwali",
    "timing": "",
    "description": "The festival celebrating Rama's return to Ayodhya after 14 years of exile and his victory over Ravana. Celebrated with lights, fireworks, sweets, and worship of Lakshmi.",
    "steps": [],
    "tools": [],
    "mythology": "hindu",
    "filename": "diwali",
    "name": "Hindu Rituals",
    "primarySources": [],
    "participants": []
  },
  {
    "id": "islamic_salat",
    "purpose": [],
    "displayName": "🕌 Salat - Islamic Prayer",
    "timing": "",
    "steps": [],
    "tools": [],
    "mythology": "islamic",
    "filename": "salat",
    "name": "Salat",
    "primarySources": [],
    "participants": [],
    "metadata": {
      "createdAt": "2025-12-13T02:38:19.010Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/islamic/rituals/salat.html",
      "finalEnrichment": true,
      "updatedAt": {
        "_seconds": 1766539878,
        "_nanoseconds": 162000000
      }
    },
    "description": "Also known as 🕌 Salat - Islamic Prayer."
  },
  {
    "id": "norse_blot",
    "metadata": {
      "createdAt": "2025-12-13T02:38:18.808Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/norse/rituals/blot.html",
      "updatedAt": "2025-12-13T02:38:18.808Z"
    },
    "purpose": [],
    "displayName": "🔥 Blót - Norse Sacrifice",
    "timing": "",
    "description": "The blót\n(Old Norse \"blessing\" or \"sacrifice\") was the central ritual of Norse religion, a communal sacrifice feast honoring the gods and spirits.\nThrough offerings of animals, mead, and food, Norse peoples maintained reciprocal relationships with Odin,\nThor, Freyr, and the land spirits (landvættir), ensuring fertility,\nprosperity, victory in battle, and cosmic order. The ritual combined sacrifice, feasting, and sacred drinking in ceremonies that bound\ncommunities to their gods and to each other.",
    "steps": [],
    "tools": [],
    "mythology": "norse",
    "filename": "blot",
    "name": "Norse Ritual Sacrifice",
    "primarySources": [],
    "participants": []
  },
  {
    "id": "persian_fire-worship",
    "purpose": [],
    "displayName": "Fire Worship",
    "timing": "",
    "steps": [],
    "tools": [],
    "mythology": "persian",
    "filename": "fire-worship",
    "name": "Persian Mythology",
    "primarySources": [],
    "participants": [],
    "metadata": {
      "createdAt": "2025-12-13T02:38:18.947Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/persian/rituals/fire-worship.html",
      "finalEnrichment": true,
      "updatedAt": {
        "_seconds": 1766539878,
        "_nanoseconds": 240000000
      }
    },
    "description": "Also known as Fire Worship."
  },
  {
    "id": "roman_calendar",
    "purpose": [],
    "displayName": "Roman Religious Calendar",
    "timing": "",
    "steps": [],
    "tools": [],
    "mythology": "roman",
    "filename": "calendar",
    "name": "Roman Mythology",
    "primarySources": [],
    "participants": [],
    "metadata": {
      "createdAt": "2025-12-13T02:38:18.720Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/roman/rituals/calendar.html",
      "finalEnrichment": true,
      "updatedAt": {
        "_seconds": 1766539878,
        "_nanoseconds": 316000000
      }
    },
    "description": "Also known as Roman Religious Calendar."
  },
  {
    "id": "roman_offerings",
    "purpose": [],
    "displayName": "Roman Offerings and Sacrifices",
    "timing": "",
    "steps": [],
    "tools": [],
    "mythology": "roman",
    "filename": "offerings",
    "name": "Roman Mythology",
    "primarySources": [],
    "participants": [],
    "metadata": {
      "createdAt": "2025-12-13T02:38:18.738Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/roman/rituals/offerings.html",
      "finalEnrichment": true,
      "updatedAt": {
        "_seconds": 1766539878,
        "_nanoseconds": 395000000
      }
    },
    "description": "Also known as Roman Offerings and Sacrifices."
  },
  {
    "id": "roman_triumph",
    "purpose": [],
    "displayName": "The Roman Triumph",
    "timing": "",
    "steps": [],
    "tools": [],
    "mythology": "roman",
    "filename": "triumph",
    "name": "Roman Mythology",
    "primarySources": [],
    "participants": [],
    "metadata": {
      "createdAt": "2025-12-13T02:38:18.754Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/roman/rituals/triumph.html",
      "finalEnrichment": true,
      "updatedAt": {
        "_seconds": 1766539878,
        "_nanoseconds": 477000000
      }
    },
    "description": "Also known as The Roman Triumph."
  },
  {
    "id": "tarot_celtic-cross",
    "purpose": [],
    "displayName": "🍀 Celtic Cross Spread",
    "timing": "",
    "steps": [],
    "tools": [],
    "mythology": "tarot",
    "filename": "celtic-cross",
    "name": "Tarot Rituals",
    "primarySources": [],
    "participants": [],
    "metadata": {
      "createdAt": "2025-12-13T02:38:19.034Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/tarot/rituals/celtic-cross.html",
      "finalEnrichment": true,
      "updatedAt": {
        "_seconds": 1766539878,
        "_nanoseconds": 573000000
      }
    },
    "description": "Also known as 🍀 Celtic Cross Spread."
  }
]