[
  {
    "id": "babylonian_akitu",
    "purpose": [
      "Celebrate the New Year and cosmic renewal",
      "Renew the king's divine mandate to rule",
      "Reenact Marduk's victory over chaos",
      "Ensure fertility and prosperity for the coming year",
      "Reaffirm the cosmic order established at creation",
      "Petition the gods to determine favorable destinies"
    ],
    "metadata": {
      "createdAt": "2025-12-13T02:38:18.907Z",
      "updatedAt": "2025-12-25T00:00:00.000Z",
      "completeness": "comprehensive",
      "sourceFile": "mythos/babylonian/rituals/akitu.html",
      "verified": true,
      "updatedBy": "Agent12",
      "enrichmentVersion": "1.0",
      "createdBy": "system",
      "source": "html_parser_enhanced"
    },
    "panelDisplay": {
      "sections": [
        {
          "type": "text",
          "content": "The Babylonian New Year Festival - A twelve-day celebration of cosmic renewal, royal legitimation, and the victory of order over chaos through the annual reenactment of Marduk's triumph over Tiamat.",
          "title": "Description"
        }
      ],
      "layout": "hero"
    },
    "_version": "2.0",
    "symbolism": {
      "creationReenactment": "By reciting Enuma Elish and reenacting Marduk's victory, the festival renewed the cosmos annually, preventing a return to primordial chaos.",
      "kingsHumiliation": "Demonstrated that royal power derived from divine favor, not inherent right. The king ruled as Marduk's representative on earth.",
      "sacredMarriage": "United heaven and earth, ensuring fertility, abundance, and the proper relationship between divine and human realms.",
      "tearOfAcceptance": "When the king's tears flowed after being struck, it showed his genuine humility and Marduk's acceptance of his rule for another year.",
      "processionalWay": "The journey from Esagila to Bit Akitu symbolized the cosmic journey from sacred center to the liminal space where chaos was conquered.",
      "destinyDetermination": "The gods' council meeting paralleled the divine assembly in myth, where fates were decreed at creation. This annual renewal ensured divine will for the coming year."
    },
    "modernPractice": null,
    "entityType": "unknown",
    "historicalContext": {
      "origins": "The Akitu festival dates to at least the early 2nd millennium BCE in Sumerian tradition, where it celebrated the New Year and agricultural renewal. Under Babylonian rule, it became centered on Marduk and incorporated the Enuma Elish creation narrative.",
      "decline": "The festival continued into the Seleucid period but eventually declined with the rise of Christianity and the abandonment of traditional Mesopotamian religion.",
      "persianPeriod": "After Cyrus the Great conquered Babylon (539 BCE), he restored the Akitu festival and proper worship of Marduk, as documented in the Cyrus Cylinder, to legitimize Persian rule.",
      "cancellations": "Historical records show the festival was suspended during periods of foreign occupation, royal absence, or political crisis - emphasizing its role in legitimating royal authority.",
      "significance": "The festival was so important that its cancellation was recorded in chronicles as a sign of political instability. The Akitu Chronicle documents that during King Nabonidus's absence (when he stayed in Tema in Arabia), the festival was not celebrated, causing public disturbance."
    },
    "searchTerms": [
      "akitu",
      "🎭 akitu festival",
      "babylonian",
      "year",
      "festival",
      "twelve",
      "celebration",
      "cosmic",
      "renewal",
      "royal",
      "legitimation",
      "victory",
      "order",
      "over",
      "chaos",
      "through",
      "annual",
      "reenactment",
      "marduk",
      "triumph",
      "tiamat"
    ],
    "sortName": "akitu",
    "prayers": [
      {
        "context": "Spoken by the king on Day 5 before Marduk after being stripped of royal insignia",
        "title": "The King's Negative Confession",
        "text": "I have not sinned, O lord of the lands, I have not been negligent regarding your divinity, I have not destroyed Babylon, I have not caused its dissolution, I have not shaken the Esagila, I have not forgotten your rites, I have not struck the face of a subordinate. I care for Babylon, I have not broken its walls."
      },
      {
        "title": "The Priest's Reassurance",
        "context": "Spoken by the high priest to restore the king's confidence after humiliation",
        "text": "Have no fear of what Marduk has spoken! Bel will hear your prayers. He will magnify your kingship. He will exalt your sovereignty."
      }
    ],
    "importance": 50,
    "_uploadedAt": "2025-12-25T15:46:38.040974",
    "primarySources": [
      {
        "excerpt": "On the fifth day, three and one-third hours after sunrise, the high priest shall come forth and take all the insignia of kingship—the crown, the scepter, the ring, and the mace...",
        "description": "Seleucid-era tablet describing the ritual procedures for Days 2-5 of the festival, including the king's humiliation and restoration",
        "source": "Akitu Ritual Tablet (BM 45749)",
        "date": "c. 300 BCE"
      },
      {
        "source": "Akitu Chronicle (ABC 16)",
        "excerpt": "Year 3 of Nabonidus: The king did not come to Babylon for the akitu festival. Nabu did not come to Babylon. Bel did not go out. The akitu festival was omitted. The population was disturbed...",
        "description": "Chronicles the years when the Akitu festival was not celebrated due to King Nabonidus's absence, showing the festival's political importance",
        "date": "c. 540 BCE"
      },
      {
        "source": "Enuma Elish",
        "description": "The Babylonian creation epic recited in full on Day 4 of the Akitu festival",
        "date": "c. 12th century BCE"
      },
      {
        "source": "Herodotus, Histories Book I:181-183",
        "excerpt": "On the greater altar the Chaldaeans burn a thousand talents' weight of frankincense yearly, when they keep the festival of this god.",
        "description": "Greek historian's eyewitness account of Babylonian temple practices and festival offerings",
        "date": "c. 440 BCE"
      },
      {
        "excerpt": "I returned the gods to their places and let them dwell in eternal abodes... at the command of Marduk, the great lord, I settled in their habitations, in pleasing abodes, the gods of Sumer and Akkad.",
        "date": "539 BCE",
        "source": "Cyrus Cylinder",
        "description": "Persian king's proclamation restoring proper worship and the Akitu festival after conquering Babylon"
      }
    ],
    "listDisplay": {
      "expandable": true,
      "meta": "Babylonian Mythology",
      "expandedContent": "The Babylonian New Year Festival - A twelve-day celebration of cosmic renewal, royal legitimation, and the victory of order over chaos through the annual reenactment of Marduk's triumph over Tiamat.",
      "primary": "Akitu - Deity",
      "secondary": "The Babylonian New Year Festival - A twelve-day celebration of cosmic renewal, royal legitimation, a...",
      "icon": "🔱"
    },
    "gridDisplay": {
      "image": "🔱",
      "badge": "Babylonian",
      "hoverInfo": {
        "domains": [],
        "quick": "The Babylonian New Year Festival - A twelve-day celebration of cosmic renewal, royal legitimation, a..."
      },
      "subtitle": "Deity",
      "title": "Akitu",
      "stats": [
        {
          "value": "Unknown",
          "label": "Domain"
        },
        {
          "value": "🔱",
          "label": "Symbol"
        }
      ]
    },
    "tools": [
      {
        "purpose": "Royal insignia temporarily surrendered by the king and placed before Marduk",
        "item": "Crown, Scepter, Ring, and Mace"
      },
      {
        "purpose": "Images of Marduk, Nabu, and other deities processed through the city",
        "item": "Cult Statues"
      },
      {
        "purpose": "The creation epic recited in full on Day 4",
        "item": "Enuma Elish Tablet"
      },
      {
        "purpose": "Carried divine statues along the Euphrates River and through canals",
        "item": "Processional Barges"
      },
      {
        "purpose": "Herodotus records that 1,000 talents of frankincense were burned annually during the festival",
        "item": "Incense and Offerings"
      },
      {
        "item": "Sacred Garments",
        "purpose": "Special ritual clothing for priests, king, and participants"
      },
      {
        "purpose": "For offerings in Marduk's temple (described by Herodotus)",
        "item": "Golden Altar and Table"
      }
    ],
    "mythology": "babylonian",
    "steps": [
      {
        "day": "Day 1-4",
        "details": "Priests purified the Esagila temple complex. Daily prayers and offerings to Marduk. Recitation of creation myths.",
        "action": "Temple Preparation and Purification"
      },
      {
        "details": "The complete Babylonian creation epic was recited in full, retelling Marduk's victory over Tiamat and the establishment of cosmic order.",
        "action": "Recitation of Enuma Elish",
        "day": "Day 4"
      },
      {
        "day": "Day 5",
        "action": "The King's Humiliation",
        "details": "The high priest removed all royal insignia (crown, scepter, ring, and mace) and placed them before Marduk. The priest struck the king's cheek and pulled his ears. If tears flowed, it was a favorable sign that Marduk accepted the king."
      },
      {
        "day": "Day 5",
        "details": "The king declared: 'I have not sinned, O lord of the lands, I have not been negligent regarding your divinity, I have not destroyed Babylon, I have not caused its dissolution, I have not shaken the Esagila, I have not forgotten your rites, I have not struck the face of a subordinate. I care for Babylon, I have not broken its walls.'",
        "action": "The Negative Confession"
      },
      {
        "action": "The King's Restoration",
        "details": "The priest reassured the king that Marduk would hear his prayers and magnify his kingship. The royal insignia were returned, and the king was struck again - this time to remind him of his mortality and dependence on the gods.",
        "day": "Day 5"
      },
      {
        "day": "Day 6-7",
        "details": "Statues of deities from surrounding cities (especially Nabu from Borsippa) were brought in sacred processions to Babylon to attend Marduk's festival.",
        "action": "Arrival of the Gods"
      },
      {
        "details": "The assembled gods met in council to determine the fates for the coming year. This mirrored the divine assembly described in Enuma Elish.",
        "day": "Day 8",
        "action": "The Determination of Destinies"
      },
      {
        "action": "The Great Procession",
        "day": "Day 9-11",
        "details": "Marduk's statue was carried from Esagila to the Bit Akitu (Festival House) outside the city. The king led the procession, 'taking the hand of Marduk.' Citizens lined the processional way celebrating."
      },
      {
        "day": "Day 11",
        "action": "The Sacred Marriage (Hieros Gamos)",
        "details": "The king enacted a ritual marriage with the high priestess representing Marduk's consort, ensuring fertility for the land. This may have occurred in the Bit Akitu."
      },
      {
        "day": "Day 11",
        "details": "Ritual reenactment of Marduk's battle against Tiamat, symbolizing the victory of order over chaos and the renewal of creation.",
        "action": "The Battle Against Chaos"
      },
      {
        "day": "Day 12",
        "action": "Return to the City",
        "details": "Triumphant return of Marduk's statue to Esagila. Final banquet and celebrations. The cosmic order was renewed for another year."
      }
    ],
    "popularity": 40,
    "filename": "akitu",
    "displayName": "🎭 Akitu Festival",
    "participants": [
      {
        "role": "High Priest (Šešgallu)",
        "description": "Led the ritual procedures, purified the temple, and orchestrated the humiliation and restoration of the king"
      },
      {
        "description": "Central participant who underwent ritual humiliation, confessed his innocence, and was restored to power by Marduk",
        "role": "The King"
      },
      {
        "role": "Priests of Marduk",
        "description": "Performed daily rituals, recited the Enuma Elish creation epic, and maintained temple services"
      },
      {
        "description": "Provided sacred music and hymns throughout the festival",
        "role": "Temple Musicians"
      },
      {
        "description": "Participated in processions, witnessed the sacred marriage rite, and celebrated the renewal of cosmic order",
        "role": "Citizens of Babylon"
      },
      {
        "description": "Brought the statue of Nabu from Borsippa to participate in the festival",
        "role": "Priests of Nabu"
      }
    ],
    "relatedConcepts": [
      "Enuma Elish",
      "Sacred Kingship",
      "Cosmic Renewal",
      "Divine Assembly",
      "Hieros Gamos"
    ],
    "_enhanced": true,
    "timing": "First twelve days of Nisannu (March-April), the Babylonian New Year month. The festival coincided with the spring equinox and agricultural renewal.",
    "name": "Akitu",
    "corpusSearch": {
      "domains": [],
      "variants": [
        "akitu",
        "🎭 akitu festival"
      ],
      "canonical": "akitu",
      "symbols": [],
      "epithets": [],
      "concepts": [],
      "places": []
    },
    "relatedDeities": [
      "Marduk",
      "Nabu",
      "Tiamat",
      "Ea",
      "Ishtar"
    ],
    "icon": "🔱",
    "_created": "2025-12-25T05:23:54.860Z",
    "_modified": "2025-12-25T05:23:54.860Z",
    "description": "The Babylonian New Year Festival - A twelve-day celebration of cosmic renewal, royal legitimation, and the victory of order over chaos through the annual reenactment of Marduk's triumph over Tiamat.",
    "tableDisplay": {
      "columns": {
        "domains": {
          "sortable": false,
          "label": "Domains"
        },
        "mythology": {
          "label": "Mythology",
          "sortable": true
        },
        "importance": {
          "label": "Importance",
          "sortable": true
        },
        "name": {
          "sortable": true,
          "label": "Name"
        }
      },
      "defaultOrder": "desc",
      "defaultSort": "importance"
    }
  },
  {
    "id": "babylonian_divination",
    "sortName": "babyloniandivination",
    "timing": "Performed as needed before important decisions, regularly for the king, during festivals, and when seeking guidance. Some forms like astrology were observed continuously.",
    "_modified": "2025-12-25T05:23:54.859Z",
    "gridDisplay": {
      "subtitle": "Deity",
      "title": "Babylonian Divination",
      "badge": "Babylonian",
      "image": "🔱",
      "stats": [
        {
          "value": "Unknown",
          "label": "Domain"
        },
        {
          "value": "🔱",
          "label": "Symbol"
        }
      ],
      "hoverInfo": {
        "domains": [],
        "quick": "The systematic practice of interpreting divine signs through various methods including extispicy (li..."
      }
    },
    "symbolism": {
      "celestialEarthly": "The principle 'As above, so below' - celestial events reflected divine intentions that would manifest on earth",
      "binaryOpposition": "Omens were classified as favorable (šulmu) or unfavorable (lumnu), often with apotropaic rituals prescribed to avert negative predictions",
      "divineWriting": "Signs in nature, organs, and sky were understood as divine writing - the gods communicated through the created world",
      "liver": "Considered the seat of life and emotions, the liver was the organ most directly connected to divine will. Its complex anatomy allowed for numerous interpretations."
    },
    "_uploadedAt": "2025-12-25T15:46:38.048366",
    "name": "Babylonian Divination",
    "historicalContext": {
      "origins": "Divination practices in Mesopotamia date to the 3rd millennium BCE. The Old Babylonian period (c. 2000-1600 BCE) saw the systematization of omen series and training of professional diviners.",
      "royalMonopoly": "Extispicy was primarily a royal prerogative - the king regularly consulted diviners before military campaigns, construction projects, and important decisions",
      "peakPeriod": "Neo-Assyrian and Neo-Babylonian periods (c. 911-539 BCE) when divination was highly developed, with vast libraries of omen texts at Nineveh and Babylon",
      "influence": "Babylonian divination, especially astrology, profoundly influenced Greek, Roman, Persian, and later Islamic astronomical and astrological traditions",
      "libraries": "King Ashurbanipal's library at Nineveh contained thousands of omen tablets, preserved when the library burned in 612 BCE, baking the clay tablets and preserving them for modern discovery"
    },
    "purpose": [
      "Determine the will and intentions of the gods",
      "Predict future events and outcomes",
      "Guide royal decisions on war, diplomacy, and policy",
      "Determine auspicious times for important actions",
      "Diagnose causes of misfortune or illness",
      "Interpret divine warnings and messages"
    ],
    "mythology": "babylonian",
    "relatedConcepts": [
      "Extispicy",
      "Astrology",
      "Omen Interpretation",
      "Sacred Knowledge",
      "Divine Will"
    ],
    "tableDisplay": {
      "columns": {
        "mythology": {
          "sortable": true,
          "label": "Mythology"
        },
        "domains": {
          "sortable": false,
          "label": "Domains"
        },
        "name": {
          "sortable": true,
          "label": "Name"
        },
        "importance": {
          "sortable": true,
          "label": "Importance"
        }
      },
      "defaultOrder": "desc",
      "defaultSort": "importance"
    },
    "displayName": "🔮 Babylonian Divination",
    "searchTerms": [
      "babylonian divination",
      "🔮 babylonian divination",
      "babylonian",
      "systematic",
      "practice",
      "interpreting",
      "divine",
      "signs",
      "through",
      "various",
      "methods",
      "including",
      "extispicy",
      "liver",
      "divination",
      "astrology",
      "dream",
      "interpretation",
      "omens",
      "primary",
      "means",
      "communication",
      "with",
      "realm",
      "used",
      "discern",
      "will",
      "gods",
      "like",
      "marduk",
      "shamash"
    ],
    "importance": 60,
    "primarySources": [
      {
        "content": "Systematic catalogue of liver and organ features with interpretations",
        "source": "Bārûtu Series",
        "description": "Massive compendium of over 100 tablets covering extispicy, compiled in the Neo-Assyrian period"
      },
      {
        "source": "Enūma Anu Enlil",
        "content": "Lunar, solar, planetary, and weather omens with earthly correspondences",
        "description": "70-tablet series on celestial omens, the foundational text of Mesopotamian astrology"
      },
      {
        "description": "24-tablet series on teratological omens (birth anomalies)",
        "content": "Catalogues malformations and unusual births with their significance",
        "source": "Šumma Izbu"
      },
      {
        "significance": "Training aids for student diviners, showing how to identify and interpret organ features",
        "description": "Clay models of sheep livers with cuneiform labels identifying anatomical features",
        "source": "Old Babylonian Liver Models"
      },
      {
        "content": "Actual divination queries and responses preserved in royal archives",
        "description": "Correspondence from diviners to Assyrian kings reporting divination results",
        "source": "Neo-Assyrian Oracle Reports"
      }
    ],
    "corpusSearch": {
      "symbols": [],
      "variants": [
        "babyloniandivination",
        "🔮 babylonian divination",
        "babylonian divination"
      ],
      "places": [],
      "concepts": [],
      "domains": [],
      "epithets": [],
      "canonical": "babyloniandivination"
    },
    "_enhanced": true,
    "relatedDeities": [
      "Shamash",
      "Adad",
      "Marduk",
      "Ea",
      "Sin",
      "Ishtar"
    ],
    "description": "The systematic practice of interpreting divine signs through various methods including extispicy (liver divination), astrology, dream interpretation, and omens. Divination was the primary means of communication with the divine realm, used to discern the will of gods like Marduk and Shamash.",
    "panelDisplay": {
      "sections": [
        {
          "type": "text",
          "content": "The systematic practice of interpreting divine signs through various methods including extispicy (liver divination), astrology, dream interpretation, and omens. Divination was the primary means of communication with the divine realm, used to discern the will of gods like Marduk and Shamash.",
          "title": "Description"
        }
      ],
      "layout": "hero"
    },
    "methods": [
      {
        "type": "Extispicy (Bārûtu)",
        "organs": "Liver (primary), gall bladder, coils of intestines, lungs, heart",
        "features": "Color, texture, size, markings, abnormalities, divisions, and positions of organs",
        "description": "Examination of animal entrails, especially the liver, which was considered the seat of life and divine communication. The most prestigious form of divination."
      },
      {
        "omens": "Lunar eclipses, planetary positions, Venus phenomena, comets, meteors, weather signs",
        "type": "Celestial Divination (Enūma Anu Enlil)",
        "description": "Observation of astronomical phenomena including planetary movements, eclipses, halos, and unusual events. Believed celestial events presaged earthly ones."
      },
      {
        "type": "Dream Interpretation",
        "description": "Analysis of dreams as divine messages. Dream omen manuals catalogued dream symbols and their meanings.",
        "sources": "The god Zaqīqu was patron of dream interpretation"
      },
      {
        "interpretation": "Shapes, movements, and interactions of oil with water predicted outcomes",
        "description": "Observing patterns formed by oil dropped into water in a bowl",
        "type": "Oil Divination (Lecanomancy)"
      },
      {
        "type": "Smoke Divination (Libanomancy)",
        "description": "Interpreting patterns and movements of incense smoke",
        "signs": "Direction, thickness, color, and behavior of smoke"
      },
      {
        "description": "Interpreting the significance of malformed newborns (human or animal) as divine messages",
        "type": "Birth Omens (Šumma Izbu)",
        "text": "Extensive omen series cataloguing birth abnormalities and their meanings"
      },
      {
        "type": "Terrestrial Omens",
        "description": "Signs from everyday occurrences, animal behavior, encounters on the road, sounds, and natural phenomena"
      }
    ],
    "listDisplay": {
      "icon": "🔱",
      "primary": "Babylonian Divination - Deity",
      "meta": "Babylonian Mythology",
      "expandable": true,
      "secondary": "The systematic practice of interpreting divine signs through various methods including extispicy (li...",
      "expandedContent": "The systematic practice of interpreting divine signs through various methods including extispicy (liver divination), astrology, dream interpretation, and omens. Divination was the primary means of communication with the divine realm, used to discern the will of gods like Marduk and Shamash."
    },
    "popularity": 40,
    "icon": "🔱",
    "participants": [
      {
        "description": "Highly trained specialist in extispicy and omen interpretation. The baru examined animal organs (especially livers) and consulted omen series to discern divine will.",
        "role": "Baru (Diviner-Priest)"
      },
      {
        "role": "Tupšar Enūma Anu Enlil (Astrologer-Scribe)",
        "description": "Scholar-priests who observed celestial phenomena and consulted astronomical omen texts to predict earthly events"
      },
      {
        "role": "Šabrû (Dream Interpreter)",
        "description": "Specialist in interpreting dreams as messages from the gods, consulting dream omen manuals"
      },
      {
        "role": "Āšipu (Exorcist-Priest)",
        "description": "Sometimes involved in divination to diagnose spiritual causes of illness or misfortune"
      },
      {
        "role": "The King or Petitioner",
        "description": "Person seeking divine guidance, often the king before military campaigns or major decisions"
      },
      {
        "role": "Temple Scribes",
        "description": "Recorded divination results and maintained vast omen libraries"
      }
    ],
    "filename": "divination",
    "_version": "2.0",
    "divinationDeities": [
      {
        "role": "Sun god, lord of justice and truth, primary deity invoked in extispicy",
        "deity": "Shamash"
      },
      {
        "role": "Storm god associated with divination and weather omens",
        "deity": "Adad"
      },
      {
        "role": "Supreme deity whose will was often sought through divination",
        "deity": "Marduk"
      },
      {
        "role": "God of wisdom and magic, associated with secret knowledge",
        "deity": "Ea (Enki)"
      },
      {
        "role": "Moon god, crucial for celestial divination and time-keeping",
        "deity": "Sin"
      },
      {
        "role": "Associated with the planet Venus, important in astronomical omens",
        "deity": "Ishtar"
      }
    ],
    "metadata": {
      "createdBy": "system",
      "verified": true,
      "completeness": "comprehensive",
      "createdAt": "2025-12-13T02:38:18.920Z",
      "updatedAt": "2025-12-25T00:00:00.000Z",
      "source": "html_parser_enhanced",
      "sourceFile": "mythos/babylonian/rituals/divination.html",
      "updatedBy": "Agent12",
      "enrichmentVersion": "1.0"
    },
    "_created": "2025-12-25T05:23:54.859Z",
    "prayers": [
      {
        "title": "Invocation to Shamash",
        "context": "Prayer spoken before extispicy to invoke the sun god Shamash (god of justice and truth) and Adad (storm god associated with divination)",
        "text": "O Shamash, lord of judgment, O Adad, lord of divination, I stand before you. Accept my offering, hear my prayer, and reveal the truth through this sacrifice."
      }
    ],
    "modernPractice": "While Babylonian divination is not practiced today, its influence persists in Western astrology, tarot, and other divinatory traditions. The zodiac, horoscopy, and association of planets with earthly events all derive from Babylonian celestial divination.",
    "steps": [
      {
        "details": "The baru priest underwent ritual purification, donned clean garments, and prepared the sacred space. The petitioner stated their question clearly.",
        "phase": "Preparation",
        "action": "Purification Rituals"
      },
      {
        "details": "A sheep or goat was sacrificed according to precise ritual procedures. The animal's acceptance by the gods was noted through its behavior during sacrifice.",
        "phase": "Sacrifice (for Extispicy)",
        "action": "Ritual Slaughter of Sacrificial Animal"
      },
      {
        "action": "Inspection of Organs (Extispicy)",
        "phase": "Examination",
        "details": "The baru carefully examined the liver, gall bladder, lungs, and intestines, noting any irregularities, markings, or unusual features. Each part of the liver had symbolic meaning."
      },
      {
        "action": "Reference to Omen Texts",
        "details": "The diviner consulted standardized omen compendia (like the Bārûtu series) that catalogued thousands of signs and their meanings: 'If the liver shows X feature, then Y will occur.'",
        "phase": "Consultation"
      },
      {
        "phase": "Interpretation",
        "details": "The baru synthesized multiple signs, considering favorable and unfavorable omens together, then pronounced the divine answer to the petitioner's question.",
        "action": "Synthesis and Pronouncement"
      },
      {
        "details": "Scribes recorded the question, method, omens observed, and interpretation on clay tablets for the royal archives.",
        "action": "Recording the Divination",
        "phase": "Documentation"
      },
      {
        "details": "Astrologer-priests observed the positions and movements of planets (especially Jupiter, Venus, Mars), lunar eclipses, and unusual celestial phenomena, consulting the Enūma Anu Enlil series.",
        "phase": "Astronomical Observation",
        "action": "Celestial Divination"
      }
    ],
    "tools": [
      {
        "purpose": "Primary animal for extispicy, believed to carry the divine message in its organs",
        "item": "Sacrificial Sheep or Goat"
      },
      {
        "purpose": "Ritual knife for making precise cuts to extract and examine organs",
        "item": "Bronze Divination Knife"
      },
      {
        "purpose": "Training aids showing anatomical features and their divinatory meanings. Many examples survive from Old Babylonian period.",
        "item": "Clay Liver Models"
      },
      {
        "item": "Omen Compendia Tablets",
        "purpose": "Reference texts like the Bārûtu series (100+ tablets), Enūma Anu Enlil (70 tablets on celestial omens), Šumma Izbu (teratological omens), and dream books"
      },
      {
        "item": "Astronomical Observation Platforms",
        "purpose": "Ziggurats and temple observatories for systematic sky watching"
      },
      {
        "purpose": "For ritual purification before divination",
        "item": "Incense and Purification Water"
      },
      {
        "item": "Stylus and Clay Tablets",
        "purpose": "For recording observations, questions, and interpretations"
      }
    ],
    "entityType": "unknown"
  }
]