{
  "id": "hoodoo",
  "type": "magic",
  "name": "Hoodoo",
  "icon": "🕯️",
  "slug": "hoodoo",
  "mythologies": [
    "african-american",
    "west-african",
    "christian"
  ],
  "primaryMythology": "african-american",
  "shortDescription": "African-American folk magic tradition (also called rootwork or conjure) blending West African spiritual practices with Christian elements, using roots, herbs, biblical psalms, candles, and spiritual supplies for practical work including love drawing, money drawing, protection, and jinx removal",
  "fullDescription": "Hoodoo (also called rootwork, conjure, or rootwork) is the African-American folk magic tradition developed by enslaved Africans in the American South, synthesizing West African spiritual practices (particularly from Kongo, Yoruba, and other traditions) with biblical Christianity, Native American herbalism, and European folk magic. Unlike Vodou (Haitian) or Santería (Cuban), which are religions with priesthoods and initiation, hoodoo is a practical magical system—a set of techniques for addressing life's challenges through spiritual means. Core practices include creating mojo bags (flannel bags filled with roots, herbs, and curios for specific purposes), using condition oils and powders (like Van Van oil for luck, goofer dust for cursing), working with candles dressed with oils and prayers, employing biblical psalms for magical purposes (Psalm 23 for protection, Psalm 37 for justice, etc.), conducting crossroads work (making deals, leaving offerings at intersections where spirit world intersects material), foot track magic (working with someone's footprint), spiritual baths for cleansing, and both benevolent work (love, money, healing, protection) and aggressive work (crossing, jinxing, reversing). Hoodoo practitioners (rootworkers or conjure doctors) develop expertise through apprenticeship, family tradition, or extensive study, learning which roots accomplish which purposes (High John the Conqueror for success, angelica for protection, Adam and Eve root for love), how to 'fix' candles and mojo bags, how to pray effectively, and how to diagnose and remove spiritual afflictions. The tradition emphasizes practical results, biblical authority (practitioners are often devout Christians), and maintenance of African-derived spiritual technology under conditions of oppression. Modern hoodoo continues to evolve while honoring traditional formulas and practices.",
  "category": "ritual-magic",
  "subCategory": "folk-magic",
  "practiceType": "rootwork-conjure",
  "method": "herbs-candles-prayers",
  "colors": {
    "primary": "#B91C1C",
    "secondary": "#DC2626",
    "primaryRgb": "185, 28, 28"
  },
  "tags": [
    "hoodoo",
    "rootwork",
    "conjure",
    "african-american",
    "folk-magic",
    "mojo-bag",
    "candle-magic",
    "psalms",
    "spiritual-work",
    "protection",
    "love-drawing"
  ],
  "requirements": {
    "location": {
      "id": "private-workspace",
      "name": "Private Workspace",
      "type": "place",
      "description": "Private area for assembling mojo bags, fixing candles, and performing spiritual work; ideally with altar space"
    },
    "timing": "Timing significant: waxing moon for drawing work, waning moon for banishing; specific days for specific work (Friday for love, Thursday for money, Saturday for protection)",
    "practitioner": "Requires knowledge of roots and their properties, understanding of conditions (what spiritual work addresses which problems), biblical literacy, respect for the tradition",
    "preparation": "Study of traditional formulas and curios, obtaining quality spiritual supplies, prayer and spiritual cleansing, clear intention setting",
    "items": [
      {
        "id": "roots-herbs",
        "name": "Roots and Herbs",
        "description": "High John the Conqueror, angelica, Five Finger Grass, Adam and Eve root, etc.—specific botanicals for specific purposes"
      },
      {
        "id": "condition-oils",
        "name": "Condition Oils",
        "description": "Van Van, Crown of Success, Love Me, Jinx Removing, etc.—blended oils for dressing candles and anointing"
      },
      {
        "id": "candles",
        "name": "Candles",
        "description": "Figural candles, glass-encased candles, colored tapers corresponding to work (red for love, green for money, white for blessing, black for protection/reversal)"
      },
      {
        "id": "mojo-flannel",
        "name": "Flannel Bags",
        "description": "Small colored flannel bags for creating mojo hands (red for love, green for money, white for blessing)"
      },
      {
        "id": "bible",
        "name": "Bible",
        "description": "For reciting psalms and biblical passages in conjunction with magical work"
      },
      {
        "id": "petition-paper",
        "name": "Petition Paper",
        "description": "Brown paper, parchment, or special petition paper for writing names and intentions"
      }
    ]
  },
  "steps": [
    {
      "order": 1,
      "action": "Identify Your Condition",
      "description": "Determine what spiritual condition needs addressing: love drawing, money drawing, protection, jinx removal, justice work, enemy work, etc. Hoodoo is practical—name the specific problem and the specific outcome desired."
    },
    {
      "order": 2,
      "action": "Cleanse Yourself Spiritually",
      "description": "Before beginning work, take a spiritual bath for cleansing. Use hyssop, salt, and lemon for general cleansing, or specific herbs for your condition. Recite Psalm 51 (purification) or Psalm 23 (protection) while bathing. Wash downward to remove negativity."
    },
    {
      "order": 3,
      "action": "Gather Appropriate Roots and Curios",
      "description": "Select roots, herbs, minerals, and curios specific to your work: High John the Conqueror for success/mastery, lodestone for drawing, graveyard dirt for ancestor work or cursing (obtained respectfully with payment), personal concerns (hair, nails, photos) if working on specific person."
    },
    {
      "order": 4,
      "action": "Prepare Mojo Bag (if applicable)",
      "description": "For ongoing work, create a mojo hand: place appropriate roots/curios in colored flannel bag (color matches purpose), add petition paper with your name or target's name written, pray over each ingredient, breathe life into it, feed it regularly with whiskey or condition oil."
    },
    {
      "order": 5,
      "action": "Write Petition Paper",
      "description": "On brown paper or parchment, write the name of the person being worked for/on (or your own name) multiple times. Cross and cover with your intention written perpendicularly. Some workers write name 3x, 7x, or 9x depending on power desired. Anoint corners with appropriate oil."
    },
    {
      "order": 6,
      "action": "Dress Your Candle",
      "description": "Select candle in appropriate color. Carve names or symbols into wax if desired. Anoint/dress with condition oil: for drawing work, rub oil upward toward yourself; for banishing, rub downward away. Roll candle in powdered herbs if tradition calls for it."
    },
    {
      "order": 7,
      "action": "Set the Candle with Prayer",
      "description": "Place dressed candle on petition paper on your altar. Light it while reciting appropriate Psalm or prayer. Common: Psalm 23 (protection), Psalm 37 (justice against enemies), Psalm 65 (blessings), Psalm 91 (protection), or spontaneous prayer stating your intention clearly."
    },
    {
      "order": 8,
      "action": "Work the Candle",
      "description": "Let candle burn (if safe to do so) or burn in intervals. Each time you light it, recite your prayer/psalm and state your intention. 'Work' the candle by speaking to it, visualizing your outcome, feeding it energy. Some work candles for 7 days, 9 days, or until consumed."
    },
    {
      "order": 9,
      "action": "Perform Crossroads Work (if needed)",
      "description": "For powerful petitions or deals, take offering to crossroads (literal road intersection). Common: leave coins, whiskey, cigars for spirit of the crossroads. State your petition clearly. Walk away without looking back. Crossroads is where spirit world and material world meet."
    },
    {
      "order": 10,
      "action": "Lay Down Foot Track Magic (if targeting someone)",
      "description": "For work on specific person: obtain their footprint dirt (track they've walked on) or sprinkle your prepared powder where they'll walk. Their stepping on it activates the work. Common for love drawing, domination, or crossing work. Ethics matter here."
    },
    {
      "order": 11,
      "action": "Apply Spiritual Baths and Washes",
      "description": "Use spiritual floor washes to cleanse home (Chinese Wash for business, Van Van for blessing), take spiritual baths to maintain protection or draw conditions. Baths can be herbal infusions poured over body after regular bathing, or added to bath water."
    },
    {
      "order": 12,
      "action": "Use Powders and Oils",
      "description": "Apply condition oils to body (Crown of Success on head for achievement, Love Me on wrists for attraction, etc.). Sprinkle powders in paths, corners, shoes (sachet powder for blessing, goofer dust for cursing—use extreme caution and ethical consideration)."
    },
    {
      "order": 13,
      "action": "Dispose of Ritual Remains Properly",
      "description": "Candle remains, used baths, worked materials must be disposed correctly: throw toward sunrise for drawing work, toward sunset for banishing, into running water (river carries away), at crossroads (neutral territory), or buried. Never leave in your own trash."
    },
    {
      "order": 14,
      "action": "Maintain and Feed Your Work",
      "description": "Ongoing work requires maintenance: feed mojo bags weekly with whiskey or oil, refresh candles, renew spiritual baths. Hoodoo is active relationship with spiritual forces, not one-time fix. Give offerings of gratitude when work succeeds."
    }
  ],
  "effects": "Hoodoo work produces practical, tangible results in practitioners' lives when performed skillfully and ethically. Common effects include: love drawing (attracting romantic partners, strengthening existing relationships, domination of straying partners—though ethics questionable), money drawing (attracting financial opportunities, success in gambling, business prosperity), protection (shielding from enemies, evil eye, harmful magic; guardian mojo bags), jinx removal (diagnosing and removing crossed conditions, reversing curses back to sender), justice work (influencing legal matters, bringing enemies to account, court case success), healing (addressing spiritual roots of physical illness, removing obstacles to healing), and communication with ancestors and spirits (though less emphasized than in ATRs). Practitioners report effectiveness when traditional formulas are followed correctly, appropriate psalms recited with faith, and work maintained over time. The psychological dimension (focused intention, symbolic action, belief) combines with community wisdom preserved over generations. Results depend on skill, spiritual connection, and ethical alignment.",
  "warnings": "CULTURAL RESPECT ESSENTIAL: Hoodoo is African-American cultural heritage, developed under slavery and Jim Crow as spiritual technology of resistance and survival. Non-Black practitioners must approach with humility, respect, acknowledgment of this history, and ideally learn from tradition bearers rather than appropriating freely. Do not practice hoodoo while denying or minimizing anti-Black racism. Purchase from Black-owned spiritual supply shops when possible. ETHICAL CONCERNS: Hoodoo includes aggressive work (crossing, jinxing, domination) alongside benevolent practices. Consider consequences carefully—crossing someone, even if justified, has karmic and spiritual implications. Domination work overrides free will. Enemy work can rebound. Traditional practitioners emphasize justified defense, not casual cursing. GOOFER DUST AND HARMFUL WORK: Some traditional formulas are genuinely dangerous—graveyard dirt, personal concerns, crossings. These should only be used by experienced practitioners in serious situations. Beginners should not experiment with cursing work. SPIRITUAL PROTECTION: If doing any protective or aggressive work, ensure your own spiritual protection is strong first. Reversal work sends energy back—make sure you can handle what returns. CLOSED VS. OPEN: Debate exists about whether hoodoo is closed practice. Conservative view: it's African-American cultural property and appropriation harms the community. Liberal view: it's been commercialized and shared widely for generations. Middle ground: learn respectfully from tradition bearers, credit sources, don't claim authority, don't profit inappropriately. BIBLICAL CONTEXT: Many traditional practitioners are devout Christians who see hoodoo as compatible with faith. Don't approach it as 'just folklore'—respect the genuine spiritual beliefs involved.",
  "mythologyContexts": [
    {
      "mythology": "african-american",
      "usage": "Hoodoo developed as enslaved Africans preserved and adapted their spiritual technologies under brutal oppression. Unable to practice their religions openly, they encoded African practices in biblical language, syncretized with Christianity, and passed knowledge through oral tradition, apprenticeship, and coded formulas. Hoodoo represents cultural survival, resistance, and the creation of new African-American spiritual tradition from multiple African sources plus American context.",
      "associatedDeities": [],
      "mythicalOrigins": "Hoodoo doesn't have mythical origin stories like ancient traditions—its origins are historical (slavery era, American South). However, legendary practitioners like Doctor Buzzard, Aunt Caroline Dye, and others are remembered in tradition. The power is attributed to knowledge of roots, biblical authority, and connection to ancestors.",
      "textReferences": [
        {
          "text": "Hoodoo - Conjuration - Witchcraft - Rootwork",
          "author": "Harry Middleton Hyatt (collected interviews)",
          "passage": "Multiple volumes of practitioner testimony",
          "context": "Extensive folklore collection documenting traditional hoodoo practices",
          "corpusUrl": "/corpus-search.html?term=hyatt+hoodoo"
        },
        {
          "text": "Mules and Men",
          "author": "Zora Neale Hurston",
          "passage": "Part 2 on hoodoo",
          "context": "Anthropological/literary documentation of hoodoo in 1930s South",
          "corpusUrl": "/corpus-search.html?term=zora+neale+hurston+hoodoo"
        },
        {
          "text": "The Bible (especially Psalms)",
          "passage": "Various psalms used in magical work",
          "context": "Biblical texts integrated into hoodoo practice for authority and power",
          "corpusUrl": "/corpus-search.html?term=hoodoo+psalms"
        }
      ],
      "symbolism": "Key symbols: the crossroads (meeting point of spirit and material, place of power and deals), the mojo bag (portable spiritual power), High John the Conqueror root (symbolic of resistance and triumph over oppression), the railroad spike (used in foot track magic, symbol of African-American labor), candle colors as correspondences.",
      "culturalSignificance": "Hoodoo represents African-American spiritual ingenuity and cultural preservation. It provided enslaved people with sense of agency, protection, and practical help in impossible circumstances. Post-slavery, it continued to serve Black communities facing Jim Crow, poverty, and violence. Modern practice maintains connection to ancestors and cultural heritage while adapting to contemporary contexts."
    },
    {
      "mythology": "west-african",
      "usage": "Hoodoo's roots include Kongo spiritual practices (cosmology of crossroads, use of nkisi/power objects, ancestor veneration), possible Yoruba influences (though less than in Vodou/Santería), and other West/Central African traditions. The emphasis on herbs, spiritual power in natural objects, and practical magic all derive from African worldviews.",
      "associatedDeities": [],
      "mythicalOrigins": "While deities aren't centrally invoked in hoodoo (unlike ATRs), the underlying cosmology includes African concepts of spiritual power in nature, ancestor presence, and the thin boundary between spirit and material worlds.",
      "textReferences": [],
      "symbolism": "The minkisi (singular: nkisi) tradition of Kongo—power objects containing spiritual force—likely influences mojo bag tradition. Crossroads significance derives partly from Kongo cosmology of Kalunga line separating worlds.",
      "culturalSignificance": "Hoodoo demonstrates how African spiritual knowledge survived Middle Passage and slavery through adaptation, encoding, and creative synthesis with available materials and Christian framework imposed by enslavers."
    }
  ],
  "relatedEntities": {
    "practices": [
      {
        "id": "candle-magic",
        "name": "Candle Magic",
        "type": "magic",
        "mythology": "folk",
        "icon": "🕯️",
        "url": "/magic/folk/candle-magic.html"
      },
      {
        "id": "psalm-magic",
        "name": "Psalm Magic",
        "type": "magic",
        "mythology": "christian-magical",
        "icon": "📖",
        "url": "/magic/folk/psalm-magic.html"
      },
      {
        "id": "rootwork",
        "name": "Rootwork",
        "type": "magic",
        "mythology": "african-american",
        "icon": "🌿",
        "url": "/magic/folk/rootwork.html"
      }
    ],
    "concepts": [
      {
        "id": "crossroads",
        "name": "Crossroads Magic",
        "type": "concept",
        "mythology": "african-american",
        "icon": "✖️",
        "url": "/concepts/crossroads.html"
      },
      {
        "id": "mojo-bag",
        "name": "Mojo Bag",
        "type": "concept",
        "mythology": "hoodoo",
        "icon": "👝",
        "url": "/concepts/mojo-bag.html"
      },
      {
        "id": "spiritual-conditions",
        "name": "Spiritual Conditions",
        "type": "concept",
        "mythology": "hoodoo",
        "icon": "🔮",
        "url": "/concepts/conditions.html"
      }
    ]
  },
  "archetypes": [
    {
      "category": "resistance-magic",
      "score": 98,
      "strength": "strong",
      "analysis": "Hoodoo embodies magical resistance—spiritual technology developed by oppressed people to maintain agency, protection, and power in conditions of brutal subjugation. The rootworker as subtle rebel, wielding hidden power."
    },
    {
      "category": "practical-folk-wisdom",
      "score": 95,
      "strength": "strong",
      "analysis": "Hoodoo represents practical folk magic tradition—passed down through families and communities, addressing everyday needs (love, money, protection), using accessible materials, focused on results over theology."
    },
    {
      "category": "syncretic-adaptation",
      "score": 92,
      "strength": "strong",
      "analysis": "Hoodoo demonstrates the archetype of cultural synthesis under duress—creatively combining African, Christian, Native American, and European elements into new tradition that preserved ancestral wisdom while adapting to American context."
    }
  ],
  "sources": [
    {
      "text": "Hoodoo - Conjuration - Witchcraft - Rootwork (5 volumes)",
      "author": "Harry Middleton Hyatt",
      "mythology": "african-american-folklore",
      "date": "1970-1978",
      "type": "folklore-collection"
    },
    {
      "text": "Mules and Men",
      "author": "Zora Neale Hurston",
      "mythology": "african-american",
      "date": "1935",
      "type": "anthropological-literary"
    },
    {
      "text": "Hoodoo Herb and Root Magic",
      "author": "Catherine Yronwode",
      "mythology": "hoodoo-tradition",
      "date": "2002",
      "type": "modern-teaching"
    },
    {
      "text": "Hoodoo in Theory and Practice",
      "author": "catherine yronwode",
      "mythology": "hoodoo-tradition",
      "date": "2013",
      "type": "modern-teaching"
    },
    {
      "text": "The Black Folder: Personal Communications on the Mastery of Hoodoo",
      "author": "S. Jason Black and Christopher S. Hyatt",
      "mythology": "hoodoo-occult",
      "date": "2000",
      "type": "modern-teaching"
    },
    {
      "text": "Working the Roots: Over 400 Years of Traditional African American Healing",
      "author": "Michele E. Lee",
      "mythology": "african-american-healing",
      "date": "2014",
      "type": "historical-scholarship"
    },
    {
      "text": "Sticks, Stones, Roots & Bones: Hoodoo, Mojo & Conjuring with Herbs",
      "author": "Stephanie Rose Bird",
      "mythology": "african-american",
      "date": "2004",
      "type": "modern-teaching"
    },
    {
      "text": "The Sixth and Seventh Books of Moses",
      "author": "Anonymous (attributed to Moses)",
      "mythology": "christian-magical",
      "date": "18th-19th century (various editions)",
      "type": "grimoire"
    }
  ],
  "linguistic": {
    "originalName": "Hoodoo / Rootwork / Conjure",
    "originalScript": "english",
    "transliteration": "N/A",
    "pronunciation": "/ˈhuːduː/",
    "etymology": {
      "rootLanguage": "Uncertain (possibly West African)",
      "meaning": "Magic, spiritual work",
      "derivation": "Possibly from 'juju' (West African), or from 'voodoo' (though distinct practices). 'Rootwork' refers to working with botanical roots. 'Conjure' from English 'conjure' (summon, make magic)."
    },
    "cognates": [
      {
        "language": "Various West African",
        "term": "juju",
        "script": "juju",
        "meaning": "Spiritual power, charm"
      }
    ],
    "languageCode": "en"
  },
  "geographical": {
    "region": "American South (origin and primary practice)",
    "culturalArea": "Rural South, particularly Louisiana, Mississippi, Georgia, Carolinas; spread to urban areas through Great Migration",
    "originPoint": {
      "name": "American South (enslaved African communities)",
      "coordinates": {
        "latitude": 32.3547,
        "longitude": -89.3985,
        "accuracy": "regional"
      }
    },
    "modernCountries": [
      "United States (origin and primary practice)",
      "Diaspora communities globally"
    ]
  },
  "temporal": {
    "timelinePosition": "Colonial/slavery era to present",
    "culturalPeriod": "Developed during slavery (17th-19th centuries), continued through Jim Crow and to present",
    "firstAttestation": {
      "date": {
        "year": 1650,
        "circa": true,
        "uncertainty": 50,
        "display": "c. 1650",
        "confidence": "probable"
      },
      "source": "Oral tradition from slavery era; earliest documentation later",
      "type": "cultural-practice"
    },
    "historicalDate": {
      "start": {
        "year": 1650,
        "circa": true,
        "uncertainty": 50,
        "display": "c. 1650"
      },
      "end": {
        "year": 2025,
        "circa": false,
        "display": "Present"
      },
      "display": "c. 1650 - Present"
    }
  }
}