{
  "id": "kabbalah-practical",
  "type": "magic",
  "name": "Practical Kabbalah (Ma'aseh/Magia)",
  "icon": "✡️",
  "slug": "kabbalah-practical",
  "mythologies": [
    "jewish",
    "kabbalistic"
  ],
  "primaryMythology": "kabbalistic",
  "shortDescription": "Operative magical tradition within Jewish mysticism distinct from theoretical Kabbalah, utilizing divine name permutations, Hebrew letter combinations, angelic invocations, amulet creation, and gematria to perform practical magic, often controversial within Jewish orthodoxy",
  "fullDescription": "Practical Kabbalah (Hebrew: קַבָּלָה מַעֲשִׂית, Kabbalah Ma'asit, or sometimes called Kabbalah Magia) represents the operative, magical dimension of Jewish mysticism, sharply distinguished from theoretical or contemplative Kabbalah which focuses on metaphysical philosophy and meditation on divine attributes. While theoretical Kabbalah explores the nature of God, the structure of the cosmos through the sephiroth, and the soul's relationship to the divine, practical Kabbalah applies this knowledge to perform actual magical operations: manipulating divine names to cause effects in the world, creating protective amulets inscribed with sacred letter combinations, invoking and commanding angels, binding demons, using gematria (numerology based on Hebrew letter values) for divination and power, creating kameas (magical squares), and in legendary accounts, creating the Golem (an animated clay servant). The tradition emerged from medieval Jewish mysticism, integrating earlier Jewish magical practices (found in texts like Sefer HaRazim and Harba de-Moshe) with Kabbalistic cosmology developed in 12th-13th century Spain and Provence. Central to practical Kabbalah is the creative power of Hebrew letters and divine names: the belief that God created the world through combinations of the 22 Hebrew letters (as described in Sefer Yetzirah), and that humans who know these combinations can similarly manipulate reality. The most potent names include the Tetragrammaton (YHVH, the ineffable name of God), the 42-letter name, the 72-letter name derived from Exodus 14:19-21, and the Shem ha-Mephorash (explicit name) with 72 three-letter combinations. Techniques include permutation of divine names according to specific rules, writing amulets (kameot) on parchment with divine names for protection or healing, drawing upon angelic hierarchies (borrowed and adapted from Christian angelology and earlier Jewish sources), and using Kabbalistic correspondences for timing and power. However, practical Kabbalah has always been controversial within Judaism. Rabbinic authorities generally discouraged it, fearing that: (1) it borders on or crosses into forbidden sorcery; (2) improper use of divine names is blasphemous; (3) it can lead practitioners into delusion, madness, or contact with demonic forces; (4) it was associated with antinomian movements like Sabbateanism (17th-18th century messianic movement that engaged in transgressive practices). The most famous practical text, Sefer Raziel HaMalakh (Book of Raziel the Angel), was controversial and both revered and condemned. Despite rabbinic discouragement, practical Kabbalah persisted in folk practice, particularly for protective amulets and healing, and among certain mystical circles. The practice requires deep Torah study, ethical purity, and spiritual preparation—not as mere prerequisites but as essential components, since the magic works through alignment with divine will and proper understanding of sacred language. Modern practical Kabbalah exists in several forms: (1) traditional practice within some Orthodox and Hasidic communities (mostly amulet creation by authorized rabbis); (2) academic and historical study; (3) adaptation into Hermetic Qabalah by the Golden Dawn, which removed the Jewish religious context and created a universalized Western magical Qabalah; (4) New Age and popular appropriation, often with little connection to authentic sources. The tradition represents the tension in Judaism between rationalist opposition to magic and the mystical tradition's embrace of supernatural techniques, between exoteric prohibition and esoteric practice, and between guarding sacred knowledge and making it accessible.",
  "category": "tradition",
  "subCategory": "jewish-magic",
  "traditionComponents": {
    "divineNames": {
      "name": "Sacred Names of God",
      "description": "Divine names containing creative and commanding power, used in permutations and combinations",
      "majorNames": [
        {
          "name": "Tetragrammaton (YHVH)",
          "hebrew": "יהוה",
          "description": "The ineffable four-letter name of God; most sacred and powerful; permuted in various ways",
          "notes": "Never pronounced as written in traditional Judaism; substituted with Adonai or HaShem"
        },
        {
          "name": "42-Letter Name",
          "hebrew": "שם בן מ״ב",
          "description": "Derived from the first 42 letters of Genesis, divided into triplets; used in meditation and magic",
          "notes": "Kabbalistic derivation; each triplet has specific power"
        },
        {
          "name": "72-Letter Name (Shem ha-Mephorash)",
          "hebrew": "שם המפורש",
          "description": "72 three-letter combinations derived from Exodus 14:19-21 (the splitting of the Red Sea)",
          "notes": "Each triplet associated with an angel; basis for 72 angels of the Shemhamphorasch"
        },
        {
          "name": "Other Holy Names",
          "description": "Ehyeh, El, Elohim, Shaddai, Adonai, Tzevaot, and numerous other divine names from scripture"
        }
      ],
      "techniques": "Permutation (tzeruf), substitution, calculation, visualization, vibration/pronunciation"
    },
    "letterMagic": {
      "name": "Hebrew Letter Combinations",
      "description": "Using the 22 Hebrew letters as fundamental creative forces",
      "basis": "Sefer Yetzirah teaches that God created the world through letters; each letter has numerical value, symbolic meaning, and creative power",
      "practices": [
        "Gematria - numerological calculation of letter values for interpretation and power",
        "Notarikon - acronyms and abbreviations revealing hidden meanings",
        "Temurah - letter substitution systems (Atbash, Albam, etc.)",
        "Tzeruf - permutation of letters to create names and formulas"
      ]
    },
    "amulets": {
      "name": "Kameot (Amulets)",
      "description": "Written talismans inscribed with divine names, angelic names, biblical verses, and Kabbalistic symbols",
      "purposes": "Protection from evil eye, demons, illness; healing; ensuring safe childbirth; love; success in endeavors",
      "construction": "Written on parchment, metal (silver common), or paper; must be created by one with knowledge and purity; specific formulas for different purposes; often folded or enclosed in case",
      "authorization": "Traditionally created by rabbis or Kabbalists with proper training and authority; folk practice widespread but controversial"
    },
    "angelicMagic": {
      "name": "Angelic Invocation and Commandment",
      "description": "Calling upon angels for assistance, protection, and knowledge; commanding angels through divine names",
      "hierarchies": "Metatron (highest angel), Michael, Gabriel, Raphael, Uriel; angels of the sephiroth; angels derived from the 72-fold name; angels of days, hours, and zodiac",
      "methods": "Invocation through prayer and divine names; commandment through authority of God's name; offerings and incense traditional",
      "sources": "Sefer Raziel, Hekhalot literature, medieval grimoires"
    },
    "demonBinding": {
      "name": "Commanding and Binding Demons",
      "description": "Using divine names and angelic authority to bind, banish, or control harmful spirits",
      "approach": "Not evocation for service (as in Christian grimoires) but rather protection and neutralization",
      "famous": "Binding of Ashmedai (Asmodeus) by King Solomon; various protective formulas against Lilith and child-stealing demons",
      "ethics": "Generally defensive rather than offensive; focused on protection"
    },
    "kameas": {
      "name": "Magical Squares (Kameas)",
      "description": "Number squares associated with planets, containing divine names and used as talismans",
      "structure": "3x3 (Saturn) through 9x9 (Moon); each cell contains number; sum of rows/columns/diagonals constant; divine names derived from number patterns",
      "uses": "Planetary magic, talismanic empowerment, meditation focuses"
    },
    "golem": {
      "name": "Golem Creation (Legendary)",
      "description": "The creation of an animated clay servant through inscription of divine names",
      "famous": "Golem of Prague (Rabbi Judah Loew, 16th century); earlier accounts in medieval texts",
      "method": "Form human shape from clay; inscribe Shem (divine name) on forehead or place in mouth; perform letter permutations from Sefer Yetzirah to animate",
      "warning": "Legends emphasize dangers - Golem may run amok, creator may be destroyed; symbol of hubris and limits of human power",
      "reality": "Almost certainly legendary/allegorical rather than historical practice; represents ultimate aspiration of practical Kabbalah"
    }
  },
  "historicalDevelopment": {
    "origins": {
      "period": "Medieval period (12th-13th centuries CE) formalization, but roots in earlier Jewish magic",
      "context": "Integration of earlier Jewish magical traditions with developed Kabbalistic cosmology; influenced by Islamic magic, Christian Kabbalah, and Neoplatonism",
      "sources": "Sefer Yetzirah (ancient, c. 2nd-6th century CE), Hekhalot literature (merkavah mysticism, c. 3rd-7th century), medieval Kabbalistic texts"
    },
    "keyPeriods": [
      {
        "name": "Formative Period",
        "years": "12th-13th centuries",
        "developments": "Integration with theoretical Kabbalah in Spain and Provence; Sefer ha-Bahir and Zohar provide cosmological framework; early practical texts emerge",
        "figures": "Isaac the Blind, Azriel of Gerona, early Spanish Kabbalists"
      },
      {
        "name": "Medieval Flowering",
        "years": "13th-16th centuries",
        "developments": "Sefer Raziel HaMalakh compiled; extensive amulet traditions; Golem legends emerge; practical Kabbalah spreads in German Jewish communities",
        "figures": "Abraham Abulafia (ecstatic Kabbalah using letter permutations), Rabbi Judah Loew (Golem legend), various practical Kabbalists"
      },
      {
        "name": "Safed School and Lurianic Kabbalah",
        "years": "16th century",
        "developments": "Rabbi Isaac Luria (Ari) develops theoretical Kabbalah; some practical applications; protective practices against demons and evil eye codified",
        "location": "Safed, Galilee (major Kabbalistic center)"
      },
      {
        "name": "Sabbatean Crisis and Rabbinic Reaction",
        "years": "17th-18th centuries",
        "developments": "Sabbatai Zevi messianic movement uses Kabbalah for antinomian practices; rabbinic authorities crack down on practical Kabbalah as dangerous; becomes more underground",
        "result": "Increased suspicion and restriction of practical Kabbalah teaching"
      },
      {
        "name": "Hasidism and Folk Practice",
        "years": "18th century - present",
        "developments": "Hasidic movement integrates some Kabbalistic practices; tzaddikim (righteous masters) create amulets and perform wonders; folk Kabbalah continues in Jewish communities",
        "status": "Practical Kabbalah survives in limited, controlled forms within Orthodox and Hasidic Judaism"
      },
      {
        "name": "Western Hermetic Adoption",
        "years": "19th-20th centuries",
        "developments": "Christian and non-Jewish occultists (Golden Dawn, Crowley, etc.) adopt and transform Kabbalah into Hermetic Qabalah; divorced from Jewish religious context",
        "result": "Parallel tradition of Western Qabalah with different character and purposes"
      }
    ],
    "keyTexts": [
      {
        "name": "Sefer Yetzirah (Book of Formation)",
        "period": "c. 2nd-6th century CE",
        "contribution": "Foundational text describing creation through Hebrew letters; basis for letter magic and permutation"
      },
      {
        "name": "Sefer Raziel HaMalakh (Book of Raziel the Angel)",
        "period": "Medieval compilation (13th century)",
        "contribution": "Compendium of practical Kabbalistic magic; amulets, divine names, angelic hierarchies, magical operations"
      },
      {
        "name": "Sword of Moses (Harba de-Moshe)",
        "period": "Medieval",
        "contribution": "Magical text with incantations and divine name combinations for various purposes"
      },
      {
        "name": "Sefer ha-Razim (Book of Mysteries)",
        "period": "Talmudic era (c. 3rd-7th century CE)",
        "contribution": "Early Jewish magical text with angelic hierarchies and practical operations"
      }
    ],
    "evolution": "Early Jewish magic (amulets, exorcisms, angelic invocations) → Integration with medieval Kabbalah → Formalization of divine name magic → Rabbinic restrictions and controversy → Survival in folk practice and authorized use by certain rabbis → Modern academic study and limited traditional practice → Western occult appropriation as Hermetic Qabalah",
    "modernStatus": "Limited traditional practice within Orthodox/Hasidic Judaism (primarily amulet creation by authorized rabbis); academic historical study; widely adapted into Western Hermetic Qabalah (a distinct tradition); New Age popularization often disconnected from authentic sources"
  },
  "corePhilosophy": {
    "worldview": "The universe was created through divine speech using the 22 Hebrew letters, which are not merely symbols but fundamental creative forces. The Hebrew language is the original language of creation, and its letters and divine names contain actual power to affect reality. Angels are intermediaries between God and creation, and can be invoked through proper use of divine names. Humans who achieve sufficient purity, knowledge, and alignment with divine will can participate in the creative process through manipulation of letters and names.",
    "principles": [
      "Hebrew letters are the building blocks of creation, not mere symbols",
      "Divine names contain actual power and creative force",
      "God's names can be permuted and combined to produce effects",
      "Angels are commanded through the authority of God's name",
      "Gematria reveals hidden connections and meanings through number",
      "Purity and righteousness are essential - magic works through alignment with divine will, not against it",
      "Knowledge of Torah and Talmud essential foundation - practical Kabbalah requires deep learning",
      "The practice is dangerous if approached without proper preparation, authorization, and ethical purity"
    ],
    "distinctionFromTheoretical": [
      "Theoretical Kabbalah: Contemplative study of divine attributes, sephiroth, cosmic structure; meditation; philosophy",
      "Practical Kabbalah: Operative use of divine names, letters, and angels to cause effects; amulet creation; magical operations",
      "Relationship: Theoretical provides cosmological framework and understanding; practical applies this knowledge operatively"
    ],
    "ethics": "Practical Kabbalah is only legitimate when: (1) Practiced by one with deep Torah knowledge and ethical purity; (2) Used for permitted purposes (healing, protection, serving God) not forbidden ones (harm, manipulation, selfish gain); (3) Authorized by rabbinic tradition or justified by necessity; (4) Approached with reverence and fear of heaven, not hubris or greed. Violation of these principles risks divine punishment, contact with demonic forces, madness, or death. The magic is not 'neutral technology' but operates within a moral universe where God permits or forbids effects."
  },
  "requirements": {
    "practitioner": {
      "knowledge": "Extensive Torah and Talmud study; fluency in Hebrew; understanding of Kabbalistic cosmology and sephirotic system; knowledge of divine names and their permutations; familiarity with angelic hierarchies",
      "qualities": "Ethical purity and righteousness; fear of heaven; humility; intellectual capacity; spiritual maturity; psychological stability",
      "preparation": "Years or decades of study; traditionally requires rabbinic authorization or apprenticeship to a master; moral and ritual purity essential",
      "restrictions": "Traditionally restricted to married men over 40 (though this varied); requires demonstrated ethical character and Torah knowledge; some communities forbid teaching it altogether"
    },
    "authorization": {
      "traditional": "Ideally requires transmission from authorized teacher or rabbi; some texts warn against study without proper guidance",
      "modern": "Academic study open to all; religious practice within Judaism requires community and rabbinic context; Western Hermetic Qabalah operates outside Jewish authorization structure"
    },
    "purity": {
      "ritual": "Mikvah (ritual immersion) before operations; avoidance of ritual impurity; proper kashrut observance; prayer and fasting traditional",
      "ethical": "Absolutely essential - improper motivation or unethical character renders practice ineffective or dangerous; must live righteously according to Torah"
    },
    "tools": [
      {
        "item": "Sacred Texts",
        "description": "Torah, Talmud, Sefer Yetzirah, Sefer Raziel, prayer books; knowledge more important than physical tools",
        "requirement": "Deep study and understanding, not mere possession"
      },
      {
        "item": "Writing Materials for Amulets",
        "description": "Parchment (klaf), special inks, quills; silver or other metals for permanent amulets",
        "requirement": "Ritually pure materials; proper preparation"
      },
      {
        "item": "Divine Name Charts",
        "description": "Tables of divine names, letter permutations, gematria values, kameas",
        "requirement": "Accurate reproduction from authentic sources"
      },
      {
        "item": "Ritual Objects",
        "description": "Tallit (prayer shawl), tefillin, mezuzot (may serve protective magical functions)",
        "requirement": "Kosher and properly made"
      }
    ],
    "location": "Private space for study and meditation; synagogue for some practices; home for amulet creation; purity of space important",
    "timing": "Sabbath and holidays avoided for magical operations; some practices use lunar calendar; proper times according to tradition"
  },
  "modernPractice": {
    "status": "Limited traditional practice; academic study; Western occult adaptation; popular misunderstanding common",
    "approaches": [
      {
        "name": "Traditional Orthodox/Hasidic Practice",
        "description": "Continued within some Orthodox and Hasidic communities, primarily amulet creation by authorized rabbis",
        "practitioners": "Certain rabbis known for Kabbalistic knowledge; restricted practice",
        "methods": "Amulet creation for protection, healing, childbirth; limited use of divine names; bound by halakhic (Jewish legal) restrictions",
        "accessibility": "Very limited; requires community membership and authorization; generally not taught publicly"
      },
      {
        "name": "Academic Study",
        "description": "Historical and textual analysis by scholars",
        "scholars": "Gershom Scholem (foundational), Moshe Idel, Daniel Abrams, others",
        "focus": "Historical development, textual analysis, social context, comparison with other magical traditions",
        "accessibility": "Academic works available in libraries and universities; scholarly translations of key texts"
      },
      {
        "name": "Hermetic Qabalah (Western Occult)",
        "description": "Christian and non-Jewish adaptation into Western ceremonial magic",
        "origin": "Christian Kabbalah (Renaissance), Golden Dawn systematization (late 19th century)",
        "character": "Removed from Jewish religious context; integrated with Hermeticism, Tarot, astrology; different pronunciation and emphasis",
        "relationship": "Parallel tradition with shared roots but different character and purposes; not authentic Jewish practice"
      },
      {
        "name": "New Age and Popular Kabbalah",
        "description": "Popularized and often commercialized versions with little connection to authentic tradition",
        "examples": "Kabbalah Centre, self-help Kabbalah books, celebrity interest",
        "problems": "Often lacks grounding in Hebrew, Torah, or authentic sources; commodified; sometimes outright fraudulent",
        "Jewish response": "Generally dismissed by authentic Kabbalists as illegitimate"
      }
    ],
    "accessibility": "Authentic practice: Very limited, requires Jewish religious context and authorization; Academic study: Open to all through scholarly sources; Hermetic Qabalah: Widely accessible through occult organizations and literature; Popular versions: Easily accessible but often inauthentic",
    "contemporary": "Growing academic interest; traditional practice remains restricted; tension between secrecy and scholarly openness; debates about cultural appropriation when non-Jews practice; Hermetic Qabalah continues as distinct Western tradition"
  },
  "warnings": "EXTREME CAUTION AND RESPECT REQUIRED. This is a sacred Jewish tradition with serious restrictions: (1) Requires deep Torah knowledge - not for dabblers or beginners; (2) Ethical purity absolutely essential - improper practice risks divine punishment; (3) Rabbinic authorities historically discouraged or forbade practical Kabbalah for most people; (4) Improper use of divine names considered blasphemous in Judaism; (5) Can lead to psychological instability, delusion, or contact with harmful forces if practiced improperly; (6) Cultural appropriation concerns - non-Jews practicing Jewish mysticism should do so with utmost respect and acknowledgment; (7) Hermetic Qabalah is a different tradition, not authentic Jewish Kabbalah; (8) Commercial or popularized versions often lack authenticity; (9) Traditional view: Reserved for married men over 40 with extensive learning (though this varied); (10) Not all Kabbalists practiced or approved of practical Kabbalah - many focused solely on contemplative aspects. Approach with maximum reverence, study, and cultural sensitivity. If not Jewish, consider whether study is respectful scholarship or appropriation.",
  "relatedEntities": {
    "traditions": [
      {
        "id": "golden-dawn",
        "name": "Hermetic Order of the Golden Dawn",
        "type": "magic",
        "mythology": "hermetic",
        "icon": "🌅",
        "url": "/magic/traditions/golden-dawn.html"
      }
    ],
    "concepts": [
      {
        "id": "tree-of-life",
        "name": "Tree of Life",
        "type": "concept",
        "mythology": "kabbalistic",
        "icon": "🌳",
        "url": "/concepts/tree-of-life.html"
      },
      {
        "id": "divine-names",
        "name": "Divine Names",
        "type": "concept",
        "mythology": "kabbalistic",
        "icon": "📜",
        "url": "/concepts/divine-names.html"
      },
      {
        "id": "gematria",
        "name": "Gematria",
        "type": "concept",
        "mythology": "kabbalistic",
        "icon": "🔢",
        "url": "/concepts/gematria.html"
      },
      {
        "id": "golem",
        "name": "Golem",
        "type": "concept",
        "mythology": "jewish",
        "icon": "🗿",
        "url": "/concepts/golem.html"
      }
    ],
    "practices": [
      {
        "id": "amulet-creation",
        "name": "Amulet Creation",
        "type": "magic",
        "mythology": "universal",
        "icon": "🧿",
        "url": "/magic/talismanic/amulets.html"
      }
    ]
  },
  "sources": [
    {
      "text": "Kabbalah: A Very Short Introduction",
      "author": "Joseph Dan",
      "mythology": "jewish-scholarly",
      "date": "2006",
      "type": "scholarly-overview",
      "notes": "Accessible academic introduction to Kabbalah including practical aspects"
    },
    {
      "text": "Major Trends in Jewish Mysticism",
      "author": "Gershom Scholem",
      "mythology": "jewish-scholarly",
      "date": "1941",
      "type": "foundational-scholarship",
      "notes": "Foundational academic work on Kabbalah, including practical Kabbalah chapter"
    },
    {
      "text": "Kabbalah: New Perspectives",
      "author": "Moshe Idel",
      "mythology": "jewish-scholarly",
      "date": "1988",
      "type": "scholarly-critical",
      "notes": "Important scholarly work challenging Scholem, discussing ecstatic and practical Kabbalah"
    },
    {
      "text": "Sefer Raziel HaMalakh (Book of Raziel the Angel)",
      "author": "Anonymous (medieval compilation)",
      "mythology": "kabbalistic",
      "date": "13th century (compiled)",
      "type": "primary-text",
      "notes": "Major practical Kabbalah grimoire; various editions and translations available"
    },
    {
      "text": "Sefer Yetzirah (Book of Formation)",
      "author": "Anonymous (traditional attribution to Abraham)",
      "mythology": "kabbalistic",
      "date": "c. 2nd-6th century CE",
      "type": "foundational-text",
      "notes": "Foundational text on creation through Hebrew letters; multiple commentaries and translations"
    },
    {
      "text": "The Sword of Moses (Harba de-Moshe)",
      "author": "Moses Gaster (translator/editor)",
      "mythology": "jewish-magic",
      "date": "1896 (publication)",
      "type": "primary-text",
      "notes": "Medieval Jewish magical text with practical operations"
    },
    {
      "text": "Jewish Magic and Superstition",
      "author": "Joshua Trachtenberg",
      "mythology": "jewish-folklore",
      "date": "1939",
      "type": "scholarly-folklore",
      "notes": "Study of Jewish magical practices and folk beliefs"
    },
    {
      "text": "The Golem: Jewish Magical and Mystical Traditions on the Artificial Anthropoid",
      "author": "Moshe Idel",
      "mythology": "jewish-scholarly",
      "date": "1990",
      "type": "scholarly-specialized",
      "notes": "Comprehensive study of Golem traditions and letter magic"
    }
  ],
  "linguistic": {
    "originalName": "Kabbalah Ma'asit / Kabbalah Magia",
    "originalScript": "Hebrew: קַבָּלָה מַעֲשִׂית",
    "transliteration": "Kabbalah Ma'asit",
    "pronunciation": "/kɑːbɑːˈlɑː mɑːʔɑːˈsiːt/",
    "etymology": {
      "rootLanguage": "Hebrew",
      "meaning": "Kabbalah = 'receiving/tradition'; Ma'asit = 'practical/operative'; together = 'Practical Kabbalah'",
      "derivation": "Distinguished from Kabbalah Iyyunit (contemplative/theoretical Kabbalah)"
    },
    "languageCode": "he"
  },
  "geographical": {
    "region": "Spain, Provence, Germany, Israel (Safed) - major centers at various periods",
    "culturalArea": "Jewish diaspora communities, particularly Ashkenazi (German) and Sephardi (Spanish) traditions",
    "originPoint": {
      "name": "Multiple centers: Spain (medieval), Safed (16th century), Eastern Europe (Hasidic)",
      "coordinates": {
        "latitude": 32.9653,
        "longitude": 35.4953,
        "accuracy": "city"
      }
    },
    "modernCountries": [
      "Israel (traditional practice in Orthodox/Hasidic communities)",
      "United States (Hasidic communities, academic study)",
      "Global (Jewish diaspora, Western occult adaptation)"
    ]
  },
  "temporal": {
    "timelinePosition": "Medieval formalization (12th-13th centuries) of earlier practices",
    "culturalPeriod": "Medieval through present, with earlier roots",
    "firstAttestation": {
      "date": {
        "year": 1200,
        "circa": true,
        "uncertainty": 100,
        "display": "c. 1200 CE",
        "confidence": "medium"
      },
      "source": "Medieval Kabbalistic texts, though earlier Jewish magical practices existed",
      "type": "textual"
    },
    "historicalDate": {
      "start": {
        "year": 1200,
        "circa": true,
        "display": "c. 1200 CE (formalization)"
      },
      "end": {
        "year": 2025,
        "display": "Present"
      },
      "display": "c. 1200 CE - Present"
    }
  },
  "tags": [
    "kabbalah",
    "practical-kabbalah",
    "jewish-mysticism",
    "jewish-magic",
    "divine-names",
    "hebrew-letters",
    "gematria",
    "amulets",
    "angelic-magic",
    "sefer-yetzirah",
    "sefer-raziel",
    "golem",
    "tetragrammaton",
    "shem-ha-mephorash",
    "kameas",
    "letter-magic"
  ],
  "colors": {
    "primary": "#1E40AF",
    "secondary": "#3B82F6",
    "primaryRgb": "30, 64, 175"
  }
}