{
  "id": "key-of-solomon",
  "type": "magic",
  "name": "Key of Solomon",
  "icon": "🔑",
  "slug": "key-of-solomon",
  "mythologies": [
    "jewish",
    "christian",
    "medieval-european",
    "western-esoteric"
  ],
  "primaryMythology": "medieval-european",
  "shortDescription": "Medieval grimoire (14th-15th century manuscripts) attributed to King Solomon, teaching ceremonial magic including spirit conjuration, circle construction, consecration of magical tools, and creation of pentacles for commanding spirits and gaining knowledge",
  "fullDescription": "The Key of Solomon (Latin: Clavicula Salomonis) is one of the most influential grimoires in Western ceremonial magic, a comprehensive manual of ritual magic practices attributed to the legendary wisdom of King Solomon, biblical king renowned for commanding spirits and demons. Surviving in numerous manuscripts from the 14th-15th centuries onward (though claiming much greater antiquity), the text represents a synthesis of Jewish mysticism, Christian demonology, Greco-Roman magic, and medieval ceremonial practice. The grimoire is organized into two books containing detailed instructions for conjuring and commanding spirits, constructing magical circles and triangles, consecrating ritual implements (sword, knife, wand, pentacles, vestments), observing proper planetary timing, performing purifications, and creating pentacles (talismanic seals) for various purposes—wealth, love, protection, invisibility, knowledge, and spirit control. The Key teaches that the magician, through purity, prayer, and proper ceremonial procedure, becomes a channel of divine authority capable of commanding celestial and infernal spirits. The text emphasizes the magician's moral purity, Christian faith, and ritual precision as essential to success and safety. S.L. MacGregor Mathers' 1889 English translation brought the Key to widespread occult attention, becoming foundational for the Hermetic Order of the Golden Dawn and modern ceremonial magic. The grimoire's system of pentacles, spirit hierarchies, and ritual procedures influenced virtually all subsequent Western grimoires and remains central to contemporary magical practice.",
  "category": "grimoire",
  "subCategory": "ceremonial-magic",
  "textType": "practical-manual",
  "colors": {
    "primary": "#4169E1",
    "secondary": "#6495ED",
    "primaryRgb": "65, 105, 225"
  },
  "tags": [
    "grimoire",
    "ceremonial-magic",
    "solomonic-magic",
    "spirit-conjuration",
    "pentacles",
    "ritual-magic",
    "medieval-magic",
    "golden-dawn",
    "planetary-magic",
    "circle-casting",
    "magical-tools",
    "angelic-magic"
  ],
  "textStructure": {
    "form": "Practical ritual manual with instructions and diagrams",
    "organization": "Two books (in most versions)",
    "language": "Originally Latin and Hebrew; many vernacular versions (French, Italian, English)",
    "book1": {
      "chapters": "Approximately 18-20 chapters (varies by manuscript)",
      "contents": [
        "Preliminary instructions on purity and preparation",
        "Conjurations and invocations of spirits",
        "Construction of magical circle and triangle",
        "Days and hours for operations (planetary timing)",
        "Fumigations and perfumes",
        "Sacrifices and offerings",
        "Preparation of virgin parchment, pen, ink",
        "Consecration of magical instruments (sword, knife, sickle, poniard, dagger, lance, wand, staff)",
        "Magical vestments and accessories",
        "Pentacles of Solomon and their uses"
      ]
    },
    "book2": {
      "chapters": "Approximately 16-18 chapters",
      "contents": [
        "Times and seasons for magical operations",
        "Astrological considerations",
        "Properties of places and materials",
        "Additional conjurations",
        "Experiments and their requisites (specific magical operations)",
        "Love magic, treasure finding, invisibility, binding spirits",
        "Particular pentacles for specific purposes",
        "Dismissing spirits safely"
      ]
    },
    "pentacles": "44 pentacles divided among seven planetary categories (Saturn, Jupiter, Mars, Sun, Venus, Mercury, Moon), each with specific powers and uses",
    "diagrams": "Elaborate illustrations of circles, triangles, pentacles, Hebrew divine names, spirit seals",
    "length": "Approximately 150-200 pages in modern editions"
  },
  "historicalContext": {
    "attribution": "Attributed to King Solomon (c. 970-931 BCE), legendary Israelite king who commanded spirits to build the Temple",
    "actualDate": "Earliest extant manuscripts 14th-15th century; possibly based on earlier Greek or Arabic sources now lost",
    "sources": "Draws on Jewish angelology (Testament of Solomon), Christian grimoire tradition, Arabic magical texts, Greco-Roman ceremonial magic",
    "manuscripts": "Hundreds of manuscript versions across Europe (Italian, French, German, Latin, English) with significant variations",
    "culturalContext": "Medieval and Renaissance learned magic; practiced by educated clerics, scholars, and nobles seeking hidden knowledge and power",
    "solomonicLegend": "Solomon's wisdom and spirit-commanding ability became template for medieval magic; Testament of Solomon (1st-3rd century CE) established his magical authority",
    "christianization": "Grimoire frames magic within Christian cosmology—invoking God, Jesus, angels; spirits are demons to be dominated through divine names",
    "influence": "Foundation for Lemegeton (Lesser Key of Solomon), Heptameron, Grand Grimoire, and virtually all later European ceremonial magic"
  },
  "keyTeachings": [
    "Divine Authority Over Spirits: The magician operates through God's authority, using divine and angelic names to command spirits; success depends on purity, faith, and ritual precision, not personal power",
    "Planetary Timing: All magical operations must be performed during appropriate planetary hours, days, and astrological conditions; each planet governs specific types of magic and spirits",
    "Circle and Triangle: Magical circle protects the magician through divine names and seals; spirits are conjured into the triangle where they can be seen and commanded safely",
    "Consecration of Tools: All magical implements must be created during specific planetary hours, consecrated through elaborate rituals, and never used for mundane purposes; tools channel divine and planetary forces",
    "Purity and Preparation: Magician must undergo ritual purification (bathing, fasting, prayer, sexual abstinence) before operations; moral purity is essential for commanding spirits",
    "Pentacles as Talismans: The 44 pentacles inscribed with divine names, angelic seals, and Hebrew letters serve as tools for specific purposes—each must be created at proper time on appropriate materials",
    "Hierarchies of Spirits: Spirits are organized hierarchically (angelic, aerial, terrestrial, infernal) with specific ruling spirits, subordinates, and domains; knowing the hierarchy enables control",
    "Conjuration Formula: Spirits are summoned through graduated conjurations—beginning politely, escalating to commands and threats using divine names if the spirit proves reluctant or rebellious"
  ],
  "practicalApplications": [
    "Spirit Evocation: Summoning angels, planetary spirits, or demons into the triangle for knowledge, favors, teaching, or to compel service; foundational practice of ceremonial magic",
    "Talismanic Magic: Creating and consecrating pentacles for specific purposes—protection, wealth, love, invisibility, finding treasure, gaining wisdom, binding enemies",
    "Tool Consecration: Ritual creation and empowerment of magical implements still used in modern Wicca, ceremonial magic, and folk magic traditions",
    "Circle Casting: The Solomonic circle became template for protective sacred space in countless magical traditions including Wicca and modern witchcraft",
    "Golden Dawn System: Hermetic Order of the Golden Dawn incorporated Solomonic methods, pentacles, and divine names into their comprehensive magical curriculum",
    "Goetic Magic: The grimoire's spirit conjuration methods were elaborated in the Goetia (Lesser Key of Solomon), still practiced in modern demonology and spirit work",
    "Planetary Magic: System of planetary hours, correspondences, and timing remains standard in Western astrology and magical practice",
    "Theurgic Practice: High ceremonial magic adapted Solomonic methods for invoking angels and achieving mystical union with divine forces"
  },
  "manuscriptHistory": {
    "medieval": {
      "earliest": "14th-15th century manuscripts in Latin, Italian, and French",
      "notable": [
        "British Library Sloane MS 3091 (17th century, Latin)",
        "Bibliothèque de l'Arsenal MS 2348 (18th century, French)",
        "Bodleian Library MS e Mus 173 (Italian)"
      ],
      "variations": "Significant textual variations between manuscripts; different number of pentacles, chapters, and instructions"
    },
    "printed": {
      "first": "Earliest printed editions 17th century",
      "grimoire": "Included in grimoire collections and books of secrets"
    },
    "mathers": {
      "year": 1889,
      "translator": "S.L. MacGregor Mathers",
      "significance": "First widely available English translation; became standard for modern occultism",
      "source": "Mathers collated multiple manuscripts (primarily Sloane 3091 and Arsenal 2348)",
      "impact": "Made Solomonic magic accessible to Golden Dawn and modern ceremonial magicians; still most commonly used version"
    },
    "modern": {
      "editions": "Numerous reprints, translations, and scholarly editions",
      "scholarly": "Joseph H. Peterson's critical edition (2004) comparing multiple manuscript sources",
      "variations": "Modern editions vary in completeness and authenticity; Peterson's edition most rigorous"
    },
    "related": {
      "texts": "Lesser Key of Solomon (Lemegeton), Greater Key of Solomon, Testament of Solomon (ancient), Heptameron, Sworn Book of Honorius"
    }
  },
  "relatedEntities": {
    "figures": [
      {
        "id": "king-solomon",
        "name": "King Solomon",
        "type": "historical-figure",
        "mythology": "jewish",
        "icon": "👑",
        "url": "/figures/king-solomon.html"
      }
    ],
    "practices": [
      {
        "id": "ceremonial-magic",
        "name": "Ceremonial Magic",
        "type": "magic",
        "mythology": "western-esoteric",
        "icon": "✨",
        "url": "/magic/ceremonial-magic.html"
      },
      {
        "id": "astrology",
        "name": "Astrology",
        "type": "magic",
        "mythology": "universal",
        "icon": "♈",
        "url": "/magic/divination/astrology.html"
      },
      {
        "id": "qabalah",
        "name": "Qabalah",
        "type": "magic",
        "mythology": "kabbalistic",
        "icon": "🌳",
        "url": "/magic/qabalah.html"
      }
    ],
    "texts": [
      {
        "id": "lemegeton",
        "name": "Lemegeton (Lesser Key of Solomon)",
        "type": "text",
        "mythology": "medieval-european",
        "icon": "📖",
        "url": "/texts/lemegeton.html"
      },
      {
        "id": "picatrix",
        "name": "Picatrix",
        "type": "text",
        "mythology": "islamic",
        "icon": "📜",
        "url": "/texts/picatrix.html"
      }
    ],
    "concepts": [
      {
        "id": "divine-names",
        "name": "Divine Names",
        "type": "concept",
        "mythology": "kabbalistic",
        "icon": "יהוה",
        "url": "/concepts/divine-names.html"
      },
      {
        "id": "planetary-hours",
        "name": "Planetary Hours",
        "type": "concept",
        "mythology": "astrological",
        "icon": "⏰",
        "url": "/concepts/planetary-hours.html"
      }
    ]
  },
  "sources": [
    {
      "text": "The Key of Solomon the King (Clavicula Salomonis)",
      "author": "S.L. MacGregor Mathers (translator)",
      "mythology": "medieval-european",
      "date": "1889 (translation)",
      "type": "primary-translation"
    },
    {
      "text": "The Key of Solomon: A Critical Edition (Clavicula Salomonis)",
      "author": "Joseph H. Peterson (editor)",
      "mythology": "medieval-european",
      "date": "2004",
      "type": "scholarly-edition"
    },
    {
      "text": "Grimoires: A History of Magic Books",
      "author": "Owen Davies",
      "mythology": "historical",
      "date": "2009",
      "type": "modern-scholarship"
    },
    {
      "text": "The Sworn Book of Honorius: Liber Iuratus Honorii",
      "author": "Joseph H. Peterson (editor)",
      "mythology": "medieval-european",
      "date": "2016",
      "type": "comparative-text"
    },
    {
      "text": "Between the Living and the Dead: A Perspective on Witches and Seers in the Early Modern Age",
      "author": "Eva Pócs",
      "mythology": "historical",
      "date": "1999",
      "type": "modern-scholarship"
    },
    {
      "text": "The Testament of Solomon",
      "author": "F.C. Conybeare (translator)",
      "mythology": "jewish-christian",
      "date": "1st-3rd century CE (composition)",
      "type": "ancient-source"
    },
    {
      "text": "The Magus: A Complete System of Occult Philosophy",
      "author": "Francis Barrett",
      "mythology": "western-esoteric",
      "date": "1801",
      "type": "historical-compilation"
    },
    {
      "text": "Golden Dawn: The Original Account of the Teachings, Rites & Ceremonies",
      "author": "Israel Regardie",
      "mythology": "western-esoteric",
      "date": "1937",
      "type": "modern-practice"
    }
  ],
  "linguistic": {
    "originalName": "Clavicula Salomonis (Latin)",
    "originalScript": "latin",
    "transliteration": "Clavicula Salomonis",
    "pronunciation": "/kiː ʌv ˈsɒləmən/",
    "etymology": {
      "rootLanguage": "Latin",
      "meaning": "Clavicula = 'little key' (diminutive of clavis, key); Salomonis = 'of Solomon' (genitive of Salomon)",
      "derivation": "Solomon from Hebrew Shlomo (שְׁלֹמֹה) meaning 'peace' or 'peaceful'; 'Key' metaphor implies unlocking hidden knowledge and commanding spirits"
    },
    "cognates": [
      {
        "language": "French",
        "term": "La Clavicule de Salomon",
        "script": "La Clavicule de Salomon"
      },
      {
        "language": "Italian",
        "term": "Chiave di Salomone",
        "script": "Chiave di Salomone"
      },
      {
        "language": "Hebrew",
        "term": "מפתח שלמה",
        "script": "Mafteach Shlomo"
      }
    ],
    "languageCode": "la"
  },
  "geographical": {
    "region": "Medieval Europe (manuscript tradition)",
    "culturalArea": "Pan-European grimoire culture (Italy, France, Germany, England)",
    "originPoint": {
      "name": "Unknown (possibly Italy or France)",
      "coordinates": {
        "latitude": 45.0,
        "longitude": 10.0,
        "accuracy": "regional-estimate"
      }
    },
    "modernCountries": [
      "Global (Western ceremonial magic)",
      "Italy (early manuscripts)",
      "France (major manuscript tradition)",
      "England (Mathers translation, Golden Dawn)",
      "United States (modern practice)"
    ]
  },
  "temporal": {
    "timelinePosition": "Late Medieval to Early Modern (manuscript tradition)",
    "culturalPeriod": "14th-15th century (earliest manuscripts) to present",
    "firstAttestation": {
      "date": {
        "year": 1350,
        "circa": true,
        "uncertainty": 50,
        "display": "c. 1350-1400 CE",
        "confidence": "probable"
      },
      "source": "Earliest extant manuscript evidence",
      "type": "manuscript"
    },
    "historicalDate": {
      "manuscripts": {
        "start": {
          "year": 1350,
          "circa": true,
          "display": "c. 1350 CE"
        },
        "end": {
          "year": 1800,
          "circa": true,
          "display": "c. 1800 CE"
        },
        "display": "c. 1350-1800 CE (manuscript tradition)"
      },
      "influence": {
        "start": {
          "year": 1350,
          "circa": true,
          "display": "c. 1350 CE"
        },
        "end": {
          "year": 2025,
          "circa": false,
          "display": "Present"
        },
        "display": "c. 1350 CE - Present"
      }
    }
  }
}
