{
  "id": "kundalini",
  "type": "magic",
  "name": "Kundalini Yoga",
  "icon": "🐍",
  "slug": "kundalini",
  "mythologies": [
    "hindu",
    "tantric",
    "yogic"
  ],
  "primaryMythology": "hindu",
  "shortDescription": "Practice of awakening the dormant serpent power (kundalini shakti) coiled at the base of the spine, using asana, pranayama, mantra, mudra, and meditation to raise this primal energy through the chakras to achieve spiritual enlightenment and union of Shiva-Shakti",
  "fullDescription": "Kundalini Yoga is the practice of awakening kundalini shakti—the dormant serpent power coiled three-and-a-half times at the base of the spine (muladhara chakra). Described in Tantric and yogic texts, kundalini represents the primal cosmic energy (shakti) lying dormant in most individuals. Through systematic practices including dynamic kriyas (action sets), pranayama (breathwork), bandhas (energy locks), mudras (seals), mantras (sacred sounds), and deep meditation, practitioners activate this powerful force, guiding it upward through sushumna nadi (central energy channel) and through each chakra until it reaches the crown (sahasrara), where individual consciousness (Shiva) unites with cosmic energy (Shakti) in enlightenment (samadhi). The term 'kundalini' comes from Sanskrit 'kundal' (कुण्डल) meaning 'coiled.' Traditional texts like Hatha Yoga Pradipika and modern teachings from Yogi Bhajan present kundalini yoga as the 'yoga of awareness'—the most direct path to higher consciousness. However, kundalini awakening is intense and potentially destabilizing, requiring proper preparation, guidance, and ethical foundation.",
  "category": "energy-work",
  "subCategory": "kundalini-awakening",
  "practiceType": "serpent-power-activation",
  "method": "kriya-mantra-breathwork",
  "colors": {
    "primary": "#DC2626",
    "secondary": "#F87171",
    "primaryRgb": "220, 38, 38"
  },
  "tags": [
    "kundalini",
    "shakti",
    "serpent-power",
    "kundalini-awakening",
    "chakras",
    "tantra",
    "kriyas",
    "mantra",
    "shiva-shakti",
    "spiritual-awakening",
    "enlightenment"
  ],
  "requirements": {
    "location": {
      "id": "dedicated-practice-space",
      "name": "Dedicated Practice Space",
      "type": "place",
      "description": "Clean, quiet, energetically supportive space for intensive practice"
    },
    "timing": "Daily practice essential; traditionally before dawn (Amrit Vela, 3-7am); consistency crucial",
    "practitioner": "Requires qualified teacher for safe practice; strong foundation in yoga and ethical living (yamas/niyamas) essential; not recommended for beginners without guidance",
    "preparation": "Years of preliminary yoga practice recommended; purification of body/mind through asana, pranayama, meditation; ethical lifestyle; guru or qualified instructor; mental/emotional stability",
    "items": [
      {
        "id": "sheepskin-mat",
        "name": "Sheepskin or Yoga Mat",
        "description": "Traditional natural fiber mat for practice"
      },
      {
        "id": "meditation-shawl",
        "name": "White Cotton Shawl",
        "description": "For covering head and maintaining energy field during practice"
      },
      {
        "id": "mala-beads",
        "name": "Mala Beads",
        "description": "For mantra repetition (optional)"
      }
    ]
  },
  "steps": [
    {
      "order": 1,
      "action": "Establish Foundational Practice",
      "description": "Before attempting kundalini awakening, establish strong foundation: regular hatha yoga, pranayama mastery, chakra awareness, ethical living, meditation practice. This may take years of preparation."
    },
    {
      "order": 2,
      "action": "Find Qualified Teacher or Guru",
      "description": "Kundalini awakening should not be attempted alone. Seek experienced teacher in authentic lineage (Yogi Bhajan tradition or classical Tantric lineage). Teacher provides guidance, support, and protection."
    },
    {
      "order": 3,
      "action": "Purify Body and Lifestyle",
      "description": "Adopt sattvic (pure) diet, reduce stimulants and toxins, practice cleanliness (shaucha), cultivate brahmacharya (wise use of sexual energy), establish regular sleep patterns. Physical purification prepares vessel for powerful energy."
    },
    {
      "order": 4,
      "action": "Practice Tuning In (Adi Mantra)",
      "description": "Begin each session chanting 'Ong Namo Guru Dev Namo' 3 times (I bow to the divine teacher within). This connects to golden chain of teachers and creates sacred space for practice."
    },
    {
      "order": 5,
      "action": "Warm Up with Spinal Flexes",
      "description": "Perform spinal flexes (cat-cow movements) coordinated with breath to awaken energy in spine and prepare sushumna nadi (central channel) for kundalini flow. Spine flexibility crucial."
    },
    {
      "order": 6,
      "action": "Practice Breath of Fire (Agni Prana)",
      "description": "Master this rapid rhythmic breath (similar to Bhastrika): equal emphasis on inhalation and exhalation powered by navel point. Builds heat, purifies nadis, energizes entire system. Start with 1-3 minutes."
    },
    {
      "order": 7,
      "action": "Perform Kriya (Action Set)",
      "description": "Practice specific kriya taught by teacher: sequence of postures, mudras, bandhas, pranayama, and mantra designed to awaken kundalini or work with specific chakras. Hold positions for prescribed duration (often 3-11 minutes)."
    },
    {
      "order": 8,
      "action": "Apply Maha Bandha (Great Lock)",
      "description": "Engage all three bandhas simultaneously: root lock (mula), diaphragm lock (uddiyana), throat lock (jalandhara). This contains and directs kundalini energy upward through central channel during retention."
    },
    {
      "order": 9,
      "action": "Chant Mantras for Chakra Activation",
      "description": "Use specific mantras for each chakra or practice 'Sat Nam' (Truth is my identity). Vibration opens energy centers and channels. Common practice: 'Sa Ta Na Ma' for transformation."
    },
    {
      "order": 10,
      "action": "Deep Relaxation (Savasana)",
      "description": "After intensive kriya, complete relaxation essential: lie in corpse pose 11 minutes minimum. This allows energy to integrate, nervous system to recalibrate, benefits to consolidate. Never skip this phase."
    },
    {
      "order": 11,
      "action": "Meditation for Integration",
      "description": "Practice meditation with specific focus: chakra visualization, mantra repetition, breath awareness, or simply witnessing inner experience. This integrates awakened energy and cultivates witness consciousness."
    },
    {
      "order": 12,
      "action": "Close with Blessing and Grounding",
      "description": "Chant closing mantra (often 'Sat Nam' 3 times or 'May the long time sun shine upon you'). Ground energy fully before returning to daily activities. Journal experiences for processing with teacher."
    }
  ],
  "effects": "Kundalini awakening produces profound transformation across all dimensions of being. Physical: intense heat, spontaneous movements, purification of toxins, healing of chronic conditions, extraordinary vitality. Energetic: activation of all chakras, purification of nadis, powerful flow of prana, awakening of psychic abilities. Psychological: release of deep traumas, dissolution of ego structures, integration of shadow, expanded consciousness. Spiritual: direct experience of divine, mystical visions, bliss states (ananda), non-dual awareness, potential for enlightenment. However, awakening can also produce challenging symptoms (kundalini syndrome) including anxiety, insomnia, energetic overwhelm, emotional volatility, and disorientation. Proper guidance, gradual practice, and integration support are essential for safe transformation.",
  "warnings": "CRITICAL: Kundalini awakening is powerful and potentially dangerous without proper preparation and guidance. DO NOT attempt to force awakening through intensive practices without qualified teacher. Kundalini syndrome can produce severe physical, psychological, and spiritual crises including: uncontrollable shaking, extreme heat, insomnia, anxiety/panic, psychosis-like states, inability to function in daily life. Those with mental health conditions, trauma history, or unstable life circumstances should not practice intensive kundalini yoga. Premature awakening without adequate preparation can shatter the ego before one is ready to integrate the experience. Drug use is contraindicated. Sexual energy (brahmach arya) must be handled wisely—excessive or suppressed sexuality both problematic. Practice ethics (yamas/niyamas) essential—awakening without moral foundation dangerous. If kundalini awakens spontaneously or practice becomes overwhelming, immediately seek experienced kundalini teacher or therapist familiar with spiritual emergencies. Ground thoroughly, reduce practice intensity, focus on integration. Respect cultural origins; this is sacred Hindu/Tantric practice, not mere fitness routine.",
  "mythologyContexts": [
    {
      "mythology": "hindu",
      "usage": "Kundalini represents Shakti, the divine feminine creative power, lying dormant at the base of the spine. In Tantric philosophy, the universe arises from the union of Shiva (pure consciousness, masculine principle) and Shakti (dynamic energy, feminine principle). In most humans, Shakti sleeps coiled at muladhara, while Shiva resides at sahasrara (crown). Kundalini yoga aims to awaken Shakti and reunite her with Shiva, achieving the ultimate union of energy and consciousness in enlightenment. Classical texts describe the journey through six chakras, with kundalini piercing each lotus until final union in the thousand-petaled lotus at the crown.",
      "associatedDeities": [],
      "mythicalOrigins": "Kundalini is personified as the Goddess—sleeping serpent, coiled three-and-a-half times representing the three gunas (qualities of nature) plus transcendence. She is both the obstacle (keeping consciousness bound in matter) and the vehicle of liberation (rising to unite with pure consciousness).",
      "textReferences": [
        {
          "text": "Hatha Yoga Pradipika",
          "author": "Swami Svatmarama",
          "passage": "Chapter 3, verses on kundalini",
          "context": "Classical description of kundalini awakening practices",
          "corpusUrl": "/corpus-search.html?term=hatha+yoga+pradipika+kundalini"
        },
        {
          "text": "Sat-Chakra-Nirupana",
          "author": "Purnananda Swami",
          "passage": "Complete text",
          "context": "Tantric description of chakras and kundalini's journey through them",
          "corpusUrl": "/corpus-search.html?term=sat+chakra+nirupana"
        },
        {
          "text": "Yoga-Kundalini Upanishad",
          "passage": "Complete text",
          "context": "Upanishadic teachings on kundalini awakening",
          "corpusUrl": "/corpus-search.html?term=yoga+kundalini+upanishad"
        }
      ],
      "symbolism": "The serpent symbolizes primordial power, wisdom, and transformation through shedding of old skin. Three-and-a-half coils represent the three gunas plus transcendence. The upward journey through chakras represents the evolution of consciousness from gross matter (earth) to pure spirit (ether/thought).",
      "culturalSignificance": "Kundalini yoga represents the pinnacle of yogic practice—the direct path to enlightenment through awakening of dormant spiritual power. Modern popularization by Yogi Bhajan (1969) brought kundalini yoga to the West, though some traditional teachers question the appropriateness of teaching these advanced practices so openly."
    }
  ],
  "relatedEntities": {
    "practices": [
      {
        "id": "chakra-work",
        "name": "Chakra Work",
        "type": "magic",
        "mythology": "hindu",
        "icon": "🌈",
        "url": "/magic/energy/chakra-work.html"
      },
      {
        "id": "breathwork",
        "name": "Pranayama",
        "type": "magic",
        "mythology": "hindu",
        "icon": "🌬️",
        "url": "/magic/energy/breathwork.html"
      },
      {
        "id": "tantra",
        "name": "Tantra",
        "type": "magic",
        "mythology": "hindu",
        "icon": "🕉️",
        "url": "/magic/traditions/tantra.html"
      }
    ],
    "concepts": [
      {
        "id": "shakti",
        "name": "Shakti (Divine Feminine Power)",
        "type": "concept",
        "mythology": "hindu",
        "icon": "⚡",
        "url": "/concepts/shakti.html"
      },
      {
        "id": "shiva-shakti-union",
        "name": "Shiva-Shakti Union",
        "type": "concept",
        "mythology": "hindu",
        "icon": "☯️",
        "url": "/concepts/shiva-shakti.html"
      },
      {
        "id": "sushumna-nadi",
        "name": "Sushumna Nadi (Central Channel)",
        "type": "concept",
        "mythology": "hindu",
        "icon": "⚡",
        "url": "/concepts/sushumna.html"
      }
    ]
  },
  "archetypes": [
    {
      "category": "serpent-wisdom-transformation",
      "score": 95,
      "strength": "strong",
      "analysis": "The serpent appears universally as symbol of transformation, wisdom, and primordial power. Kundalini as coiled serpent embodies the archetype of dormant potential awaiting awakening, shedding old forms to achieve rebirth."
    },
    {
      "category": "ascent-of-consciousness",
      "score": 90,
      "strength": "strong",
      "analysis": "The vertical journey from root to crown mirrors universal myths of ascension—Jacob's ladder, World Tree, shamanic ascent—representing the soul's evolution from matter to spirit, earth to heaven."
    },
    {
      "category": "sacred-marriage",
      "score": 88,
      "strength": "strong",
      "analysis": "The union of Shiva and Shakti reflects the archetypal sacred marriage (hieros gamos) found across traditions—the reconciliation of opposites (masculine/feminine, consciousness/energy, static/dynamic) in divine union."
    }
  ],
  "sources": [
    {
      "text": "Hatha Yoga Pradipika",
      "author": "Swami Svatmarama",
      "mythology": "hindu",
      "date": "15th century CE",
      "type": "primary-text"
    },
    {
      "text": "The Serpent Power",
      "author": "Arthur Avalon (Sir John Woodroffe)",
      "mythology": "tantric",
      "date": "1919",
      "type": "translation-commentary"
    },
    {
      "text": "Kundalini Tantra",
      "author": "Swami Satyananda Saraswati",
      "mythology": "hindu",
      "date": "1984",
      "type": "modern-teaching"
    },
    {
      "text": "The Kundalini Experience",
      "author": "Lee Sannella, M.D.",
      "mythology": "medical-research",
      "date": "1987",
      "type": "modern-scholarship"
    },
    {
      "text": "Energies of Transformation: A Guide to the Kundalini Process",
      "author": "Bonnie Greenwell",
      "mythology": "transpersonal-psychology",
      "date": "1990",
      "type": "modern-scholarship"
    },
    {
      "text": "Sadhana Guidelines for Kundalini Yoga",
      "author": "Yogi Bhajan",
      "mythology": "sikh-kundalini",
      "date": "1974",
      "type": "modern-teaching"
    }
  ],
  "linguistic": {
    "originalName": "कुण्डलिनी",
    "originalScript": "devanagari",
    "transliteration": "kuṇḍalinī",
    "pronunciation": "/kʊndəˈliːni/",
    "etymology": {
      "rootLanguage": "Sanskrit",
      "meaning": "Coiled one (feminine)",
      "derivation": "From 'kundal' (कुण्डल = coiled, circular) + feminine suffix 'ini'"
    },
    "cognates": [
      {
        "language": "Hindi",
        "term": "कुंडलिनी",
        "script": "kuṇḍalinī"
      },
      {
        "language": "Tibetan",
        "term": "གཏུམ་མོ",
        "script": "gtum mo",
        "meaning": "Inner heat/fierce woman"
      }
    ],
    "languageCode": "sa"
  },
  "geographical": {
    "region": "Indian subcontinent",
    "culturalArea": "South Asia; global spread through yoga movement",
    "originPoint": {
      "name": "Ancient India",
      "coordinates": {
        "latitude": 28.6139,
        "longitude": 77.209,
        "accuracy": "approximate"
      }
    },
    "modernCountries": [
      "India (origin)",
      "Nepal",
      "Tibet (related tummo practice)",
      "Global (modern kundalini yoga)"
    ]
  },
  "temporal": {
    "timelinePosition": "Medieval (systematic texts); ancient roots",
    "culturalPeriod": "Tantric period to present",
    "firstAttestation": {
      "date": {
        "year": 600,
        "circa": true,
        "uncertainty": 200,
        "display": "c. 600 CE",
        "confidence": "probable"
      },
      "source": "Early Tantric texts and Upanishads",
      "type": "literary"
    },
    "historicalDate": {
      "start": {
        "year": 600,
        "circa": true,
        "uncertainty": 200,
        "display": "c. 600 CE"
      },
      "end": {
        "year": 2025,
        "circa": false,
        "display": "Present"
      },
      "display": "c. 600 CE - Present"
    }
  }
}