{
  "id": "olympic-games",
  "type": "magic",
  "name": "Olympic Games",
  "icon": "🏆",
  "slug": "olympic-games",
  "mythologies": [
    "greek"
  ],
  "primaryMythology": "greek",
  "shortDescription": "Sacred Panhellenic athletic festival held every four years at Olympia to honor Zeus, combining religious ritual with athletic competition",
  "fullDescription": "The Olympic Games were the most prestigious of the four Panhellenic athletic festivals in ancient Greece, held every four years at Olympia in honor of Zeus from 776 BCE until 393 CE. Far more than mere athletic competitions, the Olympics were fundamentally religious festivals combining sacrifice, prayer, processions, and oaths with athletic contests viewed as offerings to the gods. The games took place during a sacred truce (ekecheiria) that suspended all warfare across Greece, allowing safe passage for athletes and spectators. Events included foot races, wrestling, boxing, pankration, pentathlon, chariot racing, and the prestigious stadion sprint. Victory brought not just athletic glory but divine favor—winners were crowned with olive wreaths from Zeus's sacred tree, honored in their home cities with statues and lifetime privileges, and sometimes even worshipped as heroes after death. The Olympic sanctuary itself was a sacred grove (Altis) filled with temples, altars, and treasuries where continuous sacrifices maintained the favor of Zeus and other deities. The games embodied Greek ideals of arete (excellence), kalokagathia (physical and moral beauty), and agon (competitive struggle), transforming athletic prowess into religious devotion.",
  "category": "ritual",
  "subCategory": "festival",
  "method": "athletic-religious-celebration",
  "colors": {
    "primary": "#FFD700",
    "secondary": "#2E8B57",
    "primaryRgb": "255, 215, 0"
  },
  "tags": [
    "athletics",
    "festival",
    "zeus",
    "competition",
    "sacred-truce",
    "panhellenic",
    "olympia",
    "victory",
    "sacrifice",
    "glory"
  ],
  "requirements": {
    "location": {
      "id": "olympia",
      "name": "Olympia",
      "type": "place",
      "mythology": "greek",
      "description": "Sacred sanctuary of Zeus in Elis, western Peloponnese"
    },
    "timing": "Every four years during the first full moon after the summer solstice, held over five days",
    "practitioner": "Free-born Greek males (athletes, priests, officials, spectators)",
    "preparation": "Athletes trained for ten months and spent final month at Olympia; ritual purification and taking of sacred oaths",
    "items": [
      {
        "id": "olive-wreath",
        "name": "Olive Wreath (Kotinos)",
        "description": "Victory crown woven from sacred olive tree branches"
      },
      {
        "id": "sacrificial-animals",
        "name": "Sacrificial Animals",
        "description": "Hundred oxen (hecatomb) and other animals for Zeus and other gods"
      },
      {
        "id": "victory-statues",
        "name": "Victory Statues",
        "description": "Bronze or marble statues of victors dedicated at Olympia"
      }
    ]
  },
  "steps": [
    {
      "order": 1,
      "action": "Sacred Truce Declared",
      "description": "Heralds announce the ekecheiria across Greece, suspending all warfare for three months"
    },
    {
      "order": 2,
      "action": "Arrival and Registration",
      "description": "Athletes and officials arrive at Olympia, athletes register and prove Greek citizenship"
    },
    {
      "order": 3,
      "action": "Sacred Oath",
      "description": "Athletes, trainers, and judges swear oaths before Zeus Horkios to compete fairly and follow rules"
    },
    {
      "order": 4,
      "action": "Opening Sacrifices",
      "description": "Grand sacrifices to Zeus and other Olympian deities, with prayers for successful games"
    },
    {
      "order": 5,
      "action": "Athletic Contests Begin",
      "description": "Five days of competitions including running, wrestling, boxing, pankration, pentathlon, and equestrian events"
    },
    {
      "order": 6,
      "action": "Mid-Games Hecatomb",
      "description": "On the third day, procession and sacrifice of 100 oxen at the Great Altar of Zeus"
    },
    {
      "order": 7,
      "action": "Victory Announcements",
      "description": "Heralds proclaim victors, announcing their name, father's name, and home city"
    },
    {
      "order": 8,
      "action": "Award of Olive Wreaths",
      "description": "Victors crowned with kotinos from Zeus's sacred olive tree in solemn ceremony"
    },
    {
      "order": 9,
      "action": "Victory Processions",
      "description": "Winners parade through Olympia, receiving praise and offerings"
    },
    {
      "order": 10,
      "action": "Closing Banquet",
      "description": "Communal feast in the Prytaneion with victors as honored guests, consuming meat from sacrifices"
    },
    {
      "order": 11,
      "action": "Return Home",
      "description": "Victors return to cities for additional honors, statues, lifetime benefits, and sometimes worship as heroes"
    }
  ],
  "effects": "Olympic victors received divine favor, eternal glory (kleos), and tangible rewards including olive wreaths, purple ribbons, palm branches, and enormous prestige. In their home cities they received heroic honors: free meals for life, front-row seats at festivals, exemption from taxes, statues in public spaces, victory odes by poets like Pindar, and sometimes posthumous hero-cult worship. The games unified Greek identity across city-states through shared religious experience and cultural values. Participants and spectators alike renewed connection with Zeus and Greek heritage.",
  "warnings": "Cheating or oath-breaking was sacrilege punished by heavy fines used to erect bronze statues of Zeus (Zanes) inscribed with warnings. Women were forbidden to attend (except priestess of Demeter) under penalty of death. Athletes who withdrew after swearing oaths faced divine retribution and public shame. The games' religious nature meant violations were offenses against Zeus himself.",
  "mythologyContexts": [
    {
      "mythology": "greek",
      "usage": "The Olympics expressed core Greek values through religious festival format. Athletic competition was viewed as a form of worship, with excellence (arete) in athletics bringing honor to both victor and patron deity. The games created Panhellenic identity, uniting otherwise fractious city-states in shared religious devotion and cultural celebration. They embodied the Greek ideal that human excellence glorifies the gods.",
      "associatedDeities": [
        {
          "id": "zeus",
          "name": "Zeus",
          "type": "deity",
          "mythology": "greek",
          "icon": "⚡",
          "url": "/mythos/greek/deities/zeus.html"
        },
        {
          "id": "hera",
          "name": "Hera",
          "type": "deity",
          "mythology": "greek",
          "icon": "👑",
          "url": "/mythos/greek/deities/hera.html"
        },
        {
          "id": "nike",
          "name": "Nike",
          "type": "deity",
          "mythology": "greek",
          "icon": "🏅",
          "url": "/mythos/greek/deities/nike.html"
        },
        {
          "id": "apollo",
          "name": "Apollo",
          "type": "deity",
          "mythology": "greek",
          "icon": "☀️",
          "url": "/mythos/greek/deities/apollo.html"
        }
      ],
      "mythicalOrigins": "Multiple foundation myths exist: Pelops won chariot race against King Oenomaus for his daughter's hand and founded the games; Heracles (Hercules) established them after completing his labors; Zeus defeated Cronus in wrestling and founded them in celebration. All versions link the games' origins to divine-heroic action.",
      "textReferences": [
        {
          "text": "Pindar's Olympic Odes",
          "passage": "Olympian 1, 6, 10",
          "context": "Victory odes celebrating Olympic champions and linking them to divine glory",
          "corpusUrl": "/corpus-search.html?term=pindar+olympian+odes"
        },
        {
          "text": "Pausanias' Description of Greece",
          "passage": "Book 5 (Elis)",
          "context": "Detailed account of Olympic sanctuary, games, rituals, and monuments",
          "corpusUrl": "/corpus-search.html?term=pausanias+olympia"
        },
        {
          "text": "Philostratus",
          "passage": "On Gymnastics",
          "context": "Training methods and religious aspects of athletic preparation",
          "corpusUrl": "/corpus-search.html?term=philostratus+gymnastics"
        }
      ],
      "symbolism": "The Olympics symbolized the unity of physical and spiritual excellence. Athletic competition represented agon (struggle) as cosmic principle—order emerging from contest, harmony from competition. The olive wreath, from Zeus's sacred tree, represented peace, victory, and divine blessing. The sacred truce embodied Greek values of religious devotion transcending political conflict. Victory itself was seen as divine favor, with athletic prowess as visible proof of godlike excellence.",
      "culturalSignificance": "The Olympics lasted over 1,100 years, shaping Greek identity and values. They inspired Panhellenic consciousness, spread Greek culture, and influenced Roman games. Victory odes by Pindar and others created immortal literary glory. The games ended in 393 CE when Christian Emperor Theodosius I banned pagan festivals. Their revival in 1896 CE reconnected with this ancient tradition, though modern games lack the religious centrality of their predecessors."
    }
  ],
  "relatedEntities": {
    "deities": [
      {
        "id": "zeus",
        "name": "Zeus",
        "type": "deity",
        "mythology": "greek",
        "icon": "⚡",
        "url": "/mythos/greek/deities/zeus.html"
      },
      {
        "id": "hera",
        "name": "Hera",
        "type": "deity",
        "mythology": "greek",
        "icon": "👑",
        "url": "/mythos/greek/deities/hera.html"
      },
      {
        "id": "nike",
        "name": "Nike",
        "type": "deity",
        "mythology": "greek",
        "icon": "🏅",
        "url": "/mythos/greek/deities/nike.html"
      }
    ],
    "places": [
      {
        "id": "olympia",
        "name": "Olympia",
        "type": "place",
        "mythology": "greek",
        "icon": "🏛️",
        "url": "/mythos/greek/places/olympia.html"
      },
      {
        "id": "mount-olympus",
        "name": "Mount Olympus",
        "type": "place",
        "mythology": "greek",
        "icon": "⛰️",
        "url": "/mythos/greek/places/mount-olympus.html"
      }
    ],
    "items": [
      {
        "id": "olive",
        "name": "Olive Wreath",
        "type": "item",
        "mythology": "greek",
        "icon": "🫒",
        "url": "/mythos/greek/items/olive.html"
      }
    ],
    "concepts": [
      {
        "id": "arete",
        "name": "Arete (Excellence)",
        "type": "concept",
        "mythology": "greek",
        "icon": "⭐",
        "url": "/mythos/greek/concepts/arete.html"
      },
      {
        "id": "agon",
        "name": "Agon (Contest/Struggle)",
        "type": "concept",
        "mythology": "greek",
        "icon": "⚔️",
        "url": "/mythos/greek/concepts/agon.html"
      }
    ],
    "heroes": [
      {
        "id": "heracles",
        "name": "Heracles",
        "type": "hero",
        "mythology": "greek",
        "icon": "💪",
        "url": "/mythos/greek/heroes/heracles.html"
      },
      {
        "id": "pelops",
        "name": "Pelops",
        "type": "hero",
        "mythology": "greek",
        "icon": "🏇",
        "url": "/mythos/greek/heroes/pelops.html"
      }
    ]
  },
  "archetypes": [
    {
      "category": "cosmic-battle",
      "score": 50,
      "strength": "moderate",
      "analysis": "Athletic competition symbolically represented cosmic agon—the struggle between opposing forces that generates excellence and order. While not literal battle, the contests embodied the principle of creative conflict and the emergence of champions through ordeal."
    },
    {
      "category": "hero-journey",
      "score": 70,
      "strength": "strong",
      "analysis": "Olympic victors followed the heroic pattern: departure from home, trials and ordeals, victory over opponents, and triumphant return with boons (glory, wreaths, divine favor). Victors joined the ranks of legendary figures, sometimes receiving posthumous hero worship."
    },
    {
      "category": "sacred-kingship",
      "score": 55,
      "strength": "moderate",
      "analysis": "Olympic victors embodied qualities of sacred kings—chosen by divine favor (victory), intermediaries between human and divine, and recipients of special privileges and communal veneration during and after life."
    }
  ],
  "sources": [
    {
      "text": "Pindar's Olympic Odes",
      "author": "Pindar",
      "passage": "Olympians 1, 6, 10, 13",
      "mythology": "greek",
      "corpusUrl": "/corpus-search.html?term=pindar+olympian"
    },
    {
      "text": "Pausanias' Description of Greece",
      "author": "Pausanias",
      "passage": "Book 5 (Elis)",
      "mythology": "greek",
      "corpusUrl": "/corpus-search.html?term=pausanias+elis+olympia"
    },
    {
      "text": "The Ancient Olympics",
      "author": "Judith Swaddling",
      "mythology": "greek",
      "type": "modern-scholarship"
    },
    {
      "text": "Sport and Society in Ancient Greece",
      "author": "Mark Golden",
      "mythology": "greek",
      "type": "modern-scholarship"
    }
  ],
  "linguistic": {
    "originalName": "Olympic Games",
    "transliteration": "Olympic Games",
    "needsResearch": true
  },
  "geographical": {
    "region": "Greece",
    "culturalArea": "Hellenic World"
  },
  "temporal": {
    "firstAttestation": {
      "date": {
        "year": -750,
        "circa": true,
        "uncertainty": 100,
        "display": "c. 750 BCE",
        "confidence": "speculative"
      },
      "type": "literary",
      "description": "Estimated based on mythology literary tradition",
      "needsResearch": true
    },
    "historicalDate": {
      "start": {
        "year": -800,
        "circa": true,
        "uncertainty": 200,
        "display": "c. 800 BCE"
      },
      "end": {
        "year": 400,
        "circa": true,
        "uncertainty": 100,
        "display": "c. 400 CE"
      },
      "display": "800 BCE - 400 CE",
      "needsResearch": true
    }
  }
}