{
  "id": "oracle-bones",
  "type": "magic",
  "name": "Oracle Bones (Jiaguwen)",
  "icon": "🦴",
  "slug": "oracle-bones",
  "mythologies": [
    "chinese"
  ],
  "primaryMythology": "chinese",
  "shortDescription": "Earliest systematically documented form of Chinese divination involving inscribing questions on animal bones or turtle shells, applying heat to create cracks, and interpreting the patterns as answers from ancestral spirits and deities, practiced primarily during the late Shang Dynasty (c. 1600-1046 BCE)",
  "fullDescription": "Oracle bone divination, known as 'jiaguwen' (甲骨文, literally 'shell-bone script'), represents the earliest systematically documented form of Chinese divination and the oldest substantial corpus of Chinese writing. Practiced primarily during the late Shang Dynasty (c. 1600-1046 BCE), this method involved inscribing questions on animal bones or turtle plastrons (lower shells), applying heat to create cracks, and interpreting the resulting patterns as answers from ancestral spirits and deities. The discovery of oracle bones in 1899 by scholar Wang Yirong transformed understanding of ancient China, providing the earliest examples of Chinese writing, documenting actual Shang Dynasty events, and revealing religious practices at the foundation of Chinese civilization. Over 150,000 oracle bone fragments have been excavated, primarily from Anyang (ancient Yin, the last Shang capital), serving triple significance as earliest writing examples, historical records, and evidence of divinatory practices.",
  "category": "divination",
  "subCategory": "pyromancy",
  "method": "crack-interpretation",
  "colors": {
    "primary": "#8B7355",
    "secondary": "#DEB887",
    "primaryRgb": "139, 115, 85"
  },
  "tags": [
    "oracle-bones",
    "jiaguwen",
    "chinese",
    "shang-dynasty",
    "pyromancy",
    "ancestral-spirits",
    "turtle-shells",
    "scapulimancy",
    "ancient-writing",
    "divination"
  ],
  "requirements": {
    "location": {
      "id": "royal-court",
      "name": "Royal Court or Sacred Space",
      "type": "place",
      "description": "Primarily royal prerogative during Shang Dynasty; required prepared ritual space"
    },
    "timing": "Specific dates recorded using the 60-day ganzhi cycle; timing was crucial element of divinations",
    "practitioner": "Specialized diviners (wu/zhen) trained in bone preparation, heat application, crack interpretation, and oracle bone script",
    "preparation": "Extensive preparation of bones or shells: cleaning, smoothing, creating hollow depressions (zans) for heat application; training in interpretation",
    "items": [
      {
        "id": "turtle-plastron",
        "name": "Turtle Plastron",
        "description": "Lower shell of turtle, particularly Chinese softshell turtle, prepared with hollow depressions"
      },
      {
        "id": "cattle-scapula",
        "name": "Cattle Scapula",
        "description": "Shoulder blades from oxen or water buffalo, most common oracle bones"
      },
      {
        "id": "heated-rod",
        "name": "Heated Bronze Rod",
        "description": "Tool for applying intense heat to create cracks"
      },
      {
        "id": "carving-tools",
        "name": "Carving Tools",
        "description": "For inscribing questions and interpretations in oracle bone script"
      }
    ]
  },
  "steps": [
    {
      "order": 1,
      "action": "Formulate Binary Question",
      "description": "Frame question as proposition receiving affirmative or negative answer. Often both positive and negative versions asked for confirmation"
    },
    {
      "order": 2,
      "action": "Inscribe the Charge",
      "description": "Carve the question into prepared bone/shell before heat application, including cyclical date, diviner's name, and the proposition"
    },
    {
      "order": 3,
      "action": "Apply Heat to Hollows",
      "description": "Apply heated bronze rod or burning wood to prepared depressions on underside of bone/shell"
    },
    {
      "order": 4,
      "action": "Create Cracks (Pyromancy)",
      "description": "Intense heat causes material to crack on upper surface in distinctive patterns resembling the character 卜 (bu, divination)"
    },
    {
      "order": 5,
      "action": "Interpret Crack Patterns",
      "description": "Examine crack direction, length, clarity, and pattern. Consider straightness, prominence, branch cracks, sound produced, and relationships between multiple cracks"
    },
    {
      "order": 6,
      "action": "Inscribe Prognostication",
      "description": "Carve the interpreted answer or spiritual communication received through the cracks alongside the original question"
    },
    {
      "order": 7,
      "action": "Record Verification (Later)",
      "description": "After predicted event occurs or fails to occur, add verification statement recording actual outcome, creating historical record"
    },
    {
      "order": 8,
      "action": "Archive the Oracle Bone",
      "description": "Store used bones for reference and record-keeping, creating institutional memory of divinations"
    }
  ],
  "effects": "Oracle bone divination served as primary method for Shang royal decision-making and communication with the spirit world, particularly ancestors. It provided guidance on military campaigns, agriculture, hunting, sacrifice, royal health, dreams, construction, and astronomical interpretation. The practice reinforced royal authority as intermediary between human and spiritual realms. Modern archaeological study of oracle bones provides extraordinary insight into Shang Dynasty religion, politics, daily life, and the development of Chinese writing, transforming legendary history into confirmed fact.",
  "warnings": "This practice is primarily of historical and archaeological interest—authentic oracle bone divination ended with the Shang Dynasty's fall (c. 1046 BCE). The Zhou Dynasty preferred yarrow stalk divination (I Ching), though simplified bone divination continued in folk practice. Modern practitioners cannot authentically recreate Shang royal divination due to lost interpretation techniques and the practice's embeddedness in Shang state religion. Academic study requires specialized training in oracle bone script—approximately 5,000 different characters appear, with only 1,500 reliably identified. Cultural appropriation concerns apply to casual modern attempts to use this sacred royal practice outside its historical context.",
  "mythologyContexts": [
    {
      "mythology": "chinese",
      "usage": "Oracle bones served the Shang Dynasty royal court as primary communication channel with ancestral spirits and deities. Questions addressed warfare, agriculture, hunting, sacrifice, illness, dreams, and cosmic phenomena. The king personally participated in major divinations. The practice was royal monopoly, reinforcing the king's unique position as intermediary between human and spiritual realms",
      "associatedDeities": [
        {
          "id": "shangdi",
          "name": "Shangdi",
          "type": "deity",
          "mythology": "chinese",
          "icon": "⚡",
          "url": "/mythos/chinese/deities/shangdi.html"
        }
      ],
      "mythicalOrigins": "Oracle bone divination likely evolved from earlier practices using heated materials, systematized during Shang Dynasty into elaborate inscribed procedure. The practice connected earthly rulers with heavenly powers and ancestral wisdom",
      "textReferences": [
        {
          "text": "Jiaguwen Heji (Collection of Oracle Bone Inscriptions)",
          "author": "Guo Moruo et al. (eds.)",
          "passage": "Complete collection",
          "context": "Comprehensive collection of 41,956 inscribed pieces, standard reference for oracle bone research",
          "corpusUrl": "/corpus-search.html?term=jiaguwen+heji"
        }
      ],
      "symbolism": "Turtle shells represented cosmic stability and longevity, their structure reflecting cosmic order. The cracks revealed patterns hidden in chaos, making visible the will of spirits. The character 卜 (bu, divination) itself depicts a crack pattern",
      "culturalSignificance": "Oracle bones provided the first substantial Chinese writing, transformed Shang Dynasty from legend to confirmed history, revealed Shang cosmology and state organization, and established precedent for divination as state function. The practice influenced all subsequent Chinese divination and the concept of royal mandate"
    }
  ],
  "relatedEntities": {
    "practices": [
      {
        "id": "i-ching",
        "name": "I Ching",
        "type": "magic",
        "mythology": "chinese",
        "icon": "☯",
        "url": "/magic/divination/i-ching.html"
      },
      {
        "id": "geomancy",
        "name": "Feng Shui",
        "type": "magic",
        "mythology": "chinese",
        "icon": "🌍",
        "url": "/magic/divination/geomancy.html"
      }
    ],
    "deities": [
      {
        "id": "shangdi",
        "name": "Shangdi (Supreme Deity)",
        "type": "deity",
        "mythology": "chinese",
        "icon": "⚡",
        "url": "/mythos/chinese/deities/shangdi.html"
      }
    ]
  },
  "archetypes": [
    {
      "category": "sage-wisdom",
      "score": 85,
      "strength": "strong",
      "analysis": "The diviner as sage interpreting ancestral wisdom, reading hidden patterns to guide the ruler. The oracle bone practice embodies seeking wisdom from the past to guide the present"
    },
    {
      "category": "ruler-authority",
      "score": 80,
      "strength": "strong",
      "analysis": "Oracle bones reinforced royal authority through exclusive access to divine communication. The king as cosmic intermediary between heaven, ancestors, and people"
    }
  ],
  "sources": [
    {
      "text": "Sources of Shang History: The Oracle-Bone Inscriptions of Bronze Age China",
      "author": "David N. Keightley",
      "mythology": "chinese",
      "date": "1978",
      "type": "modern-scholarship"
    },
    {
      "text": "The Ancestral Landscape: Time, Space, and Community in Late Shang China",
      "author": "David N. Keightley",
      "mythology": "chinese",
      "date": "2000",
      "type": "modern-scholarship"
    },
    {
      "text": "Shang Civilization",
      "author": "Kwang-chih Chang",
      "mythology": "chinese",
      "date": "1980",
      "type": "modern-scholarship"
    },
    {
      "text": "The Origin and Early Development of the Chinese Writing System",
      "author": "William G. Boltz",
      "mythology": "chinese",
      "date": "1994",
      "type": "modern-scholarship"
    }
  ],
  "linguistic": {
    "originalName": "甲骨文",
    "originalScript": "chinese",
    "transliteration": "jiaguwen",
    "pronunciation": "/tɕjä kú wə́n/",
    "etymology": {
      "rootLanguage": "Chinese",
      "meaning": "Shell-bone script",
      "derivation": "Jia (shell) + Gu (bone) + Wen (writing/script)"
    },
    "cognates": [],
    "languageCode": "zh"
  },
  "geographical": {
    "region": "Yellow River Valley, Henan Province",
    "culturalArea": "Shang Dynasty China",
    "originPoint": {
      "name": "Anyang (ancient Yin)",
      "coordinates": {
        "latitude": 36.1,
        "longitude": 114.3,
        "accuracy": "city"
      }
    },
    "modernCountries": [
      "China"
    ]
  },
  "temporal": {
    "timelinePosition": "Bronze Age",
    "culturalPeriod": "Late Shang Dynasty (c. 1600-1046 BCE)",
    "firstAttestation": {
      "date": {
        "year": -1250,
        "circa": true,
        "uncertainty": 100,
        "display": "c. 1250 BCE",
        "confidence": "probable"
      },
      "source": "Archaeological inscriptions from Anyang",
      "type": "archaeological"
    },
    "historicalDate": {
      "start": {
        "year": -1600,
        "circa": true,
        "uncertainty": 100,
        "display": "c. 1600 BCE"
      },
      "end": {
        "year": -1046,
        "circa": true,
        "uncertainty": 20,
        "display": "c. 1046 BCE"
      },
      "display": "c. 1600-1046 BCE (primary use); discovery 1899 CE"
    }
  }
}
