{
  "id": "qigong",
  "type": "magic",
  "name": "Qigong",
  "icon": "☯",
  "slug": "qigong",
  "mythologies": [
    "chinese",
    "taoist",
    "buddhist"
  ],
  "primaryMythology": "chinese",
  "shortDescription": "Ancient Chinese holistic system of coordinated body posture, movement, breathing, and meditation used for health, spirituality, and martial arts; cultivates and balances qi (vital life force energy) through slow flowing movements, regulated breathing, and focused intention",
  "fullDescription": "Qigong (pronounced 'chee-gong') is an ancient Chinese holistic system of coordinated body-posture and movement, breathing, and meditation used for the purposes of health, spirituality, and martial arts training. With roots extending back over 4,000 years, qigong combines slow flowing movements, regulated breathing, focused intention, and meditative awareness to cultivate and balance qi (chi)—the vital life force energy that flows through all living things. The word 'qigong' is composed of two Chinese characters: 'qi' (氣) meaning 'life force' or 'vital energy,' and 'gong' (功) meaning 'work,' 'skill,' or 'cultivation.' Thus qigong literally translates as 'working with life energy' or 'cultivating vital force.' This practice represents a sophisticated understanding of the human energy system and its relationship to health, consciousness, and the natural world. Rooted in Daoism, Buddhism, Confucianism, and Traditional Chinese Medicine (TCM), qigong encompasses medical qigong (healing), martial qigong (power development), and spiritual qigong (enlightenment). Practices range from gentle medical qigong like the Six Healing Sounds, to vigorous forms like Shaolin qigong, to advanced internal alchemy (neidan) seeking spiritual transformation.",
  "category": "energy-work",
  "subCategory": "qi-cultivation",
  "practiceType": "breath-movement-meditation",
  "method": "moving-meditation-breathwork",
  "colors": {
    "primary": "#10B981",
    "secondary": "#6EE7B7",
    "primaryRgb": "16, 185, 129"
  },
  "tags": [
    "qigong",
    "qi",
    "chi",
    "chinese-medicine",
    "taoist",
    "energy-cultivation",
    "meridians",
    "dan-tian",
    "standing-meditation",
    "microcosmic-orbit",
    "internal-alchemy",
    "tai-chi"
  ],
  "requirements": {
    "location": {
      "id": "open-natural-space",
      "name": "Open Natural Space",
      "type": "place",
      "description": "Outdoor natural setting preferred (parks, gardens); well-ventilated indoor space acceptable; connection to nature enhances qi"
    },
    "timing": "Best practiced at dawn or dusk when yin-yang energies balance; daily consistent practice essential; traditionally practiced facing east at sunrise",
    "practitioner": "Anyone of any age and fitness level can practice gentle qigong; advanced practices require qualified instruction",
    "preparation": "Comfortable loose clothing allowing free movement; empty stomach or light eating; calm mental state; study of qi theory and practice forms",
    "items": [
      {
        "id": "comfortable-clothing",
        "name": "Loose Comfortable Clothing",
        "description": "Breathable natural fibers allowing unrestricted movement and energy flow"
      },
      {
        "id": "flat-shoes",
        "name": "Flat Flexible Shoes or Bare Feet",
        "description": "Thin-soled shoes or barefoot practice for connection to earth"
      },
      {
        "id": "practice-mat",
        "name": "Practice Mat (optional)",
        "description": "For indoor practice or standing meditation"
      }
    ]
  },
  "steps": [
    {
      "order": 1,
      "action": "Enter Wuji Stance (Primordial State)",
      "description": "Stand with feet shoulder-width apart, knees slightly bent, tailbone tucked, spine erect, head suspended as if from above. Relax shoulders, hollow chest slightly, round back. Tongue touches roof of mouth. Enter state of emptiness and stillness—wuji, the void before creation."
    },
    {
      "order": 2,
      "action": "Establish Lower Dan Tian Awareness",
      "description": "Focus attention on lower dan tian (下丹田), 2-3 inches below navel and deep in abdomen. This is the body's 'battery' where original qi (yuan qi) is stored. Breathe naturally into this area, allowing belly to expand on inhalation. Build warmth and presence in lower dan tian."
    },
    {
      "order": 3,
      "action": "Practice Natural Breathing (Ziran Huxi)",
      "description": "Begin with natural abdominal breathing: abdomen expands on inhale, contracts on exhale. Breath should be slow, deep, fine, and even. Coordinate breath with mind and movement. This is foundational for all qigong."
    },
    {
      "order": 4,
      "action": "Practice Standing Like a Tree (Zhan Zhuang)",
      "description": "Hold standing posture with arms raised as if embracing a large tree or ball. Start with 5 minutes, gradually building to 20-40 minutes daily. This powerful practice builds qi, develops internal strength, and cultivates stillness. Breathe into lower dan tian throughout."
    },
    {
      "order": 5,
      "action": "Practice the Eight Brocades (Ba Duan Jin)",
      "description": "Perform the eight elegant movements: 1) Hold up the Heavens, 2) Draw the Bow, 3) Separate Heaven and Earth, 4) Wise Owl Gazes Backward, 5) Sway Head Shake Tail, 6) Two Hands Hold Feet, 7) Clench Fists with Fiery Eyes, 8) Bounce on Toes. Each 6-12 repetitions."
    },
    {
      "order": 6,
      "action": "Practice the Six Healing Sounds (Liu Zi Jue)",
      "description": "Use specific sounds and postures to regulate organs: Xu (liver/wood/anger), He (heart/fire/impatience), Hu (spleen/earth/worry), Si (lungs/metal/grief), Chui (kidneys/water/fear), Xi (triple warmer/all emotions). Each sound 6-12 times, visualizing organ cleansed and revitalized."
    },
    {
      "order": 7,
      "action": "Practice the Five Animal Frolics (Wu Qin Xi)",
      "description": "Mimic movements of five animals: Tiger (strength/courage), Deer (grace/longevity), Bear (grounding/stability), Monkey (agility/heart), Crane (tranquility/balance). Each cultivates specific qualities and benefits particular organ systems."
    },
    {
      "order": 8,
      "action": "Practice the Small Circulation (Microcosmic Orbit)",
      "description": "Advanced meditation: sit with tongue on roof of mouth. Focus on lower dan tian until warm. Guide qi down to perineum, up spine (Governing Vessel) to crown, down front centerline (Conception Vessel) back to dan tian. Complete the circuit 9-36 times. This purifies meridians and circulates energy."
    },
    {
      "order": 9,
      "action": "Cultivate Reverse Breathing (Ni Huxi)",
      "description": "Advanced technique: abdomen contracts on inhalation (drawing qi inward to dan tian), expands on exhalation. This builds internal power (nei gong) and prepares for martial applications. Practice only after mastering natural breathing."
    },
    {
      "order": 10,
      "action": "Balance Yin-Yang and Five Elements",
      "description": "Qigong balances the fundamental polarities (yin-yang) and five elemental phases (wood, fire, earth, metal, water). Practice coordinates with seasons: spring/wood/liver, summer/fire/heart, late summer/earth/spleen, autumn/metal/lungs, winter/water/kidneys."
    },
    {
      "order": 11,
      "action": "Collect and Store Qi",
      "description": "After active practice, always conclude by gathering scattered qi back to lower dan tian. Place palms over lower abdomen, spiral hands inward, visualize energy condensing and storing. This prevents qi depletion and integrates practice benefits."
    },
    {
      "order": 12,
      "action": "Return to Wuji and Integrate",
      "description": "Stand in wuji stance again, completely relaxed. Allow movements, breath, and qi to settle into stillness. Observe internal state without judgment. Transition slowly back to daily activities, maintaining awareness of qi and centeredness cultivated in practice."
    }
  ],
  "effects": "Regular qigong practice produces profound multi-dimensional benefits. Physical: increased lung capacity, improved cardiovascular health, enhanced immune function, better balance and coordination, reduced chronic pain and inflammation, improved sleep, support for chronic illness management. Mental/Emotional: reduced stress and anxiety, enhanced concentration and mental clarity, emotional regulation and resilience, improved mood, greater mind-body awareness. Energetic: purified and strengthened meridians, balanced organ systems, abundant qi flow, harmonized yin-yang, balanced five elements. Spiritual: cultivation of inner peace, connection with universal energy (Dao), development of spiritual awareness, refinement of consciousness (shen), potential for enlightenment. Modern research validates traditional claims, showing measurable physiological changes including improved heart rate variability, reduced cortisol, enhanced parasympathetic tone, and altered brainwave patterns.",
  "warnings": "Never force movements or breath—qigong should feel natural and comfortable, following principle of wu wei (effortless action). Start slowly with 10-15 minutes daily, gradually increasing. Those with serious health conditions should practice under guidance of qualified instructor and with medical approval. Mental health conditions may be exacerbated by intensive practice—proceed with awareness and professional support. Avoid extremes and obsessive practice; too much qigong can create imbalances (qi deviation). Pregnant women should avoid certain exercises and reverse breathing; practice only gentle forms under guidance. If you feel dizzy, nauseous, overheated, or experience unusual sensations, stop immediately and rest. Advanced practices (Microcosmic Orbit, reverse breathing, martial qigong) require proper instruction to avoid injury or energetic imbalances. Cultural sensitivity important: qigong is living Chinese tradition, not just exercise—honor its origins and philosophical foundations. Integration with Traditional Chinese Medicine theory, ethical living, and balanced lifestyle enhances practice.",
  "mythologyContexts": [
    {
      "mythology": "chinese",
      "usage": "Qigong is rooted in Chinese philosophy, medicine, and spirituality—primarily Daoism, Buddhism, and Confucianism. Daoist qigong emphasizes alignment with natural rhythms (Dao), balance of yin-yang, cultivation of Three Treasures (jing, qi, shen), and internal alchemy (neidan) for spiritual immortality. Buddhist qigong (especially from Shaolin tradition) combines energy cultivation with Chan (Zen) meditation, using qigong to strengthen body for spiritual practice. Traditional Chinese Medicine (TCM) views qigong as essential for health maintenance: circulating qi through meridians, balancing organs according to Five Element theory, and preventing disease through regular practice. The goal ranges from physical health (medical qigong) to supernatural power (martial qigong) to spiritual enlightenment (Daoist immortality practices).",
      "associatedDeities": [],
      "mythicalOrigins": "Legendary origins include the Yellow Emperor (Huangdi, c. 2696-2598 BCE) practicing breath exercises, and physician Hua Tuo (c. 140-208 CE) developing the Five Animal Frolics. Bodhidharma (c. 520 CE) is credited with bringing Chan Buddhism and qigong to Shaolin Temple. However, qigong represents accumulated knowledge from countless practitioners over millennia rather than single revelation.",
      "textReferences": [
        {
          "text": "Dao De Jing",
          "author": "Laozi",
          "passage": "Various chapters on breath and naturalness",
          "context": "Foundational Daoist text informing qigong philosophy of wu wei and natural flow",
          "corpusUrl": "/corpus-search.html?term=dao+de+jing"
        },
        {
          "text": "Yellow Emperor's Classic of Internal Medicine (Huangdi Neijing)",
          "passage": "Chapters on qi, meridians, and health",
          "context": "Foundation of Traditional Chinese Medicine and qi theory",
          "corpusUrl": "/corpus-search.html?term=huangdi+neijing"
        },
        {
          "text": "Zhuangzi",
          "author": "Zhuangzi",
          "passage": "Chapters on breath and longevity",
          "context": "Daoist text describing breathing practices and spiritual cultivation",
          "corpusUrl": "/corpus-search.html?term=zhuangzi+breath"
        }
      ],
      "symbolism": "Qi represents universal life force pervading all existence. The three dan tian (lower/middle/upper) correspond to earth/human/heaven and to the Three Treasures (jing/qi/shen). The Microcosmic Orbit connects Governing (yang/heaven) and Conception (yin/earth) Vessels, creating complete energetic circuit. The practice embodies Daoist cosmology of harmonizing with natural cycles and transforming consciousness.",
      "culturalSignificance": "Qigong remains central to Chinese culture for health, martial arts, and spirituality. After suppression during Cultural Revolution (1949-1976), qigong experienced massive revival in 1980s-90s with scientific research and government support. Today practiced by millions in China and worldwide, qigong bridges ancient wisdom and modern science, traditional medicine and contemporary wellness."
    }
  ],
  "relatedEntities": {
    "practices": [
      {
        "id": "breathwork",
        "name": "Pranayama",
        "type": "magic",
        "mythology": "hindu",
        "icon": "🌬️",
        "url": "/magic/energy/breathwork.html"
      },
      {
        "id": "reiki",
        "name": "Reiki",
        "type": "magic",
        "mythology": "japanese",
        "icon": "✋",
        "url": "/magic/energy/reiki.html"
      },
      {
        "id": "tai-chi",
        "name": "Tai Chi",
        "type": "magic",
        "mythology": "chinese",
        "icon": "☯",
        "url": "/magic/practices/tai-chi.html"
      },
      {
        "id": "chakra-work",
        "name": "Chakra Work",
        "type": "magic",
        "mythology": "hindu",
        "icon": "🌈",
        "url": "/magic/energy/chakra-work.html"
      }
    ],
    "concepts": [
      {
        "id": "qi-chi",
        "name": "Qi/Chi (Vital Energy)",
        "type": "concept",
        "mythology": "chinese",
        "icon": "⚡",
        "url": "/concepts/qi.html"
      },
      {
        "id": "yin-yang",
        "name": "Yin-Yang",
        "type": "concept",
        "mythology": "chinese",
        "icon": "☯",
        "url": "/concepts/yin-yang.html"
      },
      {
        "id": "five-elements",
        "name": "Five Elements (Wu Xing)",
        "type": "concept",
        "mythology": "chinese",
        "icon": "🌊",
        "url": "/concepts/five-elements.html"
      },
      {
        "id": "three-treasures",
        "name": "Three Treasures (Jing-Qi-Shen)",
        "type": "concept",
        "mythology": "taoist",
        "icon": "💎",
        "url": "/concepts/three-treasures.html"
      }
    ]
  },
  "archetypes": [
    {
      "category": "breath-of-life",
      "score": 90,
      "strength": "strong",
      "analysis": "Qigong works directly with qi—the Chinese conception of universal life force equivalent to prana, pneuma, or ruach. This reflects the universal archetype of breath as the animating principle of existence."
    },
    {
      "category": "harmony-with-nature",
      "score": 95,
      "strength": "strong",
      "analysis": "Qigong embodies the Daoist principle of aligning with natural rhythms (Dao), practicing outdoors, coordinating with seasons and times of day. This reflects humanity's perennial wisdom of living in harmony with nature."
    },
    {
      "category": "balance-of-opposites",
      "score": 92,
      "strength": "strong",
      "analysis": "The fundamental goal is balancing yin-yang, heaven-earth, internal-external, movement-stillness. This mirrors the universal pattern of transcending dualities through dynamic equilibrium."
    },
    {
      "category": "alchemical-transformation",
      "score": 85,
      "strength": "strong",
      "analysis": "Advanced qigong (neidan/internal alchemy) transforms the Three Treasures: jing to qi, qi to shen, shen to void. This parallels alchemical transformation across traditions—transmuting gross substance into spiritual gold."
    }
  ],
  "sources": [
    {
      "text": "The Way of Qigong: The Art and Science of Chinese Energy Healing",
      "author": "Ken Cohen",
      "mythology": "chinese",
      "date": "1997",
      "type": "modern-scholarship"
    },
    {
      "text": "The Root of Chinese Qigong: Secrets of Health, Longevity, & Enlightenment",
      "author": "Yang Jwing-Ming",
      "mythology": "chinese",
      "date": "1989",
      "type": "traditional-teaching"
    },
    {
      "text": "Opening the Dragon Gate: The Making of a Modern Taoist Wizard",
      "author": "Chen Kaiguo & Zheng Shunchao",
      "mythology": "taoist",
      "date": "1998",
      "type": "biography"
    },
    {
      "text": "The Way of Energy: Mastering the Chinese Art of Internal Strength",
      "author": "Master Lam Kam Chuen",
      "mythology": "chinese",
      "date": "1991",
      "type": "practical-guide"
    },
    {
      "text": "The Secret of the Golden Flower",
      "author": "Richard Wilhelm (translator), C.G. Jung (commentary)",
      "mythology": "taoist",
      "date": "1931",
      "type": "classical-text"
    },
    {
      "text": "Daoist Body Cultivation: Traditional Models and Contemporary Practices",
      "author": "Livia Kohn (editor)",
      "mythology": "academic",
      "date": "2006",
      "type": "modern-scholarship"
    }
  ],
  "linguistic": {
    "originalName": "氣功",
    "originalScript": "chinese-traditional",
    "transliteration": "qìgōng",
    "pronunciation": "/ˈtʃiːˈɡɒŋ/",
    "etymology": {
      "rootLanguage": "Chinese",
      "meaning": "Working with life energy; cultivation of vital force",
      "derivation": "From 'qi' (氣 = life force/energy/breath) + 'gong' (功 = work/skill/cultivation)"
    },
    "cognates": [
      {
        "language": "Japanese",
        "term": "気功",
        "script": "kikō",
        "meaning": "Energy work"
      },
      {
        "language": "Korean",
        "term": "기공",
        "script": "gigong",
        "meaning": "Energy cultivation"
      },
      {
        "language": "Sanskrit",
        "term": "प्राण",
        "script": "prāṇa",
        "meaning": "Life force (cognate concept)"
      }
    ],
    "languageCode": "zh"
  },
  "geographical": {
    "region": "China",
    "culturalArea": "East Asia; now global",
    "originPoint": {
      "name": "Ancient China",
      "coordinates": {
        "latitude": 34,
        "longitude": 110,
        "accuracy": "approximate"
      }
    },
    "modernCountries": [
      "China (origin and widespread practice)",
      "Taiwan",
      "Hong Kong",
      "Global (modern spread)"
    ]
  },
  "temporal": {
    "timelinePosition": "Ancient",
    "culturalPeriod": "Ancient China to present",
    "firstAttestation": {
      "date": {
        "year": -2696,
        "circa": true,
        "uncertainty": 500,
        "display": "c. 2696 BCE",
        "confidence": "legendary"
      },
      "source": "Legendary Yellow Emperor period",
      "type": "legendary"
    },
    "historicalDate": {
      "start": {
        "year": -3000,
        "circa": true,
        "uncertainty": 500,
        "display": "c. 3000 BCE"
      },
      "end": {
        "year": 2025,
        "circa": false,
        "display": "Present"
      },
      "display": "c. 3000 BCE - Present"
    }
  }
}