{
  "id": "shamanism",
  "type": "magic",
  "name": "Shamanism",
  "icon": "🥁",
  "slug": "shamanism",
  "mythologies": [
    "siberian",
    "native-american",
    "african",
    "australian-aboriginal",
    "universal"
  ],
  "primaryMythology": "universal",
  "shortDescription": "Universal spiritual practice (found across indigenous cultures worldwide) where practitioners enter ecstatic trance states through drumming or other means to journey to spirit worlds, communicate with helping spirits and power animals, perform soul retrieval, conduct healing, and serve as intermediaries between human and spirit realms",
  "fullDescription": "Shamanism represents one of humanity's oldest and most widespread spiritual technologies, found independently across Siberia, the Americas, Africa, Australia, and Asia. The term 'shaman' comes from the Tungus (Evenki) word 'šaman,' but the practice pattern—ecstatic trance journey to spirit realms—appears in diverse cultures with local variations. The shaman functions as intermediary between ordinary reality and non-ordinary reality (spirit worlds), entering altered consciousness through drumming, dancing, plant medicines, fasting, or other techniques to access three cosmological realms: the Lower World (accessed through roots, caves, water—realm of power animals and ancestral wisdom), the Middle World (the spirit aspect of physical reality—where souls of living and recently dead reside), and the Upper World (accessed through trees, mountains, smoke—realm of celestial beings and teachers). In trance, the shaman's soul 'flies' to these realms to accomplish specific tasks: retrieving lost soul parts (soul retrieval), diagnosing illness through spiritual sight, extracting harmful intrusions, journeying to find lost objects or information, psychopomp work (guiding the dead), battling malevolent spirits, and divination. Helping spirits (power animals, ancestor spirits, deity figures) assist the shaman's work. Traditional shamans undergo intense initiatory experiences—often spontaneous spiritual crisis, near-death, serious illness, or hereditary calling—followed by training with elder shamans. Modern 'core shamanism' (developed by anthropologist Michael Harner) extracts common techniques from various traditions for contemporary Western practitioners. Shamanic practice emphasizes direct experience over dogma, practical healing over theology, and maintaining relationships with spirit allies.",
  "category": "ritual-magic",
  "subCategory": "ecstatic-trance",
  "practiceType": "spirit-journey",
  "method": "trance-drumming-soul-flight",
  "colors": {
    "primary": "#8B4513",
    "secondary": "#A0522D",
    "primaryRgb": "139, 69, 19"
  },
  "tags": [
    "shamanism",
    "spirit-journey",
    "soul-retrieval",
    "power-animals",
    "drumming",
    "ecstatic-trance",
    "healing",
    "psychopomp",
    "core-shamanism",
    "indigenous-practice"
  ],
  "requirements": {
    "location": {
      "id": "journey-space",
      "name": "Safe Space for Trance Work",
      "type": "place",
      "description": "Quiet, private space where you can lie down, drum, and enter trance without interruption; ideally in nature or with natural elements present"
    },
    "timing": "No prescribed timing, though some traditions emphasize twilight times, seasonal ceremonies, or lunar phases",
    "practitioner": "Requires strong psyche, psychological stability, genuine calling or need, ideally training with experienced shaman; not for those seeking power or escapism",
    "preparation": "Traditional: years of training, initiatory crisis, apprenticeship. Modern: workshops in core shamanism, establishing relationship with helping spirits, psychological readiness, ethical commitment",
    "items": [
      {
        "id": "drum-rattle",
        "name": "Drum or Rattle",
        "description": "Primary tool for inducing trance—steady, monotonous drumming at 4-7 beats per second alters brainwaves; rattle used similarly"
      },
      {
        "id": "blindfold-covering",
        "name": "Eye Covering",
        "description": "Bandana or eye mask to reduce visual distraction and facilitate inward vision"
      },
      {
        "id": "journey-object",
        "name": "Power Object (Optional)",
        "description": "Crystal, feather, bone, or other object that holds power and connection to helping spirits"
      },
      {
        "id": "offering-materials",
        "name": "Offerings",
        "description": "Tobacco, cornmeal, flowers, food—to give to spirits in gratitude and reciprocity"
      }
    ]
  },
  "steps": [
    {
      "order": 1,
      "action": "Understand the Calling",
      "description": "Shamanic practice is typically initiated by spiritual calling—spontaneous visions, illness that won't heal conventionally, near-death experience, ancestral heritage, or persistent pull toward spirit work. Don't pursue shamanism casually; it's demanding and can be destabilizing without genuine calling."
    },
    {
      "order": 2,
      "action": "Find Training and Mentorship",
      "description": "Traditional shamans train with elders in their culture. Modern practitioners should seek responsible teachers—Foundation for Shamanic Studies (core shamanism), indigenous teachers offering cross-cultural training with permission, or established lineages. Avoid fraudulent 'plastic shamans' selling weekend enlightenment."
    },
    {
      "order": 3,
      "action": "Prepare Mind and Body",
      "description": "Before journeying, purify through fasting (if appropriate), abstain from intoxicants (unless using traditional plant medicines under expert guidance—separate from drumming journey), cleanse space, center yourself. State clear intention for journey: 'I journey to find my power animal' or 'I journey to retrieve X's lost soul part.'"
    },
    {
      "order": 4,
      "action": "Create Sacred Space",
      "description": "Mark sacred space through smudging (sage, palo santo), calling directions, invoking helping spirits, or traditional opening prayers. Create container for safe journey and return. This is both psychological and spiritual boundary-setting."
    },
    {
      "order": 5,
      "action": "Enter Trance State",
      "description": "Lie down in comfortable position, cover eyes, begin rhythmic drumming (or have assistant drum for you, or use recorded drumming at 4-7 beats/second). Let the monotonous rhythm carry you into altered state. Breathe deeply, relax, allow shift in consciousness."
    },
    {
      "order": 6,
      "action": "Journey to Lower World",
      "description": "For power animal retrieval or ancestral wisdom: visualize entering earth through cave, hollow tree, water, or familiar opening. Descend through tunnel. When you emerge, you're in Lower World—often luminous natural landscape. Call for your power animal or helping spirit."
    },
    {
      "order": 7,
      "action": "Journey to Upper World",
      "description": "For celestial wisdom and higher teachings: visualize ascending through tree, mountain, smoke, or ladder into sky. Pass through membrane or clouds. Upper World often has crystalline, etheric quality. Meet with spirit teachers, angels, or elevated beings."
    },
    {
      "order": 8,
      "action": "Meet and Work with Power Animals",
      "description": "Power animals are helping spirits in animal form. They appear multiple times or clearly present themselves. They provide power, protection, guidance, and specific abilities. Dance their movements, embody their qualities, maintain relationship through regular journeys and honor."
    },
    {
      "order": 9,
      "action": "Communicate with Spirits",
      "description": "In non-ordinary reality, communicate through intention, telepathy, and direct knowing. Ask questions, request healing, seek lost objects, receive teachings. Spirits may communicate through symbols, feelings, words, or direct transmission. Trust what comes."
    },
    {
      "order": 10,
      "action": "Perform Soul Retrieval (Advanced)",
      "description": "For healing soul loss (caused by trauma): journey to find the lost soul part—often appears as younger version of person or as light/energy. Negotiate its return, blow it back into client's body (traditionally into crown and heart), integrate with healing ceremony."
    },
    {
      "order": 11,
      "action": "Extract Harmful Intrusions (Advanced)",
      "description": "Spiritual illness may manifest as intrusions—negative energies, thought-forms, or entities lodged in person's body. Use shamanic sight to locate, remove through extraction (pulling out), and transmute or return to earth/water. This requires training—improper extraction dangerous."
    },
    {
      "order": 12,
      "action": "Conduct Psychopomp Work (Advanced)",
      "description": "Guide earthbound souls (ghosts, stuck spirits) to appropriate afterlife realms. Journey to Middle World, locate confused souls, compassionately guide them to light/ancestors/appropriate realm. This requires strong boundaries and protection."
    },
    {
      "order": 13,
      "action": "Return from Journey",
      "description": "When journey work complete, thank helping spirits, ask if anything else needed, then return same way you came (back up tunnel from Lower World, down from Upper World). Callback drumming (rapid beats) signals return. Gradually return to ordinary consciousness."
    },
    {
      "order": 14,
      "action": "Ground and Integrate",
      "description": "Don't jump up immediately. Gradually return to body awareness. Touch ground, drink water, eat something. Record journey in journal while fresh. Give offerings of gratitude to spirits (tobacco, cornmeal left outside). Integrate teachings and experiences over following days."
    }
  ],
  "effects": "Shamanic practice produces profound effects across multiple dimensions. Healing: soul retrieval addresses fragmentation from trauma, restoring vitality and wholeness; extraction removes spiritual illness; power animal retrieval provides protection and empowerment. Psychological: integration of unconscious material, healing of trauma, enhanced resilience, connection to archetypal forces, expanded sense of self. Spiritual: direct contact with spirit realms (not mediated by doctrine), relationship with helping spirits, shamanic sight (ability to see into non-ordinary reality), enhanced intuition and divination, sense of participation in living cosmos. Community: traditional shamans serve as healers, diviners, ceremonialists for their people. Personal empowerment through direct spiritual experience rather than belief. Many practitioners report genuine phenomena—meetings with deceased relatives, accurate divination, healing that defies conventional explanation, consistent mythology across independent journeys. However, experiences are subjective and interpretation varies (literal spirit realms vs. deep unconscious vs. both). Effectiveness depends on skill, relationship with spirits, ethical grounding, and psychological integration.",
  "warnings": "CULTURAL APPROPRIATION CRITICAL CONCERN: Shamanism is sacred practice from indigenous cultures worldwide who have faced genocide, cultural destruction, and ongoing oppression. Non-indigenous practitioners must approach with utmost respect, acknowledge source cultures, not claim indigenous identity or titles (don't call yourself 'shaman' unless initiated in traditional lineage), learn from authorized teachers, never profit inappropriately from indigenous knowledge, support indigenous communities, and honor the difference between 'doing shamanic practices' and 'being a shaman' (latter requires cultural initiation). PSYCHOLOGICAL READINESS ESSENTIAL: Shamanic trance can trigger psychotic breaks in vulnerable individuals. Those with schizophrenia, dissociative disorders, severe trauma without therapeutic support, or unstable mental health should not practice. Even healthy individuals can experience frightening encounters, ego dissolution, or destabilizing visions. Have support and integration resources. SPIRITUAL DANGERS: Not all spirits are benevolent. Without proper training and protection, practitioners can encounter malevolent entities, become 'possessed' or influenced, or take on clients' illnesses. Never journey without establishing relationship with helping spirits first. PLANT MEDICINES: Traditional shamanism sometimes uses ayahuasca, peyote, iboga, etc. These are powerful, potentially dangerous, and illegal in many jurisdictions. They should ONLY be used in traditional ceremonial contexts with experienced shamans, never recreationally. Core shamanism uses drumming instead—safer and legal. TRAINING ESSENTIAL: Do not attempt soul retrieval, extraction, or psychopomp work without proper training—you can harm yourself or others. AVOID 'PLASTIC SHAMANS': Many fraudulent teachers claim indigenous lineages they don't have, charge exorbitant fees, mix traditions inappropriately, or use shamanism as ego trip. Research teachers carefully.",
  "mythologyContexts": [
    {
      "mythology": "siberian",
      "usage": "The word 'shaman' originates from Siberian Tungus peoples. Siberian shamanism features the classic pattern: ecstatic trance, soul journey, three-world cosmology, helping spirits, healing and divination. Siberian shamans use drums, elaborate costumes with symbolic elements (each bone, feather, bell has meaning), and often undergo dramatic initiatory experiences including dismemberment visions and rebirth.",
      "associatedDeities": [],
      "mythicalOrigins": "Siberian shamanic mythology involves the World Tree (axis mundi connecting realms), animal spirits as ancestors and helpers, and shamanic initiation as death and rebirth—the candidate is 'killed' by spirits, dismembered, reassembled with magical bones or crystals, and resurrected with new powers.",
      "textReferences": [
        {
          "text": "Shamanism: Archaic Techniques of Ecstasy",
          "author": "Mircea Eliade",
          "passage": "Extensive discussion of Siberian traditions",
          "context": "Foundational academic study of shamanism worldwide",
          "corpusUrl": "/corpus-search.html?term=eliade+shamanism"
        }
      ],
      "symbolism": "The drum as horse or vehicle for spirit journey, the World Tree as axis mundi, helping spirits as guides, dismemberment and reassembly as initiatory transformation, the shaman as wounded healer.",
      "culturalSignificance": "Siberian shamanism represents ancient spiritual technology predating organized religion, still practiced (despite Soviet suppression and Christian missionization) among indigenous Siberian peoples."
    },
    {
      "mythology": "native-american",
      "usage": "Indigenous American traditions vary enormously but share shamanic elements: medicine people who journey, work with spirits, perform healing, use sacred plants (peyote, tobacco), conduct ceremonies (sweat lodge, vision quest), and serve as intermediaries. Each nation has distinct practices—Lakota yuwipi, Navajo hatałii, Amazonian ayahuasceros, etc.",
      "associatedDeities": [],
      "mythicalOrigins": "Origin stories vary by nation. Common themes: the first shamans received knowledge from animal spirits, ancestors, or through vision quests. The practice is gift from spirit world to help the people.",
      "textReferences": [
        {
          "text": "Black Elk Speaks",
          "author": "Black Elk (Nicholas Black Elk), as told to John Neihardt",
          "passage": "Black Elk's vision and Lakota spirituality",
          "context": "Account of Lakota holy man's spiritual experiences",
          "corpusUrl": "/corpus-search.html?term=black+elk"
        }
      ],
      "symbolism": "Vision quest as initiatory journey, sacred pipe as prayer tool, animal spirits as teachers, the Sacred Hoop (unity of all life), the medicine wheel.",
      "culturalSignificance": "Despite genocidal suppression, Native American spiritual traditions persist and are being revitalized. These are living traditions belonging to specific nations—not generic 'Native American shamanism' available for outsider use."
    },
    {
      "mythology": "universal",
      "usage": "Core shamanism (Michael Harner's extraction of universal elements) identifies common patterns across cultures: trance journey, three-world cosmology, helping spirits, healing through soul retrieval/extraction. This allows contemporary Western practitioners to engage shamanic techniques without appropriating specific indigenous traditions—though this remains controversial.",
      "associatedDeities": [],
      "mythicalOrigins": "Shamanism as archaic spiritual technology predating civilization, arising independently in human communities worldwide as primary way of engaging spirit realms.",
      "textReferences": [
        {
          "text": "The Way of the Shaman",
          "author": "Michael Harner",
          "passage": "Complete work",
          "context": "Foundation for core shamanism approach",
          "corpusUrl": "/corpus-search.html?term=harner+way+shaman"
        }
      ],
      "symbolism": "Universal: the axis mundi (World Tree, mountain, pillar connecting realms), the wounded healer, spirit flight, the three worlds, animal allies.",
      "culturalSignificance": "Debate continues: is core shamanism respectful extraction of universal principles, or cultural appropriation packaging indigenous knowledge for Western consumption? Practitioners should engage this question seriously."
    }
  ],
  "relatedEntities": {
    "practices": [
      {
        "id": "vision-quest",
        "name": "Vision Quest",
        "type": "magic",
        "mythology": "native-american",
        "icon": "👁️",
        "url": "/magic/shamanic/vision-quest.html"
      },
      {
        "id": "drumming",
        "name": "Shamanic Drumming",
        "type": "magic",
        "mythology": "universal-shamanic",
        "icon": "🥁",
        "url": "/magic/techniques/drumming.html"
      },
      {
        "id": "psychopomp-work",
        "name": "Psychopomp Work",
        "type": "magic",
        "mythology": "shamanic",
        "icon": "🦋",
        "url": "/magic/shamanic/psychopomp.html"
      }
    ],
    "concepts": [
      {
        "id": "soul-retrieval",
        "name": "Soul Retrieval",
        "type": "concept",
        "mythology": "shamanic",
        "icon": "✨",
        "url": "/concepts/soul-retrieval.html"
      },
      {
        "id": "power-animals",
        "name": "Power Animals",
        "type": "concept",
        "mythology": "shamanic",
        "icon": "🦅",
        "url": "/concepts/power-animals.html"
      },
      {
        "id": "three-worlds",
        "name": "Three Worlds (Shamanic Cosmology)",
        "type": "concept",
        "mythology": "shamanic",
        "icon": "🌍",
        "url": "/concepts/three-worlds.html"
      }
    ]
  },
  "archetypes": [
    {
      "category": "wounded-healer",
      "score": 98,
      "strength": "strong",
      "analysis": "The shaman quintessentially embodies the wounded healer archetype—one who has survived crisis, illness, or death and returns with power to heal others. The wound becomes the source of healing power."
    },
    {
      "category": "psychopomp",
      "score": 95,
      "strength": "strong",
      "analysis": "The shaman as guide of souls—traveling between worlds, mediating between living and dead, human and spirit, known and unknown. This is the archetype of the threshold guardian and world-walker."
    },
    {
      "category": "ecstatic-mystic",
      "score": 92,
      "strength": "strong",
      "analysis": "Shamanism emphasizes ecstatic trance (soul flight, spirit possession) over ascetic contemplation. The shaman achieves gnosis through altered states—dance, drumming, plant medicines—accessing divine through embodied experience."
    }
  ],
  "sources": [
    {
      "text": "Shamanism: Archaic Techniques of Ecstasy",
      "author": "Mircea Eliade",
      "mythology": "cross-cultural-academic",
      "date": "1951",
      "type": "foundational-scholarship"
    },
    {
      "text": "The Way of the Shaman",
      "author": "Michael Harner",
      "mythology": "core-shamanism",
      "date": "1980",
      "type": "foundational-teaching"
    },
    {
      "text": "Soul Retrieval: Mending the Fragmented Self",
      "author": "Sandra Ingerman",
      "mythology": "core-shamanism",
      "date": "1991",
      "type": "modern-teaching"
    },
    {
      "text": "Shamanic Voices: A Survey of Visionary Narratives",
      "author": "Joan Halifax",
      "mythology": "cross-cultural",
      "date": "1979",
      "type": "anthology-scholarship"
    },
    {
      "text": "The Cosmic Serpent: DNA and the Origins of Knowledge",
      "author": "Jeremy Narby",
      "mythology": "amazonian-shamanism",
      "date": "1998",
      "type": "modern-scholarship"
    },
    {
      "text": "Black Elk Speaks",
      "author": "Black Elk (told to John Neihardt)",
      "mythology": "lakota",
      "date": "1932",
      "type": "primary-account"
    },
    {
      "text": "Cave and Cosmos: Shamanic Encounters with Another Reality",
      "author": "Michael Harner",
      "mythology": "core-shamanism",
      "date": "2013",
      "type": "modern-teaching"
    },
    {
      "text": "Shamanism: A Biopsychosocial Paradigm of Consciousness and Healing",
      "author": "Michael Winkelman",
      "mythology": "scientific-study",
      "date": "2010",
      "type": "modern-scholarship"
    }
  ],
  "linguistic": {
    "originalName": "šaman (Evenki/Tungus)",
    "originalScript": "evenki-tungus",
    "transliteration": "šaman / shaman",
    "pronunciation": "/ˈʃɑːmən/ or /ˈʃeɪmən/",
    "etymology": {
      "rootLanguage": "Tungus (Evenki, Siberia)",
      "meaning": "One who knows, one who sees in darkness, spiritual practitioner",
      "derivation": "From Tungus 'šaman' possibly from 'ša-' (to know) or from Sanskrit 'śramaṇa' (Buddhist ascetic) via cultural contact"
    },
    "cognates": [
      {
        "language": "Mongolian",
        "term": "böö",
        "script": "böö",
        "meaning": "Shaman"
      },
      {
        "language": "Lakota",
        "term": "wičháša wakȟáŋ",
        "script": "wičháša wakȟáŋ",
        "meaning": "Holy man, medicine man"
      }
    ],
    "languageCode": "tuw"
  },
  "geographical": {
    "region": "Worldwide (universal pattern with cultural variations)",
    "culturalArea": "Siberia, Central Asia, Americas, sub-Saharan Africa, Australia, Arctic regions—wherever indigenous cultures maintain ancestral practices",
    "originPoint": {
      "name": "Multiple independent origins; Siberia for the term 'shaman'",
      "coordinates": {
        "latitude": 61.524,
        "longitude": 105.3188,
        "accuracy": "regional"
      }
    },
    "modernCountries": [
      "Russia (Siberia)",
      "Mongolia",
      "United States (Native American traditions)",
      "Peru, Ecuador, Colombia (Amazonian traditions)",
      "Australia (Aboriginal traditions)",
      "Global (modern core shamanism)"
    ]
  },
  "temporal": {
    "timelinePosition": "Prehistoric to present",
    "culturalPeriod": "Paleolithic origins (likely 30,000+ years), continuous practice in indigenous cultures to present",
    "firstAttestation": {
      "date": {
        "year": -28000,
        "circa": true,
        "uncertainty": 10000,
        "display": "c. 30,000 BCE",
        "confidence": "speculative"
      },
      "source": "Cave paintings suggesting trance practices, therianthropic figures",
      "type": "archaeological"
    },
    "historicalDate": {
      "start": {
        "year": -28000,
        "circa": true,
        "uncertainty": 10000,
        "display": "c. 30,000 BCE"
      },
      "end": {
        "year": 2025,
        "circa": false,
        "display": "Present"
      },
      "display": "c. 30,000 BCE - Present"
    }
  }
}