{
  "id": "jewish_menorah",
  "contentType": "symbols",
  "name": "Menorah",
  "displayName": "🕎 Menorah - Seven-Branched Lamp",
  "type": "symbol",
  "mythology": "jewish",
  "filename": "menorah",
  "description": "The Seven-Branched Lampstand of Divine Light\n\nThe Menorah is one of the oldest and most enduring symbols of Judaism, representing divine light, wisdom, and the eternal covenant between God and Israel. Originally crafted for the Tabernacle and later the Temple in Jerusalem, the seven-branched golden lampstand has illuminated Jewish consciousness for over three millennia.\n\nThe Menorah stands as a powerful symbol of spiritual enlightenment, the creation week, and the Tree of Life, embodying the Jewish mission to be 'a light unto the nations.'",
  "meaning": "The Menorah symbolizes divine light, wisdom, the seven days of creation, spiritual enlightenment, and Israel's eternal covenant with God. It represents the Jewish people's role as bearers of divine light to the world.",
  "meanings": [
    "Divine Light (Or HaShem) - The eternal flame of God's presence illuminating the world",
    "Seven Days of Creation - The six branches plus central shaft mirror the creation week with Shabbat at the center",
    "Tree of Life (Etz Chaim) - The branching structure evokes the cosmic tree connecting heaven and earth",
    "Wisdom and Torah - The light represents the illumination of sacred knowledge and understanding",
    "Covenant Symbol - Emblem of the eternal bond between God and the Jewish people",
    "Unity in Diversity - Seven distinct branches emanating from one source represent unified purpose",
    "Spiritual Ascent - The upward-reaching flames symbolize the soul's yearning toward the Divine"
  ],
  "visualDescription": "A seven-branched candelabrum fashioned from a single piece of beaten gold (zahav tahor), standing approximately five feet tall. The central shaft (kaneh) rises vertically with three curved branches extending from each side, all reaching the same height. Each of the seven branches terminates in a lamp (ner) designed to hold olive oil and a wick. The entire structure is adorned with decorative cups shaped like almond blossoms (geviim meshukadim), knobs (kaftorim), and flowers (perachim). The base typically features a three-legged pedestal or tiered platform. The overall form suggests an almond tree in bloom, connecting to Aaron's miraculous rod.",
  "attributes": [
    "Seven branches - the complete number in Jewish numerology",
    "Pure beaten gold (zahav tahor)",
    "Single piece construction - unity and wholeness",
    "Almond blossom decorations - watchfulness and awakening",
    "Olive oil fuel - purity and the Holy Land",
    "Perpetual flame (ner tamid) - eternal divine presence",
    "Height of approximately 18 handbreadths (about 5 feet)"
  ],
  "symbolism": {
    "sevenBranches": {
      "title": "The Seven Branches",
      "description": "The seven branches of the Menorah carry profound symbolic weight in Jewish tradition. They represent the seven days of creation, with the central shaft symbolizing Shabbat - the holy day of rest that gives meaning to all others. The six outer branches represent the six days of physical creation, while the center represents the spiritual culmination. In Kabbalistic thought, the seven branches correspond to the seven lower Sefirot: Chesed (loving-kindness), Gevurah (strength), Tiferet (beauty), Netzach (victory), Hod (splendor), Yesod (foundation), and Malkhut (sovereignty). Some interpretations link the branches to the seven classical planets known in antiquity, connecting earthly worship to cosmic order."
    },
    "treeOfLife": {
      "title": "Connection to the Tree of Life",
      "description": "The Menorah's design explicitly evokes arboreal imagery, particularly the almond tree (shaked). This connects to the Tree of Life (Etz Chaim) in the Garden of Eden and the broader Near Eastern motif of the sacred tree. The Torah commands that the Menorah be decorated with 'cups shaped like almond blossoms, with buds and flowers' (Exodus 25:33-34). The almond tree, first to bloom in Israel, symbolizes watchfulness (the Hebrew shaked relates to shakod, 'to watch'). Kabbalistic tradition identifies the Menorah with the Sefirot arrangement on the Tree of Life, making it a diagram of divine emanation and the structure of reality itself."
    },
    "divineLight": {
      "title": "Divine Light and Wisdom",
      "description": "Light (or) in Jewish thought represents divine wisdom, truth, and the presence of God. The Menorah's eternal flame symbolizes the undying light of Torah and the continuous divine presence among Israel. The Talmud (Shabbat 22b) teaches that the Menorah's western lamp (ner ma'aravi) burned miraculously longer than the others, testifying to God's presence. This concept of divine light illuminating darkness became central to Jewish theology - 'For the commandment is a lamp and Torah is light' (Proverbs 6:23). The Menorah represents Israel's mission to be 'a light unto the nations' (Isaiah 42:6), spreading ethical monotheism throughout the world."
    }
  },
  "biblicalDescription": {
    "exodus": {
      "reference": "Exodus 25:31-40",
      "description": "The Torah provides detailed instructions for the Menorah's construction in Exodus 25:31-40. God commanded Moses: 'Make a lampstand of pure gold. Hammer out its base and shaft, and make its flowerlike cups, buds and blossoms of one piece with it. Six branches are to extend from the sides of the lampstand—three on one side and three on the other.' The text specifies 22 almond-shaped cups, 9 buds, and 11 flowers - a total of 42 ornaments (some say 70). Remarkably, the entire Menorah was to be fashioned from a single talent of gold (approximately 75 pounds), hammered into shape rather than cast or assembled. According to Midrash, Moses found the construction so challenging that God showed him a heavenly Menorah of fire, and ultimately the Menorah formed itself miraculously."
    },
    "numbers": {
      "reference": "Numbers 8:1-4",
      "description": "In Numbers 8, God instructs Aaron on lighting the Menorah: 'When you set up the lamps, the seven lamps shall give light in front of the lampstand.' This passage emphasizes that all lamps should face the central shaft, symbolizing the unity of all aspects of creation pointing toward the divine center. The kohanim (priests) were responsible for preparing the wicks, adding fresh olive oil, and kindling the flames daily - first in the evening and tending them in the morning."
    }
  },
  "historicalSignificance": {
    "tabernacle": {
      "title": "The Tabernacle Menorah",
      "period": "c. 1400-1000 BCE",
      "description": "The original Menorah was crafted by Bezalel ben Uri during the Israelites' wilderness wanderings, following the divine pattern shown to Moses on Mount Sinai. It stood in the Holy Place (Kodesh) of the Tabernacle (Mishkan), along with the Table of Showbread and the Incense Altar, illuminating the sacred space where priests performed daily service."
    },
    "firstTemple": {
      "title": "Solomon's Temple",
      "period": "c. 957-586 BCE",
      "description": "When King Solomon built the First Temple in Jerusalem, he created ten golden Menorot for the sanctuary (1 Kings 7:49), in addition to preserving Moses' original. These stood five on the north side and five on the south. The Babylonians under Nebuchadnezzar destroyed the Temple in 586 BCE and carried away these sacred vessels."
    },
    "secondTemple": {
      "title": "The Second Temple",
      "period": "516 BCE - 70 CE",
      "description": "After the return from Babylonian exile, a new Menorah was fashioned for the Second Temple. This is the Menorah depicted on the Arch of Titus and became the iconic image of the Temple. During the Maccabean revolt (167-160 BCE), the Seleucid Greeks desecrated the Temple and extinguished the Menorah. When the Maccabees rededicated the Temple, they found only enough pure oil to light the Menorah for one day, but it miraculously burned for eight days - the origin of Hanukkah."
    },
    "destruction": {
      "title": "Destruction and Loss",
      "period": "70 CE",
      "description": "When Roman forces under Titus destroyed the Second Temple in 70 CE, they carried the Menorah to Rome as a trophy of war. The Arch of Titus, still standing in Rome, depicts Roman soldiers carrying the Menorah in triumphal procession. The fate of the Temple Menorah remains one of history's great mysteries. Theories suggest it was melted down, hidden in the Vatican, lost when the Vandals sacked Rome in 455 CE, or taken to Constantinople. Some traditions hold it will be revealed with the coming of the Messiah."
    }
  },
  "archaeologicalEvidence": {
    "archOfTitus": {
      "title": "The Arch of Titus",
      "location": "Rome, Italy",
      "date": "81 CE",
      "description": "The most famous depiction of the Temple Menorah appears on the Arch of Titus in Rome, erected to commemorate the Roman victory over Judea. The relief panel shows Roman soldiers carrying the Menorah, the Table of Showbread, and silver trumpets in triumphal procession. This image has become iconic, though scholars note it may show a Menorah stand with an octagonal base rather than the tripod described in some sources. The Arch of Titus relief served as the primary reference when Israel designed its national emblem."
    },
    "synagogueArt": {
      "title": "Ancient Synagogue Mosaics",
      "description": "The Menorah appears extensively in ancient synagogue art throughout Israel and the Diaspora. Notable examples include the magnificent mosaic floors at Beit Alpha (6th century CE), Hammat Tiberias (4th century CE), and Sepphoris. These depictions show the Menorah flanked by other Temple implements like the shofar, lulav, and incense shovel, demonstrating its central place in Jewish memory and hope for Temple restoration."
    },
    "catacombs": {
      "title": "Jewish Catacombs",
      "location": "Rome and Beit She'arim",
      "description": "Menorahs carved into ossuaries, tomb walls, and catacomb inscriptions throughout the ancient world testify to its importance as a Jewish identity marker. The Beth She'arim necropolis in Israel and the Jewish catacombs of Rome contain numerous Menorah images, often accompanied by Greek or Hebrew inscriptions."
    }
  },
  "menorahVsHanukkiah": {
    "title": "Menorah vs. Hanukkiah",
    "description": "The Temple Menorah (seven branches) must be distinguished from the Hanukkiah or Hanukkah Menorah (nine branches). The Hanukkiah commemorates the miracle of Hanukkah with eight branches for the eight nights of the festival, plus one shamash (servant candle) used to kindle the others. Jewish law (halakha) actually prohibits making an exact replica of the seven-branched Temple Menorah, considering it sacred to the Temple alone. This is why the Hanukkiah has nine branches - to fulfill the mitzvah of publicizing the Hanukkah miracle while respecting the Temple's unique sanctity.",
    "differences": [
      "Temple Menorah: 7 branches, olive oil, stood in the Temple sanctuary",
      "Hanukkiah: 9 branches (8 + shamash), oil or candles, used in homes",
      "Temple Menorah: Lit by priests (kohanim) daily",
      "Hanukkiah: Lit by all Jews during the 8 nights of Hanukkah",
      "Temple Menorah: Represents eternal divine presence",
      "Hanukkiah: Commemorates the miracle of oil and Maccabean victory"
    ]
  },
  "kabbalisticInterpretations": {
    "sefirot": {
      "title": "The Sefirot Connection",
      "description": "In Kabbalistic thought, the seven branches correspond to the seven lower Sefirot (divine emanations) on the Tree of Life. The central shaft represents Tiferet (Beauty/Harmony), flanked by Chesed (Loving-kindness) and Gevurah (Strength) on the upper tier, Netzach (Eternity) and Hod (Glory) on the middle tier, with Yesod (Foundation) and Malkhut (Sovereignty) completing the pattern. The light flowing through all branches symbolizes divine energy (shefa) flowing from the upper worlds into material reality."
    },
    "souls": {
      "title": "The Seven Shepherds",
      "description": "The Zohar connects the seven lamps to the seven 'shepherds' of Israel: Abraham, Isaac, Jacob, Moses, Aaron, Joseph, and David. Each represents a different spiritual archetype and mode of divine service. During Sukkot, these seven ushpizin (spiritual guests) are invited into the sukkah, one each night, mirroring the seven lights."
    },
    "cosmicLight": {
      "title": "Or HaGanuz - The Hidden Light",
      "description": "Kabbalistic tradition teaches that the primordial light of creation (or haganuz) - too powerful for the world to contain - was hidden away for the righteous in the World to Come. The Menorah's light is considered a reflection of this hidden light, bringing divine illumination into the physical world in measured, sustainable form."
    }
  },
  "modernSignificance": {
    "israelEmblem": {
      "title": "Emblem of the State of Israel",
      "description": "In 1949, the seven-branched Menorah was chosen as the official emblem of the newly established State of Israel. The design, created by the Shamir brothers, depicts the Menorah flanked by olive branches (symbolizing peace) with the word 'Israel' in Hebrew below. The choice was profoundly meaningful - after nearly 2,000 years since the Temple's destruction and the Menorah's disappearance, the ancient symbol returned to represent Jewish sovereignty in the ancestral homeland. The emblem appears on Israeli official documents, government buildings, and the cover of Israeli passports."
    },
    "knessetMenorah": {
      "title": "The Knesset Menorah",
      "description": "A magnificent bronze Menorah sculpture stands outside Israel's parliament building (Knesset) in Jerusalem. Created by British sculptor Benno Elkan and donated by the British Parliament in 1956, the five-meter-tall work depicts 29 relief scenes from Jewish history on its branches, from Abraham to the Warsaw Ghetto uprising and the establishment of the State of Israel."
    },
    "continuity": {
      "title": "Symbol of Jewish Continuity",
      "description": "The Menorah remains one of the most recognizable symbols of Jewish identity worldwide. It adorns synagogues, Jewish institutions, jewelry, and ceremonial objects. Its endurance from the wilderness Tabernacle through centuries of exile to modern Israeli statehood embodies the Jewish people's remarkable continuity and resilience."
    }
  },
  "ritualUsage": "While the seven-branched Temple Menorah can no longer be used in its original sacred context, its symbolism permeates Jewish ritual life. The Hanukkiah (nine-branched) fulfills the mitzvah of Hanukkah lights. Synagogues often feature decorative Menorahs near the ark. The concept of the ner tamid (eternal light) burning before the ark in every synagogue echoes the Temple Menorah. The lighting of Shabbat candles by Jewish women connects to the Menorah's illumination. Many authorities hold that when the Temple is rebuilt, the Menorah service will resume.",
  "usage": "The Temple Menorah was lit daily by the kohanim using pure beaten olive oil. The westernmost lamp was lit first and used to kindle the others. The flames burned through the night, tended in the morning. In modern times, the seven-branched Menorah serves primarily as a symbol rather than a functional ritual object, though representations appear throughout Jewish religious and cultural life.",
  "variations": [
    "Temple Menorah - The original seven-branched golden lampstand",
    "Hanukkiah - Nine-branched menorah for Hanukkah celebration",
    "Synagogue Menorah - Decorative representations in houses of worship",
    "Ner Tamid - The eternal light before the ark, conceptually linked to the Menorah",
    "Artistic interpretations - Modern sculptures and artistic representations"
  ],
  "christianSignificance": {
    "overview": "The Menorah holds profound significance for Christian understanding of Scripture, serving as a typological prefigurement of Christ, the Holy Spirit, and the Church. Early Christians inherited the symbol from their Jewish roots, and it appears prominently in the New Testament book of Revelation as a representation of the churches.",
    "biblicalReferences": {
      "oldTestament": [
        {
          "reference": "Exodus 25:31-40",
          "description": "The original divine pattern for the Menorah, understood by Christians as a shadow of heavenly realities (Hebrews 8:5)"
        },
        {
          "reference": "Zechariah 4:1-14",
          "description": "The prophet's vision of a golden lampstand with seven lamps and two olive trees, interpreted by Christians as prophesying the two witnesses and the Spirit's work"
        },
        {
          "reference": "Proverbs 6:23",
          "description": "'For the commandment is a lamp and the teaching a light' - prefiguring Christ as the Word made flesh"
        }
      ],
      "newTestament": [
        {
          "reference": "Revelation 1:12-20",
          "description": "John's vision of Christ walking among seven golden lampstands, explicitly identified as the seven churches of Asia Minor"
        },
        {
          "reference": "Revelation 2:1",
          "description": "'Him who holds the seven stars in his right hand and walks among the seven golden lampstands' - Christ as High Priest tending the lights"
        },
        {
          "reference": "Revelation 4:5",
          "description": "'Seven lamps of fire burning before the throne, which are the seven Spirits of God' - the Menorah as symbol of the Holy Spirit's sevenfold gifts"
        },
        {
          "reference": "John 8:12",
          "description": "'I am the light of the world' - Christ as the fulfillment of the Menorah's symbolism"
        },
        {
          "reference": "Matthew 5:14-16",
          "description": "'You are the light of the world... let your light shine before others' - the Church as lampstand bearing Christ's light"
        },
        {
          "reference": "Hebrews 9:2",
          "description": "The author of Hebrews describes the Holy Place with its lampstand, explaining how the Old Covenant worship pointed to Christ"
        }
      ]
    },
    "typologicalMeaning": {
      "christAsLight": {
        "title": "Christ as the True Light",
        "description": "Christian theology interprets Christ as the antitype (fulfillment) of the Menorah. As the Temple lampstand illuminated the sanctuary, Christ illuminates the world with divine truth. The seven lamps burning continuously prefigure Christ's eternal, uncreated light. The pure olive oil represents the Holy Spirit by whom Christ was anointed (Greek: Christos, 'Anointed One')."
      },
      "sevenSpirits": {
        "title": "The Sevenfold Spirit of God",
        "description": "Based on Isaiah 11:2 and Revelation 4:5, the seven lamps are understood as representing the seven Spirits (or sevenfold Spirit) of God: the Spirit of the LORD, wisdom, understanding, counsel, might, knowledge, and the fear of the LORD. This connects to the Christian doctrine of the Holy Spirit's manifold gifts."
      },
      "theChurch": {
        "title": "The Church as Lampstand",
        "description": "In Revelation 1-3, the seven lampstands explicitly represent the seven churches. Just as priests tended the Temple Menorah, Christ walks among His churches, tending their flames. The warning to Ephesus that their lampstand could be removed (Revelation 2:5) suggests the Church's witness can be extinguished through unfaithfulness."
      },
      "treeOfLife": {
        "title": "Connection to the Tree of Life",
        "description": "The Menorah's almond-tree design connects it to the Tree of Life in Eden (Genesis 2-3) and the tree of life in the New Jerusalem (Revelation 22:2). Christian typology sees Christ as the true Tree of Life, from whom believers receive eternal life. The Menorah thus bridges the protological (creation) and eschatological (final restoration) themes of Scripture."
      }
    },
    "earlyChurchUsage": {
      "jewishChristianAdoption": {
        "period": "1st-4th century CE",
        "description": "Jewish Christians continued to honor the Menorah's symbolism while understanding it through the lens of Christ's fulfillment. Early Christian art in the catacombs of Rome sometimes depicts the Menorah alongside distinctly Christian symbols, reflecting the Jewish roots of the faith."
      },
      "patristicInterpretation": {
        "fathers": [
          {
            "name": "Clement of Alexandria",
            "interpretation": "Interpreted the seven lamps as representing the seven planets and the created order illuminated by the Logos"
          },
          {
            "name": "Origen",
            "interpretation": "Saw the Menorah as representing the law and the prophets, with Christ as the central shaft from which all branches receive their light"
          },
          {
            "name": "Jerome",
            "interpretation": "Connected the seven lamps to the seven gifts of the Holy Spirit (Isaiah 11:2)"
          },
          {
            "name": "Augustine",
            "interpretation": "Interpreted the Menorah typologically as the Church receiving light from Christ to illuminate the world"
          }
        ]
      },
      "symbolicTransference": {
        "description": "As Christianity developed its own visual vocabulary, the symbolism of the Menorah was transferred to other light-bearing symbols: the Christ candle, the Paschal candle, the seven-branched church candelabra (still used in Eastern Orthodox and some Western liturgies), and ultimately to Christ Himself as 'Lux Mundi' (Light of the World)."
      }
    },
    "liturgicalConnections": {
      "paschalCandle": {
        "description": "The Paschal (Easter) candle in Christian liturgy carries forward the Menorah's symbolism of divine light conquering darkness. Lit at the Easter Vigil, it represents the Risen Christ as the light who has conquered death."
      },
      "altarCandles": {
        "description": "The tradition of seven candles on Christian altars (particularly in Anglican and Lutheran churches) consciously echoes the Temple Menorah, representing Christ's presence among His people and the sevenfold Spirit."
      },
      "easternOrthodox": {
        "description": "The seven-branched candelabrum (heptakerion) is used in Eastern Orthodox churches, often placed behind the altar, maintaining direct continuity with the Temple Menorah symbolism."
      },
      "advent": {
        "description": "The Advent wreath's progressive lighting of candles echoes the Menorah's theme of increasing light, preparing for the coming of Christ, the Light of the World, at Christmas."
      }
    },
    "iconographicHistory": {
      "earlyChristianArt": {
        "period": "2nd-6th century CE",
        "description": "The Menorah appears in early Christian catacomb art, sometimes alongside the Chi-Rho or cross. This reflects the Jewish-Christian heritage of the early Church and the continuity between Old and New Covenant worship."
      },
      "medievalTypology": {
        "description": "Medieval Christian manuscripts and cathedral sculpture programs included the Menorah in typological schemes, pairing Old Testament images with their New Testament fulfillments. The Menorah was typically paired with the seven churches of Revelation or the sevenfold gifts of the Spirit."
      },
      "reformation": {
        "description": "Protestant reformers largely moved away from Menorah imagery, emphasizing Christ as the sole light. However, some Protestant churches retained seven-branched candelabra, and the Menorah continued to appear in Bible illustrations."
      }
    },
    "theologicalReflections": {
      "continuity": "The Menorah represents the continuity between Israel and the Church - 'one olive tree' (Romans 11:17-24) onto which Gentile believers are grafted. The Temple's light is not extinguished but fulfilled and expanded through Christ to illuminate all nations.",
      "eschatological": "In the New Jerusalem, there is no need for a lamp because 'the glory of God gives it light, and the Lamb is its lamp' (Revelation 21:23). The Menorah thus points forward to the ultimate reality it symbolized - unmediated divine presence and light.",
      "ecumenical": "The Menorah reminds Christians of their Jewish heritage and the importance of understanding the Old Testament foundations of their faith. It serves as a symbol of Jewish-Christian dialogue and shared reverence for the Hebrew Scriptures."
    }
  },
  "primarySources": [
    {
      "title": "Torah - Exodus 25:31-40",
      "description": "Primary biblical description of the Menorah's design and construction"
    },
    {
      "title": "Torah - Numbers 8:1-4",
      "description": "Instructions for lighting the Menorah"
    },
    {
      "title": "Talmud Bavli - Tractate Menachot 28b-29a",
      "description": "Detailed rabbinic discussions of Menorah laws and lore"
    },
    {
      "title": "Zohar - Parashat Beha'alotecha",
      "description": "Kabbalistic interpretations of the Menorah's mystical significance"
    },
    {
      "title": "Josephus - Antiquities of the Jews",
      "description": "First-century historical account of the Temple Menorah"
    }
  ],
  "relationships": {
    "mythology": "jewish",
    "relatedSymbols": [
      "star_of_david",
      "tablets_of_law",
      "tree_of_life"
    ],
    "relatedPlaces": [
      "temple_mount",
      "jerusalem"
    ],
    "relatedTexts": [
      "torah",
      "talmud",
      "zohar"
    ],
    "relatedRituals": [
      "hanukkah",
      "temple_service"
    ]
  },
  "iconType": "svg",
  "icon": "<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 64 64\">\n  <rect x=\"28\" y=\"48\" width=\"8\" height=\"12\" fill=\"#FFD700\" rx=\"1\"/>\n  <rect x=\"24\" y=\"56\" width=\"16\" height=\"4\" fill=\"#FFD700\" rx=\"1\"/>\n  <rect x=\"30\" y=\"20\" width=\"4\" height=\"28\" fill=\"#FFD700\"/>\n  <path d=\"M32 20 Q22 25 18 20 L18 16\" stroke=\"#FFD700\" stroke-width=\"3\" fill=\"none\" stroke-linecap=\"round\"/>\n  <path d=\"M32 20 Q42 25 46 20 L46 16\" stroke=\"#FFD700\" stroke-width=\"3\" fill=\"none\" stroke-linecap=\"round\"/>\n  <path d=\"M32 26 Q24 30 22 26 L22 16\" stroke=\"#FFD700\" stroke-width=\"3\" fill=\"none\" stroke-linecap=\"round\"/>\n  <path d=\"M32 26 Q40 30 42 26 L42 16\" stroke=\"#FFD700\" stroke-width=\"3\" fill=\"none\" stroke-linecap=\"round\"/>\n  <path d=\"M32 32 Q26 35 26 32 L26 16\" stroke=\"#FFD700\" stroke-width=\"3\" fill=\"none\" stroke-linecap=\"round\"/>\n  <path d=\"M32 32 Q38 35 38 32 L38 16\" stroke=\"#FFD700\" stroke-width=\"3\" fill=\"none\" stroke-linecap=\"round\"/>\n  <circle cx=\"18\" cy=\"12\" r=\"4\" fill=\"#FFA500\" opacity=\"0.8\"/>\n  <circle cx=\"22\" cy=\"12\" r=\"4\" fill=\"#FFA500\" opacity=\"0.8\"/>\n  <circle cx=\"26\" cy=\"12\" r=\"4\" fill=\"#FFA500\" opacity=\"0.8\"/>\n  <circle cx=\"32\" cy=\"12\" r=\"5\" fill=\"#FFA500\"/>\n  <circle cx=\"38\" cy=\"12\" r=\"4\" fill=\"#FFA500\" opacity=\"0.8\"/>\n  <circle cx=\"42\" cy=\"12\" r=\"4\" fill=\"#FFA500\" opacity=\"0.8\"/>\n  <circle cx=\"46\" cy=\"12\" r=\"4\" fill=\"#FFA500\" opacity=\"0.8\"/>\n</svg>",
  "metadata": {
    "sourceFile": "symbols/jewish_menorah.json",
    "verified": true,
    "createdBy": "claude-opus-4-5",
    "source": "comprehensive_research",
    "createdAt": "2026-01-01T00:00:00.000Z"
  },
  "createdAt": "2026-01-01T00:00:00.000Z",
  "updatedAt": "2026-01-01T00:00:00.000Z",
  "origins": "Biblical origin (Exodus 25); originally placed in the Tabernacle and Second Temple; ancient symbol from 1st century BCE onward",
  "associations": {
    "symbols": [
      "Star of David",
      "Torah",
      "Ark of Covenant"
    ],
    "concepts": [
      "Divine light",
      "Creation",
      "Hanukkah (rededication)",
      "Shabbat (weekly rest)",
      "Jewish continuity",
      "Spiritual illumination"
    ]
  },
  "prohibitions": [
    "Should be treated with reverence as sacred Jewish symbol",
    "Not to be used mockingly or disrespectfully",
    "Proper lighting and maintenance protocols for ritual use",
    "In Holocaust contexts, requires sensitive handling",
    "Respect the deep historical and religious significance"
  ],
  "_enriched": true,
  "_enrichedAt": "2026-01-01T03:38:42.008Z",
  "_enrichedBy": "symbol-enrichment-script",
  "relatedEntities": {
    "concepts": [
      {
        "id": "ner-tamid-eternal-light",
        "name": "Ner Tamid (Eternal Light)",
        "relationship": "related",
        "_unverified": true,
        "_unverifiedReason": "Entity not found in database"
      },
      {
        "id": "or-haganuz-hidden-light",
        "name": "Or HaGanuz (Hidden Light)",
        "relationship": "related",
        "_unverified": true,
        "_unverifiedReason": "Entity not found in database"
      },
      {
        "id": "etz-chaim-tree-of-life",
        "name": "Etz Chaim (Tree Of Life)",
        "relationship": "related",
        "_unverified": true,
        "_unverifiedReason": "Entity not found in database"
      },
      {
        "id": "sefirot-divine-emanations",
        "name": "Sefirot (Divine Emanations)",
        "relationship": "related",
        "_unverified": true,
        "_unverifiedReason": "Entity not found in database"
      },
      {
        "id": "shabbat-sabbath",
        "name": "Shabbat (Sabbath)",
        "relationship": "related",
        "_unverified": true,
        "_unverifiedReason": "Entity not found in database"
      },
      {
        "id": "beit-hamikdash-holy-temple",
        "name": "Beit HaMikdash (Holy Temple)",
        "relationship": "related",
        "_unverified": true,
        "_unverifiedReason": "Entity not found in database"
      },
      {
        "id": "hanukkah",
        "name": "Hanukkah",
        "relationship": "related",
        "_unverified": true,
        "_unverifiedReason": "Entity not found in database"
      },
      {
        "id": "torah-as-light",
        "name": "Torah As Light",
        "relationship": "related",
        "_unverified": true,
        "_unverifiedReason": "Entity not found in database"
      }
    ]
  }
}