{
  "id": "jewish_kiddush-hashem",
  "type": "concept",
  "name": "Kiddush HaShem (Sanctification of God's Name)",
  "displayName": "Kiddush HaShem - Dying for the Sanctification of God's Name",
  "mythology": "jewish",
  "mythologies": ["jewish", "christian"],
  "_enhanced": true,
  "description": "Kiddush HaShem ('Sanctification of the Name') is the Jewish concept of glorifying God through righteous conduct, and in its ultimate form, dying rather than denying faith. This tradition of martyrdom stretches from the Maccabean era through the apostolic age to modern times. James son of Zebedee, the first apostle martyred, stands in this noble tradition of those who chose death over apostasy.",
  "etymology": {
    "hebrew": "קִדּוּשׁ הַשֵּׁם (Kiddush HaShem)",
    "meaning": "'Sanctification of the Name' - glorifying God's name",
    "opposite": "חִלּוּל הַשֵּׁם (Chillul HaShem) - desecration of God's name"
  },
  "biblicalRoots": [
    {
      "reference": "Leviticus 22:32",
      "text": "Do not profane my holy name, for I must be acknowledged as holy by the Israelites. I am the LORD, who made you holy.",
      "significance": "Foundational command to sanctify God's name"
    },
    {
      "reference": "Daniel 3:16-18",
      "text": "Shadrach, Meshach and Abednego replied to him, 'King Nebuchadnezzar, we do not need to defend ourselves before you in this matter. If we are thrown into the blazing furnace, the God we serve is able to deliver us from it, and he will deliver us from Your Majesty's hand. But even if he does not, we want you to know, Your Majesty, that we will not serve your gods or worship the image of gold you have set up.'",
      "significance": "Archetype of refusing idolatry even at cost of life"
    },
    {
      "reference": "Daniel 6:10",
      "text": "Now when Daniel learned that the decree had been published, he went home to his upstairs room where the windows opened toward Jerusalem. Three times a day he got down on his knees and prayed, giving thanks to his God, just as he had done before.",
      "significance": "Daniel continued prayer despite death decree"
    }
  ],
  "maccabeanMartyrs": {
    "context": "During the persecution of Antiochus IV Epiphanes (167-164 BCE), Jews faced death for practicing their faith",
    "examples": [
      {
        "name": "Eleazar the Scribe",
        "reference": "2 Maccabees 6:18-31",
        "story": "Elderly scribe refused to eat pork or pretend to do so, preferring death to setting a bad example for youth",
        "significance": "Model of integrity - refused even the appearance of compromise"
      },
      {
        "name": "The Mother and Seven Sons",
        "reference": "2 Maccabees 7",
        "story": "A mother watched her seven sons tortured and killed for refusing to eat pork, encouraging each to remain faithful",
        "significance": "Ultimate maternal sacrifice; each son expressed faith in resurrection"
      },
      {
        "name": "Hannah and Her Seven Sons",
        "reference": "Gittin 57b (Talmud); Lamentations Rabbah 1:50",
        "story": "Rabbinic parallel to the Maccabean martyrs, sometimes identified with them",
        "significance": "Model of parental faith passing to children even unto death"
      }
    ],
    "theologicalDevelopments": [
      "Belief in resurrection of the righteous (2 Maccabees 7:9, 14, 23)",
      "Martyrdom as atonement for the nation's sins (2 Maccabees 7:37-38)",
      "Heavenly reward for the faithful (4 Maccabees)",
      "Victory through suffering rather than military might"
    ]
  },
  "isaianicTradition": {
    "reference": "Isaiah's Martyrdom - Ascension of Isaiah (2nd century BCE - 4th century CE)",
    "tradition": "Isaiah was sawn in two by King Manasseh for prophesying against Jerusalem",
    "hebrewsReference": "Hebrews 11:37 - 'They were stoned; they were sawed in two; they were put to death by the sword'",
    "significance": "Prophetic martyrdom tradition that preceded and influenced later martyrology"
  },
  "apostolicMartyrs": {
    "jamesSonOfZebedee": {
      "reference": "Acts 12:1-2",
      "text": "It was about this time that King Herod arrested some who belonged to the church, intending to persecute them. He had James, the brother of John, put to death with the sword.",
      "significance": "First apostle martyred; fulfilled Jesus' prophecy about 'drinking his cup' (Mark 10:38-39)",
      "date": "c. 44 CE",
      "context": "Herod Agrippa I's persecution of the Jerusalem church"
    },
    "stephen": {
      "reference": "Acts 7:54-60",
      "significance": "First Christian martyr; forgave his killers like Jesus",
      "connection": "Model for subsequent Christian martyrdom"
    },
    "apostolicTradition": "Church tradition holds that most apostles died as martyrs, continuing the Kiddush HaShem tradition"
  },
  "jesusTeaching": {
    "drinkTheCup": {
      "reference": "Mark 10:38-39",
      "text": "Jesus said to them... 'Can you drink the cup I drink or be baptized with the baptism I am baptized with?' 'We can,' they answered. Jesus said to them, 'You will drink the cup I drink and be baptized with the baptism I am baptized with.'",
      "significance": "Jesus predicted martyrdom for James and John"
    },
    "loseLifeToFindIt": {
      "reference": "Matthew 16:25; Mark 8:35; Luke 9:24",
      "text": "For whoever wants to save their life will lose it, but whoever loses their life for me will find it.",
      "significance": "Core teaching on martyrdom as gain, not loss"
    },
    "confessBeforeMen": {
      "reference": "Matthew 10:32-33",
      "text": "Whoever acknowledges me before others, I will also acknowledge before my Father in heaven. But whoever disowns me before others, I will disown before my Father in heaven.",
      "significance": "Public confession even unto death"
    },
    "hatedForMyName": {
      "reference": "Matthew 10:22; 24:9",
      "text": "You will be hated by everyone because of my name, but the one who stands firm to the end will be saved.",
      "significance": "Prediction of persecution for the Name"
    }
  },
  "rabbinicDevelopment": {
    "threeCardinalSins": {
      "principle": "One must die rather than commit: idolatry, sexual immorality, or murder",
      "source": "Sanhedrin 74a",
      "exceptions": "For other commandments, 'live by them' (Leviticus 18:5) means preservation of life takes precedence"
    },
    "publicDesecration": {
      "principle": "In times of persecution or public coercion, one must die rather than violate even minor commandments",
      "rationale": "Yielding publicly would desecrate God's name among the nations"
    },
    "tenMartyrs": {
      "tradition": "Tradition of ten great rabbis martyred by Romans, commemorated on Yom Kippur",
      "examples": ["Rabbi Akiva", "Rabbi Ishmael", "Rabban Shimon ben Gamliel"],
      "significance": "Model of scholarly martyrdom - dying with Shema on lips"
    }
  },
  "hallmarks": [
    "Choosing death over apostasy or desecration of God's name",
    "Public witness - sanctifying God's name before observers",
    "Forgiveness of persecutors (following Jesus and Stephen)",
    "Expression of faith in resurrection",
    "Courage rooted in love for God above love of life"
  ],
  "transfigurationConnection": {
    "jamesWitness": "James son of Zebedee witnessed the Transfiguration glory - seeing Christ's divine majesty prepared him to die for that truth",
    "mosesAndElijah": "Both Moses and Elijah faced death for their faithfulness; their appearance at the Transfiguration linked to the martyrdom tradition",
    "gloryToSuffering": "The Transfiguration immediately preceded Jesus' teaching about his coming death; glory and suffering are connected",
    "drinkTheCup": "Soon after the Transfiguration, James and John asked for positions of honor, and Jesus predicted they would share his cup of suffering"
  },
  "corpusQueries": [
    {"term": "Kiddush HaShem", "tradition": "jewish", "context": "Sanctification of the Name"},
    {"term": "martyrdom", "tradition": "jewish", "context": "Dying for faith"},
    {"term": "Maccabees martyrs", "tradition": "jewish", "context": "Mother and seven sons"},
    {"term": "James son of Zebedee", "tradition": "christian", "context": "First apostle martyred"},
    {"term": "drink the cup", "tradition": "christian", "context": "Jesus' prediction of martyrdom"},
    {"term": "ten martyrs", "tradition": "jewish", "context": "Rabbinic tradition"}
  ],
  "relatedEntities": {
    "heroes": ["james-son-of-zebedee", "stephen", "moses", "elijah", "daniel"],
    "concepts": ["resurrection", "shekinah"],
    "texts": ["2-maccabees", "4-maccabees", "ascension-of-isaiah"],
    "rituals": ["yom-kippur"]
  },
  "modernSignificance": {
    "shoah": "Holocaust martyrs who died with Shema on their lips",
    "continuing": "Kiddush HaShem remains a living concept in Jewish ethics and theology",
    "christianMartyrs": "Church continues to honor those who die for Christ as witnesses (Greek: martyres)"
  },
  "iconType": "svg",
  "icon": "<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 64 64\">\n  <circle cx=\"32\" cy=\"32\" r=\"28\" fill=\"#8B0000\" opacity=\"0.2\"/>\n  <path d=\"M32 8 L34 28 L32 26 L30 28 Z\" fill=\"#FFD700\"/>\n  <circle cx=\"32\" cy=\"32\" r=\"12\" fill=\"none\" stroke=\"#FFD700\" stroke-width=\"2\"/>\n  <path d=\"M24 40 L32 32 L40 40\" fill=\"none\" stroke=\"#8B0000\" stroke-width=\"3\"/>\n  <line x1=\"32\" y1=\"44\" x2=\"32\" y2=\"56\" stroke=\"#8B0000\" stroke-width=\"3\"/>\n</svg>",
  "_modified": "2025-12-29T00:00:00.000Z",
  "createdAt": "2025-12-29T00:00:00.000Z",
  "metadata": {
    "createdAt": "2025-12-29T00:00:00.000Z",
    "createdBy": "Agent_James_Transfiguration",
    "verified": true,
    "enrichedBy": "Agent_James_Transfiguration",
    "finalEnrichment": true,
    "enhancementDate": "2025-12-29",
    "enhancementFocus": "Martyrdom tradition, James' death, Maccabean connection"
  },
  "updated_at": "2025-12-29T00:00:00.000Z"
}
