{
  "id": "simon-zealot",
  "type": "hero",
  "name": "Saint Simon the Zealot",
  "displayName": "Simon the Zealot (Simon the Cananean)",
  "icon": "S",
  "slug": "simon-zealot",
  "mythologies": [
    "christian",
    "jewish"
  ],
  "primaryMythology": "christian",
  "shortDescription": "Former Jewish revolutionary who traded political zeal for spiritual mission, apostle who carried the Gospel to Persia and Britain according to various traditions",
  "longDescription": "Simon the Zealot stands as one of the most intriguing figures among the Twelve Apostles, his very title preserving memory of his revolutionary past. The designation 'Zealot' (Greek: Zelotes) or 'Cananean' (from Aramaic qan'ana, meaning 'zealous one') identifies him as either a member of or sympathizer with the Zealot movement - the fiercely nationalist Jewish faction that advocated armed resistance against Roman occupation. This was no idle political affiliation; the Zealots were willing to die - and kill - for Israel's freedom, viewing Roman rule as both political oppression and religious apostasy. Yet this revolutionary found himself called by Jesus of Nazareth to join a mission that transcended national boundaries. Alongside Matthew the tax collector - his natural enemy as a Jewish collaborator with Rome - Simon learned that the Kingdom of God operates by different principles than the kingdoms of this world. Where the Zealot dreamed of liberating Israel through violence, Jesus spoke of loving enemies and blessing persecutors. Simon's transformation represents one of the most dramatic conversions in the apostolic company: from violent nationalist to peaceful evangelist, from seeking to establish Israel's earthly kingdom to proclaiming God's universal reign. According to Western tradition, he partnered with Thaddaeus to carry the Gospel beyond Rome's eastern borders into Armenia and Persia, where both apostles sealed their testimony with martyrdom. Some traditions place his mission as far as Britain, connecting him with Glastonbury legends. The instrument of his death - being sawn in half - echoes the fate of the prophet Isaiah and stands as the ultimate fulfillment of his transformed zeal: giving his life not to take the lives of others, but to save them.",
  "category": "apostle-martyr",
  "subCategory": "twelve-apostles",
  "colors": {
    "primary": "#8B0000",
    "secondary": "#FFD700",
    "primaryRgb": "139, 0, 0"
  },
  "tags": [
    "simon-zealot",
    "simon-cananean",
    "apostle",
    "christian",
    "jewish",
    "zealot-movement",
    "revolutionary",
    "martyr",
    "persia",
    "armenia",
    "britain",
    "glastonbury",
    "thaddaeus",
    "twelve-apostles",
    "transformation",
    "political-to-spiritual",
    "radical-commitment"
  ],
  "aliases": [
    "Simon Zelotes",
    "Simon the Cananean",
    "Simon the Canaanite",
    "Simon the Zealot",
    "Simeon the Zealot",
    "Simon Qanana"
  ],
  "linguistic": {
    "originalName": "Σίμων ὁ Ζηλωτής / Σίμων ὁ Καναναῖος",
    "originalScript": "greek",
    "transliteration": "Simon ho Zelotes / Simon ho Kananaios",
    "pronunciation": "/SI-mohn ho zay-LOH-tays/",
    "alternativeNames": [
      {
        "name": "Σίμων ὁ Ζηλωτής",
        "language": "Greek",
        "script": "Greek",
        "meaning": "Simon the Zealot (from Greek zelos, 'zeal')"
      },
      {
        "name": "Σίμων ὁ Καναναῖος",
        "language": "Greek (from Aramaic)",
        "script": "Greek",
        "meaning": "Simon the Cananean (from Aramaic qan'ana, 'zealous')"
      },
      {
        "name": "שמעון הקנאי",
        "language": "Hebrew",
        "script": "Hebrew",
        "meaning": "Shimon HaKanai - Simon the Zealot"
      }
    ],
    "etymology": {
      "rootLanguage": "Hebrew/Aramaic",
      "meaning": "Simon: 'He has heard' (from Hebrew Shimon); Zealot/Cananean: 'Zealous one'",
      "derivation": "The name Simon derives from Hebrew שמעון (Shimon) meaning 'he has heard' or 'hearing.' The epithet 'Zealot' (Greek Zelotes) translates the Aramaic Qan'ana (not referring to Canaan geographically), both meaning 'zealous one.' This likely indicates membership in or sympathy with the Jewish Zealot party."
    },
    "languageCode": "grc"
  },
  "geographical": {
    "primaryLocation": {
      "name": "Galilee, Roman Judea",
      "modernName": "Galilee, Israel",
      "coordinates": {
        "latitude": 32.8,
        "longitude": 35.5,
        "accuracy": "general_area"
      },
      "type": "homeland",
      "description": "Galilee was the heartland of Zealot activity, particularly after Judas the Galilean's revolt in 6 CE",
      "significance": "The Zealot movement had its strongest roots in Galilee, where resistance to Rome flourished"
    },
    "associatedLocations": [
      {
        "name": "Jerusalem",
        "coordinates": {
          "latitude": 31.7683,
          "longitude": 35.2137,
          "accuracy": "precise"
        },
        "type": "ministry_site",
        "significance": "Site of Pentecost and early apostolic ministry; the Temple was the ideological center of Zealot hopes"
      },
      {
        "name": "Armenia",
        "coordinates": {
          "latitude": 40.0691,
          "longitude": 45.0382,
          "accuracy": "general_area"
        },
        "type": "mission_field",
        "significance": "Mission field with Thaddaeus; helped establish Armenian Christianity"
      },
      {
        "name": "Persia",
        "coordinates": {
          "latitude": 32.4279,
          "longitude": 53.688,
          "accuracy": "general_area"
        },
        "type": "martyrdom_site",
        "significance": "Site of martyrdom with Thaddaeus according to Western tradition"
      },
      {
        "name": "Glastonbury, Britain",
        "coordinates": {
          "latitude": 51.1485,
          "longitude": -2.7147,
          "accuracy": "approximate"
        },
        "type": "alternative_tradition",
        "significance": "Some British traditions claim Simon preached in Britain and was martyred at Caistor in Lincolnshire"
      },
      {
        "name": "Egypt",
        "coordinates": {
          "latitude": 26.8206,
          "longitude": 30.8025,
          "accuracy": "general_area"
        },
        "type": "alternative_tradition",
        "significance": "Some traditions place his mission in Egypt before traveling east"
      }
    ],
    "region": "Galilee, Levant, Persia, possibly Britain",
    "culturalArea": "Second Temple Judaism, Parthian Empire",
    "modernCountries": [
      "Israel",
      "Armenia",
      "Iran",
      "United Kingdom",
      "Egypt"
    ]
  },
  "temporal": {
    "historicalDate": {
      "start": {
        "year": 1,
        "circa": true,
        "uncertainty": 10,
        "display": "c. 1st century CE"
      },
      "end": {
        "year": 65,
        "circa": true,
        "uncertainty": 10,
        "display": "c. 65 CE"
      },
      "display": "c. 1st century CE (fl. 30-65 CE)"
    },
    "culturalPeriod": "Apostolic Age / Second Temple Judaism",
    "literaryReferences": [
      {
        "work": "Gospel of Matthew",
        "author": "Matthew",
        "date": {
          "year": 75,
          "circa": true,
          "display": "c. 70-80 CE"
        },
        "significance": "Lists Simon as 'the Canaanite' (Matt 10:4)"
      },
      {
        "work": "Gospel of Mark",
        "author": "Mark",
        "date": {
          "year": 68,
          "circa": true,
          "display": "c. 65-70 CE"
        },
        "significance": "Lists Simon as 'the Cananean' (Mark 3:18)"
      },
      {
        "work": "Gospel of Luke",
        "author": "Luke",
        "date": {
          "year": 80,
          "circa": true,
          "display": "c. 80 CE"
        },
        "significance": "First to use Greek 'Zelotes' (Luke 6:15)"
      },
      {
        "work": "Acts of the Apostles",
        "author": "Luke",
        "date": {
          "year": 80,
          "circa": true,
          "display": "c. 80 CE"
        },
        "significance": "Lists 'Simon Zelotes' in Upper Room (Acts 1:13)"
      },
      {
        "work": "Golden Legend",
        "author": "Jacobus de Voragine",
        "date": {
          "year": 1260,
          "circa": true,
          "display": "c. 1260 CE"
        },
        "significance": "Preserves tradition of Simon and Thaddaeus's joint mission and martyrdom"
      }
    ]
  },
  "biography": {
    "birthplace": "Galilee (presumed)",
    "earlyLife": "Simon's epithet 'the Zealot' or 'Cananean' suggests he was involved with or sympathetic to the Jewish Zealot movement. The Zealots emerged as a distinct faction around 6 CE when Judas the Galilean led a revolt against the Roman census. They believed that paying taxes to Rome was apostasy, that only God should rule Israel, and that armed resistance was a religious duty. Simon would have been raised in this atmosphere of revolutionary fervor, likely in Galilee where Zealot sentiment ran strongest.",
    "education": "Trained in Torah and Jewish traditions; Zealot ideology emphasized the Shema ('YHWH is our God, YHWH alone') and rejected any compromise with foreign rule as idolatry",
    "calling": "Called by Jesus as one of the Twelve Apostles, joining a diverse group that included Matthew the tax collector - his ideological opposite as a Jewish collaborator with Rome",
    "majorEvents": [
      {
        "event": "Life as a Zealot",
        "description": "Before meeting Jesus, Simon was associated with the Zealot movement, which advocated armed resistance against Rome based on religious conviction"
      },
      {
        "event": "Called as Apostle",
        "description": "Jesus selected Simon as one of the Twelve, placing him alongside Matthew the tax collector - forcing natural enemies to become brothers in mission"
      },
      {
        "event": "Witnessing Jesus' Ministry",
        "description": "Simon observed Jesus' teaching on loving enemies (Matt 5:44), rendering unto Caesar (Matt 22:21), and the nature of God's Kingdom - teachings that challenged Zealot ideology"
      },
      {
        "event": "The Temple Cleansing",
        "description": "Witnessed Jesus' zealous cleansing of the Temple, where 'zeal for your house has consumed me' (John 2:17) - Jesus demonstrating holy zeal without violence against persons"
      },
      {
        "event": "Gethsemane and the Sword",
        "description": "Present when Jesus rebuked the disciple who drew a sword, saying 'all who take the sword will perish by the sword' (Matt 26:52) - a direct challenge to Zealot methods"
      },
      {
        "event": "Pentecost",
        "description": "Received the Holy Spirit with other apostles in the Upper Room, empowered for a mission that transcended national boundaries"
      },
      {
        "event": "Mission to Persia",
        "description": "According to Western tradition, partnered with Thaddaeus to carry the Gospel to Armenia and Persia, far beyond Rome's eastern borders"
      },
      {
        "event": "Alternative British Tradition",
        "description": "Some traditions claim Simon traveled to Britain, preaching in the western islands and being martyred at Caistor in Lincolnshire"
      },
      {
        "event": "Martyrdom",
        "description": "According to the most common tradition, Simon was martyred in Persia by being sawn in half - an echo of Isaiah's legendary death. Western churches commemorate him with Thaddaeus on October 28."
      }
    ],
    "achievements": [
      "One of the Twelve Apostles chosen by Christ",
      "Transformed from violent revolutionary to peaceful evangelist",
      "Model of reconciliation with ideological enemies (Matthew the tax collector)",
      "Co-founder of Armenian Christianity (with Thaddaeus)",
      "Carried Gospel beyond Roman Empire to Persia",
      "Martyr for the faith",
      "Patron saint of curriers, tanners, and sawyers"
    ],
    "legacy": "Simon the Zealot represents the transformative power of following Christ. His journey from nationalist revolutionary to universal missionary demonstrates that the Gospel transcends political categories. The former Zealot who would have gladly died killing Rome's collaborators instead died giving his life to save both Jews and Gentiles. His pairing with Matthew the tax collector in Jesus' inner circle shows that enemies can become brothers in the Kingdom of God. Churches dedicated to Saints Simon and Jude (Thaddaeus) appear throughout Christianity, and their joint feast day on October 28 celebrates their missionary partnership and shared martyrdom."
  },
  "attributes": {
    "role": "Apostle, Former Revolutionary, Martyr",
    "symbols": [
      "saw (instrument of martyrdom)",
      "fish (traditional apostolic symbol)",
      "boat (missionary journeys)",
      "oar (some traditions)",
      "book (Gospel)",
      "lance or spear (alternative martyrdom tradition)",
      "axe (alternative tradition)"
    ],
    "feast_day": "October 28 (Western, with Thaddaeus/Jude), May 10 (Eastern)",
    "patronage": [
      "curriers",
      "tanners",
      "sawyers",
      "woodcutters"
    ]
  },
  "theologicalSignificance": {
    "coreConcepts": [
      {
        "name": "Transformed Zeal",
        "description": "Simon's journey from political to spiritual zeal illustrates how genuine passion for God must be channeled according to God's methods, not human violence. His zelos (zeal) was not diminished but redirected."
      },
      {
        "name": "Kingdom of God vs Kingdom of Israel",
        "description": "Simon had to learn that Jesus' Kingdom operates by different principles than earthly kingdoms. Where Zealots sought to establish God's reign through force, Jesus proclaimed a Kingdom that comes through suffering love."
      },
      {
        "name": "Enemy Love in Practice",
        "description": "Simon's fellowship with Matthew the tax collector was a living demonstration of Jesus' command to love enemies. Two natural enemies became brothers in Christ's family."
      },
      {
        "name": "Radical Discipleship",
        "description": "The Zealots were willing to die for their cause; Simon learned to die differently - not killing others, but giving his life that others might live. His martyrdom fulfilled his zealous commitment in transformed form."
      },
      {
        "name": "Universal Mission",
        "description": "The former Jewish nationalist carried the Gospel to Gentile nations, demonstrating that the Good News transcends ethnic and political boundaries."
      }
    ],
    "doctrinalContributions": [
      "Demonstrates that passion and zeal are gifts to be transformed, not eliminated",
      "Models reconciliation between ideological enemies",
      "Shows that political categories are transcended in the Kingdom of God",
      "Exemplifies how radical commitment can serve love rather than violence",
      "Illustrates the universal scope of apostolic mission"
    ]
  },
  "jewishConnections": {
    "zealotMovement": {
      "founder": "Judas the Galilean (revolt of 6 CE)",
      "ideology": "Only God should rule Israel; paying Roman taxes was apostasy; armed resistance was religious duty",
      "scriptural_basis": "The Shema (Deut 6:4), Phinehas's zeal (Num 25), Maccabean revolt precedent",
      "destiny": "The Zealots played a major role in the Jewish War (66-73 CE), culminating in the fall of Masada"
    },
    "phinehasTradition": {
      "reference": "Numbers 25:6-13",
      "significance": "Phinehas killed an Israelite and Midianite woman engaged in idolatrous worship, and was praised for his 'zeal' (qin'ah). This became the model for Zealot ideology: violent action against apostasy as religious virtue.",
      "connection": "Simon's original 'zeal' may have been modeled on Phinehas; Christ transformed this into zeal for saving rather than killing"
    },
    "maccabeanPrecedent": {
      "significance": "The Maccabean revolt (167-160 BCE) successfully overthrew Greek oppression through armed resistance. This provided historical precedent for the Zealot belief that God honors violent resistance to pagan rule.",
      "contrast": "Jesus' way of suffering love and universal mission contrasted with nationalist military resistance"
    },
    "messianicExpectations": {
      "zealotView": "Expected a military Messiah who would lead Israel to victory over Rome and establish God's Kingdom through force",
      "jesusTeaching": "Proclaimed a Kingdom that comes through self-sacrifice, enemy love, and spiritual transformation rather than political violence"
    },
    "templeZeal": {
      "reference": "John 2:17; Psalm 69:9",
      "significance": "When Jesus cleansed the Temple, the disciples remembered 'Zeal for your house will consume me.' Jesus demonstrated holy zeal that attacked commercial corruption without violence against persons - a model for Simon's transformed zeal."
    }
  },
  "philosophicalTeachings": {
    "coreConcepts": [
      {
        "name": "From Violence to Witness",
        "description": "Simon's transformation illustrates the Christian ethic of martyrdom (witness through suffering) rather than holy war (witness through killing). The Greek word martys means 'witness' - Simon ultimately witnessed to Christ by dying, not by killing."
      },
      {
        "name": "The Politics of Jesus",
        "description": "Following Jesus required Simon to abandon Zealot politics without abandoning his passionate commitment. The Kingdom of God is political but operates by cruciform rather than violent power."
      }
    ]
  },
  "metaphysicalProperties": {
    "primaryElement": "fire",
    "chakras": [
      "manipura",
      "anahata"
    ],
    "yinYang": "yang",
    "polarity": "active-transformed"
  },
  "relatedEntities": {
    "deities": [
      {
        "id": "jesus-christ",
        "name": "Jesus Christ",
        "relationship": "Master and Lord who transformed Simon's zeal from political violence to spiritual mission"
      }
    ],
    "heroes": [
      {
        "id": "thaddaeus",
        "name": "Saint Thaddaeus",
        "relationship": "Mission partner to Armenia and Persia; martyred together according to Western tradition"
      },
      {
        "id": "matthew",
        "name": "Saint Matthew",
        "relationship": "Fellow apostle and former ideological enemy - Simon the Zealot and Matthew the tax collector represented opposite ends of Jewish political spectrum"
      },
      {
        "id": "judas-iscariot",
        "name": "Judas Iscariot",
        "relationship": "Some scholars believe 'Iscariot' derives from sicarii (dagger-men, radical Zealots). If so, two Zealots were among the Twelve, with radically different outcomes."
      },
      {
        "id": "phinehas",
        "name": "Phinehas",
        "relationship": "Old Testament priest whose violent zeal became the model for Zealot ideology; Simon's original inspiration"
      },
      {
        "id": "judas-galilean",
        "name": "Judas the Galilean",
        "relationship": "Founder of the Zealot movement in 6 CE; the revolutionary tradition Simon was raised in"
      }
    ],
    "concepts": [
      {
        "id": "zealot-movement",
        "name": "Zealot Movement",
        "relationship": "Simon's original ideological commitment before following Jesus"
      },
      {
        "id": "religious-zeal",
        "name": "Religious Zeal",
        "relationship": "The passion that was transformed from violence to mission"
      },
      {
        "id": "kingdom-of-god",
        "name": "Kingdom of God",
        "relationship": "The universal reign of God that transcended Zealot dreams of an earthly kingdom of Israel"
      }
    ],
    "places": [
      {
        "id": "galilee",
        "name": "Galilee",
        "relationship": "Homeland and heartland of Zealot movement"
      },
      {
        "id": "jerusalem",
        "name": "Jerusalem",
        "relationship": "Site of Pentecost; the Temple was the ideological center of Zealot hopes"
      },
      {
        "id": "persia",
        "name": "Persia",
        "relationship": "Site of mission and martyrdom with Thaddaeus"
      },
      {
        "id": "armenia",
        "name": "Armenia",
        "relationship": "Mission field with Thaddaeus"
      }
    ],
    "items": [
      {
        "id": "saw-of-simon",
        "name": "Saw of Simon",
        "relationship": "Instrument of martyrdom according to most traditions"
      }
    ],
    "texts": [
      {
        "id": "acts-simon-jude",
        "name": "Acts of Simon and Jude",
        "relationship": "Apocryphal account of their mission and martyrdom"
      }
    ]
  },
  "corpusQueries": [
    {
      "id": "simon-zealot-matthew",
      "label": "Simon the Canaanite in Matthew's Apostle List (Matt 10:4)",
      "queryType": "github",
      "query": {
        "term": "Simon the Canaanite",
        "repositories": ["bible-kjv"]
      },
      "renderMode": "panel",
      "description": "Matthew identifies Simon by the Aramaic term 'Canaanite' (from qan'ana, meaning zealous)"
    },
    {
      "id": "simon-zealot-mark",
      "label": "Simon the Cananean in Mark's Apostle List (Mark 3:18)",
      "queryType": "github",
      "query": {
        "term": "Simon the Canaanite",
        "repositories": ["bible-kjv"]
      },
      "renderMode": "panel",
      "description": "Mark preserves the Aramaic designation 'Cananean'"
    },
    {
      "id": "simon-zelotes-luke",
      "label": "Simon Zelotes in Luke's Apostle List (Luke 6:15)",
      "queryType": "github",
      "query": {
        "term": "Simon called Zelotes",
        "repositories": ["bible-kjv"]
      },
      "renderMode": "panel",
      "description": "Luke translates the Aramaic into Greek 'Zelotes' (Zealot)"
    },
    {
      "id": "simon-zelotes-acts",
      "label": "Simon Zelotes in the Upper Room (Acts 1:13)",
      "queryType": "github",
      "query": {
        "term": "Simon Zelotes",
        "repositories": ["bible-kjv"]
      },
      "renderMode": "panel",
      "description": "Simon among the apostles waiting for Pentecost in the Upper Room"
    },
    {
      "id": "phinehas-zeal",
      "label": "Phinehas's Zeal - Zealot Model (Num 25:11)",
      "queryType": "github",
      "query": {
        "term": "Phinehas turned my wrath away zealous",
        "repositories": ["bible-kjv"]
      },
      "renderMode": "panel",
      "description": "Phinehas praised for his violent zeal - the Old Testament model that shaped Zealot ideology"
    },
    {
      "id": "temple-zeal",
      "label": "Zeal for God's House (John 2:17)",
      "queryType": "github",
      "query": {
        "term": "zeal of thine house hath eaten me up",
        "repositories": ["bible-kjv"]
      },
      "renderMode": "panel",
      "description": "Jesus' Temple cleansing demonstrates transformed zeal - passion without violence against persons"
    },
    {
      "id": "love-enemies",
      "label": "Love Your Enemies (Matt 5:44)",
      "queryType": "github",
      "query": {
        "term": "Love your enemies bless them that curse you",
        "repositories": ["bible-kjv"]
      },
      "renderMode": "panel",
      "description": "Jesus' teaching that challenged Zealot ideology of violence against Rome"
    },
    {
      "id": "render-caesar",
      "label": "Render Unto Caesar (Matt 22:21)",
      "queryType": "github",
      "query": {
        "term": "Render therefore unto Caesar the things which are Caesar",
        "repositories": ["bible-kjv"]
      },
      "renderMode": "panel",
      "description": "Jesus' teaching on taxes challenged the Zealot position that paying Roman taxes was apostasy"
    },
    {
      "id": "sword-perish",
      "label": "Those Who Take the Sword (Matt 26:52)",
      "queryType": "github",
      "query": {
        "term": "all they that take the sword shall perish with the sword",
        "repositories": ["bible-kjv"]
      },
      "renderMode": "panel",
      "description": "Jesus' rebuke to violent resistance - a direct challenge to Zealot methods"
    },
    {
      "id": "kingdom-not-of-world",
      "label": "My Kingdom Not of This World (John 18:36)",
      "queryType": "github",
      "query": {
        "term": "My kingdom is not of this world if my kingdom were of this world",
        "repositories": ["bible-kjv"]
      },
      "renderMode": "panel",
      "description": "Jesus distinguishes his Kingdom from earthly political kingdoms - the fundamental reorientation Simon had to undergo"
    },
    {
      "id": "judas-galilean",
      "label": "Judas of Galilee - Zealot Founder (Acts 5:37)",
      "queryType": "github",
      "query": {
        "term": "Judas of Galilee in the days of the taxing",
        "repositories": ["bible-kjv"]
      },
      "renderMode": "panel",
      "description": "Gamaliel mentions Judas the Galilean, founder of the Zealot movement that shaped Simon's early life"
    },
    {
      "id": "elijah-zeal",
      "label": "Elijah's Zeal (1 Kings 19:10)",
      "queryType": "github",
      "query": {
        "term": "I have been very jealous for the LORD God of hosts",
        "repositories": ["bible-kjv"]
      },
      "renderMode": "panel",
      "description": "Elijah's prophetic zeal was another model for the Zealot movement"
    }
  ],
  "sources": [
    {
      "title": "Gospel of Matthew",
      "author": "Matthew",
      "date": {
        "year": 75,
        "circa": true,
        "display": "c. 70-80 CE"
      },
      "type": "primary",
      "relevance": "significant",
      "citation": "Matthew 10:4 - Lists 'Simon the Canaanite' among the Twelve"
    },
    {
      "title": "Gospel of Mark",
      "author": "Mark",
      "date": {
        "year": 68,
        "circa": true,
        "display": "c. 65-70 CE"
      },
      "type": "primary",
      "relevance": "significant",
      "citation": "Mark 3:18 - Lists 'Simon the Cananean'"
    },
    {
      "title": "Gospel of Luke",
      "author": "Luke",
      "date": {
        "year": 80,
        "circa": true,
        "display": "c. 80 CE"
      },
      "type": "primary",
      "relevance": "significant",
      "citation": "Luke 6:15 - First to use Greek 'Zelotes'"
    },
    {
      "title": "Acts of the Apostles",
      "author": "Luke",
      "date": {
        "year": 80,
        "circa": true,
        "display": "c. 80 CE"
      },
      "type": "primary",
      "relevance": "significant",
      "citation": "Acts 1:13 - Simon Zelotes in the Upper Room"
    },
    {
      "title": "Jewish Antiquities",
      "author": "Josephus",
      "date": {
        "year": 94,
        "circa": true,
        "display": "c. 93-94 CE"
      },
      "type": "secondary",
      "relevance": "comprehensive",
      "citation": "Book XVIII - Account of Judas the Galilean and the 'Fourth Philosophy' (Zealots)"
    },
    {
      "title": "The Jewish War",
      "author": "Josephus",
      "date": {
        "year": 75,
        "circa": true,
        "display": "c. 75-79 CE"
      },
      "type": "secondary",
      "relevance": "comprehensive",
      "citation": "Books II-VII - Detailed account of Zealot activities during the Jewish War"
    },
    {
      "title": "Golden Legend (Legenda Aurea)",
      "author": "Jacobus de Voragine",
      "date": {
        "year": 1260,
        "circa": true,
        "display": "c. 1260 CE"
      },
      "type": "hagiographical",
      "relevance": "comprehensive",
      "citation": "Life of Simon and Jude - Mission and martyrdom in Persia"
    },
    {
      "title": "Ecclesiastical History",
      "author": "Eusebius of Caesarea",
      "date": {
        "year": 324,
        "circa": true,
        "display": "c. 324 CE"
      },
      "type": "secondary",
      "relevance": "significant",
      "citation": "Various references to apostolic missions"
    }
  ],
  "fullDescription": "Former Jewish revolutionary who traded political zeal for spiritual mission, apostle who transformed from violent nationalist to peaceful evangelist carrying the Gospel to Persia and beyond",
  "metadata": {
    "lastModified": "2025-12-29T00:00:00.000Z",
    "version": "1.0",
    "createdBy": "Agent Simon the Zealot",
    "agentPerspective": "Transformed zeal, from political revolution to spiritual mission, Jewish nationalism, and the radical demands of discipleship"
  }
}
