{
  "id": "freya",
  "displayName": "Freyja",
  "category": "deity",
  "mythology": "norse",
  "mythologyName": "Norse Mythology",
  "subtitle": "Goddess of Love, Beauty, Fertility, and Magic",
  "summary": "The most renowned of the Vanir, Freyja is goddess of love, beauty, fertility, gold, death in battle, and seidr magic. She receives half of those who die in combat, rules from her hall Sessrumnir, and taught the Aesir the shamanic art of seidr. Beautiful and fierce, sensual and powerful, she embodies the Vanir's connection to both life's pleasures and its mysteries.",
  "richContent": {
    "panels": [
      {
        "type": "attributes",
        "title": "Divine Attributes",
        "content": {
          "titles": "Lady (Freyja means \"Lady\"), Vanadís (Vanir Goddess), Mardöll (Sea-Bright), Gefn (Giver), Hörn (Flax)",
          "domains": [
            "Love",
            "beauty",
            "fertility",
            "sex",
            "war",
            "death",
            "magic (seidr)",
            "gold",
            "prophecy",
            "cats",
            "falcons"
          ],
          "symbols": [
            "Necklace Brísingamen",
            "falcon cloak (allows flight)",
            "boar Hildisvíni",
            "her chariot pulled by cats"
          ],
          "sacredAnimals": [
            "Cats (pull her chariot)",
            "falcon (her cloak)",
            "boar Hildisvíni",
            "swine in general"
          ],
          "sacredPlants": [
            "Elder tree",
            "Mugwort",
            "roses",
            "flax",
            "primrose"
          ],
          "colors": [
            "Gold",
            "amber",
            "red",
            "white",
            "green (spring/fertility)"
          ]
        }
      },
      {
        "type": "text",
        "title": "Mythology & Stories",
        "content": "The Brísingamen Necklace: Freyja desired the beautiful golden necklace Brísingamen, crafted by four dwarven brothers. To obtain it, she agreed to spend one night with each dwarf. Loki discovered this and told Odin, who ordered Loki to steal the necklace. Freyja furiously demanded its return, and Odin agreed on condition she stir up endless war between two human kings. This myth shows Freyja's willingness to use her sexuality to gain power, and her association with both desire and the violence of war.\n\nFreyja's Tears of Gold: Freyja's husband Óðr (possibly another name for Odin, or a separate figure) wandered away on long journeys. Freyja searched for him, weeping tears that turned to gold on land and amber when they fell into the sea. This establishes Freyja's connection to gold, amber, and the pain of lost love - showing even the goddess of love suffers from it.\n\nThe Giant Who Wanted Freyja: When the gods needed the walls of Asgard rebuilt, a giant offered to do it in exchange for the sun, moon, and Freyja as his bride. The gods agreed, thinking he couldn't finish in time. When he nearly succeeded (aided by his stallion), Loki transformed into a mare and lured the horse away, preventing completion. This myth repeatedly shows Freyja as the most desired being in all Nine Realms - so valuable the gods constantly use her as bait or bargaining chip, though she never actually becomes anyone's prize."
      },
      {
        "type": "relationships",
        "title": "Divine Relationships",
        "content": {
          "family": "Parents: Njord (father, god of sea and wealth), mother unnamed (possibly Nerthus) Consort(s): Óðr (husband, often absent), possibly identical to or an aspect of Odin Children: Hnoss and Gersemi (daughters), both described as extremely beautiful Siblings: Freyr (twin brother, god of fertility and prosperity)",
          "allies": "Allies: Her brother Freyr (close bond), the Vanir tribe, völvas and seeresses who practice her magic Enemies: Giants who desire her (she's constantly pursued), Loki (complex relationship - he both aids and antagonizes her), those who would harm the Vanir or disrespect seidr",
          "enemies": "Allies: Her brother Freyr (close bond), the Vanir tribe, völvas and seeresses who practice her magic Enemies: Giants who desire her (she's constantly pursued), Loki (complex relationship - he both aids and antagonizes her), those who would harm the Vanir or disrespect seidr"
        }
      },
      {
        "type": "worship",
        "title": "Worship & Rituals",
        "content": {
          "sacredSites": "Freyja was worshipped throughout Scandinavia, with particular devotion in Sweden where the Vanir cult was strongest. Her worship involved groves sacred to love and fertility, places where völvas practiced seidr, and sites associated with gold and amber. Unlike war gods honored with weapons, Freyja received offerings of flowers, honey, mead, and gold. Place names like Frövi (Sweden) preserve her cult locations.",
          "festivals": "Dísablót (Late Winter): Festival honoring female spirits and goddesses, with Freyja as chief Dís (goddess/female spirit). Women played central roles in this festival, offering sacrifices and performing prophetic seidr. Winter Nights (Autumn): Harvest festival particularly associated with Freyja and Freyr, thanking the Vanir for prosperity and fertility. Beginning of the dark half of the year when seidr magic was most powerful. Spring Celebrations: Fertility rites invoking Freyja for the renewal of life, successful crops, and fruitful marriages.",
          "offerings": "Freyja received offerings of mead, honey, flowers (especially primrose and roses), gold and amber jewelry, cakes and sweet foods, flax (sacred to her), and sometimes swine (her sacred animal). Völvas practicing seidr in her name made offerings before trance work. Love charms and beauty spells invoked her name. Unlike the blood sacrifices given to Odin and Thor, Freyja's offerings emphasized beauty, sweetness, and sensuality."
        }
      }
    ]
  },
  "icon": "💎",
  "attributes": {
    "titles": "Lady (Freyja means \"Lady\"), Vanadís (Vanir Goddess), Mardöll (Sea-Bright), Gefn (Giver), Hörn (Flax)",
    "domains": [
      "Love",
      "beauty",
      "fertility",
      "sex",
      "war",
      "death",
      "magic (seidr)",
      "gold",
      "prophecy",
      "cats",
      "falcons"
    ],
    "symbols": [
      "Necklace Brísingamen",
      "falcon cloak (allows flight)",
      "boar Hildisvíni",
      "her chariot pulled by cats"
    ],
    "sacredAnimals": [
      "Cats (pull her chariot)",
      "falcon (her cloak)",
      "boar Hildisvíni",
      "swine in general"
    ],
    "sacredPlants": [
      "Elder tree",
      "Mugwort",
      "roses",
      "flax",
      "primrose"
    ],
    "colors": [
      "Gold",
      "amber",
      "red",
      "white",
      "green (spring/fertility)"
    ]
  },
  "tags": [
    "deity",
    "norse",
    "Love",
    "beauty",
    "fertility"
  ],
  "relatedContent": [],
  "relatedMythologies": [],
  "sources": "Poetic Edda, Prose Edda, Icelandic Sagas",
  "createdAt": "2025-12-13T08:46:57.477Z",
  "updatedAt": "2025-12-13T08:46:57.477Z"
}