{
  "id": "frigg",
  "displayName": "Frigg",
  "category": "deity",
  "mythology": "norse",
  "mythologyName": "Norse Mythology",
  "subtitle": "Queen of Asgard, Goddess of Marriage and Motherhood",
  "summary": "Wife of Odin and queen of the Aesir, Frigg is goddess of marriage, motherhood, domestic life, and foresight. She knows all fates but speaks no prophecies. From her hall Fensalir, she spins the clouds and watches over families and households. The only goddess permitted to sit on Odin's throne Hlidskjalf, she shares his all-seeing vision across the Nine Realms.",
  "richContent": {
    "panels": [
      {
        "type": "attributes",
        "title": "Divine Attributes",
        "content": {
          "titles": "Queen of Asgard, First of the Asynjur, Lady of Fensalir, Mistress of Foresight",
          "domains": [
            "Marriage",
            "motherhood",
            "domestic life",
            "prophecy",
            "foresight",
            "clouds",
            "weaving",
            "protection of families"
          ],
          "symbols": [
            "Spindle",
            "distaff",
            "keys (household authority)",
            "clouds",
            "mists",
            "falcon cloak"
          ],
          "sacredAnimals": [
            "Falcon",
            "rams",
            "sheep"
          ],
          "sacredPlants": [
            "Birch tree",
            "mistletoe (tragically)",
            "flax",
            "wool-bearing plants"
          ],
          "colors": [
            "White",
            "silver",
            "blue (sky)",
            "gray (clouds)"
          ]
        }
      },
      {
        "type": "text",
        "title": "Mythology & Stories",
        "content": "The Death of Baldr: Frigg's most famous story is her attempt to save her son Baldr from his prophesied death. Troubled by Baldr's dreams of death, she traveled across all the Nine Realms extracting oaths from every creature, plant, and object never to harm her beloved son. She overlooked only the mistletoe, thinking it too young and harmless. Loki discovered this and fashioned a dart of mistletoe, which killed Baldr when thrown by his blind brother Hod. Frigg's grief was immeasurable, and she sent Hermod to Hel to bargain for Baldr's return.\n\nFrigg and Odin's Wager: In one tale, Frigg and Odin each favored different sides in a human war. Odin supported the Winilers, while Frigg favored the Vandals. Frigg tricked Odin by moving his bed so when he woke facing a different direction, he saw the Vandals first and was compelled to grant them victory, having promised to favor whoever he saw first. This shows Frigg's cleverness and willingness to use cunning to protect those under her care.\n\nKeeper of Secrets: Though Frigg knows all that will happen, she never speaks prophecies as völvas do. This restraint - knowing but not telling - reflects her role as wife and mother who must watch fates unfold even when she knows the outcome. Only once did she act on foreknowledge: trying to save Baldr, and even that failed."
      },
      {
        "type": "relationships",
        "title": "Divine Relationships",
        "content": {
          "family": "Parents: Fjörgynn (father, obscure giant or deity), mother unknown Consort: Odin (husband, king of Aesir) Children: Baldr (beloved son), Hod (blind son), possibly others Stepchildren: Thor, Vidar, Vali, and Odin's many sons by other mothers",
          "allies": "Allies: Her handmaidens (Fulla, Gna, Eir), the Asynjur (goddesses), mothers and married women who invoke her Enemies: Loki (after he killed Baldr), the giantess who refused to weep for Baldr (likely Loki in disguise), those who break marriage oaths or harm families",
          "enemies": "Allies: Her handmaidens (Fulla, Gna, Eir), the Asynjur (goddesses), mothers and married women who invoke her Enemies: Loki (after he killed Baldr), the giantess who refused to weep for Baldr (likely Loki in disguise), those who break marriage oaths or harm families"
        }
      },
      {
        "type": "worship",
        "title": "Worship & Rituals",
        "content": {
          "sacredSites": "Frigg was worshipped throughout the Germanic world, though her cult is less well-documented than Odin's or Thor's. Place names preserve her memory, and she was invoked in domestic settings - the home itself was her temple. Married women particularly honored her, seeking her blessings for family harmony, children, and household prosperity.",
          "festivals": "Yule (Midwinter): As Odin's wife, Frigg presided over Yule celebrations alongside him. Spinning was forbidden during the twelve days of Yule - no one should spin while Frigg was spinning clouds Wedding Ceremonies: Every marriage invoked Frigg's blessing. The bride was under Frigg's special protection from betrothal through the first year of marriage Mother's Blessings: Childbirth rituals invoked Frigg for safe delivery and healthy children",
          "offerings": "Frigg received offerings of flax and wool (her domain as spinner), household items, keys (symbol of her domestic authority), and silver. Married women dedicated their spinning work to her. The first portion of newly woven cloth might be offered at her shrine. Unlike warrior gods receiving blood sacrifice, Frigg's offerings were peaceful - bread, cheese, ale, woven goods, and prayers for family welfare."
        }
      }
    ]
  },
  "icon": "👸",
  "attributes": {
    "titles": "Queen of Asgard, First of the Asynjur, Lady of Fensalir, Mistress of Foresight",
    "domains": [
      "Marriage",
      "motherhood",
      "domestic life",
      "prophecy",
      "foresight",
      "clouds",
      "weaving",
      "protection of families"
    ],
    "symbols": [
      "Spindle",
      "distaff",
      "keys (household authority)",
      "clouds",
      "mists",
      "falcon cloak"
    ],
    "sacredAnimals": [
      "Falcon",
      "rams",
      "sheep"
    ],
    "sacredPlants": [
      "Birch tree",
      "mistletoe (tragically)",
      "flax",
      "wool-bearing plants"
    ],
    "colors": [
      "White",
      "silver",
      "blue (sky)",
      "gray (clouds)"
    ]
  },
  "tags": [
    "deity",
    "norse",
    "Marriage",
    "motherhood",
    "domestic life"
  ],
  "relatedContent": [],
  "relatedMythologies": [],
  "sources": "Poetic Edda, Prose Edda, Icelandic Sagas",
  "createdAt": "2025-12-13T08:46:57.537Z",
  "updatedAt": "2025-12-13T08:46:57.537Z"
}