{
  "id": "loki",
  "displayName": "Loki",
  "category": "deity",
  "mythology": "norse",
  "mythologyName": "Norse Mythology",
  "subtitle": "The Trickster, Agent of Chaos",
  "summary": "The shapeshifter and trickster who dwells among the gods despite being a giant's son. Blood-brother to Odin, father of monsters, helper and betrayer of the Aesir. His cunning brings both salvation and doom to the gods, culminating in the death of Baldr and his binding until Ragnarok.",
  "richContent": {
    "panels": [
      {
        "type": "attributes",
        "title": "Divine Attributes",
        "content": {
          "titles": "Trickster, Shapeshifter, Sly One, Father of Lies, Breaker of Worlds",
          "domains": [
            "Trickery",
            "chaos",
            "fire",
            "cunning",
            "deception",
            "transformation",
            "mischief"
          ],
          "symbols": [
            "Fire",
            "snakes",
            "fishing net",
            "masks",
            "the bound god"
          ],
          "sacredAnimals": [
            "Serpents",
            "salmon",
            "flies",
            "horses (as mother of Sleipnir)"
          ],
          "colors": [
            "Red (fire)",
            "green (chaos)",
            "shifting hues"
          ]
        }
      },
      {
        "type": "text",
        "title": "Mythology & Stories",
        "content": "Birth of Sleipnir: When a giant builder threatened to complete Asgard's walls, Loki transformed into a mare to lure away the giant's stallion Svadilfari. Later, Loki gave birth to the eight-legged horse Sleipnir, which became Odin's mount.\n\nThe Death of Baldr: Loki's greatest crime. He discovered that mistletoe was the only thing that could harm Baldr and tricked the blind god Hod into throwing it, killing the most beloved of the gods. When Hel offered to release Baldr if all things wept for him, Loki disguised himself as a giantess and refused to weep, sealing Baldr's fate.\n\nThe Binding of Loki: As punishment for Baldr's death, the gods bound Loki to three rocks with the entrails of his son Nari. A serpent was placed above him to drip venom on his face. His wife Sigyn holds a bowl to catch the venom, but when she must empty it, the venom falls on Loki, causing him to writhe in agony - these convulsions cause earthquakes.\n\nThe Treasures of the Gods: After cutting off Sif's golden hair as a prank, Loki commissioned the dwarves to create replacement hair and other treasures, including Thor's hammer Mjolnir, Odin's spear Gungnir, and Freyr's ship Skidbladnir."
      },
      {
        "type": "relationships",
        "title": "Divine Relationships",
        "content": {
          "family": "Parents: Farbauti (father, a giant) and Laufey or Nal (mother) Consort(s): Sigyn (wife), Angrboda (giantess, mother of his monster children) Children: Fenrir (great wolf), Jormungandr (world serpent), Hel (goddess of death), Sleipnir (eight-legged horse, as mother), Nari and Vali (sons with Sigyn) Blood-Brother: Odin (by oath)"
        }
      }
    ]
  },
  "icon": "🎭",
  "attributes": {
    "titles": "Trickster, Shapeshifter, Sly One, Father of Lies, Breaker of Worlds",
    "domains": [
      "Trickery",
      "chaos",
      "fire",
      "cunning",
      "deception",
      "transformation",
      "mischief"
    ],
    "symbols": [
      "Fire",
      "snakes",
      "fishing net",
      "masks",
      "the bound god"
    ],
    "sacredAnimals": [
      "Serpents",
      "salmon",
      "flies",
      "horses (as mother of Sleipnir)"
    ],
    "colors": [
      "Red (fire)",
      "green (chaos)",
      "shifting hues"
    ]
  },
  "tags": [
    "deity",
    "norse",
    "Trickery",
    "chaos",
    "fire"
  ],
  "relatedContent": [],
  "relatedMythologies": [],
  "sources": "Poetic Edda, Prose Edda, Icelandic Sagas",
  "createdAt": "2025-12-13T08:46:57.677Z",
  "updatedAt": "2025-12-13T08:46:57.677Z"
}