{
  "id": "odin",
  "displayName": "Odin",
  "category": "deity",
  "mythology": "norse",
  "mythologyName": "Norse Mythology",
  "subtitle": "The Allfather, God of Wisdom and War",
  "summary": "The one-eyed wanderer who sacrificed himself to himself, hung on the World Tree for nine nights to gain the runes, and rules Asgard with wisdom bought through suffering. King of the Aesir, lord of Valhalla, patron of poets, shamans, and warriors who seek glory through death.",
  "richContent": {
    "panels": [
      {
        "type": "attributes",
        "title": "Divine Attributes",
        "content": {
          "titles": "Allfather, Valfather, Grimnir (Masked One), Gangleri (Wanderer), High One, Har, Bolverk (Evil-Doer)",
          "domains": [
            "Wisdom",
            "war",
            "death",
            "poetry",
            "magic",
            "runes",
            "prophecy",
            "knowledge",
            "battle strategy",
            "the gallows"
          ],
          "symbols": [
            "Spear Gungnir",
            "Valknut (three interlocked triangles)",
            "hanged man",
            "one eye"
          ],
          "sacredAnimals": [
            "Ravens Huginn (Thought) and Muninn (Memory)",
            "wolves Geri and Freki",
            "eight-legged horse Sleipnir"
          ],
          "sacredPlants": [
            "Yew tree",
            "Ash (Yggdrasil)",
            "Mugwort"
          ],
          "colors": [
            "Gray",
            "blue",
            "black (his wanderer's cloak)"
          ]
        }
      },
      {
        "type": "text",
        "title": "Mythology & Stories",
        "content": "The Sacrifice for the Runes: Odin hung himself on Yggdrasil for nine days and nights, pierced by his own spear, without food or water. In this self-sacrifice \"of myself to myself,\" he received the knowledge of the runes - the fundamental symbols of power and meaning. This myth establishes the pattern that wisdom requires sacrifice and suffering.\n\nThe Mead of Poetry: Odin seduced the giantess Gunnlod to steal the Mead of Poetry (Óðrœrir), which grants wisdom and poetic inspiration. He shape-shifted into an eagle to escape, spilling some mead that became the portion of lesser poets. This establishes Odin as patron of skalds and master of the art of words.\n\nSacrifice of His Eye: To drink from Mimir's Well of Wisdom beneath Yggdrasil's roots, Odin gouged out his own eye as payment. This sacrifice of sight for insight shows Odin values wisdom above all - willing to give up physical vision for deeper spiritual knowledge. His single remaining eye sees all across the Nine Realms."
      },
      {
        "type": "relationships",
        "title": "Divine Relationships",
        "content": {
          "family": "Parents: Bor (father) and Bestla (mother, a giantess) Consort(s): Frigg (primary wife), Jord/Earth (mother of Thor), Grid (giantess mother of Vidar), numerous others Children: Thor (with Jord), Baldr and Hod (with Frigg), Vidar (with Grid), Vali, Hermod, and many others Siblings: Vili and Vé (brothers who helped create the world from Ymir's body)",
          "allies": "Allies: Thor (son), Tyr (war companion), Heimdall (watchman), Mimir's head (advisor) Enemies: Fenrir wolf (destined to kill him at Ragnarok), giants in general, though he often makes deals with them",
          "enemies": "Allies: Thor (son), Tyr (war companion), Heimdall (watchman), Mimir's head (advisor) Enemies: Fenrir wolf (destined to kill him at Ragnarok), giants in general, though he often makes deals with them"
        }
      },
      {
        "type": "worship",
        "title": "Worship & Rituals",
        "content": {
          "sacredSites": "Old Uppsala in Sweden was a major cult center for Odin worship. Temples (hof) dedicated to him featured prominently in Viking Age Scandinavia. Sacred groves where warriors were hanged as offerings to Odin existed across Norse territories. Battlefields themselves became his temples, as the honored dead were his chosen.",
          "festivals": "Yule (Midwinter): Odin leads the Wild Hunt across the sky during the darkest nights. Sacrifices and feasts honor the Allfather and ancestral spirits. The 12 days of Yule are Odin's special time when the boundaries between worlds thin. Sigrblót (Victory Sacrifice): Spring festival before summer campaigns, warriors made offerings to Odin for victory in battle. This was the time to pledge oaths and seek the Allfather's favor for the raiding season.",
          "offerings": "Odin received the most intense sacrifices: warriors hanged on trees or impaled with spears, dedicated \"to Odin.\" Mead and ale poured in his honor. Poetry and rune-carving as devotional acts. The custom of spilling the first drink for the gods honored Odin first. Weapons cast into sacred waters or buried in bogs. Unlike Thor who received common folk's prayers, Odin was invoked by jarls, kings, poets, and warriors seeking glory in death."
        }
      }
    ]
  },
  "icon": "🧙",
  "attributes": {
    "titles": "Allfather, Valfather, Grimnir (Masked One), Gangleri (Wanderer), High One, Har, Bolverk (Evil-Doer)",
    "domains": [
      "Wisdom",
      "war",
      "death",
      "poetry",
      "magic",
      "runes",
      "prophecy",
      "knowledge",
      "battle strategy",
      "the gallows"
    ],
    "symbols": [
      "Spear Gungnir",
      "Valknut (three interlocked triangles)",
      "hanged man",
      "one eye"
    ],
    "sacredAnimals": [
      "Ravens Huginn (Thought) and Muninn (Memory)",
      "wolves Geri and Freki",
      "eight-legged horse Sleipnir"
    ],
    "sacredPlants": [
      "Yew tree",
      "Ash (Yggdrasil)",
      "Mugwort"
    ],
    "colors": [
      "Gray",
      "blue",
      "black (his wanderer's cloak)"
    ]
  },
  "tags": [
    "deity",
    "norse",
    "Wisdom",
    "war",
    "death"
  ],
  "relatedContent": [],
  "relatedMythologies": [],
  "sources": "Poetic Edda, Prose Edda, Icelandic Sagas",
  "createdAt": "2025-12-13T08:46:57.716Z",
  "updatedAt": "2025-12-13T08:46:57.716Z"
}