{
  "id": "thor",
  "displayName": "Thor",
  "category": "deity",
  "mythology": "norse",
  "mythologyName": "Norse Mythology",
  "subtitle": "God of Thunder, Protector of Midgard",
  "summary": "The mightiest warrior of the Aesir, wielder of the hammer Mjolnir, and defender of gods and humans against the chaotic forces of the giants. Red-bearded and fierce in battle yet a friend to mankind, Thor was the most widely worshipped of the Norse gods, especially among farmers and common folk who relied on his storms for rain and his protection against evil.",
  "richContent": {
    "panels": [
      {
        "type": "attributes",
        "title": "Divine Attributes",
        "content": {
          "titles": "Thunder God, Defender of Midgard, Slayer of Giants, Charioteer, Vingthor (Hallower)",
          "domains": [
            "Thunder",
            "lightning",
            "storms",
            "strength",
            "protection",
            "fertility (through rain)",
            "consecration",
            "agriculture"
          ],
          "symbols": [
            "Hammer Mjolnir",
            "lightning bolts",
            "thunder",
            "chariot",
            "hammer amulets worn as protection"
          ],
          "sacredAnimals": [
            "Goats Tanngrisnir and Tanngnjóstr (who pull his chariot and can be eaten and resurrected)"
          ],
          "sacredPlants": [
            "Oak tree",
            "rowan tree (protection)",
            "houseleek (Þórr's Beard)",
            "leeks"
          ],
          "colors": [
            "Red (his beard)",
            "silver/gray (storms)",
            "yellow/gold (lightning)"
          ]
        }
      },
      {
        "type": "text",
        "title": "Mythology & Stories",
        "content": "Thor's Fishing for Jormungandr: Thor went fishing with the giant Hymir using an ox head as bait. He hooked the Midgard Serpent Jormungandr and nearly pulled the world-encircling beast from the ocean, intending to kill it. Just as Thor raised his hammer for the killing blow, the terrified Hymir cut the line. This story foreshadows their fatal confrontation at Ragnarok, where Thor will kill the serpent but die from its venom nine steps later.\n\nThe Theft of Mjolnir: When the giant Thrym stole Thor's hammer, he demanded Freyja as his bride for its return. Thor, disguised as Freyja in bridal dress (to his fury and the gods' amusement), attended the wedding feast. When Mjolnir was brought forth to consecrate the bride, Thor seized it and slaughtered Thrym and all the giants present. This humorous myth shows both Thor's devotion to protecting the gods and his willingness to endure ridicule to achieve victory.\n\nThor's Journey to Utgard-Loki: Traveling to the giant stronghold Utgard, Thor and Loki faced impossible challenges that were actually illusions. Thor failed to drink the ocean dry (but lowered sea levels), couldn't lift a cat (actually Jormungandr), and lost a wrestling match with an old woman (personification of Old Age). This rare tale of Thor's defeat teaches that even the mightiest god faces limits - though even in \"failure\" his strength is cosmic."
      },
      {
        "type": "relationships",
        "title": "Divine Relationships",
        "content": {
          "family": "Parents: Odin (father) and Jord/Earth (mother, a giantess) Consort(s): Sif (wife, golden-haired goddess), Járnsaxa (giantess) Children: Modi (\"Courage\") and Magni (\"Strength\") with Járnsaxa, Thrud (\"Power\") with Sif, Ullr (stepson, Sif's son from previous relationship) Siblings: Baldr (half-brother), Hod (half-brother), Vidar (half-brother), Vali (half-brother) - many sons of Odin by different mothers",
          "allies": "Allies: Tyr (fellow warrior god), occasionally Loki (their relationship is complex), humanity in general Enemies: The giants (jotnar) in general, especially Jormungandr the Midgard Serpent (his destined killer at Ragnarok), giant sorcerers, and the forces of chaos",
          "enemies": "Allies: Tyr (fellow warrior god), occasionally Loki (their relationship is complex), humanity in general Enemies: The giants (jotnar) in general, especially Jormungandr the Midgard Serpent (his destined killer at Ragnarok), giant sorcerers, and the forces of chaos"
        }
      },
      {
        "type": "worship",
        "title": "Worship & Rituals",
        "content": {
          "sacredSites": "Thor's worship was widespread across Scandinavia, Iceland, and Norse settlements. Place names containing \"Thor\" (Þórr) are extremely common: Thorsby, Thorshavn, etc. Many groves sacred to Thor existed, and his hammer symbol appears carved on runestones, worn as pendants, and marked on boundary stones. Unlike Odin's temples which were often royal cult centers, Thor's worship permeated all levels of society, with farmers and sailors particularly devoted to him.",
          "festivals": "Þorrablót (Mid-Winter): Festival dedicated to Thor during the harsh winter month called Þorri. Feasts to earn Thor's protection until spring. This festival continues in modern Iceland as a celebration of traditional foods. Spring Planting Blessings: Farmers invoked Thor for rain and protection of crops. Mjolnir symbols used to consecrate fields and ensure fertility through storm-brought rain.",
          "offerings": "Thor received offerings from all classes: farmers offered grain and livestock; sailors offered before voyages; warriors dedicated weapons. Unlike Odin who preferred human sacrifice, Thor's offerings were typically animals - goats especially, echoing his own goats that pull his chariot. Ale and mead were poured in his honor at communal feasts. The hammer sign was made over food and drink to consecrate it (this gesture persisted even after Christianization as making the sign of the cross)."
        }
      }
    ]
  },
  "icon": "⚡",
  "attributes": {
    "titles": "Thunder God, Defender of Midgard, Slayer of Giants, Charioteer, Vingthor (Hallower)",
    "domains": [
      "Thunder",
      "lightning",
      "storms",
      "strength",
      "protection",
      "fertility (through rain)",
      "consecration",
      "agriculture"
    ],
    "symbols": [
      "Hammer Mjolnir",
      "lightning bolts",
      "thunder",
      "chariot",
      "hammer amulets worn as protection"
    ],
    "sacredAnimals": [
      "Goats Tanngrisnir and Tanngnjóstr (who pull his chariot and can be eaten and resurrected)"
    ],
    "sacredPlants": [
      "Oak tree",
      "rowan tree (protection)",
      "houseleek (Þórr's Beard)",
      "leeks"
    ],
    "colors": [
      "Red (his beard)",
      "silver/gray (storms)",
      "yellow/gold (lightning)"
    ]
  },
  "tags": [
    "deity",
    "norse",
    "Thunder",
    "lightning",
    "storms"
  ],
  "relatedContent": [],
  "relatedMythologies": [],
  "sources": "Poetic Edda, Prose Edda, Icelandic Sagas",
  "createdAt": "2025-12-13T08:46:57.745Z",
  "updatedAt": "2025-12-13T08:46:57.745Z"
}