{
  "magic": [
    {
      "id": "astrology",
      "type": "magic",
      "name": "Astrology",
      "icon": "♈",
      "slug": "astrology",
      "mythologies": [
        "babylonian",
        "greek",
        "hindu",
        "chinese",
        "universal"
      ],
      "primaryMythology": "babylonian",
      "shortDescription": "Ancient divination system studying the correlation between celestial phenomena and terrestrial events, based on the principle that the positions and movements of celestial bodies at specific moments correspond with character traits, life events, and worldly affairs",
      "fullDescription": "Astrology is the study of the relationship between celestial phenomena and terrestrial events, based on the principle that the positions and movements of celestial bodies at specific moments correlate with character traits, life events, and worldly affairs. Emerging independently in multiple ancient civilizations, astrology represents humanity's earliest attempt to systematize observations of cosmic patterns and their apparent influence on earthly existence. While modern science distinguishes astronomy (empirical study of celestial objects) from astrology (interpretive correlation), the two were historically unified as a single discipline seeking to understand both the mechanics and meaning of celestial movements. The philosophical foundation rests on the Hermetic axiom 'As above, so below'—the principle of correspondence stating that patterns in the macrocosm (universe) reflect in the microcosm (individual).",
      "category": "magic",
      "subCategory": "celestial-divination",
      "method": "chart-interpretation",
      "colors": {
        "primary": "#F59E0B",
        "secondary": "#FCD34D",
        "primaryRgb": "245, 158, 11"
      },
      "tags": [
        "divination",
        "celestial",
        "zodiac",
        "planets",
        "birth-chart",
        "horoscope",
        "natal-astrology",
        "predictive",
        "hermetic-principle",
        "as-above-so-below"
      ],
      "requirements": {
        "location": {
          "id": "any-location",
          "name": "Any Location",
          "type": "place",
          "description": "Can be practiced anywhere, though birth location required for accurate natal charts"
        },
        "timing": "Ongoing practice; birth time required for natal charts; current planetary positions for predictive work",
        "practitioner": "Astrologers ranging from amateur enthusiasts to professional consultants; requires study of symbolism and mathematics",
        "preparation": "Learning zodiac signs, planetary meanings, house systems, and aspect interpretations; modern practice often uses software for calculations",
        "items": [
          {
            "id": "ephemeris",
            "name": "Ephemeris",
            "description": "Tables of planetary positions for specific dates and times"
          },
          {
            "id": "birth-data",
            "name": "Birth Data",
            "description": "Date, time, and place of birth for natal chart calculation"
          },
          {
            "id": "astrology-software",
            "name": "Astrology Software",
            "description": "Modern tools like Solar Fire, Astro.com, or apps for chart calculation"
          },
          {
            "id": "house-tables",
            "name": "House Tables",
            "description": "Mathematical tables for determining house cusps based on location"
          }
        ]
      },
      "steps": [
        {
          "order": 1,
          "action": "Gather Birth Information",
          "description": "Collect accurate birth date, time (precise to the minute if possible), and geographic location"
        },
        {
          "order": 2,
          "action": "Calculate Planetary Positions",
          "description": "Use ephemeris or software to determine where each planet was positioned in the zodiac at birth time"
        },
        {
          "order": 3,
          "action": "Determine House Cusps",
          "description": "Calculate the twelve houses based on Earth's rotation, requiring birth time and location"
        },
        {
          "order": 4,
          "action": "Identify Ascendant",
          "description": "Determine the rising sign (zodiac sign on eastern horizon at birth), marking the first house cusp"
        },
        {
          "order": 5,
          "action": "Chart the Aspects",
          "description": "Calculate angular relationships between planets (conjunctions, sextiles, squares, trines, oppositions)"
        },
        {
          "order": 6,
          "action": "Assess Element and Quality Balance",
          "description": "Determine distribution of Fire, Earth, Air, Water and Cardinal, Fixed, Mutable energies"
        },
        {
          "order": 7,
          "action": "Interpret the Sun Sign",
          "description": "Analyze core identity, conscious will, and life purpose through the Sun's zodiac placement"
        },
        {
          "order": 8,
          "action": "Interpret the Moon Sign",
          "description": "Understand emotional nature, needs, and subconscious patterns through the Moon's placement"
        },
        {
          "order": 9,
          "action": "Analyze Personal Planets",
          "description": "Examine Mercury (communication), Venus (love), and Mars (action) for personality details"
        },
        {
          "order": 10,
          "action": "Consider Outer Planets",
          "description": "Interpret generational influences through Jupiter, Saturn, Uranus, Neptune, and Pluto"
        },
        {
          "order": 11,
          "action": "Synthesize the Chart",
          "description": "Integrate all factors into a coherent interpretation, noting dominant themes and patterns"
        },
        {
          "order": 12,
          "action": "Apply Predictive Techniques",
          "description": "For forecasting: examine transits, progressions, solar returns, or horary charts as appropriate"
        }
      ],
      "effects": "Astrology provides insight into personality patterns, psychological tendencies, life challenges, and potential timing for events. Practitioners gain understanding of their strengths, weaknesses, and life purpose. Predictive techniques can indicate favorable and challenging periods, though interpretations emphasize potential and probability rather than fixed fate. Modern psychological astrology focuses on self-awareness and personal growth rather than deterministic prediction. The practice develops pattern recognition, symbolic thinking, and awareness of cyclical rhythms in life.",
      "warnings": "Astrology should not replace medical, legal, or financial professional advice. Avoid fatalistic interpretations that remove personal agency and free will. Be wary of overly specific predictions or claims of absolute certainty. Some critics view astrology as pseudoscience lacking empirical validation. Ethical practitioners avoid creating dependency or making clients feel powerless. Birth time inaccuracy significantly affects house placements and Ascendant. Cultural differences exist between tropical and sidereal zodiacs (Western vs. Vedic). Avoid using astrology to manipulate or control others.",
      "mythologyContexts": [
        {
          "mythology": "babylonian",
          "usage": "The Babylonians and Sumerians developed the earliest systematic astrology (c. 3000-1000 BCE), observing Venus, Jupiter, and other planets, correlating celestial phenomena with agricultural cycles, weather patterns, and political events. The Enūma Anu Enlil (c. 1600 BCE) compiled omens derived from celestial observations, representing predictive astrology focused on kingdoms rather than individuals.",
          "associatedDeities": [
            {
              "id": "shamash",
              "name": "Shamash",
              "type": "deity",
              "mythology": "babylonian",
              "icon": "☀️",
              "url": "/mythos/babylonian/deities/shamash.html"
            },
            {
              "id": "sin",
              "name": "Sin",
              "type": "deity",
              "mythology": "babylonian",
              "icon": "🌙",
              "url": "/mythos/babylonian/deities/sin.html"
            },
            {
              "id": "ishtar",
              "name": "Ishtar",
              "type": "deity",
              "mythology": "babylonian",
              "icon": "⭐",
              "url": "/mythos/babylonian/deities/ishtar.html"
            }
          ],
          "mythicalOrigins": "Babylonian astrology originated in the observation of celestial omens for predicting the fate of kingdoms and rulers. The zodiac division into twelve signs developed in Mesopotamia, where astronomy and astrology formed a unified discipline for understanding cosmic order.",
          "textReferences": [
            {
              "text": "Enūma Anu Enlil",
              "passage": "Complete compendium",
              "context": "70 tablets of celestial omens correlating sky phenomena with earthly events",
              "corpusUrl": "/corpus-search.html?term=enuma+anu+enlil"
            },
            {
              "text": "Mul.Apin",
              "passage": "Complete text",
              "context": "Babylonian astronomical compendium listing stars, constellations, and planets",
              "corpusUrl": "/corpus-search.html?term=mul+apin"
            }
          ],
          "symbolism": "The Babylonians saw celestial bodies as manifestations of divine will. The movements of planets represented the actions and intentions of gods, making the sky a divine script revealing cosmic intentions to those trained to read it.",
          "culturalSignificance": "Babylonian astrology provided the foundation for all subsequent Western astrological traditions. The zodiac, planetary associations, and concept of celestial influence on earthly events originated in Mesopotamia and spread throughout the ancient world."
        },
        {
          "mythology": "greek",
          "usage": "Following Alexander the Great's conquests, Babylonian astronomical knowledge merged with Greek philosophy, Egyptian mysticism, and Persian cosmology (c. 300 BCE - 300 CE). This Hellenistic synthesis produced horoscopic astrology—birth chart interpretation for individuals—including the zodiac signs, planetary rulers, houses, and aspects still used today.",
          "associatedDeities": [
            {
              "id": "zeus",
              "name": "Zeus/Jupiter",
              "type": "deity",
              "mythology": "greek",
              "icon": "⚡",
              "url": "/mythos/greek/deities/zeus.html"
            },
            {
              "id": "aphrodite",
              "name": "Aphrodite/Venus",
              "type": "deity",
              "mythology": "greek",
              "icon": "💗",
              "url": "/mythos/greek/deities/aphrodite.html"
            },
            {
              "id": "hermes",
              "name": "Hermes/Mercury",
              "type": "deity",
              "mythology": "greek",
              "icon": "☿",
              "url": "/mythos/greek/deities/hermes.html"
            },
            {
              "id": "ares",
              "name": "Ares/Mars",
              "type": "deity",
              "mythology": "greek",
              "icon": "⚔️",
              "url": "/mythos/roman/deities/mars.html"
            }
          ],
          "mythicalOrigins": "Greek astrology integrated Babylonian celestial science with Platonic philosophy, seeing the cosmos as an ordered, ensouled whole. Planetary gods represented archetypal principles operating at both cosmic and personal levels.",
          "textReferences": [
            {
              "text": "Tetrabiblos",
              "author": "Ptolemy",
              "passage": "Complete work",
              "context": "2nd century CE systematization of astrological doctrine, foundational to Western astrology",
              "corpusUrl": "/corpus-search.html?term=ptolemy+tetrabiblos"
            }
          ],
          "symbolism": "The cosmos as a living, ordered whole where planetary movements reflect divine intelligence. The individual soul descends through planetary spheres, acquiring characteristics from each, making the birth chart a map of the soul's cosmic journey.",
          "culturalSignificance": "Hellenistic astrology transformed the practice from omen-reading for kings to personal divination for individuals. This democratization made astrology accessible to all social classes and established it as a respected intellectual discipline taught alongside philosophy and medicine."
        },
        {
          "mythology": "hindu",
          "usage": "Jyotisha (Hindu astrology) uses the sidereal zodiac aligned to actual constellations, accounting for precession of the equinoxes. It emphasizes the Moon and Ascendant over the Sun, uses 27-28 lunar mansions (Nakshatras), employs the Dasha system of planetary periods, and integrates concepts of karma and spiritual evolution. Used for determining auspicious timing (muhurta) for important life events.",
          "associatedDeities": [
            {
              "id": "surya",
              "name": "Surya",
              "type": "deity",
              "mythology": "hindu",
              "icon": "☀️",
              "url": "/mythos/hindu/deities/surya.html"
            },
            {
              "id": "chandra",
              "name": "Chandra",
              "type": "deity",
              "mythology": "hindu",
              "icon": "🌙",
              "url": "/mythos/hindu/deities/chandra.html"
            }
          ],
          "mythicalOrigins": "Vedic astrology traces to the Vedas (c. 1500 BCE), where astronomy and divine timing were crucial for ritual performance. Jyotisha means 'science of light,' viewing celestial bodies as manifestations of divine intelligence guiding human destiny.",
          "textReferences": [
            {
              "text": "Brihat Parashara Hora Shastra",
              "author": "Parashara",
              "passage": "Complete text",
              "context": "Foundational text of Vedic astrology detailing planetary significations, house meanings, and predictive techniques",
              "corpusUrl": "/corpus-search.html?term=parashara+hora+shastra"
            }
          ],
          "symbolism": "Planets as grahas (seizers) that hold karma and influence the soul's evolution. The birth chart reveals one's prarabdha karma (destiny to be experienced this lifetime) and provides guidance for spiritual practice and auspicious timing.",
          "culturalSignificance": "Jyotisha remains central to Hindu culture, consulted for marriage matching, naming ceremonies, business ventures, and religious rituals. It forms one of the six Vedangas (limbs of the Vedas), considered essential sacred knowledge."
        }
      ],
      "relatedEntities": {
        "practices": [
          {
            "id": "tarot",
            "name": "Tarot",
            "type": "magic",
            "mythology": "universal",
            "icon": "🃏",
            "url": "/magic/divination/tarot.html"
          },
          {
            "id": "i-ching",
            "name": "I Ching",
            "type": "magic",
            "mythology": "chinese",
            "icon": "☯",
            "url": "/magic/divination/i-ching.html"
          },
          {
            "id": "geomancy",
            "name": "Geomancy",
            "type": "magic",
            "mythology": "arabic",
            "icon": "🌍",
            "url": "/magic/divination/geomancy.html"
          }
        ],
        "texts": [
          {
            "id": "picatrix",
            "name": "Picatrix",
            "type": "magic",
            "mythology": "arabic",
            "icon": "📖",
            "url": "/magic/texts/picatrix.html"
          }
        ],
        "concepts": [
          {
            "id": "hermetic-principle",
            "name": "As Above, So Below",
            "type": "concept",
            "mythology": "hermetic",
            "icon": "🜏",
            "url": "/concepts/hermetic-principles.html"
          },
          {
            "id": "macrocosm-microcosm",
            "name": "Macrocosm-Microcosm",
            "type": "concept",
            "mythology": "hermetic",
            "icon": "🌌",
            "url": "/concepts/macrocosm-microcosm.html"
          }
        ]
      },
      "archetypes": [
        {
          "category": "sage-wisdom",
          "score": 75,
          "strength": "strong",
          "analysis": "Astrology embodies the Sage archetype's quest for cosmic wisdom and understanding of universal patterns. The astrologer as wise counselor interprets celestial signs to guide others on their life paths."
        },
        {
          "category": "order-from-chaos",
          "score": 80,
          "strength": "strong",
          "analysis": "The practice imposes meaningful order on the apparent chaos of existence by mapping correspondences between celestial and terrestrial realms, creating a comprehensible cosmic structure."
        },
        {
          "category": "cycles-and-seasons",
          "score": 85,
          "strength": "strong",
          "analysis": "Astrology fundamentally concerns cyclical patterns—planetary orbits, seasonal changes, life phases—reflecting the universal archetype of eternal return and rhythmic transformation."
        }
      ],
      "sources": [
        {
          "text": "Tetrabiblos",
          "author": "Claudius Ptolemy",
          "passage": "Complete work",
          "mythology": "greek",
          "date": "c. 160 CE",
          "corpusUrl": "/corpus-search.html?term=ptolemy+tetrabiblos"
        },
        {
          "text": "The Astrology of Personality",
          "author": "Dane Rudhyar",
          "mythology": "modern-western",
          "date": "1936",
          "type": "modern-scholarship"
        },
        {
          "text": "Saturn: A New Look at an Old Devil",
          "author": "Liz Greene",
          "mythology": "modern-western",
          "date": "1976",
          "type": "modern-scholarship"
        },
        {
          "text": "Astrology, Psychology, and the Four Elements",
          "author": "Stephen Arroyo",
          "mythology": "modern-western",
          "date": "1975",
          "type": "modern-scholarship"
        },
        {
          "text": "Planets in Transit",
          "author": "Robert Hand",
          "mythology": "modern-western",
          "date": "1976",
          "type": "modern-scholarship"
        },
        {
          "text": "A History of Western Astrology",
          "author": "Nicholas Campion",
          "mythology": "academic",
          "date": "2008-2009",
          "type": "modern-scholarship"
        }
      ],
      "linguistic": {
        "originalName": "αστρολογία",
        "originalScript": "ancient-greek",
        "transliteration": "astrologia",
        "pronunciation": "/æstrɒlədʒi/",
        "etymology": {
          "rootLanguage": "Ancient Greek",
          "meaning": "Study of stars",
          "derivation": "From 'astron' (star) + 'logia' (study/discourse)"
        },
        "cognates": [
          {
            "language": "Latin",
            "term": "astrologia",
            "script": "astrologia"
          },
          {
            "language": "Sanskrit",
            "term": "ज्योतिष",
            "script": "jyotisha",
            "meaning": "Science of light"
          },
          {
            "language": "Arabic",
            "term": "علم التنجيم",
            "script": "'ilm al-tanjīm",
            "meaning": "Science of the stars"
          },
          {
            "language": "Chinese",
            "term": "占星術",
            "script": "zhānxīngshù",
            "meaning": "Star divination technique"
          }
        ],
        "languageCode": "grc"
      },
      "geographical": {
        "region": "Mesopotamia (origin)",
        "culturalArea": "Global (now practiced worldwide)",
        "originPoint": {
          "name": "Mesopotamia/Babylonia",
          "coordinates": {
            "latitude": 32.5,
            "longitude": 44.4,
            "accuracy": "approximate"
          }
        },
        "modernCountries": [
          "Global practice",
          "Iraq (historical origin)",
          "India (Vedic tradition)",
          "China (Chinese astrology)",
          "Western world (tropical astrology)"
        ]
      },
      "temporal": {
        "timelinePosition": "Ancient",
        "culturalPeriod": "Bronze Age Mesopotamia (earliest), continues to present",
        "firstAttestation": {
          "date": {
            "year": -1600,
            "circa": true,
            "uncertainty": 100,
            "display": "c. 1600 BCE",
            "confidence": "probable"
          },
          "source": "Enūma Anu Enlil",
          "type": "literary"
        },
        "historicalDate": {
          "start": {
            "year": -3000,
            "circa": true,
            "uncertainty": 500,
            "display": "c. 3000 BCE"
          },
          "end": {
            "year": 2025,
            "circa": false,
            "display": "Present"
          },
          "display": "c. 3000 BCE - Present"
        }
      },
      "searchTerms": [
        "astrology",
        "babylonian",
        "greek",
        "hindu",
        "chinese",
        "universal",
        "divination",
        "celestial",
        "zodiac",
        "planets",
        "birth-chart",
        "horoscope",
        "natal-astrology",
        "predictive",
        "hermetic-principle",
        "as-above-so-below",
        "αστρολογία",
        "astrologia",
        "magic"
      ],
      "displayName": "Astrology",
      "mythology": "babylonian",
      "visibility": "public",
      "status": "published",
      "views": 0,
      "likes": 0,
      "schemaVersion": "2.0",
      "completeness": 0
    },
    {
      "id": "dionysian-rites",
      "type": "magic",
      "name": "Dionysian Mysteries - Greek Mythology",
      "icon": "🍷",
      "mythologies": [
        "greek"
      ],
      "primaryMythology": "greek",
      "shortDescription": "",
      "fullDescription": "The Dionysian Mysteries\nwere secret religious rites dedicated to Dionysus, god of wine, fertility, and ecstatic liberation.\nThrough ritual intoxication, frenzied dance, and theatrical performance, initiates sought divine madness that dissolved boundaries between\nhuman and divine, civilization and nature, order and chaos.\n\nSacred wine was central to Dionysian worship, representing the god's blood and divine essence. Ritual intoxication lowered inhibitions and opened participants to ecstatic experience and divine possession.\n\nSymbolism: Liberation, transformation, divine communion",
      "tags": [
        "dionysian-rites",
        "greek"
      ],
      "colors": {
        "primary": "#E67E22",
        "secondary": "#F39C12"
      },
      "linguistic": {
        "originalName": "",
        "originalScript": "greek",
        "transliteration": "Dionysian Mysteries - Greek Mythology",
        "pronunciation": "",
        "languageCode": "grc",
        "etymology": {
          "rootLanguage": "Ancient Greek",
          "meaning": "",
          "derivation": ""
        }
      },
      "geographical": {
        "primaryLocation": {
          "name": "",
          "coordinates": {
            "latitude": 38,
            "longitude": 23,
            "accuracy": "general_area"
          },
          "type": "temple",
          "description": "",
          "significance": ""
        },
        "region": "Mediterranean",
        "culturalArea": "Ancient Greece",
        "modernCountries": [
          "Greece"
        ]
      },
      "temporal": {
        "mythologicalDate": {
          "display": "Mythological Age"
        },
        "historicalDate": {
          "display": "c. 800 BCE - 400 CE"
        },
        "firstAttestation": {
          "date": {
            "year": -800,
            "circa": true,
            "display": "c. 800 BCE"
          },
          "source": "Homer",
          "type": "literary",
          "confidence": "probable"
        },
        "culturalPeriod": "Classical Period"
      },
      "cultural": {
        "socialRole": ""
      },
      "relatedEntities": {
        "deities": [
          {
            "id": "dionysus",
            "name": "Dionysus"
          },
          {
            "id": "zeus",
            "name": "Zeus Father"
          }
        ]
      },
      "metadata": {
        "created": "2025-12-13T09:03:11.299Z",
        "lastModified": "2025-12-13T09:03:11.299Z",
        "version": "2.0",
        "completeness": 50,
        "migratedFrom": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\greek\\rituals\\dionysian-rites.html"
      },
      "searchTerms": [
        "dionysian-rites",
        "dionysian mysteries - greek mythology",
        "dionysian",
        "mysteries",
        "-",
        "greek",
        "mythology",
        "magic"
      ],
      "displayName": "Dionysian Mysteries - Greek Mythology",
      "category": "magic",
      "mythology": "greek",
      "visibility": "public",
      "status": "published",
      "views": 0,
      "likes": 0,
      "schemaVersion": "2.0",
      "completeness": 50
    },
    {
      "id": "eleusinian-mysteries",
      "type": "magic",
      "name": "Eleusinian Mysteries - Greek Mythology",
      "icon": "🌸",
      "mythologies": [
        "greek"
      ],
      "primaryMythology": "greek",
      "shortDescription": "",
      "fullDescription": "The Eleusinian Mysteries\nwere the most famous and revered secret religious rites of ancient Greece, celebrated for nearly two millennia at Eleusis near Athens.\nDedicated to Demeter and Persephone, these mystery initiations\npromised initiates (mystai) a blessed afterlife and revealed secret knowledge about death, rebirth, and the cycle of life.\nThe rites remained so sacred that their exact content was never fully disclosed, protected by oath of secrecy under penalty of death.\n\nHades, god of the underworld, seized Persephone (Kore) while she gathered flowers in a meadow. The earth opened and swallowed her into the realm of the dead.\n\nLocation: Nysa meadow (various traditions)",
      "tags": [
        "eleusinian-mysteries",
        "greek"
      ],
      "colors": {
        "primary": "#E67E22",
        "secondary": "#F39C12"
      },
      "linguistic": {
        "originalName": "",
        "originalScript": "greek",
        "transliteration": "Eleusinian Mysteries - Greek Mythology",
        "pronunciation": "",
        "languageCode": "grc",
        "etymology": {
          "rootLanguage": "Ancient Greek",
          "meaning": "",
          "derivation": ""
        }
      },
      "geographical": {
        "primaryLocation": {
          "name": "",
          "coordinates": {
            "latitude": 38,
            "longitude": 23,
            "accuracy": "general_area"
          },
          "type": "temple",
          "description": "",
          "significance": ""
        },
        "region": "Mediterranean",
        "culturalArea": "Ancient Greece",
        "modernCountries": [
          "Greece"
        ]
      },
      "temporal": {
        "mythologicalDate": {
          "display": "Mythological Age"
        },
        "historicalDate": {
          "display": "c. 800 BCE - 400 CE"
        },
        "firstAttestation": {
          "date": {
            "year": -800,
            "circa": true,
            "display": "c. 800 BCE"
          },
          "source": "Homer",
          "type": "literary",
          "confidence": "probable"
        },
        "culturalPeriod": "Classical Period"
      },
      "cultural": {
        "socialRole": ""
      },
      "relatedEntities": {
        "deities": [
          {
            "id": "demeter",
            "name": "Demeter"
          },
          {
            "id": "persephone",
            "name": "Persephone"
          }
        ],
        "places": [
          {
            "id": "underworld",
            "name": "The Underworld"
          }
        ]
      },
      "metadata": {
        "created": "2025-12-13T09:03:11.316Z",
        "lastModified": "2025-12-13T09:03:11.316Z",
        "version": "2.0",
        "completeness": 50,
        "migratedFrom": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\greek\\rituals\\eleusinian-mysteries.html"
      },
      "searchTerms": [
        "eleusinian-mysteries",
        "eleusinian mysteries - greek mythology",
        "eleusinian",
        "mysteries",
        "-",
        "greek",
        "mythology",
        "magic"
      ],
      "displayName": "Eleusinian Mysteries - Greek Mythology",
      "category": "magic",
      "mythology": "greek",
      "visibility": "public",
      "status": "published",
      "views": 0,
      "likes": 0,
      "schemaVersion": "2.0",
      "completeness": 50
    },
    {
      "id": "greek-offerings",
      "type": "magic",
      "name": "Greek Sacrificial Offerings",
      "icon": "🐂",
      "slug": "greek-offerings",
      "mythologies": [
        "greek"
      ],
      "primaryMythology": "greek",
      "shortDescription": "Traditional Greek religious practice of offering animals, food, and goods to gods as acts of worship, supplication, and thanksgiving",
      "fullDescription": "Sacrifice (thysia) was the central ritual act of ancient Greek religion, forming the primary means of communication between mortals and gods. Greek offerings ranged from grand public hecatombs (sacrifices of 100 cattle) to simple household libations of wine or oil. Animal sacrifice typically involved procession, purification, prayer, slaughter at an altar, and ritual burning of select portions for the gods while the community shared the meat in sacred feasting. This created a reciprocal relationship—gods received honor, smoke, and divine portions, while humans received divine favor and communal meals. Different gods received different offerings: Olympian deities received animals slaughtered facing the sky with burnt offerings rising upward, while chthonic (underworld) deities received holocausts (entirely burned offerings) or blood poured into the earth. Beyond animals, Greeks offered bloodless sacrifices of grain, cakes, fruits, flowers, incense, and libations of wine, milk, honey, oil, or water. Every significant event—battles, voyages, marriages, births, deaths, agricultural cycles, civic meetings—was accompanied by appropriate sacrifices that maintained cosmic order and divine favor.",
      "category": "magic",
      "subCategory": "sacrifice",
      "method": "offering",
      "colors": {
        "primary": "#8B4513",
        "secondary": "#DEB887",
        "primaryRgb": "139, 69, 19"
      },
      "tags": [
        "sacrifice",
        "offerings",
        "worship",
        "ritual-slaughter",
        "libation",
        "bloodless-sacrifice",
        "hecatomb",
        "thysia",
        "altar",
        "reciprocity"
      ],
      "requirements": {
        "location": {
          "id": "altar",
          "name": "Altar (Bomos)",
          "type": "place",
          "description": "Sacred altar, either public temple altar or private household altar"
        },
        "timing": "Specific festivals for each deity, or as needed for private occasions",
        "practitioner": "Priests for public sacrifices, household heads for private rites, or professional sacrificers",
        "preparation": "Ritual purification, selection of unblemished animals, preparation of altar and sacred fire",
        "items": [
          {
            "id": "sacrificial-animal",
            "name": "Sacrificial Animal",
            "description": "Unblemished animals appropriate to the deity (cattle, sheep, goats, pigs, birds)"
          },
          {
            "id": "sacrificial-knife",
            "name": "Sacrificial Knife (Machaira)",
            "description": "Ritual blade for slaughtering the victim"
          },
          {
            "id": "barley-groats",
            "name": "Barley Groats",
            "description": "Sacred grain scattered over the altar and victim"
          },
          {
            "id": "libation-vessels",
            "name": "Libation Vessels",
            "description": "Special containers for pouring liquid offerings"
          }
        ]
      },
      "steps": [
        {
          "order": 1,
          "action": "Procession",
          "description": "Ritual procession to the altar with the victim decorated with garlands, led by basket-bearer carrying sacred implements"
        },
        {
          "order": 2,
          "action": "Purification",
          "description": "Participants wash hands in lustral water (chernips); the altar is purified"
        },
        {
          "order": 3,
          "action": "Prayer and Invocation",
          "description": "Prayer to the deity stating the purpose of the sacrifice and requesting divine favor"
        },
        {
          "order": 4,
          "action": "Scattering Barley",
          "description": "Barley groats scattered over altar and victim, symbolizing shared participation"
        },
        {
          "order": 5,
          "action": "Taking of First Hair",
          "description": "Cutting hair from the victim's head and burning it as the first offering"
        },
        {
          "order": 6,
          "action": "Ritual Slaughter",
          "description": "Swift killing of the victim; women cry out (ololyge) to honor the moment"
        },
        {
          "order": 7,
          "action": "Blood Offering",
          "description": "Blood collected and poured on the altar or into the ground for chthonic deities"
        },
        {
          "order": 8,
          "action": "Butchering",
          "description": "Victim skinned and divided according to ritual prescription"
        },
        {
          "order": 9,
          "action": "Divine Portions",
          "description": "Thighbones wrapped in fat, along with other choice portions, burned for the gods"
        },
        {
          "order": 10,
          "action": "Libation",
          "description": "Wine poured on the burning offerings and altar"
        },
        {
          "order": 11,
          "action": "Communal Feast",
          "description": "Remaining meat roasted or boiled and shared among participants"
        }
      ],
      "effects": "Sacrifices maintained reciprocal relationship with the gods, securing divine favor, protection, and blessing. They marked transitions, sanctified agreements, celebrated victories, and sought divine aid. The shared feast created social cohesion and reinforced community bonds. Proper sacrifice ensured cosmic order (themis) and prevented divine anger. For individuals, offerings brought peace of mind, answered prayers, and fulfilled religious obligations.",
      "warnings": "Improperly performed sacrifices or violations of ritual purity could anger the gods. Sacrificing the wrong animal or at the wrong time was sacrilege. Omens were carefully watched during sacrifice—reluctance of the victim, improper burning, or inauspicious signs required additional sacrifices or indicated divine displeasure.",
      "mythologyContexts": [
        {
          "mythology": "greek",
          "usage": "Sacrifice permeated every aspect of Greek life from state ceremonies to household worship. No significant action was undertaken without sacrificial offerings. The practice defined the relationship between human and divine realms, establishing boundaries and communication channels. Greek religion was fundamentally a 'do ut des' (I give so that you will give) system where sacrifices purchased divine goodwill.",
          "associatedDeities": [
            {
              "id": "zeus",
              "name": "Zeus",
              "type": "deity",
              "mythology": "greek",
              "icon": "⚡",
              "url": "/mythos/greek/deities/zeus.html"
            },
            {
              "id": "hera",
              "name": "Hera",
              "type": "deity",
              "mythology": "greek",
              "icon": "👑",
              "url": "/mythos/greek/deities/hera.html"
            },
            {
              "id": "apollo",
              "name": "Apollo",
              "type": "deity",
              "mythology": "greek",
              "icon": "☀️",
              "url": "/mythos/greek/deities/apollo.html"
            },
            {
              "id": "athena",
              "name": "Athena",
              "type": "deity",
              "mythology": "greek",
              "icon": "🦉",
              "url": "/mythos/greek/deities/athena.html"
            }
          ],
          "mythicalOrigins": "The first sacrifice was performed by Prometheus, who deceptively divided the slaughtered ox to trick Zeus, giving humans the meat while burning only bones and fat for the gods. Zeus accepted this division, establishing the pattern for all future sacrifices. Different myths explain offerings to specific deities.",
          "textReferences": [
            {
              "text": "Hesiod's Theogony",
              "passage": "Lines 535-557",
              "context": "Prometheus establishes sacrificial division between gods and humans",
              "corpusUrl": "/corpus-search.html?term=hesiod+theogony+prometheus+sacrifice"
            },
            {
              "text": "Homer's Odyssey",
              "passage": "Book 3, lines 404-463",
              "context": "Detailed description of sacrifice to Athena at Pylos",
              "corpusUrl": "/corpus-search.html?term=odyssey+sacrifice+nestor"
            },
            {
              "text": "Homer's Iliad",
              "passage": "Book 1, lines 447-474",
              "context": "Sacrifice and feast for Apollo to end the plague",
              "corpusUrl": "/corpus-search.html?term=iliad+sacrifice+apollo"
            }
          ],
          "symbolism": "Sacrifice symbolized the fundamental separation and connection between mortals and immortals. The rising smoke carried prayers and honor to Olympus while the shared meat bound the human community. The practice affirmed mortality (humans eat perishable meat, gods receive imperishable honor) while creating communion across the divine-human boundary. Blood represented life force connecting earth, humans, and heaven.",
          "culturalSignificance": "Greek sacrifice was not penitential or focused on sin but celebratory and relational. It structured time through festival calendars, distributed meat in societies where it was rare, reinforced social hierarchies (who sacrificed what, and who received which portions), and created shared religious identity. The practice continued into Roman times and only ended with the Christianization of the Empire."
        }
      ],
      "relatedEntities": {
        "deities": [
          {
            "id": "zeus",
            "name": "Zeus",
            "type": "deity",
            "mythology": "greek",
            "icon": "⚡",
            "url": "/mythos/greek/deities/zeus.html"
          },
          {
            "id": "apollo",
            "name": "Apollo",
            "type": "deity",
            "mythology": "greek",
            "icon": "☀️",
            "url": "/mythos/greek/deities/apollo.html"
          },
          {
            "id": "athena",
            "name": "Athena",
            "type": "deity",
            "mythology": "greek",
            "icon": "🦉",
            "url": "/mythos/greek/deities/athena.html"
          }
        ],
        "places": [
          {
            "id": "delphi",
            "name": "Delphi",
            "type": "place",
            "mythology": "greek",
            "icon": "🏛️",
            "url": "/mythos/greek/places/delphi.html"
          },
          {
            "id": "olympia",
            "name": "Olympia",
            "type": "place",
            "mythology": "greek",
            "icon": "🏛️",
            "url": "/mythos/greek/places/olympia.html"
          }
        ],
        "items": [
          {
            "id": "altar",
            "name": "Altar",
            "type": "item",
            "mythology": "greek",
            "icon": "🔥",
            "url": "/mythos/greek/items/altar.html"
          }
        ],
        "concepts": [
          {
            "id": "reciprocity",
            "name": "Divine Reciprocity",
            "type": "concept",
            "mythology": "universal",
            "icon": "⚖️",
            "url": "/shared/concepts/reciprocity.html"
          },
          {
            "id": "ritual-purity",
            "name": "Ritual Purity",
            "type": "concept",
            "mythology": "greek",
            "icon": "💧",
            "url": "/mythos/greek/concepts/ritual-purity.html"
          }
        ]
      },
      "archetypes": [
        {
          "category": "sacrifice-ritual",
          "score": 95,
          "strength": "strong",
          "analysis": "Greek offerings represent the quintessential sacrificial system—giving up something valuable to the divine realm in exchange for favor, blessing, and cosmic order. The practice embodies the universal principle of sacred exchange between human and divine."
        },
        {
          "category": "cosmic-order",
          "score": 70,
          "strength": "moderate",
          "analysis": "Regular sacrifices maintained cosmic order (themis) and the proper relationship between mortal and immortal realms. Neglecting sacrifices risked divine anger and cosmic disruption."
        },
        {
          "category": "communal-feast",
          "score": 80,
          "strength": "strong",
          "analysis": "Sacrificial feasts created social cohesion, reinforced community bonds, and established shared identity through collective participation in sacred meals that honored the gods."
        }
      ],
      "sources": [
        {
          "text": "Hesiod's Theogony",
          "author": "Hesiod",
          "passage": "Lines 535-557",
          "mythology": "greek",
          "corpusUrl": "/corpus-search.html?term=hesiod+theogony+prometheus"
        },
        {
          "text": "Homer's Odyssey",
          "author": "Homer",
          "passage": "Book 3.404-463",
          "mythology": "greek",
          "corpusUrl": "/corpus-search.html?term=odyssey+sacrifice"
        },
        {
          "text": "Greek Religion",
          "author": "Walter Burkert",
          "mythology": "greek",
          "type": "modern-scholarship"
        },
        {
          "text": "The Sacrificial Rituals of Greek Hero-Cults",
          "author": "Gunnel Ekroth",
          "mythology": "greek",
          "type": "modern-scholarship"
        }
      ],
      "linguistic": {
        "originalName": "Greek Sacrificial Offerings",
        "transliteration": "Greek Sacrificial Offerings",
        "needsResearch": true,
        "originalScript": "ancient-greek-polytonic",
        "etymology": {
          "rootLanguage": "Ancient Greek",
          "meaning": "Requires detailed research",
          "derivation": "Greek entity requiring etymological analysis"
        },
        "cognates": [
          {
            "language": "Latin",
            "term": "Greek Sacrificial Offerings",
            "notes": "Latin borrowing from Greek"
          },
          {
            "language": "English",
            "term": "greek sacrificial offerings",
            "notes": "English borrowing from Greek via Latin"
          },
          {
            "language": "Modern Greek",
            "term": "Greek Sacrificial Offerings",
            "notes": "Modern Greek descendant"
          }
        ]
      },
      "geographical": {
        "region": "Greece",
        "culturalArea": "Hellenic World"
      },
      "temporal": {
        "firstAttestation": {
          "date": {
            "year": -750,
            "circa": true,
            "uncertainty": 100,
            "display": "c. 750 BCE",
            "confidence": "speculative"
          },
          "type": "literary",
          "description": "Estimated based on mythology literary tradition",
          "needsResearch": true
        },
        "historicalDate": {
          "start": {
            "year": -800,
            "circa": true,
            "uncertainty": 200,
            "display": "c. 800 BCE"
          },
          "end": {
            "year": 400,
            "circa": true,
            "uncertainty": 100,
            "display": "c. 400 CE"
          },
          "display": "800 BCE - 400 CE",
          "needsResearch": true
        },
        "timelinePosition": "Archaic Greece (800-480 BCE)"
      },
      "_file": "data\\entities\\magic\\greek-offerings.json",
      "_category": "magic",
      "searchTerms": [
        "greek-offerings",
        "greek sacrificial offerings",
        "greek",
        "sacrificial",
        "offerings",
        "sacrifice",
        "worship",
        "ritual-slaughter",
        "libation",
        "bloodless-sacrifice",
        "hecatomb",
        "thysia",
        "altar",
        "reciprocity",
        "Greek Sacrificial Offerings",
        "magic"
      ],
      "displayName": "Greek Sacrificial Offerings",
      "mythology": "greek",
      "visibility": "public",
      "status": "published",
      "views": 0,
      "likes": 0,
      "schemaVersion": "2.0",
      "completeness": 0
    },
    {
      "id": "necromancy",
      "type": "magic",
      "name": "Necromancy",
      "icon": "💀",
      "slug": "necromancy",
      "mythologies": [
        "greek",
        "medieval-european",
        "universal"
      ],
      "primaryMythology": "greek",
      "shortDescription": "Death magic tradition focused on communication with spirits of the dead, divination through corpses, and mediation between the living and deceased realms, ranging from ancient Greek nekyia to medieval grimoire necromancy",
      "fullDescription": "Necromancy (from Greek nekros 'dead' and manteia 'divination') is the magical tradition of communication with the spirits of the dead for purposes of divination, knowledge acquisition, or spirit commanding. Though popularly associated with raising corpses, historical necromancy primarily involved spirit communication, consultation with the dead for hidden knowledge, and psychopomp work mediating between worlds. Ancient Greek nekromanteia included ritual journeys to the underworld (as in Homer's Odyssey Book 11) and consultation with shades at necromantic oracles. Medieval European necromancy, preserved in grimoires like the Munich Handbook, developed elaborate ceremonial techniques involving circles, conjurations, and timing based on planetary hours. Across cultures, necromancy rests on the philosophical premise that death is not absolute annihilation but transformation—the dead retain knowledge, consciousness, and the ability to communicate with properly prepared practitioners. Modern necromantic practice emphasizes ethical ancestor work, psychopomp service guiding the dead, and spirit communication rather than coercive commanding or corpse manipulation.",
      "category": "magic",
      "subCategory": "death-magic",
      "practiceType": "spirit-communication",
      "method": "ritual-evocation",
      "colors": {
        "primary": "#000000",
        "secondary": "#424242",
        "primaryRgb": "0, 0, 0"
      },
      "tags": [
        "necromancy",
        "death-magic",
        "spirit-communication",
        "divination",
        "ancestor-work",
        "psychopomp",
        "underworld",
        "shades",
        "medieval-grimoire",
        "greek-magic"
      ],
      "traditionComponents": {
        "practiceAreas": [
          "Communication with spirits of the dead",
          "Divination via deceased spirits",
          "Psychopomp work (guiding the dead)",
          "Ancestor veneration and consultation",
          "Spirit evocation and commanding",
          "Underworld journeying",
          "Grave and crossroads magic"
        ],
        "keyPractices": [
          "Nekyia (ritual descent to underworld)",
          "Spirit evocation at graveyards",
          "Offerings to the dead",
          "Protection circles and banishing",
          "Timing by moon phases and midnight hours",
          "Use of corpse materials (historical)",
          "Crossroads workings"
        ],
        "ritualStructure": [
          "Preparation and purification",
          "Circle casting and protection",
          "Offerings to chthonic deities and spirits",
          "Evocation of specific deceased spirits",
          "Communication and questioning",
          "Dismissal and banishing",
          "Grounding and closure"
        ],
        "requiredKnowledge": [
          "Understanding of death cosmology",
          "Protection techniques",
          "Spirit communication protocols",
          "Offerings appropriate to the dead",
          "Banishing and closing procedures",
          "Psychological resilience",
          "Cultural death practices and taboos"
        ]
      },
      "historicalDevelopment": {
        "origins": "Necromancy appears in ancient civilizations worldwide. Greek nekromanteia (divination by the dead) is documented from Homeric times, with oracles of the dead at sites like Acheron. Ancient Mesopotamian, Egyptian, and other cultures practiced forms of ancestor communication and spirit consultation.",
        "classicalPeriod": "Homer's Odyssey Book 11 (c. 8th century BCE) depicts Odysseus' nekyia—ritual journey to Hades to consult the prophet Tiresias. Greek magical papyri contain necromantic spells. Romans consulted deceased spirits at specific locations and times.",
        "medievalDevelopment": "Medieval European necromancy flourished despite Church condemnation, preserved in grimoires like the Munich Handbook (15th century). This ceremonial necromancy involved elaborate rituals, circles, divine names, and timing by planetary hours to compel deceased spirits to appear and answer questions.",
        "earlyModern": "Renaissance magic distinguished necromancy (communication with dead) from goetia (demon evocation), though the terms often blurred. Necromancy was considered the darkest art due to Church association with demonic commerce.",
        "modernRevival": "Contemporary necromancy emphasizes ethical practice: ancestor veneration, psychopomp work helping spirits transition, and respectful spirit communication. Influenced by spiritism, modern witchcraft, and reconstructed practices, it distances itself from corpse desecration and coercive methods."
      },
      "corePhilosophy": {
        "foundationalBeliefs": [
          "Death transforms but does not annihilate consciousness",
          "The dead retain knowledge and awareness",
          "The boundary between living and dead is permeable",
          "Necromancer serves as mediator between worlds",
          "Proper ritual and timing enable communication",
          "Respect and offerings maintain relationships with the dead"
        ],
        "ethicalPrinciples": [
          "Respect for the deceased",
          "Cultural sensitivity regarding death practices",
          "Protection of practitioner and spirits",
          "Consent and ethical communication",
          "Service as psychopomp when needed",
          "Avoidance of coercion or binding (modern ethics)"
        ],
        "cosmology": "Necromancy presupposes a multileveled cosmos where the realm of the dead exists parallel to or beneath the living world. The dead inhabit the underworld, astral realms, or liminal spaces, accessible through specific locations (graveyards, crossroads), times (midnight, dark moon), and ritual procedures. Chthonic deities govern these realms and must be propitiated."
      },
      "requirements": {
        "location": {
          "id": "graveyard-crossroads",
          "name": "Graveyard, Crossroads, or Private Ritual Space",
          "type": "place",
          "description": "Traditionally graveyards, crossroads (liminal spaces), or places associated with the dead; modern practice may use private ritual space with ancestor altar"
        },
        "timing": "Midnight, dark moon phases, Samhain/Halloween, or days associated with the dead in various traditions; planetary hours of Saturn (traditional grimoire timing)",
        "practitioner": "Requires strong psychological boundaries, experience with spirit work, protection skills, and emotional stability; not recommended for beginners or those with mental health vulnerabilities",
        "preparation": "Study of death cosmology, protection rituals, spirit communication basics, offerings research, psychological preparation, grounding techniques, understanding of cultural death taboos",
        "items": [
          {
            "id": "protection-circle",
            "name": "Protection Circle or Ritual Space",
            "description": "Circle inscribed or visualized for protection during spirit communication"
          },
          {
            "id": "offerings",
            "name": "Offerings for the Dead",
            "description": "Traditional offerings: libations (wine, milk, honey), food, incense, flowers, coins"
          },
          {
            "id": "divination-tools",
            "name": "Divination or Communication Tools",
            "description": "May include mirror, bowl of water, pendulum, spirit board, or other communication devices"
          },
          {
            "id": "banishing-tools",
            "name": "Banishing Materials",
            "description": "Salt, protective herbs, dismissal incantations, or other closing materials"
          },
          {
            "id": "black-candles",
            "name": "Black or White Candles",
            "description": "Candles for ritual illumination and spirit attraction"
          },
          {
            "id": "grimoire-text",
            "name": "Grimoire or Ritual Text (historical)",
            "description": "Medieval necromancers used specific grimoire texts with evocation formulas"
          }
        ]
      },
      "effects": "Successful necromantic practice enables communication with deceased spirits for knowledge, guidance, or closure. Practitioners may receive information about past events, hidden matters, or personal guidance from ancestors. Psychopomp work helps earthbound spirits find peace and transition properly. The practice develops mediumistic abilities, strengthens boundaries between worlds, and deepens understanding of death and afterlife cosmology. Benefits include ancestral healing, recovery of lost knowledge, and service to both living and dead.",
      "warnings": "Necromancy carries significant psychological and spiritual risks. Practitioners must maintain strong energetic boundaries to avoid attachment by confused or malevolent spirits. The practice can attract unwanted entities if protection is insufficient. Psychological dangers include obsession with death, depression, or destabilization from contact with the deceased. Cultural appropriation concerns: respect cultural death taboos and practices. Never practice in intoxicated, emotionally unstable, or mentally unwell states. Avoid graveyards without permission and respect the dead. Modern ethical practice rejects corpse desecration, coercion of spirits, or harmful magic using the dead. Ensure thorough banishing and grounding after all workings. Those with trauma around death should approach cautiously or avoid entirely.",
      "modernPractice": {
        "currentStatus": "Active practice within modern witchcraft, chaos magic, and occult communities, emphasizing ethical spirit communication and ancestor work over coercive medieval methods",
        "practitioners": "Modern witches, spirit workers, mediums, psychopomps, and occultists interested in death magic and ancestor veneration",
        "adaptations": "Modern necromancy focuses on consensual spirit communication, ancestor healing, psychopomp service, and respectful offerings rather than commanding or corpse magic. Influenced by spiritism, modern witchcraft ethics, and cultural ancestor practices.",
        "communities": "Practiced within Pagan, witchcraft, and occult communities; death worker and psychopomp networks; ancestor reverence groups across cultures"
      },
      "mythologyContexts": [
        {
          "mythology": "greek",
          "usage": "Greek nekromanteia included oracles of the dead (nekyomanteion) where priests would facilitate communication with deceased spirits. Homer's Odyssey describes Odysseus performing nekyia—ritual summoning of the dead in the underworld with libations of milk, honey, wine, and blood to strengthen the shades so they could speak.",
          "associatedDeities": [
            {
              "id": "hades",
              "name": "Hades",
              "type": "deity",
              "mythology": "greek",
              "icon": "👑",
              "url": "/mythos/greek/deities/hades.html"
            },
            {
              "id": "persephone",
              "name": "Persephone",
              "type": "deity",
              "mythology": "greek",
              "icon": "🌺",
              "url": "/mythos/greek/deities/persephone.html"
            },
            {
              "id": "hecate",
              "name": "Hecate",
              "type": "deity",
              "mythology": "greek",
              "icon": "🔥",
              "url": "/mythos/greek/deities/hecate.html"
            },
            {
              "id": "hermes-psychopompos",
              "name": "Hermes Psychopompos",
              "type": "deity",
              "mythology": "greek",
              "icon": "🪶",
              "url": "/mythos/greek/deities/hermes.html"
            }
          ],
          "mythicalOrigins": "Greek tradition held that the dead retain consciousness in Hades but are weakened, requiring blood or libations to speak. Heroes like Odysseus and Orpheus journeyed to the underworld to consult or retrieve the dead.",
          "textReferences": [
            {
              "text": "The Odyssey",
              "author": "Homer",
              "passage": "Book 11 (Nekyia)",
              "context": "Odysseus performs ritual to summon and consult dead spirits including Tiresias",
              "corpusUrl": "/corpus-search.html?term=odyssey+nekyia"
            },
            {
              "text": "Greek Magical Papyri",
              "passage": "Various necromantic spells",
              "context": "Spells for summoning the dead and compelling spirits to reveal knowledge",
              "corpusUrl": "/corpus-search.html?term=pgm+necromancy"
            }
          ],
          "symbolism": "The nekyomanteion (oracle of the dead) represented the thin boundary between worlds. Rivers of the underworld (Styx, Acheron, Lethe) symbolized the crossing from life to death.",
          "culturalSignificance": "Greek necromancy was practiced at specific oracle sites and remained distinct from mystery religions, serving as consultation with ancestors and heroes for knowledge and prophecy."
        },
        {
          "mythology": "medieval-european",
          "usage": "Medieval grimoire necromancy involved elaborate rituals to summon spirits of the dead, requiring specific timing (planetary hours, midnight), protective circles, divine names, and conjurations. The Munich Handbook and similar texts provided detailed procedures for compelling deceased spirits to appear and answer questions.",
          "mythicalOrigins": "Medieval necromancy drew from Greco-Roman magic, Arabic magical texts, Christian demonology, and folk traditions, creating a hybrid ceremonial practice condemned by the Church as demonic.",
          "textReferences": [
            {
              "text": "Munich Handbook of Necromancy",
              "author": "Anonymous",
              "passage": "Complete grimoire",
              "context": "15th-century German grimoire with detailed necromantic rituals and spirit conjurations",
              "corpusUrl": "/corpus-search.html?term=munich+handbook+necromancy"
            },
            {
              "text": "Forbidden Rites: A Necromancer's Manual",
              "author": "Richard Kieckhefer (translator/editor)",
              "passage": "Complete text and analysis",
              "context": "Modern scholarly edition of the Munich Handbook with historical context",
              "corpusUrl": "/corpus-search.html?term=kieckhefer+forbidden+rites"
            }
          ],
          "symbolism": "Circles, divine names (often Christian angels and demons mixed), and ritual purity symbolized the necromancer's authority over spirits. The practice blurred boundaries between angelic theurgy and demonic goetia.",
          "culturalSignificance": "Medieval necromancy represented forbidden knowledge, practiced by renegade clergy and learned magicians despite Church prohibition. It influenced the development of ceremonial magic and grimoire traditions."
        }
      ],
      "relatedEntities": {
        "practices": [
          {
            "id": "goetia",
            "name": "Goetia",
            "type": "magic",
            "mythology": "medieval-european",
            "icon": "👹",
            "url": "/magic/traditions/goetia.html"
          },
          {
            "id": "spirit-communication",
            "name": "Spirit Communication",
            "type": "magic",
            "mythology": "universal",
            "icon": "👻",
            "url": "/magic/practices/spirit-communication.html"
          }
        ],
        "deities": [
          {
            "id": "hades",
            "name": "Hades",
            "type": "deity",
            "mythology": "greek",
            "icon": "👑",
            "url": "/mythos/greek/deities/hades.html"
          },
          {
            "id": "hecate",
            "name": "Hecate",
            "type": "deity",
            "mythology": "greek",
            "icon": "🔥",
            "url": "/mythos/greek/deities/hecate.html"
          },
          {
            "id": "persephone",
            "name": "Persephone",
            "type": "deity",
            "mythology": "greek",
            "icon": "🌺",
            "url": "/mythos/greek/deities/persephone.html"
          }
        ],
        "concepts": [
          {
            "id": "underworld",
            "name": "Underworld",
            "type": "concept",
            "mythology": "universal",
            "icon": "🌑",
            "url": "/concepts/underworld.html"
          },
          {
            "id": "psychopomp",
            "name": "Psychopomp",
            "type": "concept",
            "mythology": "universal",
            "icon": "🦋",
            "url": "/concepts/psychopomp.html"
          }
        ]
      },
      "archetypes": [
        {
          "category": "death-and-rebirth",
          "score": 95,
          "strength": "strong",
          "analysis": "Necromancy directly engages the death archetype, working at the boundary between life and death, transformation and dissolution. The practice embodies humanity's eternal question of what lies beyond death."
        },
        {
          "category": "shadow-work",
          "score": 90,
          "strength": "strong",
          "analysis": "Death magic confronts cultural shadows around mortality, forcing practitioners to face fears and taboos. Necromancy represents the shadow aspect of magic—forbidden, feared, yet containing profound wisdom."
        },
        {
          "category": "mediator-threshold",
          "score": 88,
          "strength": "strong",
          "analysis": "The necromancer serves as psychopomp and mediator, standing at the threshold between worlds, facilitating communication and transition between living and dead realms."
        }
      ],
      "sources": [
        {
          "text": "The Odyssey",
          "author": "Homer",
          "mythology": "greek",
          "date": "c. 8th century BCE",
          "type": "primary-text",
          "note": "Book 11: Nekyia, ritual consultation with the dead"
        },
        {
          "text": "Forbidden Rites: A Necromancer's Manual of the Fifteenth Century",
          "author": "Richard Kieckhefer (ed.)",
          "mythology": "medieval-european",
          "date": "1997",
          "type": "primary-text",
          "note": "Translation and analysis of the Munich Handbook"
        },
        {
          "text": "Greek Magical Papyri in Translation",
          "author": "Hans Dieter Betz (ed.)",
          "mythology": "greco-egyptian",
          "date": "1986",
          "type": "primary-text",
          "note": "Contains numerous necromantic spells from ancient Egypt"
        },
        {
          "text": "Communing with the Spirits: The Magical Practice of Necromancy",
          "author": "Martin Coleman",
          "mythology": "modern-occult",
          "date": "2011",
          "type": "modern-scholarship"
        },
        {
          "text": "Necromancy: A Practical Guide to Spirit Communication",
          "author": "Crystal Blanton",
          "mythology": "modern-pagan",
          "date": "2018",
          "type": "modern-scholarship"
        },
        {
          "text": "The Darker Side of Witchcraft: Essays on Necromancy",
          "author": "David Rankine",
          "mythology": "modern-occult",
          "date": "2011",
          "type": "modern-scholarship"
        },
        {
          "text": "Magic in the Ancient Greek World",
          "author": "Derek Collins",
          "mythology": "academic",
          "date": "2008",
          "type": "modern-scholarship",
          "note": "Scholarly analysis including Greek necromantic practices"
        },
        {
          "text": "Between the Living and the Dead: A Perspective on Witches and Seers",
          "author": "Éva Pócs",
          "mythology": "academic",
          "date": "1999",
          "type": "modern-scholarship",
          "note": "Anthropological study of necromantic traditions"
        }
      ],
      "linguistic": {
        "originalName": "Νεκρομαντεία",
        "originalScript": "ancient-greek",
        "transliteration": "nekromanteia",
        "pronunciation": "/ˈnekroʊmænsi/",
        "etymology": {
          "rootLanguage": "Ancient Greek",
          "meaning": "Divination by the dead",
          "derivation": "From 'nekros' (dead, corpse) + 'manteia' (divination, prophecy)"
        },
        "cognates": [
          {
            "language": "Latin",
            "term": "necromantia",
            "script": "necromantia",
            "meaning": "Divination through the dead"
          },
          {
            "language": "Medieval Latin",
            "term": "nigromantia",
            "script": "nigromantia",
            "meaning": "Black art (folk etymology from 'niger' = black)"
          }
        ],
        "languageCode": "grc"
      },
      "geographical": {
        "region": "Universal (practiced globally)",
        "culturalArea": "Ancient Greece, Medieval Europe, modern global occult communities",
        "originPoint": {
          "name": "Ancient Greece (documented tradition)",
          "coordinates": {
            "latitude": 39.0742,
            "longitude": 21.8243,
            "accuracy": "approximate"
          }
        },
        "modernCountries": [
          "Universal practice across cultures",
          "Greece (historical origin)",
          "Western occult communities (grimoire tradition)",
          "Global (modern revival)"
        ]
      },
      "temporal": {
        "timelinePosition": "Ancient to Modern",
        "culturalPeriod": "Homeric Greece through medieval period to modern revival",
        "firstAttestation": {
          "date": {
            "year": -800,
            "circa": true,
            "uncertainty": 100,
            "display": "c. 800 BCE",
            "confidence": "probable"
          },
          "source": "Homer's Odyssey",
          "type": "literary"
        },
        "historicalDate": {
          "start": {
            "year": -800,
            "circa": true,
            "uncertainty": 100,
            "display": "c. 800 BCE"
          },
          "end": {
            "year": 2025,
            "circa": false,
            "display": "Present"
          },
          "display": "c. 800 BCE - Present"
        }
      },
      "searchTerms": [
        "necromancy",
        "greek",
        "medieval-european",
        "universal",
        "death-magic",
        "spirit-communication",
        "divination",
        "ancestor-work",
        "psychopomp",
        "underworld",
        "shades",
        "medieval-grimoire",
        "greek-magic",
        "Νεκρομαντεία",
        "nekromanteia",
        "magic"
      ],
      "displayName": "Necromancy",
      "mythology": "greek",
      "visibility": "public",
      "status": "published",
      "views": 0,
      "likes": 0,
      "schemaVersion": "2.0",
      "completeness": 0
    },
    {
      "id": "offerings",
      "type": "magic",
      "name": "Greek Ritual Offerings - World Mythos Explorer",
      "icon": "🔥",
      "mythologies": [
        "greek"
      ],
      "primaryMythology": "greek",
      "shortDescription": "",
      "fullDescription": "At the heart of Greek religious practice\nstood the offering - the fundamental transaction between mortals and immortals. Through animal sacrifice,\nlibations, dedications, and votive gifts, worshippers honored the gods, sought divine favor, fulfilled vows, and maintained the reciprocal\nrelationship (\"I give so that you may give\")\nthat sustained cosmic and social order.\n\nThe entire animal was consumed by fire, with smoke rising to the heavens as divine nourishment. Reserved for chthonic deities and exceptional vows.\n\nRecipients: Underworld gods, heroes, exceptional oaths",
      "tags": [
        "offerings",
        "greek"
      ],
      "colors": {
        "primary": "#E67E22",
        "secondary": "#F39C12"
      },
      "linguistic": {
        "originalName": "",
        "originalScript": "greek",
        "transliteration": "Greek Ritual Offerings - World Mythos Explorer",
        "pronunciation": "",
        "languageCode": "grc",
        "etymology": {
          "rootLanguage": "Ancient Greek",
          "meaning": "",
          "derivation": ""
        }
      },
      "geographical": {
        "primaryLocation": {
          "name": "",
          "coordinates": {
            "latitude": 38,
            "longitude": 23,
            "accuracy": "general_area"
          },
          "type": "temple",
          "description": "",
          "significance": ""
        },
        "region": "Mediterranean",
        "culturalArea": "Ancient Greece",
        "modernCountries": [
          "Greece"
        ]
      },
      "temporal": {
        "mythologicalDate": {
          "display": "Mythological Age"
        },
        "historicalDate": {
          "display": "c. 800 BCE - 400 CE"
        },
        "firstAttestation": {
          "date": {
            "year": -800,
            "circa": true,
            "display": "c. 800 BCE"
          },
          "source": "Homer",
          "type": "literary",
          "confidence": "probable"
        },
        "culturalPeriod": "Classical Period"
      },
      "cultural": {
        "socialRole": ""
      },
      "relatedEntities": {
        "deities": [
          {
            "id": "index",
            "name": "Greek Deities"
          }
        ],
        "places": [
          {
            "id": "index",
            "name": "Greek Cosmology"
          }
        ]
      },
      "metadata": {
        "created": "2025-12-13T09:03:11.333Z",
        "lastModified": "2025-12-13T09:03:11.333Z",
        "version": "2.0",
        "completeness": 50,
        "migratedFrom": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\greek\\rituals\\offerings.html"
      },
      "searchTerms": [
        "offerings",
        "greek ritual offerings - world mythos explorer",
        "greek",
        "ritual",
        "-",
        "world",
        "mythos",
        "explorer",
        "magic"
      ],
      "displayName": "Greek Ritual Offerings - World Mythos Explorer",
      "category": "magic",
      "mythology": "greek",
      "visibility": "public",
      "status": "published",
      "views": 0,
      "likes": 0,
      "schemaVersion": "2.0",
      "completeness": 50
    },
    {
      "id": "olympic-games",
      "type": "magic",
      "name": "Olympic Games - Greek Mythology",
      "icon": "⚡",
      "mythologies": [
        "greek"
      ],
      "primaryMythology": "greek",
      "shortDescription": "",
      "fullDescription": "The Olympic Games\nwere far more than athletic competitions - they were a sacred festival honoring Zeus, king of the gods,\nheld every four years at his great sanctuary in Olympia. For five days, the Greek world paused in sacred truce (ekecheiria) as athletes,\nspectators, and pilgrims gathered to witness human excellence dedicated to divine glory. The games combined religious ritual, artistic\nperformance, and physical contests, embodying the Greek ideal of kalokagathia\n(beauty and goodness united).\n\nThe most prominent foundation myth tells of Pelops defeating King Oenomaus in a chariot race to win Princess Hippodamia, establishing funeral games that evolved into the Olympics.\n\nStory: Oenomaus challenged suitors to chariot race, killing losers",
      "tags": [
        "olympic-games",
        "greek"
      ],
      "colors": {
        "primary": "#E67E22",
        "secondary": "#F39C12"
      },
      "linguistic": {
        "originalName": "",
        "originalScript": "greek",
        "transliteration": "Olympic Games - Greek Mythology",
        "pronunciation": "",
        "languageCode": "grc",
        "etymology": {
          "rootLanguage": "Ancient Greek",
          "meaning": "",
          "derivation": ""
        }
      },
      "geographical": {
        "primaryLocation": {
          "name": "",
          "coordinates": {
            "latitude": 38,
            "longitude": 23,
            "accuracy": "general_area"
          },
          "type": "temple",
          "description": "",
          "significance": ""
        },
        "region": "Mediterranean",
        "culturalArea": "Ancient Greece",
        "modernCountries": [
          "Greece"
        ]
      },
      "temporal": {
        "mythologicalDate": {
          "display": "Mythological Age"
        },
        "historicalDate": {
          "display": "c. 800 BCE - 400 CE"
        },
        "firstAttestation": {
          "date": {
            "year": -800,
            "circa": true,
            "display": "c. 800 BCE"
          },
          "source": "Homer",
          "type": "literary",
          "confidence": "probable"
        },
        "culturalPeriod": "Classical Period"
      },
      "cultural": {
        "socialRole": ""
      },
      "relatedEntities": {
        "deities": [
          {
            "id": "zeus",
            "name": "Zeus"
          },
          {
            "id": "hera",
            "name": "Hera Heraia Games"
          }
        ],
        "heroes": [
          {
            "id": "heracles",
            "name": "Heracles"
          }
        ]
      },
      "metadata": {
        "created": "2025-12-13T09:03:11.354Z",
        "lastModified": "2025-12-13T09:03:11.354Z",
        "version": "2.0",
        "completeness": 50,
        "migratedFrom": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\greek\\rituals\\olympic-games.html"
      },
      "searchTerms": [
        "olympic-games",
        "olympic games - greek mythology",
        "olympic",
        "games",
        "-",
        "greek",
        "mythology",
        "magic"
      ],
      "displayName": "Olympic Games - Greek Mythology",
      "category": "magic",
      "mythology": "greek",
      "visibility": "public",
      "status": "published",
      "views": 0,
      "likes": 0,
      "schemaVersion": "2.0",
      "completeness": 50
    }
  ]
}