{
  "id": "roman_offerings",
  "displayName": "Roman Offerings and Sacrifices",
  "timing": "",
  "steps": [],
  "tools": [],
  "mythology": "roman",
  "filename": "offerings",
  "name": "Roman Mythology",
  "primarySources": [],
  "participants": [],
  "enhancedBy": "agent8-v2",
  "procedure": "",
  "updatedAt": "2025-12-26T05:15:12.446Z",
  "batch4_migration_status": "completed",
  "batch4_migration_timestamp": {
    "_seconds": 1766801086,
    "_nanoseconds": 869000000
  },
  "extracted_lists": [
    "Prophecy: Seeing and speaking of future events, wyrd (fate), and hidden knowledge",
    "Shape-Shifting: Changing form, often using the falcon cloak to fly",
    "Influencing Fate: While fate (wyrd) is woven by the Norns, seidr practitioners could see and sometimes influence its threads",
    "Spirit Work: Communicating with spirits, the dead, and other beings across the Nine Realms",
    "Love and War Magic: Spells of attraction, binding, cursing enemies , protecting warriors",
    "Parents: Njord (father, god of sea and wealth), mother unnamed (possibly Nerthus)",
    "Consort(s): Óðr (husband, often absent), possibly identical to or an aspect of Odin",
    "Children: Hnoss and Gersemi (daughters), both described as extremely beautiful",
    "Siblings: Freyr (twin brother, god of fertility and prosperity)",
    "Allies: Her brother Freyr (close bond), the Vanir tribe, völvas and seeresses who practice her magic",
    "Enemies: Giants who desire her (she's constantly pursued), Loki (complex relationship - he both aids and antagonizes her), those who would harm the Vanir or disrespect seidr",
    "Dísablót (Late Winter): Festival honoring female spirits and goddesses, with Freyja as chief Dís (goddess/female spirit). Women played central roles in this festival, offering sacrifices and performing prophetic seidr.",
    "Winter Nights (Autumn): Harvest festival particularly associated with Freyja and Freyr , thanking the Vanir for prosperity and fertility. Beginning of the dark half of the year when seidr magic was most powerful.",
    "Spring Celebrations: Fertility rites invoking Freyja for the renewal of life, successful crops, and fruitful marriages."
  ],
  "iconType": "svg",
  "icon": "<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 64 64\">\n  <circle cx=\"32\" cy=\"32\" r=\"28.8\" fill=\"#9370DB\" opacity=\"0.2\"/>\n  <circle cx=\"32\" cy=\"32\" r=\"19.2\" fill=\"none\" stroke=\"#9370DB\" stroke-width=\"2\" stroke-dasharray=\"5,5\"/>\n  <text x=\"32\" y=\"44.8\" text-anchor=\"middle\" font-size=\"22.4\" fill=\"#9370DB\">✨</text>\n</svg>",
  "_modified": "2025-12-27T07:07:06.302Z",
  "createdAt": "2025-12-27T07:06:55.967Z",
  "metadata": {
    "createdAt": "2025-12-13T02:38:18.738Z",
    "createdBy": "system",
    "verified": false,
    "source": "html_parser",
    "sourceFile": "mythos/roman/rituals/offerings.html",
    "finalEnrichment": true,
    "updatedAt": {
      "_seconds": 1766539878,
      "_nanoseconds": 395000000
    },
    "created": {
      "_seconds": 1766819244,
      "_nanoseconds": 101000000
    }
  },
  "updated_at": "2025-12-27T07:06:55.967Z",
  "description": "Roman Mythology is a significant ritual practice in roman tradition.",
  "type": "ritual",
  "purpose": "ceremonial"
}