{
  "primarySources": [],
  "attributes": [
    "Appearance: Eagle-headed with golden feathers, human body, wings that span the sky. Sometimes depicted fully as an eagle, sometimes as anthropomorphic with wings.",
    "Speed: Can change size at will, fly faster than the wind or thought, and eclipse the sun with his wings",
    "Strength: Strong enough to carry Vishnu and Lakshmi, defeated entire armies of gods",
    "Immortality: Granted by Vishnu, making him eternal",
    "Enemy of Serpents: Nagas flee at the mere mention of his name; he devours them regularly",
    "Symbol: Represents freedom, power, devotion, and the victory of good over evil (especially the serpent of ego)"
  ],
  "mythology": "hindu",
  "physicalDescription": "King of Birds, Vahana of Vishnu [View in Corpus →]",
  "weaknesses": [],
  "abilities": [
    "Appearance: Eagle-headed with golden feathers, human body, wings that span the sky. Sometimes depicted fully as an eagle, sometimes as anthropomorphic with wings.",
    "Speed: Can change size at will, fly faster than the wind or thought, and eclipse the sun with his wings",
    "Strength: Strong enough to carry Vishnu and Lakshmi, defeated entire armies of gods",
    "Immortality: Granted by Vishnu, making him eternal",
    "Enemy of Serpents: Nagas flee at the mere mention of his name; he devours them regularly",
    "Symbol: Represents freedom, power, devotion, and the victory of good over evil (especially the serpent of ego)",
    "Strength: Strong enough to carry Vishnu and Lakshmi , defeated entire armies of gods",
    "Immortality: Granted by Vishnu , making him eternal"
  ],
  "_enhanced": true,
  "mythology_story": "Birth from the Cosmic Egg: Garuda was born to Sage Kashyapa and Vinata , one of his wives. Vinata desired children and received two eggs. Impatient after 500 years, she broke open one egg prematurely, giving birth to Aruna (charioteer of the sun god), who was incompletely formed. She waited for the second egg, from which Garuda hatched—fully formed, radiant, and powerful. The Quest for Amrita: Vinata had become enslaved to her co-wife Kadru , mother of the Nagas (serpents), through a lost wager. Kadru demanded that Garuda steal amrita (nectar of immortality) from the gods as the price of his mother's freedom. Despite the seemingly impossible task, Garuda flew to the heavens. The gods' defenses proved futile against Garuda 's might. He defeated the guardian devas, extinguished the ring of fire protecting the amrita, and navigated through deadly chakras (rotating blades). He seized the amrita and flew back, but was intercepted by Vishnu , who was impressed by Garuda 's strength and devotion to his mother. Vishnu offered Garuda a boon, and Garuda asked to be placed above Vishnu —thus becoming Vishnu 's vahana (mount), the only being to ride upon the Lord. Vishnu , in turn, granted Garuda immortality without drinking the amrita.",
  "metadata": {
    "polished": true,
    "createdBy": "system",
    "sourceFile": "mythos/hindu/creatures/garuda.html",
    "polishedBy": "Agent_11",
    "updatedAt": {
      "_seconds": 1766539877,
      "_nanoseconds": 42000000
    },
    "verified": false,
    "finalEnrichment": true,
    "createdAt": "2025-12-13T02:38:01.508Z",
    "htmlExtracted": true,
    "source": "html_parser",
    "enhanced_by_agent_6": true,
    "enhancement_date": "2025-12-29T00:33:48.572Z"
  },
  "name": "Hindu Creatures",
  "relationships": {},
  "filename": "garuda",
  "completeness": 44,
  "habitats": [],
  "_uploadedAt": "2025-12-25T15:46:33.287541",
  "displayName": "🦅 Garuda",
  "type": "spirit",
  "symbolism": "Spiritual Symbolism: Garuda represents the soul's journey toward liberation. As the vehicle of Vishnu , he symbolizes the surrender of the individual self to the Divine . His enmity with serpents represents the conquest of ego, desire, and earthly attachments. National Symbol: Garuda appears in the national emblems of Indonesia and Thailand. The Garuda Pancasila is Indonesia's national emblem, and Garuda is the name of Indonesia's national airline.",
  "description": "Also known as 🦅 Garuda.",
  "id": "hindu_garuda",
  "size_comparison": {
    "height": 10,
    "length": 15,
    "human_scale": 5.56
  },
  "detailed_appearance": "Garuda is a magnificent being of divine power and beauty, combining the noblest features of eagle and human. His form radiates golden light, befitting his status as the mount of Lord Vishnu.\n\nHis head is that of a mighty eagle, with a sharp, curved beak of gold and fierce, intelligent eyes that can see across all three worlds. His face combines avian features with human-like expressions of wisdom and devotion. From his head sprout feathers of pure gold that shimmer and shine with divine radiance.\n\nHis body is humanoid but perfectly formed, with bronze skin and powerful muscles. His chest is broad and strong, capable of carrying the weight of gods. His arms are human, often depicted holding weapons or in gestures of devotion, but his legs end in powerful talons like those of an eagle, capable of grasping and crushing serpents.\n\nHis wings are his most spectacular feature - vast and magnificent, they span the sky itself. The feathers are layers of gold, bronze, and crimson, and when fully extended, they can eclipse the sun. These wings can change size at will, and their speed exceeds thought itself. When Garuda flies, the wind from his wings can create storms, and his shadow covers the earth like a second night.",
  "anatomy_diagram": "diagrams/creatures/garuda_anatomy.svg",
  "habitat_info": {
    "primary": "The celestial realms, particularly near Vaikuntha (Vishnu's abode)",
    "description": "Garuda dwells in the heavens, serving as the vahana (divine mount) of Lord Vishnu. He can travel between all realms instantly.",
    "behavior": "Noble and devoted servant of Vishnu, enemy of all serpents (nagas). Acts as divine messenger and protector of the righteous."
  },
  "behavior_traits": [
    "Extreme speed - faster than thought itself",
    "Size-changing ability - from tiny to cosmic",
    "Enemy of serpents - hunts and devours nagas",
    "Unwavering devotion to Vishnu",
    "Divine strength - defeated armies of gods",
    "Immortal and eternal"
  ],
  "mythology_encounters": [
    {
      "story": "The Quest for Amrita",
      "source": "Hindu Mythology - Mahabharata",
      "description": "To free his mother from enslavement, Garuda stormed the heavens and stole the amrita (nectar of immortality) from the gods. He defeated all their defenses, impressing Vishnu so greatly that he became his eternal mount and received the boon of immortality."
    },
    {
      "story": "Battle with the Nagas",
      "source": "Hindu Mythology",
      "description": "Garuda's enmity with serpents stems from his mother Vinata's rivalry with Kadru, mother of the nagas. Garuda regularly hunts and devours serpents, and they flee in terror at his approach."
    }
  ]
}