[
  {
    "id": "hand-of-glory",
    "longDescription": "The Macabre Talisman of Thieves and Dark Magic The Hand of Glory (from French \"main de gloire\" or corrupted from \"mandragore\"/mandrake)\n                    is one of the most infamous magical objects in European occult tradition. This gruesome\n                    artifact consists of the severed, pickled, and dried hand of an executed criminal, typically\n                    one hanged at a crossroads, fashioned into a candleholder or itself used as a candle.",
    "migrationDate": "2025-12-13T10:16:35.601Z",
    "geographical": null,
    "itemType": "artifact",
    "sources": [],
    "searchTerms": [
      "hand of glory",
      "hand-of-glory",
      "european",
      "occult",
      "medieval",
      "dark magic",
      "relic"
    ],
    "icon": "⚔️",
    "type": "item",
    "colors": null,
    "linguistic": null,
    "subtype": "sacred-object",
    "extendedContent": [
      {
        "title": "Description and Nature",
        "content": "The Hand of Glory (from French \"main de gloire\" or corrupted from \"mandragore\"/mandrake)\n                    is one of the most infamous magical objects in European occult tradition. This gruesome\n                    artifact consists of the severed, pickled, and dried hand of an executed criminal, typically\n                    one hanged at a crossroads, fashioned into a candleholder or itself used as a candle.\n                \n                \n                    According to folklore, when the fingers were lit (or when a candle made from the criminal's\n                    fat was placed in the hand), the Hand of Glory possessed the power to paralyze all who\n                    beheld its light and to open any lock it touched. This made it the legendary tool of\n                    burglars and thieves throughout medieval and early modern Europe."
      },
      {
        "title": "Creation and Ritual",
        "content": "Traditional Preparation\n                \n                    The grimoire traditions provide detailed (and gruesome) instructions for creating a Hand\n                    of Glory. The hand had to be severed from a hanged criminal while still on the gibbet,\n                    preferably during an eclipse or at a crossroads. It was then wrapped in a piece of the\n                    corpse's shroud, squeezed to drain remaining blood, and pickled in an earthen vessel\n                    with various salts and peppers for a fortnight.\n                \n                \n                    After pickling, the hand was dried in an oven with vervain and fern, then fashioned\n                    into a candle holder. A candle was made from the criminal's fat, virgin wax, and\n                    sesame oil (or alternatively, the fingers themselves were set alight). The resulting\n                    artifact was believed to be virtually unstoppable in its magical effects.\n                \n\n                Countermeasures\n                \n                    Folk tradition also preserved methods to defend against the Hand of Glory:\n                \n                \n                    Anointing the threshold with an ointment made from the gall of a black cat, owl fat, and blood\n                    Blood from a screech owl was said to neutralize its effects\n                    Milk was believed to be the only substance that could extinguish its flames\n                    Keeping consecrated objects or religious items in the home"
      },
      {
        "title": "Historical Examples",
        "content": "Several alleged Hands of Glory have survived as museum curiosities, most notably the\n                    specimen at the Whitby Museum in North Yorkshire, England. This dried hand, discovered\n                    in a cottage wall in the early 20th century, dates to approximately the 18th century\n                    and represents one of the few physical examples of this legend made real.\n                \n                \n                    Court records from the 17th and 18th centuries occasionally mention criminals found\n                    in possession of \"mummified hands\" or similar items, suggesting that some individuals\n                    genuinely believed in and attempted to create these talismans for criminal purposes."
      }
    ],
    "mythologies": [
      "dark magic",
      "medieval",
      "european",
      "occult"
    ],
    "slug": "hand-of-glory",
    "temporal": null,
    "primaryMythology": "dark magic",
    "visibility": "public",
    "shortDescription": "The Macabre Talisman of Thieves and Dark Magic",
    "mythologyContexts": [],
    "tags": [
      "european",
      "occult",
      "medieval",
      "dark magic",
      "relic",
      "hand-of-glory"
    ],
    "wielders": [],
    "cultural": null,
    "mediaReferences": {
      "images": [],
      "diagrams": []
    },
    "migratedFrom": "legacy-repository",
    "createdBy": [],
    "materials": [
      "Preserved hand of executed criminal"
    ],
    "name": "Hand of Glory",
    "powers": [],
    "relatedEntities": null,
    "metaphysicalProperties": null,
    "status": "published"
  }
]