{
  "id": "greek_myrtle",
  "filename": "myrtle",
  "displayName": "💐 Myrtle",
  "name": "Greek Mythology",
  "primarySources": [],
  "uses": [
    "Wedding Ceremonies: Brides wore myrtle wreaths and carried myrtle branches as symbols of love and fertility",
    "Temple Offerings: Fresh myrtle adorned Aphrodite's altars and temples",
    "Love Magic: Myrtle featured in charms and spells to attract love or ensure fidelity",
    "Perfumes and Oils: Myrtle essence used in cosmetics and anointing oils sacred to Aphrodite",
    "Victory Crowns: Myrtle wreaths also honored bloodless victories and peaceful achievements",
    "Purification: Myrtle's sweet scent used in cleansing rituals"
  ],
  "rituals": [
    "Wedding Ceremonies: Brides wore myrtle wreaths and carried myrtle branches as symbols of love and fertility",
    "Temple Offerings: Fresh myrtle adorned Aphrodite's altars and temples",
    "Love Magic: Myrtle featured in charms and spells to attract love or ensure fidelity",
    "Perfumes and Oils: Myrtle essence used in cosmetics and anointing oils sacred to Aphrodite",
    "Victory Crowns: Myrtle wreaths also honored bloodless victories and peaceful achievements",
    "Purification: Myrtle's sweet scent used in cleansing rituals"
  ],
  "properties": [],
  "mythology": "greek",
  "preparation": [],
  "enhancedBy": "agent8-v2",
  "symbolism": "",
  "deities": [
    "-aphrodite",
    "-eros"
  ],
  "updatedAt": "2025-12-26T05:15:08.725Z",
  "iconType": "svg",
  "icon": "<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 64 64\">\n  <circle cx=\"32\" cy=\"32\" r=\"28.8\" fill=\"#9370DB\" opacity=\"0.2\"/>\n  <circle cx=\"32\" cy=\"32\" r=\"19.2\" fill=\"none\" stroke=\"#9370DB\" stroke-width=\"2\" stroke-dasharray=\"5,5\"/>\n  <text x=\"32\" y=\"44.8\" text-anchor=\"middle\" font-size=\"22.4\" fill=\"#9370DB\">✨</text>\n</svg>",
  "_modified": "2026-01-01T09:43:51.724Z",
  "createdAt": "2025-12-27T07:06:55.967Z",
  "metadata": {
    "createdAt": "2025-12-13T02:38:13.004Z",
    "createdBy": "system",
    "verified": false,
    "source": "html_parser",
    "sourceFile": "mythos/greek/herbs/myrtle.html",
    "finalEnrichment": true,
    "updatedAt": {
      "_seconds": 1766539878,
      "_nanoseconds": 931000000
    },
    "created": {
      "_seconds": 1766819244,
      "_nanoseconds": 101000000
    }
  },
  "updated_at": "2025-12-27T07:06:55.967Z",
  "description": "Greek Mythology is a sacred plant used in greek spiritual practices.",
  "type": "herb",
  "mythologyDetails": {
    "overview": "",
    "deities": [],
    "myths": [],
    "symbolism": []
  },
  "healing": {
    "medicinal": [
      "Garden Sage (Salvia officinalis): Essential Oils: Thujone, camphor, cineole, borneol Phenolic Acids: Rosmarinic acid, caffeic acid Flavonoids: Apigenin, luteolin Tannins: Astringent compounds Diterpenes: Carnosic acid, carnosol (antioxidants) Triterpenes: Ursolic acid, oleanolic acid",
      "Dan Shen (Salvia miltiorrhiza): Tanshinones: Lipophilic diterpenoid quinones (cardiovascular effects) Salvianolic Acids: Water-soluble phenolic acids (antioxidant, anti-inflammatory) Protocatechuic Aldehyde: Cardiovascular protective compound Vitamin E: Antioxidant properties",
      "Cognitive Function and Memory Alzheimer's Research: Multiple studies show sage extract improves cognitive function in Alzheimer's patients Memory Enhancement: Improves word recall and memory consolidation in healthy adults Acetylcholinesterase Inhibition: Prevents breakdown of acetylcholine, important for memory Neuroprotective: Antioxidant compounds protect brain cells from oxidative damage Dosage: 300-600mg extract daily in clinical trials",
      "Menopause and Hot Flashes Hot Flash Reduction: Clinical trials show 50-64% reduction in hot flashes after 4-8 weeks Night Sweats: Effectively reduces night sweats in menopausal women Mechanism: Estrogenic effects and regulation of sweat glands Traditional Formula: Fresh sage tea, 4-6 leaves steeped 5-10 minutes, 2-3 times daily",
      "Antimicrobial and Anti-inflammatory Sore Throat: Gargling sage tea reduces throat inflammation and pain Oral Health: Antibacterial against oral pathogens, reduces gingivitis Wound Healing: Topical application accelerates healing and prevents infection Respiratory: Helps with bronchitis, coughs, and respiratory infections",
      "Digestive Health Digestive Stimulant: Increases bile flow and digestive enzyme secretion Gas and Bloating: Carminative properties reduce intestinal gas Antispasmodic: Relieves intestinal cramping Loss of Appetite: Bitter compounds stimulate appetite",
      "Cardiovascular (Dan Shen Specific) Coronary Heart Disease: Widely used in China for angina and coronary artery disease Blood Circulation: Improves microcirculation and prevents blood clots Hypertension: Mild blood pressure lowering effects Atherosclerosis: Prevents plaque formation in arteries Clinical Use: Injectable forms used in Chinese hospitals for acute conditions",
      "Other Therapeutic Applications Diabetes: May improve insulin sensitivity and glucose metabolism Depression: Some evidence for mild antidepressant effects Cancer Research: Laboratory studies show anti-tumor properties (not clinical yet) Lactation: Traditionally used to dry up breast milk when weaning Excessive Sweating: Reduces perspiration in hyperhidrosis"
    ],
    "properties": [],
    "preparations": [
      "1. Smudge Stick (Smoke Cleansing): Materials: Fresh or dried sage, natural cotton twine Instructions: Gather 8-10 sage stems, about 6-8 inches long Bundle tightly with largest leaves on outside Wrap with twine from base to top, then back down in crisscross pattern Hang upside down to dry for 1-2 wee",
      "2. Sage Tea (Infusion): Uses: Menopause, digestion, sore throat, cognitive support Fresh Sage Tea: 4-6 fresh sage leaves (or 1-2 tsp dried) Pour 8 oz boiling water over leaves Cover and steep 5-10 minutes Strain and drink 2-3 times daily Optional: Add honey and lemon for sore throat Dosage: 1-3 cups",
      "3. Tincture (Alcohol Extract): Long-term storage, concentrated medicine Instructions: Fill jar 1/3 to 1/2 full with fresh sage (or 1/4 full dried) Cover completely with 80-100 proof alcohol (vodka or brandy) Seal tightly, label with date and plant name Shake daily for 4-6 weeks Strain through cheese",
      "4. Gargle for Sore Throat: Antiseptic and anti-inflammatory Make strong tea: 2 tbsp dried sage in 8 oz boiling water Steep 15 minutes, strain Cool to lukewarm Add 1 tsp salt and 1 tsp apple cider vinegar (optional) Gargle for 30 seconds, spit out Repeat 3-4 times daily",
      "5. Sage Oil Infusion: For massage, anointing, or topical use Fill jar loosely with dried sage (wilted fresh can work) Cover completely with carrier oil (olive, jojoba, sweet almond) Seal and place in sunny window for 2-6 weeks, shaking daily Or: Gently heat on low in double boiler for 2-4 hours Stra",
      "6. Sage Vinegar (Culinary and Medicinal): Digestive tonic, salad dressing, hair rinse Fill jar 1/2 full with fresh sage Cover with apple cider vinegar Seal and steep 2-4 weeks, shaking occasionally Strain and bottle Digestive Use: 1 tbsp in water before meals Hair Rinse: Dilute 50/50 with water, dar",
      "7. Loose Incense Blend: For charcoal burner or fire-safe bowl Purification Blend: 3 parts dried sage 1 part dried lavender 1 part dried rosemary 1/2 part frankincense resin (optional) Grind coarsely, store in sealed jar Burn on charcoal disc for smoke cleansing",
      "8. Sage Bath for Spiritual Cleansing: Brew strong sage tea (large handful in 1 quart boiling water) Steep 20 minutes, strain Add to bath water Optional: Add sea salt, lavender, rosemary Soak for 20-30 minutes while visualizing cleansing Let air dry or pat dry (don't rinse off)"
    ]
  },
  "magic": {
    "spiritual": [
      "Purification and Cleansing Space Clearing: Burn sage to clear negative energy from rooms, homes, offices Aura Cleansing: Pass sage smoke around body to clear personal energy field Object Purification: Cleanse crystals, ritual tools, new possessions Pre-Ritual: Cleanse sacred space before magical workings or ceremonies Post-Healing: Clear energetic residue after healing work or emotional release",
      "Protection Magic House Protection: Hang dried sage over doorways and windows Protective Amulet: Carry dried sage in mojo bag or sachet Boundary Setting: Burn sage to create energetic boundaries Psychic Protection: Shields against negative thoughts and psychic attack Travel Safety: Carry sage for protection during journeys",
      "Wisdom and Knowledge Study Aid: Burn sage while studying to enhance memory and focus Exam Success: Carry sage to examinations for mental clarity Divination: Burn before tarot reading, scrying, or other divination Meditation: Aids in achieving meditative states and clarity Spiritual Insight: Opens channels to higher wisdom and guidance",
      "Wish Magic and Manifestation Wish Spell: Write wish on sage leaf, burn it to release to universe Dream Pillow: Sleep with sage under pillow for prophetic dreams Manifestation: Burn sage while visualizing desired outcome Intention Setting: Use in new moon rituals for new beginnings",
      "Healing Magic Energy Healing: Burn during Reiki, hands-on healing, or energy work Grief Work: Aids in releasing grief and processing loss Emotional Clearing: Helps release stuck emotions and trauma Chakra Balancing: Associated with crown and third eye chakras",
      "Longevity and Immortality Magic Life Extension: Include in spells for health and longevity Rejuvenation: Bath in sage tea for renewal and vitality Ancestral Connection: Use to connect with ancestors and ancient wisdom Eternal Love: Include in love spells for lasting relationships"
    ],
    "ritual": [],
    "correspondences": [
      "Air (some traditions say Earth)",
      "Jupiter (wisdom, expansion), Mercury (communication)",
      "Sagittarius, Gemini",
      "Zeus/Jupiter, Athena, Odin, White Buffalo Calf Woman, Chiron",
      "Third Eye (6th), Crown (7th)"
    ]
  },
  "traditions": {
    "wisdom_and_memory": {
      "usage": "Wisdom and Memory Across cultures, sage is associated with wisdom, enhanced memory, and mental clarity. Medieval European scholars believed sage strengthened memory, while modern research confirms cognitive benefits. The very name \"sage\" evokes a wise person.",
      "significance": ""
    },
    "purification_and_cleansing": {
      "usage": "Purification and Cleansing From Native American smudging to European fumigation rituals, sage smoke is universally recognized as purifying spaces, objects, and people of negative energies, illness, and spiritual contamination.",
      "significance": ""
    },
    "longevity_and_immortality": {
      "usage": "Longevity and Immortality The medieval saying \"Why should a man die whilst sage grows in his garden?\" reflects sage's reputation for promoting long life. Chinese dan shen is similarly prized for longevity and vitality.",
      "significance": ""
    },
    "womens_medicine": {
      "usage": "Women's Medicine Multiple sage species are used cross-culturally for women's reproductive health, menstrual regulation, menopause symptoms, and as galactagogues or lactation suppressants.",
      "significance": ""
    },
    "native_american_traditions": {
      "usage": "🪶 Native American Traditions Primary Species: White Sage (Salvia apiana), Desert Sage (Salvia dorrii) Sacred Uses: Smudging Ceremonies: White sage burned to purify people, spaces, and ceremonial objects Vision Quests: Used to cleanse participants before and after spiritual journeys Healing Rituals: Smoke used to drive away illness and negative spirits Sacred Bundles: Dried sage included in medici",
      "significance": "ne bundles for protection Sweat Lodge: Burned or steeped for purification in sweat lodge ceremonies Funeral Rites: Used to help spirits transition and purify mourners Birth Ceremonies: Purify mother and child, welcome new life Traditional Preparation: Smudge Sticks: Bundles of dried sage leaves tied with natural twine Loose Leaf: Dried leaves burned on charcoal or in shell Tea: Steeped for interna"
    },
    "mediterranean_and_european_traditions": {
      "usage": "🏛️ Mediterranean and European Traditions Primary Species: Garden Sage (Salvia officinalis), Clary Sage (Salvia sclarea) Ancient Mediterranean Uses: Roman Empire: Sacred to Jupiter, used in religious ceremonies and as preservative Greek Medicine: Hippocrates and Dioscorides prescribed sage for numerous ailments Egyptian: Used in fertility treatments and to strengthen women's reproductive systems S",
      "significance": "acred Herb: Rituals required before harvesting, including special clothing and clean feet Medieval European Magic and Medicine: School of Salerno (9th century): \"Cur moriatur homo cui Salvia crescit in horto?\" (Why should a man die whilst sage grows in his garden?) Longevity Herb: Believed to grant long life and prevent aging Memory Enhancement: Students consumed sage to improve memory before exam"
    },
    "chinese_medicine_dan_shen": {
      "usage": "☯️ Chinese Medicine (Dan Shen) Primary Species: Dan Shen (Salvia miltiorrhiza) - Red Sage Root Traditional Chinese Medicine Uses: Blood Circulation: Primary herb for invigorating blood and removing stasis Heart Health: Treats chest pain, palpitations, and cardiovascular conditions Menstrual Disorders: Regulates menstruation, treats amenorrhea and dysmenorrhea Calming Spirit (Shen): Treats insomnia",
      "significance": ", anxiety, and restlessness Anti-inflammatory: Used for abscesses, sores, and inflammatory conditions Longevity Tonic: Included in formulas for extending life and preventing aging Energetic Properties (TCM Theory): Nature: Slightly cold Taste: Bitter Meridians: Heart, Pericardium, Liver Actions: Invigorates blood, dispels stasis, clears heat, calms spirit Famous Formulas Containing Dan Shen: Dan S"
    },
    "mesoamerican_traditions_chia_and_diviners_sage": {
      "usage": "🌽 Mesoamerican Traditions (Chia and Diviner's Sage) Aztec and Mayan Chia (Salvia hispanica): Sacred Food: One of four main foods of Aztec civilization (along with corn, beans, amaranth) Warrior Fuel: Aztec warriors consumed chia for stamina and endurance Religious Offerings: Chia offered to gods in ceremonies Tribute Payment: Conquered peoples paid tribute to Aztec empire in chia seeds Medicine: ",
      "significance": "Used for joint pain, digestive issues, and wound healing Divination: Chia seeds used in fortune-telling rituals Mazatec Diviner's Sage (Salvia divinorum): Legal Warning: Controlled substance in many jurisdictions. Information for educational purposes only. Shamanic Tool: Used by Mazatec curanderos (healers) for divination and healing ceremonies Sacred Medicine: Called \"Ska María Pastora\" (Leaves o"
    },
    "other_global_traditions": {
      "usage": "🕉️ Other Global Traditions Ayurvedic Medicine (India): Sage Tea: Used for digestive issues, though not as prominent as in Western herbalism Memory Enhancement: Occasionally prescribed for cognitive function Dosha Balance: Considered warming and drying, balances Kapha and Vata Middle Eastern Traditions: Unani Medicine: Sage used for brain health, memory, and digestive complaints Ottoman Empire: Sa",
      "significance": "ge tea popular for health and hospitality Persian Medicine: Used in formulas for mental clarity and longevity Modern Western Herbalism: Eclectic Physicians (19th century): Prescribed for night sweats, hot flashes, excessive sweating Contemporary Use: Menopause support, sore throat, digestive aid, cognitive enhancement Aromatherapy: Clary sage essential oil for hormonal balance and emotional wellbe"
    }
  },
  "extendedContent": {
    "overview": "🌿 Sage - Sacred Herb of Wisdom and Purification Sage (Salvia spp.) stands as one of humanity's most universally revered sacred plants, crossing cultural boundaries with remarkable consistency. From the Native American smudging ceremonies of white sage to the Mediterranean culinary and medicinal traditions of garden sage, this powerful plant embodies wisdom, purification, protection, and healing across dozens of world traditions. Native American European Mediterranean Chinese Mesoamerican",
    "fullDescription": "🌿 Sage - Sacred Herb of Wisdom and Purification Sage (Salvia spp.) stands as one of humanity's most universally revered sacred plants, crossing cultural boundaries with remarkable consistency. From the Native American smudging ceremonies of white sage to the Mediterranean culinary and medicinal traditions of garden sage, this powerful plant embodies wisdom, purification, protection, and healing across dozens of world traditions. Native American European Mediterranean Chinese Mesoamerican Cross-Cultural Overview The genus Salvia contains over 900 species distributed worldwide, with several varieties holding sacred and medicinal significance across cultures. The name derives from the Latin salvare meaning \"to heal\" or \"to save,\" reflecting the plant's ancient reputation as a powerful healing ally. Primary Sacred Species White Sage (Salvia apiana): Native to California and Mexico, central to Native American ceremonial practices Garden Sage (Salvia officinalis): Mediterranean origin, used in European herbalism and magic Clary Sage (Salvia sclarea): European visionary and medicinal herb Dan Shen (Salvia miltiorrhiza): Chinese medicinal sage, crucial in Traditional Chinese Medicine Chia (Salvia hispanica): Ancient Aztec and Mayan sacred food and ritual plant Diviner's Sage (Salvia divinorum): Mazatec shamanic plant (controlled substance in many areas) Universal Themes Wisdom and Memory Across cultures, sage is associated with wisdom, enhanced memory, and mental clarity. Medieval European scholars believed sage strengthened memory, while modern research confirms cognitive benefits. The very name \"sage\" evokes a wise person. Purification and Cleansing From Native American smudging to European fumigation rituals, sage smoke is universally recognized as purifying spaces, objects, and people of negative energies, illness, and spiritual contamination. Longevity and Immortality The medieval saying \"Why should a man die whilst sage grows in his garden?\" reflects sage's reputation for promoting long life. Chinese dan shen is similarly prized for longevity and vitality. Women's Medicine Multiple sage species are used cross-culturally for women's reproductive health, menstrual regulation, menopause symptoms, and as galactagogues or lactation suppressants. Sage Across World Traditions 🪶 Native American Traditions Primary Species: White Sage (Salvia apiana), Desert Sage (Salvia dorrii) Sacred Uses: Smudging Ceremonies: White sage burned to purify people, spaces, and ceremonial objects Vision Quests: Used to cleanse participants before and after spiritual journeys Healing Rituals: Smoke used to drive away illness and negative spirits Sacred Bundles: Dried sage included in medicine bundles for protection Sweat Lodge: Burned or steeped for purification in sweat lodge ceremonies Funeral Rites: Used to help spirits transition and purify mourners Birth Ceremonies: Purify mother and child, welcome new life Traditional Preparation: Smudge Sticks: Bundles of dried sage leaves tied with natural twine Loose Leaf: Dried leaves burned on charcoal or in shell Tea: Steeped for internal cleansing and digestive issues Poultice: Fresh leaves crushed for wounds and skin conditions Cultural Significance: White sage is considered sacred and is central to many Native American spiritual practices, particularly among California tribes (Chumash, Cahuilla, Tongva). The plant is considered a grandmother spirit and teacher plant. Note: White sage is over-harvested and threatened. Consider supporting Native American growers and using sustainably sourced alternatives. → Learn more about Native American spiritual practices 🏛️ Mediterranean and European Traditions Primary Species: Garden Sage (Salvia officinalis), Clary Sage (Salvia sclarea) Ancient Mediterranean Uses: Roman Empire: Sacred to Jupiter, used in religious ceremonies and as preservative Greek Medicine: Hippocrates and Dioscorides prescribed sage for numerous ailments Egyptian: Used in fertility treatments and to strengthen women's reproductive systems Sacred Herb: Rituals required before harvesting, including special clothing and clean feet Medieval European Magic and Medicine: School of Salerno (9th century): \"Cur moriatur homo cui Salvia crescit in horto?\" (Why should a man die whilst sage grows in his garden?) Longevity Herb: Believed to grant long life and prevent aging Memory Enhancement: Students consumed sage to improve memory before examinations Protection Magic: Hung over doors to prevent evil from entering Funeral Rites: Placed on graves to honor the dead Love Divination: Young women ate sage leaves on St. Luke's Day to dream of future husbands Wish Fulfillment: Write wish on sage leaf, sleep with it under pillow for three nights, then bury it British Folk Magic: Fairy Garden: Sage planted to attract fairies to the garden Immortality Ritual: Eating sage in May would grant immortality (or at least long life) Business Prosperity: Keep sage in cash register or business to attract cust"
  },
  "enrichedFromHTML": true,
  "enrichmentDate": "2026-01-01T09:43:51.724Z"
}