{
  "id": "celtic",
  "type": "mythology_page",
  "name": "Celtic Mythology",
  "icon": "🍀",
  "tagline": "The Druids, Tuatha Dé Danann, and Otherworld",
  "description": "Explore Celtic myths of the Tuatha Dé Danann, druidic wisdom, sacred groves, and the mysterious Otherworld.",
  "overview": "Celtic mythology encompasses the religious beliefs and narratives of the Celtic peoples across Ireland, Scotland, Wales, and Gaul (France). The Irish tradition features the Tuatha Dé Danann (People of the Goddess Danu) - divine beings who conquered Ireland before retreating into the sidhe (fairy mounds). Welsh mythology includes the Mabinogi tales and Arthurian legends. Celtic mythology emphasizes: the Otherworld accessible through mounds and water, druidic wisdom and magic, sacred trees and groves, seasonal festivals (Samhain, Beltane, Imbolc, Lughnasadh), warrior culture and cattle raids, shape-shifting, prophecy, and the interplay between mortal and divine realms. Unlike systematized mythologies, Celtic tradition survived fragmentarily through medieval Christian scribes.",
  "culturalContext": {
    "period": "c. 1000 BCE - 400 CE (pre-Christian)",
    "region": "Ireland, Scotland, Wales, Gaul, Brittany",
    "language": "Old Irish, Welsh, Gaulish",
    "primarySources": "Ulster Cycle, Mythological Cycle, Mabinogion, medieval Irish texts"
  },
  "statistics": {
    "deities": 16,
    "heroes": 12,
    "creatures": 10,
    "places": 8
  },
  "sections": [
    {
      "id": "browse-entities",
      "title": "Browse Celtic Entities",
      "type": "category-grid",
      "categories": [
        {"type": "deities", "icon": "🍀", "label": "Tuatha Dé Danann", "count": 16, "route": "#/browse/deities/celtic"},
        {"type": "heroes", "icon": "⚔️", "label": "Heroes & Warriors", "count": 12, "route": "#/browse/heroes/celtic"},
        {"type": "creatures", "icon": "🐴", "label": "Otherworld Beings", "count": 10, "route": "#/browse/creatures/celtic"}
      ]
    },
    {
      "id": "tuatha-de-danann",
      "title": "Tuatha Dé Danann",
      "type": "content",
      "body": "The divine race who conquered Ireland, bringing four magical treasures:\n\n**Dagda:** Father-god, owns magic cauldron of plenty and club that kills and resurrects.\n**Lugh:** Master of all arts, sun god, warrior. Led Tuatha Dé to victory.\n**Brigid:** Goddess of poetry, healing, smithcraft. Later Christianized as St. Brigid.\n**Morrigan:** Phantom queen, war goddess, shape-shifter (crow/raven).\n**Nuada:** First king, lost arm in battle, received silver prosthetic.\n**Danu:** Mother goddess, ancestress of the Tuatha Dé.\n\nDefeated by the Milesians (mortal Irish), they retreated into sidhe mounds, becoming the fairy folk (aos sí)."
    }
  ],
  "relatedMythologies": ["norse", "welsh", "arthurian"],
  "featured": true,
  "displayOrder": 8,
  "metadata": {"createdAt": "2025-12-28T00:00:00Z", "updatedAt": "2025-12-28T00:00:00Z", "version": "1.0"}
}
