{
  "id": "roman",
  "type": "mythology_page",
  "name": "Roman Mythology",
  "icon": "🏛️",
  "tagline": "The Gods of Rome and Imperial Destiny",
  "description": "Explore Roman mythology where Greek gods received Latin names and new Roman character, and where destiny shaped the eternal empire.",
  "overview": "Roman mythology adapted and transformed Greek myths while maintaining distinctly Roman religious practices and values. The Romans identified their indigenous deities with Greek counterparts (Jupiter-Zeus, Mars-Ares, Venus-Aphrodite) but emphasized different aspects - Mars became more honorable as Rome's father-god, while practical deities of household, agriculture, and state were uniquely important. Roman religion focused on: precise ritual correctness (cultus deorum), state religion supporting imperial power, household gods (Lares and Penates), augury and divination, apotheosis of emperors, and the concept of pietas (duty to gods, family, and state). The Aeneid by Virgil established Rome's divine destiny as ordained by fate.",
  "culturalContext": {
    "period": "c. 753 BCE - 400 CE",
    "region": "Roman Empire",
    "language": "Latin",
    "primarySources": "Virgil's Aeneid, Ovid's Metamorphoses, Livy's History"
  },
  "statistics": {"deities": 30, "heroes": 8, "creatures": 10, "concepts": 6},
  "sections": [
    {
      "id": "browse-entities",
      "title": "Browse Roman Entities",
      "type": "category-grid",
      "categories": [
        {"type": "deities", "icon": "⚡", "label": "Roman Gods", "count": 30, "route": "#/browse/deities/roman"},
        {"type": "heroes", "icon": "🏛️", "label": "Heroes & Legends", "count": 8, "route": "#/browse/heroes/roman"}
      ]
    },
    {
      "id": "capitol-triad",
      "title": "The Capitoline Triad",
      "type": "content",
      "body": "**Jupiter (Greek Zeus):** King of gods, sky, thunder. Patron of Roman state.\n**Juno (Greek Hera):** Queen of gods, marriage, women. Protector of Rome.\n**Minerva (Greek Athena):** Wisdom, warfare, crafts. Patron of arts and strategy.\n\nThese three were worshipped together in the Temple of Jupiter Optimus Maximus on the Capitoline Hill, the religious center of Rome."
    },
    {
      "id": "founding-myth",
      "title": "Rome's Foundation: Romulus & Remus",
      "type": "content",
      "body": "Twin sons of Mars and Vesta priestess Rhea Silvia, abandoned as infants and suckled by a she-wolf. Founded Rome (753 BCE) after Romulus killed Remus in a dispute. Romulus became first king, later deified as Quirinus."
    },
    {
      "id": "aeneid",
      "title": "Aeneas & Rome's Divine Destiny",
      "type": "content",
      "body": "Aeneas, Trojan hero and son of Venus, survived Troy's fall and traveled to Italy carrying his father and household gods. Founded the Latin people, ancestors of Romans. Virgil's Aeneid establishes Rome's destined greatness as fulfillment of divine will, connecting Rome to Troy's glory."
    }
  ],
  "relatedMythologies": ["greek", "etruscan"],
  "featured": true,
  "displayOrder": 9,
  "metadata": {"createdAt": "2025-12-28T00:00:00Z", "updatedAt": "2025-12-28T00:00:00Z", "version": "1.0"}
}
