{
  "id": "sumerian",
  "type": "mythology_page",
  "name": "Sumerian Mythology",
  "icon": "📜",
  "tagline": "The Earliest Written Myths of Humanity",
  "description": "Explore the world's oldest written mythology from ancient Sumer - cradle of civilization.",
  "overview": "Sumerian mythology represents humanity's earliest written religious texts (c. 3500 BCE), establishing foundational myths later adapted by Akkadians, Babylonians, and Assyrians. The pantheon includes An (heaven), Enlil (air/authority), Enki (wisdom/water), Inanna (love/war), and others governing cosmic order. Key myths include Inanna's Descent to the Underworld, the creation of humanity from clay to serve gods, and the flood story predating Noah's Ark. Sumerians invented writing, the wheel, and urban civilization, leaving ziggurats as temple-mountains connecting earth and heaven.",
  "culturalContext": {"period": "c. 3500-2000 BCE", "region": "Mesopotamia (southern Iraq)", "language": "Sumerian", "primarySources": "Cuneiform tablets, Epic of Gilgamesh, Inanna's Descent"},
  "statistics": {"deities": 14, "heroes": 3, "creatures": 4},
  "sections": [
    {"id": "browse-entities", "title": "Browse Sumerian Entities", "type": "category-grid", "categories": [
      {"type": "deities", "icon": "📜", "label": "Gods", "count": 14, "route": "#/browse/deities/sumerian"},
      {"type": "heroes", "icon": "👑", "label": "Heroes & Kings", "count": 3, "route": "#/browse/heroes/sumerian"}
    ]},
    {"id": "inanna-descent", "title": "Inanna's Descent", "type": "content", "body": "Inanna, Queen of Heaven, descends to the underworld ruled by her sister Ereshkigal. At each of seven gates she must remove a garment/ornament. Arriving naked, she is judged and killed. Her servant Ninshubur appeals to the gods; Enki creates creatures to rescue her. Inanna returns but must send a substitute - her husband Dumuzi, who spends half the year in the underworld. This myth explains seasonal cycles and the journey of Venus."}
  ],
  "relatedMythologies": ["babylonian", "akkadian", "assyrian"],
  "featured": true,
  "displayOrder": 13,
  "metadata": {"createdAt": "2025-12-28T00:00:00Z", "version": "1.0"}
}
