{
  "id": "mezuzah",
  "mediaReferences": {
    "images": [],
    "diagrams": []
  },
  "shortDescription": "Mezuzah",
  "name": "Mezuzah",
  "subtype": "ceremonial",
  "type": "item",
  "_uploadedAt": "2025-12-25T15:46:34.282787",
  "mythologies": [
    "jewish",
    "hebrew"
  ],
  "cultural": null,
  "primaryMythology": "jewish",
  "visibility": "public",
  "linguistic": null,
  "migrationDate": "2025-12-13T10:16:35.749Z",
  "longDescription": "The mezuzah is a small parchment scroll inscribed with Torah verses, rolled and placed inside a protective case, then affixed to the doorposts of Jewish homes. The word \"mezuzah\" literally means \"doorpost\" in Hebrew, though common usage has transferred the term to the scroll and case mounted upon it. This practice transforms every doorway into a point of encounter with divine commandment.",
  "relatedEntities": null,
  "itemType": "artifact",
  "colors": null,
  "geographical": null,
  "status": "published",
  "sources": [],
  "mythologyContexts": [],
  "tags": [
    "jewish",
    "hebrew",
    "torah",
    "ritual",
    "ritual-object",
    "mezuzah"
  ],
  "extendedContent": [],
  "_enhanced": true,
  "metaphysicalProperties": null,
  "temporal": null,
  "searchTerms": [
    "mezuzah",
    "jewish",
    "hebrew",
    "torah",
    "ritual",
    "ritual-object"
  ],
  "materials": [],
  "slug": "mezuzah",
  "createdBy": [],
  "wielders": [],
  "migratedFrom": "legacy-repository",
  "extracted_title": "Tefillin - Sacred Phylacteries | World Mythology",
  "batch4_migration_status": "completed",
  "extracted_headings": [
    "Tefillin",
    "Object Description and Materials",
    "Origin and Creation Story",
    "Ritual Uses and Practices",
    "Symbolism and Meaning",
    "Associated Deities and Figures",
    "Historical Accounts and Records",
    "Modern Use and Replicas",
    "Related Objects and Practices",
    "Bibliography",
    "Primary Sources",
    "Secondary Sources",
    "Online Resources",
    "Mezuzah",
    "Shofar",
    "Moses",
    "Judaism"
  ],
  "batch4_migration_timestamp": {
    "_seconds": 1766801086,
    "_nanoseconds": 152000000
  },
  "extracted_lists": [
    "Mishnah, Tractates Berakhot, Shabbat, Eruvin, Megillah, Menachot",
    "Babylonian Talmud, Tractates Berakhot, Menachot, Sanhedrin",
    "Maimonides. Mishneh Torah, Hilkhot Tefillin. Various translations",
    "Cohn, Abraham. An Introduction to Jewish Prayer. Philadelphia: Jewish Publication Society, 2000",
    "Donin, Hayim Halevy. To Pray as a Jew. New York: Basic Books, 1980",
    "Hammer, Reuven. Entering Jewish Prayer. New York: Schocken Books, 1994",
    "Scherman, Nosson. Tefillin. Brooklyn: Mesorah Publications, 1995",
    "Yadin, Yigael. Tefillin from Qumran. Jerusalem: Israel Exploration Society, 1969",
    "Chabad.org: Tefillin guidance and resources",
    "My Jewish Learning: Overview articles",
    "Sefaria: Primary texts in translation"
  ],
  "_created": "2025-12-27T07:06:14.195Z",
  "icon": "<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 64 64\">\n  <circle cx=\"32\" cy=\"32\" r=\"28.8\" fill=\"#6a5acd\" opacity=\"0.2\"/>\n  <circle cx=\"32\" cy=\"32\" r=\"16\" fill=\"none\" stroke=\"#6a5acd\" stroke-width=\"2\"/>\n  <text x=\"32\" y=\"44.8\" text-anchor=\"middle\" font-size=\"22.4\" fill=\"#6a5acd\">💎</text>\n</svg>",
  "powers": [
    "Mystical properties"
  ],
  "mythology": "jewish",
  "iconType": "svg",
  "_modified": "2025-12-27T07:07:12.460Z",
  "createdAt": "2025-12-27T07:06:14.195Z",
  "metadata": {
    "created": {
      "_seconds": 1766819244,
      "_nanoseconds": 101000000
    },
    "updated": {
      "_seconds": 1766819244,
      "_nanoseconds": 101000000
    }
  },
  "updated_at": "2025-12-27T07:06:55.967Z",
  "description": "The mezuzah is a small parchment scroll inscribed with Torah verses, rolled and placed inside a protective case, then affixed to the doorposts of Jewish homes. The word \"mezuzah\" literally means \"door",
  "history": "historical experiences. The blood on doorposts during the Passover narrative created associative links between doorpost markings and divine protection. Medieval Jewish thought, particularly the mystical Kabbalah, added layers of meaning to mezuzah practice. The scroll's letters, the divine names, and the act of affixing the mezuzah were understood as channeling spiritual forces that protect the home and its inhabitants. The mezuzah became both commanded practice and powerful spiritual technology. Ritual Uses and Practices The mezuzah is affixed to the right doorpost as one enters a room, at approximately shoulder height (the upper third of the doorpost). It is positioned at an angle, with the top tilting inward toward the room, a compromise between opinions favoring vertical and horizontal positions. This distinctive angle makes mezuzot immediately recognizable on Jewish doorways. Before affixing the mezuzah, the blessing is recited: \"Blessed are You, Lord our God, King of the universe, who has sanctified us with His commandments and commanded us to affix a mezuzah.\" One blessing suffices if multiple mezuzot are affixed at the same time. Moving into a new home provides an opportunity to fulfill this mitzvah with heightened awareness. Traditional practice requires mezuzot on all doorways within the home meeting certain specifications: gates and entrances with doorposts on both sides, a lintel, and sufficient size. Bathrooms and other \"undignified\" spaces are exempt. The result in fully observant homes is mezuzot throughout, including bedrooms, kitchens, and living spaces. Jews traditionally touch or kiss the mezuzah when passing through a doorway. This practice, not halakhically required but widely observed, involves touching the mezuzah and then touching the fingers to the lips. This gesture acknowledges the divine presence symbolized by the mezuzah and refreshes awareness of covenant obligations upon each passage. Mezuzot require periodic inspection to ensure the scrolls remain valid. Scribal errors, damaged letters, or deterioration from moisture or age can render a scroll pasul (invalid). Tradition recommends checking mezuzot twice every seven years, though more frequent inspection is praiseworthy. A qualified scribe examines the scrolls and repairs or replaces those found wanting. The mezuzah serves as a visible marker of Jewish identity on homes and public buildings associated with Jewish life. This visibility has historically made Jewish homes identifiable, with consequences ranging from community solidarity to targeting during persecutions. The decision to display or conceal a mezuzah can carry communal and personal significance. Symbolism and Meaning The mezuzah symbolizes God's presence at the threshold of Jewish life. The home, protected and marked by the mezuzah, becomes a mikdash me'at (small sanctuary), a sacred space where divine presence dwells. Every entrance and exit brings inhabitants into contact with this divine presence, framing domestic life within sacred awareness. The scroll's content, the Shema declaration, represents the core of Jewish faith: \"Hear, O Israel: The Lord our God, the Lord is One.\" Placing this declaration on doorposts means literally surrounding oneself with the affirmation of divine unity. The home becomes a physical expression of theological commitment. The mezuzah marks the boundary between inside and outside, between the Jewish home and the larger world. This liminal position gives it special power. The mezuzah sanctifies the threshold, transforming ordinary architectural elements into religious statements. Passing through a mezuzah-marked doorway becomes a kind of ritual moment. Traditional understanding attributes protective power to the mezuzah. The divine name Shaddai, visible on the scroll or case, invokes God's watchfulness over the home and its inhabitants. Stories throughout Jewish history describe mezuzot protecting homes from fire, plague, and violence, though rationalist interpretations emphasize the mezuzah as commanded practice rather than magical protection. The mezuzah symbolizes continuity between generations. Parents teach children to recognize and respect the mezuzah, to touch it upon entering and leaving. These childhood practices establish embodied habits of Jewish consciousness that persist throughout life. The mezuzah becomes part of family identity and memory. The commandment's comprehensive scope, covering gates as well as doorposts, extends Jewish identity into public space. A mezuzah on a business or communal building declares Jewish presence and commitment. This visibility creates Jewish space within the larger society, marking community as well as individual identity. Associated Deities and Figures The God of Israel, whose oneness the Shema declares, is the mezuzah's ultimate referent. The scroll contains God's words, commanded by God and speaking of God. The protective function attributed to the mezuzah flows from God's covenant with Israel; it is God who guards the doors of Israel, with the mezuzah serving as sign and channel of that protection. Moses transmitted the commandment inscribed within the mezuzah. The passages from Deuteronomy are part of Moses's final address to Israel before his death and their entry into the Promised Land. The mezuzah thus carries the voice of the lawgiver into every generation, as Moses's words continue to command and teach from every Jewish doorpost. The sofer (scribe) who writes the mezuzah scroll participates in sacred work. This craftsman must possess not only technical skill but proper intention and religious qualification. The sofer's consciousness affects the scroll's validity; a scroll written without proper intention fails to fulfill the commandment. The sofer thus occupies a crucial role in maintaining Jewish material practice. Maimonides (1138-1204) articulated the mezuzah's meaning with particular clarity in his legal code. He emphasized that the mezuzah serves as a reminder of God's oneness, confronting the Jew at every entrance and exit with the fundamental principle of faith. His rationalist interpretation downplayed magical protection while elevating the mezuzah's educational and spiritual functions. Kabbalistic masters, particularly Rabbi Isaac Luria (the Ari, 1534-1572), developed mystical interpretations of mezuzah practice. They taught that proper mezuzot channel divine energy that protects the home and elevates its spiritual quality. These teachings added dimensions of meaning while intensifying practical attention to mezuzah details. Contemporary rabbis and educators continue interpreting mezuzah significance for new generations. The mezuzah features prominently in outreach education, as an accessible entry point to Jewish observance. Many Jews who maintain few other practices nonetheless affix mezuzot to their homes, making it one of the most widely observed commandments. Historical Accounts and Records The commandment to write upon doorposts appears in Deuteronomy, with the text datable to the late 7th century BCE in its current form, though likely drawing on older traditions. The specific practice of affixing parchment scrolls developed in subsequent centuries, with the earliest physical evidence coming from the Second Temple period. The Dead Sea Scrolls include mezuzah texts from the 1st century BCE, demonstrating the practice's antiquity. These Qumran mezuzot contain some variations from later standardized versions, including different passages and arrangements. Like the tefillin found at Qumran, they show that mezuzah practice existed before rabbinic standardization. The Mishnah (c. 200 CE) discusses mezuzah requirements in various tractates, assuming readers know the practice while debating specifics. Which rooms require mezuzot? What about rented dwellings or temporary structures? These discussions reflect a community where mezuzah observance was normal and expected, requiring legal refinement rather than fundamental establishment. Archaeological evidence for ancient mezuzot is limited due to the organic materials involved, but metal and stone cases have survived from various periods. Byzantine-era mezuzah cases from the Land of Israel provide evidence of continuity through late antiquity. Medieval manuscript illustrations depict mezuzot on doorways, confirming ongoing practice. Throughout Jewish history, the mezuzah served as marker of Jewish homes with sometimes dangerous consequences. During persecutions, mezuzot could identify Jewish households for attack. Conversely, stories describe mezuzot protecting homes from plague, fire, and violence. These accounts, whether historical or legendary, demonstrate the mezuzah's significance in Jewish consciousness. Modern Jewish movements have maintained mezuzah observance even while differing on other matters. Reform, Conservative, and Orthodox communities all affirm the mezuzah's importance, though they may differ on technical requirements. The mezuzah has proven remarkably resilient as a marker of Jewish identity across the spectrum of observance. Modern Use and Replicas Contemporary Jews worldwide continue affixing mezuzot to their homes, making it one of the most widely observed Jewish practices. From ultra-Orthodox to secular-cultural Jews, the mezuzah marks Jewish space and identity. Its visibility on doorways makes it perhaps the most publicly recognizable sign of Jewish residence. Modern mezuzah production combines traditional and contemporary elements. Scrolls must still be handwritten by qualified scribes according to ancient specifications, but cases reflect contemporary design sensibilities. Artisan judaica designers create mezuzah cases in every style from traditional to modernist, in materials ranging from precious metals to recycled materials. Quality control for mezuzah scrolls has benefited from technological advances. Computer programs can scan scrolls for potential errors, though final certification still requires human expert review. Organizations exist to verify that mezuzot sold to consumers contain valid scrolls, addressing concerns about substandard mass-produced scrolls entering the market. Moving into a new home provides opportunity for mezuzah ceremonies that have become increasingly elaborate in some communities. Hanukkah ha-bayit (house dedication) celebrations often center on affixing mezuzot, with community members participating, blessings recited, and festive meals shared. These celebrations make religious milestone of domestic transition. Educational programs teach children about mezuzah significance, often including craft activities creating decorative mezuzah cases. Jewish schools, summer camps, and family programs use the mezuzah as a tangible entry point for discussing Jewish identity, practice, and home life. Many children's first personal connection to Judaism comes through mezuzah awareness. The mezuzah has entered broader cultural awareness beyond Jewish communities. Non-Jews sometimes recognize the mezuzah on Jewish homes and businesses. Interfaith couples navigate questions about mezuzot in shared homes. The mezuzah thus participates in larger cultural conversations about religious visibility and minority identity. Related Objects and Practices Tefillin share with mezuzot the practice of placing handwritten Torah passages in protective containers, though worn on the body rather than affixed to doorways. The same scribal standards apply to both, and both contain verses from Deuteronomy 6. Together they represent the comprehensive binding of Torah to Jewish life, in home and on person. The Torah scroll represents the fullest expression of written Torah, from which mezuzah passages derive. The same care for scribal accuracy and material purity applies to Torah scrolls as to mezuzot, though on a much larger scale. The mezuzah might be understood as a fragment of Torah placed at the threshold of Jewish life. Doorpost markings in the Passover narrative (Exodus 12) provide conceptual precedent for the mezuzah, even though the practices differ. The blood on doorposts signaled Israelite homes for divine protection during the plague of the firstborn. This association between doorpost marking and divine protection informs mezuzah interpretation. The menorah, while functionally different from the mezuzah, shares its status as quintessential Jewish symbol. Both items appear frequently in Jewish art and on ceremonial objects. Their pairing represents light (menorah) and word (mezuzah), complementary expressions of divine presence in Jewish space. The Hanukkah menorah (hanukkiah) is traditionally placed opposite the mezuzah in doorways, creating a dialogue between the permanent sign of faith (mezuzah) and the seasonal celebration of miracle and dedication (hanukkiah). This placement practice demonstrates how different ritual objects interact in Jewish sacred space. Christian door blessings and Muslim doorway markers represent parallel practices in other Abrahamic traditions, though with different theological content and historical development. Comparative study illuminates how different faiths use architectural thresholds to express and maintain religious identity. Bibliography Primary Sources Torah : Deuteronomy 6:4-9, 11:13-21 Mishnah , Tractates Berakhot, Megillah, Menachot Babylonian Talmud , Tractate Menachot Maimonides. Mishneh Torah , Hilkhot Mezuzah. Various translations Secondary Sources Donin, Hayim Halevy. To Be a Jew . New York: Basic Books, 1972 Grunfeld, Isidor. The Jewish Dietary Laws . London: Soncino Press, 1972 Klein, Isaac. A Guide to Jewish Religious Practice . New York: JTS Press, 1979 Scherman, Nosson. Mezuzah . Brooklyn: Mesorah Publications, 1981 Tigay, Jeffrey H. Deuteronomy . Philadelphia: Jewish Publication Society, 1996 Online Resources Chabad.org: Mezuzah laws and guidance My Jewish Learning: Overview articles Sefaria: Primary texts in translation &#128279; Related Across the Mythos Related Items &#128220; Tefillin Prayer Phylacteries &#128367; Menorah Sacred Candelabrum Source Tradition &#10017; Jewish Tradition Judaism Covenant and Home Related Practice &#128239; Shofar Ram's Horn",
  "significance": "significance. Symbolism and Meaning The mezuzah symbolizes God's presence at the threshold of Jewish life. The home, protected and marked by the mezuzah, becomes a mikdash me'at (small sanctuary), a sacred space where divine presence dwells. Every entrance and exit brings inhabitants into contact with this divine presence, framing domestic life within sacred awareness. The scroll's content, the Shema declaration, represents the core of Jewish faith: \"Hear, O Israel: The Lord our God, the Lord is One.\" Placing this declaration on doorposts means literally surrounding oneself with the affirmation of divine unity. The home becomes a physical expression of theological commitment. The mezuzah marks the boundary between inside and outside, between the Jewish home and the larger world. This liminal position gives it special power. The mezuzah sanctifies the threshold, transforming ordinary architectural elements into religious statements. Passing through a mezuzah-marked doorway becomes a kind of ritual moment. Traditional understanding attributes protective power to the mezuzah. The divine name Shaddai, visible on the scroll or case, invokes God's watchfulness over the home and its inhabitants. Stories throughout Jewish history describe mezuzot protecting homes from fire, plague, and violence, though rationalist interpretations emphasize the mezuzah as commanded practice rather than magical protection. The mezuzah symbolizes continuity between generations. Parents teach children to recognize and respect the mezuzah, to touch it upon entering and leaving. These childhood practices establish embodied habits of Jewish consciousness that persist throughout life. The mezuzah becomes part of family identity and memory. The commandment's comprehensive scope, covering gates as well as doorposts, extends Jewish identity into public space. A mezuzah on a business or communal building declares Jewish presence and commitment. This visibility creates Jewish space within the larger society, marking community as well as individual identity. Associated Deities and Figures The God of Israel, whose oneness the Shema declares, is the mezuzah's ultimate referent. The scroll contains God's words, commanded by God and speaking of God. The protective function attributed to the mezuzah flows from God's covenant with Israel; it is God who guards the doors of Israel, with the mezuzah serving as sign and channel of that protection. Moses transmitted the commandment inscribed within the mezuzah. The passages from Deuteronomy are part of Moses's final address to Israel before his death and their entry into the Promised Land. The mezuzah thus carries the voice of the lawgiver into every generation, as Moses's words continue to command and teach from every Jewish doorpost. The sofer (scribe) who writes the mezuzah scroll participates in sacred work. This craftsman must possess not only technical skill but proper intention and religious qualification. The sofer's consciousness affects the scroll's validity; a scroll written without proper intention fails to fulfill the commandment. The sofer thus occupies a crucial role in maintaining Jewish material practice. Maimonides (1138-1204) articulated the mezuzah's meaning with particular clarity in his legal code. He emphasized that the mezuzah serves as a reminder of God's oneness, confronting the Jew at every entrance and exit with the fundamental principle of faith. His rationalist interpretation downplayed magical protection while elevating the mezuzah's educational and spiritual functions. Kabbalistic masters, particularly Rabbi Isaac Luria (the Ari, 1534-1572), developed mystical interpretations of mezuzah practice. They taught that proper mezuzot channel divine energy that protects the home and elevates its spiritual quality. These teachings added dimensions of meaning while intensifying practical attention to mezuzah details. Contemporary rabbis and educators continue interpreting mezuzah significance for new generations. The mezuzah features prominently in outreach education, as an accessible entry point to Jewish observance. Many Jews who maintain few other practices nonetheless affix mezuzot to their homes, making it one of the most widely observed commandments. Historical Accounts and Records The commandment to write upon doorposts appears in Deuteronomy, with the text datable to the late 7th century BCE in its current form, though likely drawing on older traditions. The specific practice of affixing parchment scrolls developed in subsequent centuries, with the earliest physical evidence coming from the Second Temple period. The Dead Sea Scrolls include mezuzah texts from the 1st century BCE, demonstrating the practice's antiquity. These Qumran mezuzot contain some variations from later standardized versions, including different passages and arrangements. Like the tefillin found at Qumran, they show that mezuzah practice existed before rabbinic standardization. The Mishnah (c. 200 CE) discusses mezuzah requirements in various tractates, assuming readers know the practice while debating specifics. Which rooms require mezuzot? What about rented dwellings or temporary structures? These discussions reflect a community where mezuzah observance was normal and expected, requiring legal refinement rather than fundamental establishment. Archaeological evidence for ancient mezuzot is limited due to the organic materials involved, but metal and stone cases have survived from various periods. Byzantine-era mezuzah cases from the Land of Israel provide evidence of continuity through late antiquity. Medieval manuscript illustrations depict mezuzot on doorways, confirming ongoing practice. Throughout Jewish history, the mezuzah served as marker of Jewish homes with sometimes dangerous consequences. During persecutions, mezuzot could identify Jewish households for attack. Conversely, stories describe mezuzot protecting homes from plague, fire, and violence. These accounts, whether historical or legendary, demonstrate the mezuzah's significance in Jewish consciousness. Modern Jewish movements have maintained mezuzah observance even while differing on other matters. Reform, Conservative, and Orthodox communities all affirm the mezuzah's importance, though they may differ on technical requirements. The mezuzah has proven remarkably resilient as a marker of Jewish identity across the spectrum of observance. Modern Use and Replicas Contemporary Jews worldwide continue affixing mezuzot to their homes, making it one of the most widely observed Jewish practices. From ultra-Orthodox to secular-cultural Jews, the mezuzah marks Jewish space and identity. Its visibility on doorways makes it perhaps the most publicly recognizable sign of Jewish residence. Modern mezuzah production combines traditional and contemporary elements. Scrolls must still be handwritten by qualified scribes according to ancient specifications, but cases reflect contemporary design sensibilities. Artisan judaica designers create mezuzah cases in every style from traditional to modernist, in materials ranging from precious metals to recycled materials. Quality control for mezuzah scrolls has benefited from technological advances. Computer programs can scan scrolls for potential errors, though final certification still requires human expert review. Organizations exist to verify that mezuzot sold to consumers contain valid scrolls, addressing concerns about substandard mass-produced scrolls entering the market. Moving into a new home provides opportunity for mezuzah ceremonies that have become increasingly elaborate in some communities. Hanukkah ha-bayit (house dedication) celebrations often center on affixing mezuzot, with community members participating, blessings recited, and festive meals shared. These celebrations make religious milestone of domestic transition. Educational programs teach children about mezuzah significance, often including craft activities creating decorative mezuzah cases. Jewish schools, summer camps, and family programs use the mezuzah as a tangible entry point for discussing Jewish identity, practice, and home life. Many children's first personal connection to Judaism comes through mezuzah awareness. The mezuzah has entered broader cultural awareness beyond Jewish communities. Non-Jews sometimes recognize the mezuzah on Jewish homes and businesses. Interfaith couples navigate questions about mezuzot in shared homes. The mezuzah thus participates in larger cultural conversations about religious visibility and minority identity. Related Objects and Practices Tefillin share with mezuzot the practice of placing handwritten Torah passages in protective containers, though worn on the body rather than affixed to doorways. The same scribal standards apply to both, and both contain verses from Deuteronomy 6. Together they represent the comprehensive binding of Torah to Jewish life, in home and on person. The Torah scroll represents the fullest expression of written Torah, from which mezuzah passages derive. The same care for scribal accuracy and material purity applies to Torah scrolls as to mezuzot, though on a much larger scale. The mezuzah might be understood as a fragment of Torah placed at the threshold of Jewish life. Doorpost markings in the Passover narrative (Exodus 12) provide conceptual precedent for the mezuzah, even though the practices differ. The blood on doorposts signaled Israelite homes for divine protection during the plague of the firstborn. This association between doorpost marking and divine protection informs mezuzah interpretation. The menorah, while functionally different from the mezuzah, shares its status as quintessential Jewish symbol. Both items appear frequently in Jewish art and on ceremonial objects. Their pairing represents light (menorah) and word (mezuzah), complementary expressions of divine presence in Jewish space. The Hanukkah menorah (hanukkiah) is traditionally placed opposite the mezuzah in doorways, creating a dialogue between the permanent sign of faith (mezuzah) and the seasonal celebration of miracle and dedication (hanukkiah). This placement practice demonstrates how different ritual objects interact in Jewish sacred space. Christian door blessings and Muslim doorway markers represent parallel practices in other Abrahamic traditions, though with different theological content and historical development. Comparative study illuminates how different faiths use architectural thresholds to express and maintain religious identity. Bibliography Primary Sources Torah : Deuteronomy 6:4-9, 11:13-21 Mishnah , Tractates Berakhot, Megillah, Menachot Babylonian Talmud , Tractate Menachot Maimonides. Mishneh Torah , Hilkhot Mezuzah. Various translations Secondary Sources Donin, Hayim Halevy. To Be a Jew . New York: Basic Books, 1972 Grunfeld, Isidor. The Jewish Dietary Laws . London: Soncino Press, 1972 Klein, Isaac. A Guide to Jewish Religious Practice . New York: JTS Press, 1979 Scherman, Nosson. Mezuzah . Brooklyn: Mesorah Publications, 1981 Tigay, Jeffrey H. Deuteronomy . Philadelphia: Jewish Publication Society, 1996 Online Resources Chabad.org: Mezuzah laws and guidance My Jewish Learning: Overview articles Sefaria: Primary texts in translation &#128279; Related Across the Mythos Related Items &#128220; Tefillin Prayer Phylacteries &#128367; Menorah Sacred Candelabrum Source Tradition &#10017; Jewish Tradition Judaism Covenant and Home Related Practice &#128239; Shofar Ram's Horn",
  "_htmlEnrichment": {
    "enrichedAt": "2026-01-01T09:42:10.954Z",
    "sourceFile": "_recovered-html\\FIREBASE\\spiritual-items\\ritual\\mezuzah.html",
    "enrichmentVersion": "1.0"
  }
}