{
  "id": "amaterasu",
  "mythology": "japanese",
  "attributes": {},
  "mythologyStories": {
    "sources": "Kojiki(Record of Ancient Matters, 712 CE),Nihon Shoki(Chronicles of Japan, 720 CE),Kogo Shui(Gleanings from Ancient Stories),Engishiki(Procedures of the Engi Era)",
    "key_myths": [
      {
        "name": "Birth from Izanagi's Purification",
        "description": "After fleeing the underworld realm of Yomi, Izanagi purified himself in a river. As he washed his left eye, the sublime radiance of Amaterasu was born. She emerged fully formed, her brilliance so overwhelming that Izanagi immediately recognized her supremacy and bestowed upon her the rule of Takamagahara - the High Plain of Heaven. This birth through purification (misogi) establishes her as the embodiment of purity itself."
      },
      {
        "name": "The Cave of Heaven (Ama-no-Iwato)",
        "description": "The most celebrated myth tells of Amaterasu's retreat into a cave. Enraged by Susanoo's destructive rampage in her realm - where he defiled her weaving hall, destroyed rice paddies, and killed one of her attendants with a flayed horse - Amaterasu sealed herself within the Heavenly Rock Cave. The world plunged into eternal darkness. The eight million kami gathered in desperate council. The cunning goddess Ame-no-Uzume performed an ecstatic, ribald dance that caused such divine laughter that Amaterasu's curiosity was piqued. When she opened the cave to peek, the kami Ame-no-Tajikarao pulled her out, and a sacred rope (shimenawa) was placed across the entrance to prevent her return. Light returned to the world, and this myth explains the origins of sacred dance (kagura) and many Shinto purification rituals."
      },
      {
        "name": "The Divine Mandate to Earth",
        "description": "Amaterasu sent her grandson Ninigi-no-Mikoto to pacify and rule the terrestrial realm. She bestowed upon him the Three Sacred Treasures (Sanshu no Jingi): the mirror Yata no Kagami (\"so that you may see me within it\"), the sword Kusanagi, and the jewels Yasakani no Magatama. These treasures became the Imperial Regalia, validating the divine authority of every Japanese emperor as Amaterasu's descendant."
      },
      {
        "name": "The Conflict with Susanoo",
        "description": "Before his banishment, Susanoo challenged Amaterasu to a contest of creation. Each deity used the other's possessions to create offspring - Amaterasu chewed Susanoo's sword and breathed forth five male deities; Susanoo used her jewels to create three female goddesses. Amaterasu declared victory because the males came from her breath, but Susanoo's subsequent violence showed his rejection of civilized divine order."
      }
    ],
    "intro": "Amaterasu's myths form the cornerstone of Shinto theology and Japanese national identity. Recorded in the <em>Kojiki</em> (712 CE) and <em>Nihon Shoki</em> (720 CE), her stories explain the origins of the sun, the Imperial dynasty, and the fundamental principles of Shinto practice."
  },
  "tags": [
    "japanese",
    "deity"
  ],
  "worship": {
    "festivals": "<li><strong>Kannamesai (October 17):</strong> The most important festival at Ise, offering first rice harvest to Amaterasu</li>\n<li><strong>Niinamesai (November 23):</strong> The Emperor offers new rice to Amaterasu - one of the most important imperial rites</li>\n<li><strong>Shikinen Sengu:</strong> The 20-year shrine rebuilding ceremony, most recently in 2013</li>\n<li><strong>New Year (Shogatsu):</strong> Millions visit shrines to receive Amaterasu's blessing for the year</li>",
    "worship practices": "Worship of Amaterasu emphasizes purity, gratitude, and renewal. Devotees perform temizu (hand washing) purification before approaching shrines. Offerings include rice, sake, salt, and water - the pure essentials of life. The sacred mirror in homes (kamidana) often represents Amaterasu's presence. Prayers (norito) thank her for light, warmth, and life while seeking her continued blessings. The practice of greeting the sunrise (with two claps and a bow) honors her daily appearance.",
    "the grand shrine of ise (ise jingu)": "The Ise Grand Shrine in Mie Prefecture is Amaterasu's most sacred dwelling and the holiest site in Shinto. The Inner Shrine (Naiku) houses Yata no Kagami, the sacred mirror that is Amaterasu's primary shintai (divine vessel). The shrine complex has been ritually rebuilt every 20 years for over 1,300 years (Shikinen Sengu), symbolizing eternal renewal. The current structures (rebuilt in 2013) represent the 62nd such rebuilding. Only the Emperor and highest priests may enter the innermost sanctuary.",
    "other major shrines": "<li><strong>Amanoiwato Shrine (Takachiho, Miyazaki):</strong> Built at the site of the cave where Amaterasu hid</li>\n<li><strong>Hinomisaki Shrine (Shimane):</strong> Known as the \"Sunset Shrine\" complementing Ise's sunrise worship</li>\n<li><strong>Countless local shrines:</strong> Nearly every Shinto shrine honors Amaterasu to some degree</li>"
  },
  "name": "Japanese - Amaterasu",
  "relationships": {
    "enemies": "Susanoo - her brother whose wild nature stands opposite her ordered brilliance",
    "allies": "Takamimusubi (high creation kami), Ame-no-Tajikarao (strength kami), Omoikane (wisdom kami)",
    "family": {
      "children": "Five male kami created from Susanoo's sword - including Ame-no-Oshihomimi, ancestor of the Imperial line"
    }
  },
  "description": "",
  "interlinks": {
    "cross_cultural_parallels": [
      {
        "name": "Ra",
        "url": "../../egyptian/deities/ra.html",
        "mythology": "Egyptian - Sun God"
      },
      {
        "name": "Apollo",
        "url": "../../greek/deities/apollo.html",
        "mythology": "Greek - Light God"
      },
      {
        "name": "Surya",
        "url": "../../hindu/deities/index.html",
        "mythology": "Hindu - Sun God"
      },
      {
        "name": "Brigid",
        "url": "../../celtic/deities/brigid.html",
        "mythology": "Celtic - Fire Goddess"
      },
      {
        "name": "Inti",
        "url": "../../../index.html",
        "mythology": "Incan - Sun God"
      }
    ],
    "sacred_items": [
      {
        "name": "Yata no Kagami",
        "url": "../../../spiritual-items/relics/yata-no-kagami.html",
        "type": "Sacred Mirror"
      }
    ],
    "archetype": {
      "name": "☀️ SUN DEITY",
      "description": "Amaterasu represents the Sun Deity archetype - the supreme celestial power bringing light, life, and cosmic order to the world.",
      "url": "../../../archetypes/sun-god/index.html"
    }
  },
  "icon": "☀️",
  "subtitle": "Great Divinity Illuminating Heaven",
  "type": "deity",
  "cssColors": {},
  "searchTerms": [
    "illuminating",
    "japanese",
    "japanese - amaterasu",
    "great",
    "divinity",
    "-",
    "heaven",
    "amaterasu"
  ],
  "seeAlso": [
    {
      "url": "susanoo.html",
      "text": "🌊Susanoo"
    },
    {
      "url": "tsukuyomi.html",
      "text": "🌙Tsukuyomi"
    },
    {
      "url": "izanagi.html",
      "text": "✨Izanagi"
    },
    {
      "url": "izanami.html",
      "text": "🌈Izanami"
    },
    {
      "url": "../../../index.html",
      "text": "🦊Inari"
    },
    {
      "url": "../myths/index.html",
      "text": "🌄Cave of Heaven"
    },
    {
      "url": "../../../archetypes/sun-god/index.html",
      "text": "☀️Sun Deity Archetype"
    }
  ],
  "createdAt": {
    "_seconds": 1765798414,
    "_nanoseconds": 782000000
  },
  "metadata": {
    "extractionVersion": "2.6",
    "uploadedBy": "migration-script-v3.4",
    "completenessScore": 70,
    "sourceFile": "mythos/japanese/deities/amaterasu.html",
    "uploadedAt": {
      "_seconds": 1765798414,
      "_nanoseconds": 782000000
    }
  },
  "updatedAt": {
    "_seconds": 1765798414,
    "_nanoseconds": 782000000
  }
}