{
  "id": "inari",
  "mythology": "japanese",
  "attributes": {},
  "mythologyStories": {
    "key_myths": [
      {
        "name": "Agricultural Deity",
        "description": "Likely originated as a local agricultural kami worshipped by farming communities dependent on rice cultivation. The name \"Inari\" directly relates to rice growing/ripening."
      },
      {
        "name": "Syncretism",
        "description": "May be a syncretic fusion of multiple earlier rice and fertility deities including Uke-Mochi (killed by Tsukuyomi, from whose body came rice), Toyouke-Hime, or Ukanomitama-no-Kami."
      },
      {
        "name": "Hata Clan Origins",
        "description": "Tradition associates Inari worship with the Hata clan, Korean immigrants who brought advanced agricultural and silk production techniques to Japan in the 5th-6th centuries."
      },
      {
        "name": "Mountain Deity",
        "description": "Fushimi Inari (the head shrine) sits on Mount Inari, suggesting possible origins as a mountain kami who descended to bless the rice fields in the valleys."
      },
      {
        "name": "Buddhist Influence",
        "description": "During the medieval period, Inari was sometimes identified with Buddhist figures, especially Dakini-ten (a tantric deity), adding layers of complexity and esoteric meaning."
      }
    ],
    "intro": "Unlike many Shinto kami, Inari does not feature prominently in the ancient chronicles (Kojiki and Nihon Shoki). Instead, Inari's worship emerged organically from agricultural communities and was later systematized and incorporated into official Shinto. The deity's origins are mysterious and multifaceted."
  },
  "tags": [
    "japanese",
    "deity"
  ],
  "worship": {
    "distinctive features:": "<li><strong>Red Torii Gates:</strong> Vermillion torii gates (often in long tunnels or rows) mark Inari shrines. Donors contribute these gates as offerings when wishes are granted.</li>\n<li><strong>Fox Statues:</strong> Pairs of fox guardians (sometimes holding rice, keys, or jewels) flank shrine entrances and dot the grounds.</li>\n<li><strong>Mountain Location:</strong> Many Inari shrines sit on or near mountains, with pilgrimage paths marked by countless torii gates.</li>\n<li><strong>Business Shrines:</strong> Small Inari shrines appear on rooftops and in businesses, especially in merchant districts, seeking prosperity.</li>",
    "festivals": "<li><strong>Hatsu-Uma Festival (First Horse Day):</strong> Held on the first horse day of February (Inari's traditional descent date), this is the most important Inari festival celebrating the kami's blessing of crops.</li>\n<li><strong>Inari Matsuri:</strong> Various local festivals throughout the year, especially at planting and harvest times.</li>\n<li><strong>New Year (Shogatsu):</strong> Inari shrines receive massive crowds seeking blessings for prosperity in the coming year.</li>",
    "worship practices": "Worshippers offer rice, sake, aburaage (fried tofu - supposedly foxes' favorite food), and candles. Business owners and merchants particularly venerate Inari, dedicating small shrines in their establishments and making offerings for commercial success. The practice of donating torii gates when wishes are granted creates the famous gate tunnels. Prayers request agricultural abundance, business success, fertility, and general prosperity.",
    "30,000+ shrines": "Inari has more shrines than any other kami in Japan - over 30,000 (approximately one-third of all Shinto shrines). They range from grand shrine complexes to tiny roadside shrines to small altars in businesses and homes. This ubiquity reflects Inari's importance in daily Japanese life and economic activity.",
    "fushimi inari-taisha (head shrine)": "The most important Inari shrine is Fushimi Inari-taisha in Kyoto, established in 711 CE. Famous for its thousands of vermillion torii gates forming tunnels up the mountain, it receives millions of visitors annually - particularly on New Year's Day when it's among the most visited shrines in Japan. The shrine complex spreads across Mount Inari with countless sub-shrines, fox statues, and offerings along the mountain trails."
  },
  "name": "Japanese - Inari",
  "relationships": {},
  "description": "",
  "interlinks": {
    "cross_cultural_parallels": [
      {
        "name": "Demeter",
        "url": "../../greek/deities/demeter.html",
        "mythology": "Greek - Grain Goddess"
      },
      {
        "name": "Ceres",
        "url": "../../roman/deities/ceres.html",
        "mythology": "Roman - Agriculture"
      },
      {
        "name": "Osiris",
        "url": "../../egyptian/deities/osiris.html",
        "mythology": "Egyptian - Fertility God"
      },
      {
        "name": "Houji",
        "url": "../../chinese/deities/houji.html",
        "mythology": "Chinese - Grain God"
      },
      {
        "name": "Brigid",
        "url": "../../celtic/deities/brigid.html",
        "mythology": "Celtic - Fertility Goddess"
      }
    ],
    "sacred_items": [
      {
        "name": "Kitsune (Fox Spirits)",
        "url": "../../../creatures/spirits/kitsune.html",
        "type": "Divine Messengers"
      }
    ],
    "archetype": {
      "name": "🌾 AGRICULTURAL DEITY",
      "description": "Inari represents the Agricultural/Fertility deity archetype - gods who bless crops, ensure harvests, and bring prosperity.",
      "url": "../../../archetypes/agricultural-deity/index.html"
    }
  },
  "icon": "🦊",
  "subtitle": "The Rice Bearer - God of Prosperity, Foxes, and Abundance",
  "type": "deity",
  "cssColors": {},
  "searchTerms": [
    "god",
    "foxes,",
    "japanese",
    "prosperity,",
    "-",
    "rice",
    "inari",
    "the",
    "abundance",
    "japanese - inari",
    "bearer",
    "of",
    "and"
  ],
  "seeAlso": [
    {
      "url": "amaterasu.html",
      "text": "☀️Amaterasu"
    },
    {
      "url": "susanoo.html",
      "text": "🌊Susanoo"
    },
    {
      "url": "okuninushi.html",
      "text": "🏠Okuninushi"
    },
    {
      "url": "tsukuyomi.html",
      "text": "🌙Tsukuyomi"
    },
    {
      "url": "../myths/creation-of-japan.html",
      "text": "🏝Creation Myths"
    },
    {
      "url": "../../../creatures/spirits/kitsune.html",
      "text": "🦊Kitsune (Fox Spirits)"
    },
    {
      "url": "../../../archetypes/agricultural-deity/index.html",
      "text": "🌾Agricultural Deity Archetype"
    }
  ],
  "createdAt": {
    "_seconds": 1765798415,
    "_nanoseconds": 118000000
  },
  "metadata": {
    "extractionVersion": "2.6",
    "uploadedBy": "migration-script-v3.4",
    "completenessScore": 55,
    "sourceFile": "mythos/japanese/deities/inari.html",
    "uploadedAt": {
      "_seconds": 1765798415,
      "_nanoseconds": 118000000
    }
  },
  "updatedAt": {
    "_seconds": 1765798415,
    "_nanoseconds": 118000000
  }
}