{
  "id": "izanagi",
  "mythology": "japanese",
  "attributes": {},
  "mythologyStories": {
    "sources": "Kojiki(Record of Ancient Matters, 712 CE),Nihon Shoki(Chronicles of Japan, 720 CE),Sendai Kuji Hongi,Kogo Shui",
    "key_myths": [
      {
        "name": "The Heavenly Command",
        "description": "The primordial kami of the High Plain of Heaven commanded Izanagi and Izanami to solidify and give birth to the drifting land below. They descended to the Floating Bridge of Heaven (Ama-no-Ukihashi), bearing the Heavenly Jeweled Spear (Ama-no-Nuboko)."
      },
      {
        "name": "Stirring the Cosmic Ocean",
        "description": "Standing on the bridge, Izanagi and Izanami thrust the jeweled spear into the chaotic waters below and stirred. When they lifted the spear, brine dripped from its tip and accumulated to form Onogoro Island - the first solid land, the \"self-coagulating island.\""
      },
      {
        "name": "The Sacred Marriage Pillar",
        "description": "Descending to Onogoro, they erected the Heavenly August Pillar (Ama-no-Mihashira) and built a palace. To consummate their divine marriage, they walked around the pillar in opposite directions - Izanami from the right, Izanagi from the left. When they met, Izanami spoke first in greeting. Their first child, Hiruko (the leech-child), was born deformed and was placed in a reed boat and set adrift - punishment for Izanami having spoken first, violating proper order."
      },
      {
        "name": "The Correct Ritual",
        "description": "They consulted the heavenly kami and repeated the ritual, this time with Izanagi speaking first. The proper order established, they gave birth to the eight great islands of Japan (Awaji, Iyo, Oki, Tsukushi, Iki, Tsushima, Sado, and Yamato) and then numerous smaller islands, creating the Japanese archipelago."
      },
      {
        "name": "The Journey Underground",
        "description": "Unable to accept Izanami's death, Izanagi descended to Yomi-no-Kuni (the Land of the Dead) to bring her back. In the darkness, he called out to her. Izanami replied from the shadows: she had already eaten the food of Yomi and could not easily return. She would petition the gods of the underworld but commanded Izanagi not to look upon her."
      },
      {
        "name": "The Forbidden Sight",
        "description": "Growing impatient, Izanagi broke a tooth from his comb, lit it as a torch, and gazed upon his wife. He saw her corpse crawling with maggots, her body rotting, eight thunder kami born from her decay. The polluted Izanami, shamed and enraged, sent the Shikome (Hags of Yomi) and the thunder gods to pursue him."
      },
      {
        "name": "The Chase from Yomi",
        "description": "Izanagi fled, throwing obstacles behind him. His headdress became grapes; his comb teeth became bamboo shoots - diversions for his pursuers. At the slope of Yomi (Yomotsu Hirasaka), he found three peaches and threw them at the army of the dead, driving them back. Finally, Izanami herself pursued him. At the boundary between worlds, Izanagi rolled a massive boulder across the entrance, sealing Yomi forever."
      },
      {
        "name": "The Divorce of the Dead",
        "description": "From opposite sides of the boulder, husband and wife spoke their final words. Izanami declared she would kill one thousand people of his land each day. Izanagi replied he would then ensure one thousand five hundred were born each day. Thus death entered the world, but life would always exceed it. Their marriage was dissolved - the first divorce."
      }
    ],
    "intro": "Izanagi's myths are the foundational narratives of Shinto cosmology. His story is one of cosmic creation followed by devastating personal loss, ultimately transformed through ritual purification into new creation. These myths establish core Shinto concepts: the sacredness of land, the power of purification, and the separation between the living and the dead."
  },
  "tags": [
    "japanese",
    "deity"
  ],
  "worship": {
    "festivals & practices": "<li><strong>Oharae (Great Purification):</strong> June 30 and December 31 purification rituals that trace directly to Izanagi's misogi, cleansing pollution accumulated over the half-year</li>\n<li><strong>Misogi-harae:</strong> Water purification rituals practiced at rivers and seas, following Izanagi's example</li>\n<li><strong>Taga Taisha Matsuri:</strong> Major festival at Taga Shrine celebrating Izanagi</li>",
    "worship practices": "Izanagi is primarily invoked in the context of purification, creation, and new beginnings. His example established misogi (water purification) as the fundamental Shinto practice for removing pollution and restoring spiritual cleanliness. Couples may pray to Izanagi (and Izanami together) for fertility, creative endeavors, and harmonious marriage - though the awareness of their ultimate separation adds complexity to such prayers. His mythology also makes him significant for those dealing with grief and loss, as he was the first to experience the death of a loved one.",
    "major shrines": "<li><strong>Taga Taisha (Shiga Prefecture):</strong> One of the most important Izanagi shrines, where he is said to have retired after entrusting the world to his children. Contains traditions about the Heavenly Jeweled Spear.</li>\n<li><strong>Izanagi Jingu (Awaji Island):</strong> Claims to be built on the site of Onogoro, the first land. One of the oldest shrines in Japan, possibly dating to the early Kofun period.</li>\n<li><strong>Eda Shrine (Miyazaki):</strong> Located near the traditional site of Izanagi's purification at Tachibana River.</li>\n<li><strong>Kumano Nachi Taisha (Wakayama):</strong> Izanagi enshrined alongside other kami at this important pilgrimage site.</li>"
  },
  "name": "Japanese - Izanagi",
  "relationships": {
    "family": {
      "children": "Various kami born as he removed his clothes for purification",
      "consorts": "Izanami-no-Mikoto- \"She Who Invites,\" his divine sister-wife, now ruler of Yomi"
    }
  },
  "description": "",
  "interlinks": {
    "cross_cultural_parallels": [
      {
        "name": "Brahma",
        "url": "../../hindu/deities/brahma.html",
        "mythology": "Hindu - Creator"
      },
      {
        "name": "Ptah",
        "url": "../../egyptian/deities/ptah.html",
        "mythology": "Egyptian - Creator"
      },
      {
        "name": "Uranus",
        "url": "../../greek/deities/uranus.html",
        "mythology": "Greek - Sky Father"
      },
      {
        "name": "Odin",
        "url": "../../norse/deities/odin.html",
        "mythology": "Norse - All-Father"
      },
      {
        "name": "Pangu",
        "url": "../../chinese/deities/index.html",
        "mythology": "Chinese - World Creator"
      }
    ],
    "sacred_items": [
      {
        "name": "Izanami",
        "url": "izanami.html",
        "type": "Creator Goddess"
      }
    ],
    "archetype": {
      "name": "✨ CREATOR GOD",
      "description": "Izanagi embodies the Creator God archetype - the primordial masculine force that brings order from chaos and fathers the divine generations.",
      "url": "../../../archetypes/celestial/index.html"
    }
  },
  "icon": "✨",
  "subtitle": "The Male Who Invites - Progenitor of the Gods",
  "type": "deity",
  "cssColors": {},
  "searchTerms": [
    "progenitor",
    "japanese",
    "gods",
    "-",
    "who",
    "japanese - izanagi",
    "male",
    "invites",
    "the",
    "izanagi",
    "of"
  ],
  "seeAlso": [
    {
      "url": "izanami.html",
      "text": "🌈Izanami"
    },
    {
      "url": "amaterasu.html",
      "text": "☀️Amaterasu"
    },
    {
      "url": "susanoo.html",
      "text": "🌊Susanoo"
    },
    {
      "url": "tsukuyomi.html",
      "text": "🌙Tsukuyomi"
    },
    {
      "url": "../../../index.html",
      "text": "🔥Kagutsuchi"
    },
    {
      "url": "../myths/index.html",
      "text": "🌍Creation Myth"
    },
    {
      "url": "../../../index.html",
      "text": "💧Misogi Purification"
    },
    {
      "url": "../../../archetypes/celestial/index.html",
      "text": "✨Creator God Archetype"
    }
  ],
  "createdAt": {
    "_seconds": 1765798415,
    "_nanoseconds": 272000000
  },
  "metadata": {
    "extractionVersion": "2.6",
    "uploadedBy": "migration-script-v3.4",
    "completenessScore": 60,
    "sourceFile": "mythos/japanese/deities/izanagi.html",
    "uploadedAt": {
      "_seconds": 1765798415,
      "_nanoseconds": 272000000
    }
  },
  "updatedAt": {
    "_seconds": 1765798415,
    "_nanoseconds": 272000000
  }
}