{
  "id": "izanami",
  "mythology": "japanese",
  "attributes": {},
  "mythologyStories": {
    "sources": "Kojiki(Record of Ancient Matters, 712 CE),Nihon Shoki(Chronicles of Japan, 720 CE),Sendai Kuji Hongi,Engishiki",
    "key_myths": [
      {
        "name": "The Divine Commission",
        "description": "Together with <a href=\"izanagi.html\">Izanagi</a>, Izanami was commanded by the primordial kami to give form to the drifting chaos below heaven. They descended the Floating Bridge of Heaven bearing the jeweled spear Ama-no-Nuboko."
      },
      {
        "name": "Stirring the Cosmic Ocean",
        "description": "The divine couple thrust the spear into the chaotic waters and stirred. When they raised it, brine dripping from its tip coagulated to form Onogoro Island - the first solid land in existence."
      },
      {
        "name": "The Marriage Ritual",
        "description": "On Onogoro, they erected the Heavenly August Pillar and circled it in opposite directions to perform the sacred marriage rite. When they met, Izanami spoke first: \"What a fine young man!\" Their first offspring, Hiruko (the leech-child), was born deformed - a consequence of violating proper order by having the female speak first."
      },
      {
        "name": "The Correct Ritual",
        "description": "After consulting the heavenly kami, they repeated the ceremony with Izanagi speaking first. From this properly ordered union, Izanami gave birth to the eight great islands of Japan (Awaji, Iyo, Oki, Tsukushi, Iki, Tsushima, Sado, and Yamato) and countless smaller islands."
      },
      {
        "name": "Birth of the Kami",
        "description": "Izanami continued to give birth to kami governing all aspects of nature - seas, winds, mountains, trees, and rivers. The creative force of her divine womb populated the world with the spiritual beings that inhabit every aspect of nature."
      },
      {
        "name": "The Birth of Fire",
        "description": "When Izanami gave birth to Kagutsuchi, the fire god, his flames burned her severely. She lingered in agony while more kami were born from her vomit, urine, and feces - deities of metal, clay, and water. Despite her suffering and Izanagi's desperate care, she died from her burns."
      },
      {
        "name": "The First Corpse",
        "description": "Izanami's death was the first death in creation - before her, no divine being had experienced mortality. Her body was buried on Mount Hiba, at the border of Izumo and Hahaki provinces. Izanagi, mad with grief, killed Kagutsuchi, and from the fire god's blood and body parts sprang yet more kami."
      },
      {
        "name": "Izanagi's Descent",
        "description": "Unable to accept her death, Izanagi followed Izanami to Yomi-no-Kuni, the shadowy underworld. He found her in darkness and begged her to return. She replied that she had already eaten the food of Yomi and was bound to the realm of the dead. However, she would petition the gods of Yomi for release - but commanded Izanagi not to look upon her."
      },
      {
        "name": "The Forbidden Sight",
        "description": "Izanagi grew impatient and lit a torch using his comb. What he saw horrified him: Izanami's body was rotting, crawling with maggots, and eight thunder kami had been born from different parts of her decaying corpse. Her head hosted Great-Thunder (Owakikazuchi), her breast hosted Fire-Thunder (Ho-no-ikazuchi), her belly hosted Black-Thunder (Kuro-ikazuchi), and so on."
      },
      {
        "name": "The Rage of Izanami",
        "description": "Shamed and furious at being seen in her polluted state, Izanami sent the Shikome (Hags of Yomi) to pursue Izanagi. When they failed, she sent the Eight Thunder Gods with 1,500 warriors of Yomi. Izanagi fled, using magical objects to slow his pursuers, until he reached the slope between worlds."
      },
      {
        "name": "The Eternal Separation",
        "description": "At Yomotsu Hirasaka, the boundary between Yomi and the living world, Izanagi blocked the passage with a massive boulder that would take a thousand men to move. From opposite sides of this stone, the divorced couple spoke their final words. Izanami declared: \"My beloved husband, if you do this, I will strangle one thousand of your people every day.\" Izanagi replied: \"My beloved wife, if you do this, I will build one thousand five hundred birthing huts every day.\" Thus death entered the world - but life would always exceed it."
      }
    ],
    "intro": "Izanami's mythology forms the essential narrative of Shinto cosmology, encompassing creation, the first death, and the establishment of the boundary between the living and dead worlds. Her transformation from nurturing creator to fearsome death goddess represents one of the most powerful theological concepts in Japanese religion: that birth and death, creation and destruction, are manifestations of the same divine force."
  },
  "tags": [
    "japanese",
    "deity"
  ],
  "worship": {
    "festivals": "<li><strong>Izanami-related rites at Taga Taisha:</strong> Honoring both creator deities</li>\n<li><strong>Obon Festival:</strong> Though not specifically for Izanami, this festival of the dead acknowledges her realm</li>\n<li><strong>Purification rituals (Oharae):</strong> These counteract the pollution associated with death - pollution that originated from Izanami</li>",
    "worship practices": "Worship of Izanami is nuanced by her dual nature. In her creative aspect, she is honored alongside Izanagi for fertility, successful births, and the sacredness of the land. Couples may pray to both creator deities for harmonious marriage and children. In her death aspect, she is approached with appropriate caution and respect. Rituals acknowledging death and transition may invoke her as the ruler of Yomi, though such practices require proper purification afterward. Her mythology serves as the basis for many funeral and memorial customs.",
    "major shrines": "Direct worship of Izanami is relatively uncommon, as her association with death and pollution (kegare) makes her a complex figure for devotion. However, she is honored at several sites: <li><strong>Kamosu Shrine (Shimane):</strong> Enshrines Izanami and marks her burial place on Mount Hiba</li>\n<li><strong>Hanayama Shrine (Shiga):</strong> One of the few shrines specifically dedicated to Izanami</li>\n<li><strong>Taga Taisha (Shiga):</strong> Enshrines both Izanagi and Izanami, one of the most important creator deity shrines</li>\n<li><strong>Izanagi Jingu (Awaji):</strong> Though primarily for Izanagi, also honors Izanami's role in creation</li>\n<li><strong>Sites near Yomotsu Hirasaka:</strong> Several locations in Shimane claim to be the legendary entrance to Yomi</li>"
  },
  "name": "Japanese - Izanami",
  "relationships": {
    "family": {
      "children": "The Eight Thunder Gods, born from her decaying corpse",
      "consorts": "Izanagi-no-Mikoto- \"He Who Invites,\" now divorced and separated by the boulder of Yomi"
    }
  },
  "description": "",
  "interlinks": {
    "cross_cultural_parallels": [
      {
        "name": "Persephone",
        "url": "../../greek/deities/persephone.html",
        "mythology": "Greek - Queen of Underworld"
      },
      {
        "name": "Ereshkigal",
        "url": "../../sumerian/deities/ereshkigal.html",
        "mythology": "Mesopotamian - Death"
      },
      {
        "name": "Hel",
        "url": "../../norse/deities/hel.html",
        "mythology": "Norse - Underworld"
      },
      {
        "name": "Kali",
        "url": "../../hindu/deities/kali.html",
        "mythology": "Hindu - Death/Creation"
      },
      {
        "name": "Gaia",
        "url": "../../greek/deities/gaia.html",
        "mythology": "Greek - Earth Mother"
      }
    ],
    "sacred_items": [
      {
        "name": "Izanagi",
        "url": "izanagi.html",
        "type": "Creator God"
      }
    ],
    "archetype": {
      "name": "🌈 MOTHER GODDESS / DEATH GODDESS",
      "description": "Izanami uniquely embodies both the Mother Goddess (creator of land and life) and Death Goddess (ruler of the underworld) archetypes - creation and destruction in one deity.",
      "url": "../../../archetypes/celestial/index.html"
    }
  },
  "icon": "🌈",
  "subtitle": "She Who Invites - Mother of Creation, Queen of the Dead",
  "type": "deity",
  "cssColors": {},
  "searchTerms": [
    "japanese - izanami",
    "japanese",
    "queen",
    "creation,",
    "she",
    "-",
    "who",
    "invites",
    "the",
    "mother",
    "dead",
    "of",
    "izanami"
  ],
  "seeAlso": [
    {
      "url": "izanagi.html",
      "text": "✨Izanagi"
    },
    {
      "url": "amaterasu.html",
      "text": "☀️Amaterasu"
    },
    {
      "url": "susanoo.html",
      "text": "🌊Susanoo"
    },
    {
      "url": "tsukuyomi.html",
      "text": "🌙Tsukuyomi"
    },
    {
      "url": "../../../index.html",
      "text": "🔥Kagutsuchi"
    },
    {
      "url": "../myths/index.html",
      "text": "🌉Descent to Yomi"
    },
    {
      "url": "../../../index.html",
      "text": "💀Yomi-no-Kuni"
    },
    {
      "url": "../../../archetypes/celestial/index.html",
      "text": "💀Death Goddess Archetype"
    }
  ],
  "createdAt": {
    "_seconds": 1765798415,
    "_nanoseconds": 397000000
  },
  "metadata": {
    "extractionVersion": "2.6",
    "uploadedBy": "migration-script-v3.4",
    "completenessScore": 60,
    "sourceFile": "mythos/japanese/deities/izanami.html",
    "uploadedAt": {
      "_seconds": 1765798415,
      "_nanoseconds": 397000000
    }
  },
  "updatedAt": {
    "_seconds": 1765798415,
    "_nanoseconds": 397000000
  }
}