{
  "id": "nezha",
  "mythology": "chinese",
  "attributes": {},
  "mythologyStories": {
    "key_myths": [
      {
        "name": "Miraculous Birth",
        "description": "Nezha was born to Lady Yin after three years and six months of pregnancy. He emerged as a ball of flesh, which his father Li Jing (later the Pagoda-Bearing Heavenly King) struck with his sword. From the flesh emerged a fully-formed child wearing the Universe Ring and Red Armillary Sash, gifts from his immortal teacher Taiyi Zhenren."
      },
      {
        "name": "Slaying of Ao Bing",
        "description": "While bathing in the sea, young Nezha's magical sash stirred the Dragon King's underwater palace. When the Dragon King sent his third son Ao Bing to investigate, Nezha killed him in the ensuing confrontation. This act triggered divine retribution from the Dragon Kings of the Four Seas, who demanded justice from the Jade Emperor."
      },
      {
        "name": "Filial Sacrifice",
        "description": "To protect his parents from the Dragon Kings' wrath, Nezha committed suicide by cutting out his own flesh and returning it to his mother and his bones to his father. This extreme act of filial piety released his parents from responsibility for his deeds, but left his spirit wandering without a body."
      },
      {
        "name": "Lotus Rebirth",
        "description": "His teacher Taiyi Zhenren reconstructed Nezha's body from lotus roots, lotus leaves, and lotus flowers, giving him immortal form and even greater powers. Reborn as the Lotus Prince, Nezha sought revenge against his father Li Jing for destroying his temple, but was ultimately reconciled through Buddha's intervention."
      },
      {
        "name": "War Against the Shang",
        "description": "In the Fengshen Yanyi, Nezha serves as a general in King Wu's army against the tyrannical King Zhou of Shang. He battles numerous demons and enemy generals, contributing to the establishment of the Zhou Dynasty and the investiture of the gods."
      },
      {
        "name": "Journey to the West",
        "description": "Nezha attempts to capture Sun Wukong on behalf of the Jade Emperor. Despite his formidable powers, he is defeated by the Monkey King, demonstrating both his warrior prowess and the exceptional nature of Sun Wukong's abilities."
      }
    ],
    "intro": "Nezha's mythology is one of the most dramatic in Chinese tradition, featuring themes of miraculous birth, tragic sacrifice, divine rebirth, and ultimate redemption. His stories appear prominently in the <em>Fengshen Yanyi</em> (Investiture of the Gods) and <em>Journey to the West</em>, where he serves as both a fierce warrior and complex figure struggling with filial duty and personal identity."
  },
  "tags": [
    "chinese",
    "deity"
  ],
  "worship": {
    "festivals": "<li><strong>Nezha's Birthday (哪吒诞):</strong> Celebrated on the 9th day of the 9th lunar month (some regions observe different dates). Features lion dances, opera performances, and spirit medium rituals.</li>\n<li><strong>Ghost Month Ceremonies:</strong> Nezha is invoked to protect against malevolent spirits during the seventh lunar month.</li>",
    "sacred sites": "Nezha is widely worshipped throughout China, Taiwan, and Southeast Asian Chinese communities: <li><strong>Taiwan:</strong> Numerous Nezha temples, especially popular among youth and gamblers</li>\n<li><strong>Sichuan:</strong> Temples in the region traditionally associated with his mythology</li>\n<li><strong>Fujian &amp; Guangdong:</strong> Major temple centers with elaborate festival traditions</li>\n<li><strong>Malaysia &amp; Singapore:</strong> Active worship in Chinese diaspora communities</li>",
    "offerings": "<li><strong>Toys and sweets:</strong> Reflecting his child nature</li>\n<li><strong>Red items:</strong> Candles, cloth, incense in his sacred color</li>\n<li><strong>Roasted meats:</strong> Particularly duck and pork</li>\n<li><strong>Firecrackers:</strong> To honor his fiery nature</li>\n<li><strong>Spirit money:</strong> Especially gold-colored offerings</li>",
    "patronage": "Nezha is particularly popular among: <li>Children and parents seeking protection for their young</li>\n<li>Gamblers and those seeking luck in games of chance</li>\n<li>Those seeking exorcism or protection from evil spirits</li>\n<li>Youth culture in Taiwan (associated with temple-boy culture)</li>\n<li>Martial artists and soldiers</li>"
  },
  "name": "Chinese - Nezha",
  "relationships": {},
  "description": "",
  "interlinks": {
    "cross_cultural_parallels": [
      {
        "name": "Heracles",
        "url": "../../greek/heroes/heracles.html",
        "mythology": "Greek"
      },
      {
        "name": "Krishna",
        "url": "../../hindu/deities/krishna.html",
        "mythology": "Hindu"
      },
      {
        "name": "Cuchulain",
        "url": "../../celtic/heroes/index.html",
        "mythology": "Celtic"
      },
      {
        "name": "Maui",
        "url": "../../../index.html",
        "mythology": "Polynesian"
      },
      {
        "name": "Thor",
        "url": "../../norse/deities/thor.html",
        "mythology": "Norse"
      },
      {
        "name": "Momotaro",
        "url": "../../../index.html",
        "mythology": "Japanese"
      }
    ],
    "sacred_items": [
      {
        "name": "Fire-Tipped Spear",
        "url": "../../../index.html",
        "type": "Divine Weapon"
      }
    ],
    "archetype": {
      "name": "🔥 DIVINE CHILD / WARRIOR YOUTH",
      "description": "Nezha embodies the Divine Child archetype - miraculous birth, supernatural powers from youth, rebellion against authority, death and rebirth into greater form.",
      "url": "../../../archetypes/index.html"
    }
  },
  "icon": "",
  "subtitle": "",
  "type": "deity",
  "cssColors": {
    "secondary": "#FFD700",
    "primary": "#DC143C"
  },
  "searchTerms": [
    "chinese",
    "-",
    "chinese - nezha",
    "nezha"
  ],
  "seeAlso": [
    {
      "url": "jade-emperor.html",
      "text": "👑Jade Emperor"
    },
    {
      "url": "erlang-shen.html",
      "text": "👁Erlang Shen"
    },
    {
      "url": "dragon-kings.html",
      "text": "🐉Dragon Kings"
    },
    {
      "url": "guanyin.html",
      "text": "🙏Guanyin"
    },
    {
      "url": "../heroes/index.html",
      "text": "🐵Sun Wukong & Heroes"
    },
    {
      "url": "../texts/index.html",
      "text": "📖Fengshen Yanyi"
    },
    {
      "url": "../../../archetypes/index.html",
      "text": "🔥Divine Child Archetype"
    },
    {
      "url": "../creatures/index.html",
      "text": "🐉Dragons & Creatures"
    }
  ],
  "createdAt": {
    "_seconds": 1765798392,
    "_nanoseconds": 17000000
  },
  "metadata": {
    "extractionVersion": "2.6",
    "uploadedBy": "migration-script-v3.4",
    "completenessScore": 45,
    "sourceFile": "mythos/chinese/deities/nezha.html",
    "uploadedAt": {
      "_seconds": 1765798392,
      "_nanoseconds": 17000000
    }
  },
  "updatedAt": {
    "_seconds": 1765798392,
    "_nanoseconds": 17000000
  }
}