{
  "id": "satis",
  "mythology": "egyptian",
  "attributes": {
    "Domains": "Nile flood, southern border protection, arrows and archery, fertility (through flooding), water abundance, swift justice",
    "Symbols": "Bow and arrow, antelope horns, white crown of Upper Egypt, water jar, ankh",
    "Colors": "River blue, water blue, white (crown and purity), silver (arrows)",
    "SacredAnimals": "Antelope (swift and sure-footed), gazelle",
    "Era": "Old Kingdom through Late Period",
    "Titles": "The Arrow, Mistress of Elephantine, She Who Shoots Forth, Guardian of the Southern Gate, Lady of the Flood, The Swift One"
  },
  "mythologyStories": {
    "sources": "Pyramid Texts, Temple inscriptions at Elephantine Island, Sehel Island stelae, texts from the Temple of Khnum at Elephantine",
    "intro": "<a class=\"corpus-link\" data-term=\"Satis\" data-tradition=\"egyptian\" href=\"../corpus-search.html?term=satis\" title=\"Search corpus for 'Satis'\">Satis</a>'s <a class=\"corpus-link\" data-term=\"Mythology\" data-tradition=\"egyptian\" href=\"../corpus-search.html?term=mythology\" title=\"View mythology in ancient texts\">mythology</a> centers on her role as the personification of the Nile's yearly inundation and her fierce protection of Egypt's southern frontier at Elephantine Island, near Aswan. She is the swift arrow of divine justice and the rushing waters that bring life to the land."
  },
  "tags": [
    "deity",
    "sacredanimals",
    "titles",
    "egyptian",
    "symbols",
    "domains",
    "era",
    "colors"
  ],
  "worship": {
    "elephantine island": "Satis's primary cult center was at Elephantine Island (ancient Abu) near modern Aswan, at the First Cataract of the Nile. This location was considered the source of the Nile flood, where Khnum's sacred cave supposedly released the waters each year. The temple complex at Elephantine honored the entire triad, with Satis receiving particular veneration as the goddess who ensured the flood's timely arrival.",
    "offerings": "Offerings to Satis included water libations, arrows (symbolic of her protective power), white linen, and images of antelopes or gazelles. During flood season, special prayers and offerings were made to ensure the waters would come swiftly and abundantly.",
    "sehel island": "Nearby Sehel Island contains numerous inscriptions and stelae dedicated to Satis, many left by officials and travelers seeking her protection as they ventured into Nubia or praying for a good flood season."
  },
  "name": "Satis - Goddess of the Nile Flood",
  "relationships": {
    "family": {
      "consorts": "Khnum(ram-headed creator god who controls the flood from beneath Elephantine Island)"
    }
  },
  "description": "<a href=\"../corpus-search.html?term=satis\" style=\"color: white; text-decoration: underline;\">Satis</a> is the swift arrow goddess of ancient Egypt, who personifies the flooding of the Nile and guards Egypt's southern frontier. As part of the <a class=\"corpus-link\" data-term=\"Elephantine Triad\" data-tradition=\"egyptian\" href=\"../corpus-search.html?term=elephantine\" title=\"Search corpus for 'Elephantine Triad'\">Elephantine Triad</a> alongside <a href=\"../corpus-search.html?term=khnum\" style=\"color: white; text-decoration: underline;\">Khnum</a> and <a href=\"../corpus-search.html?term=anuket\" style=\"color: white; text-decoration: underline;\">Anuket</a>, she represents the swift, life-giving waters of the annual inundation and the protective fury that defends Egypt's borders from invaders. Her arrows fly true like the rushing flood waters that bring fertility to the land.",
  "interlinks": {},
  "icon": "🏹",
  "subtitle": "Goddess of the Nile Flood and Southern Border",
  "type": "deity",
  "cssColors": {
    "secondary": "#4EA5D9",
    "primary": "#006994"
  },
  "searchTerms": [
    "southern",
    "satis - goddess of the nile flood",
    "satis",
    "nile",
    "-",
    "border",
    "goddess",
    "the",
    "flood",
    "of",
    "and"
  ],
  "seeAlso": [],
  "createdAt": {
    "_seconds": 1765798405,
    "_nanoseconds": 356000000
  },
  "metadata": {
    "extractionVersion": "2.6",
    "uploadedBy": "migration-script-v3.4",
    "completenessScore": 73,
    "sourceFile": "mythos/egyptian/deities/satis.html",
    "uploadedAt": {
      "_seconds": 1765798405,
      "_nanoseconds": 356000000
    }
  },
  "updatedAt": {
    "_seconds": 1765798405,
    "_nanoseconds": 356000000
  }
}