{
  "id": "susanoo",
  "mythology": "japanese",
  "attributes": {},
  "mythologyStories": {
    "sources": "Kojiki(712 CE),Nihon Shoki(720 CE),Izumo Fudoki(733 CE),Sendai Kuji Hongi",
    "key_myths": [
      {
        "name": "Birth from Izanagi's Nose",
        "description": "When Izanagi purified himself after fleeing Yomi, Susanoo was born from his nose - fitting origin for a god of howling winds. Unlike his siblings who accepted their celestial domains, Susanoo wept and raged, longing for his mother Izanami in the underworld. His uncontrollable grief caused mountains to wither and seas to dry up, prompting Izanagi to exile him from heaven before he ever properly ruled."
      },
      {
        "name": "The Destruction in Heaven",
        "description": "Before his exile, Susanoo visited Amaterasu in Takamagahara, claiming peaceful intentions. Initially Amaterasu was suspicious, but after a divine contest of creation seemed to prove his sincerity, she lowered her guard. Susanoo then went on a destructive rampage: he broke down the ridges between Amaterasu's celestial rice paddies, defiled her sacred halls with excrement, and horrifically threw a flayed piebald horse through the roof of her weaving hall, killing one of her maidens. This violence drove Amaterasu into her cave, plunging the world into darkness."
      },
      {
        "name": "Exile and the Slaying of Yamata-no-Orochi",
        "description": "Cast down from heaven with his beard cut off and nails torn out (symbolic mutilation), Susanoo wandered to Izumo Province. There he encountered an elderly couple weeping over their daughter Kushinadahime - their eighth and last child, as the eight-headed, eight-tailed dragon Yamata-no-Orochi had devoured the others. Susanoo agreed to slay the monster in exchange for Kushinadahime's hand. He transformed her into a comb (kushinada means \"wondrous comb\") for safety, then prepared eight vats of sake. The dragon, lured by the alcohol, stuck its eight heads into the vats and became drunk. Susanoo then hacked it to pieces with his sword. In the dragon's tail, he discovered the legendary sword Kusanagi-no-Tsurugi (\"Grass-Cutting Sword\"), which he presented to Amaterasu as a peace offering. This sword became one of the Three Imperial Regalia."
      },
      {
        "name": "Marriage and the Palace of Suga",
        "description": "After slaying Orochi, Susanoo married Kushinadahime and built a palace at Suga in Izumo. Looking upon the rising clouds over his new home, he composed what is considered Japan's first waka poem: \"Yakumo tatsu / Izumo yaegaki / Tsuma-gomi ni / Yaegaki tsukuru / Sono yaegaki wo\" - \"Many clouds arise / The clouds of Izumo / For the dwelling of husband and wife / I build a many-layered fence / Oh, that many-layered fence!\" This moment marks his transformation from chaos-bringer to civilized being capable of beauty and creation."
      },
      {
        "name": "Lord of Ne-no-Kuni",
        "description": "After his earthly adventures, Susanoo descended to rule Ne-no-Kuni (the Land of Roots), a realm sometimes identified with or adjacent to Yomi. There he later tested and eventually blessed the hero Okuninushi, who sought refuge with him, eventually giving Okuninushi his daughter and magical items to help him establish rule over Izumo."
      }
    ],
    "intro": "Susanoo's myths chart a dramatic arc from petulant divine child to exiled troublemaker to heroic dragon-slayer. His stories explore themes of chaos versus order, exile and redemption, and the necessary role of destructive forces in maintaining cosmic balance. Where his sister Amaterasu represents civilized light, Susanoo embodies the wild darkness that makes that light meaningful."
  },
  "tags": [
    "japanese",
    "deity"
  ],
  "worship": {
    "festivals": "<li><strong>Gion Matsuri (July, Kyoto):</strong> Japan's most famous festival, originally began as prayers to Susanoo (as Gozu Tenno) to avert plague. Features elaborate floats (yamaboko) and processions</li>\n<li><strong>Tsushima Matsuri:</strong> Summer festival with illuminated boats to ward off epidemics</li>\n<li><strong>Nagoshi no Harae (June 30):</strong> Purification festival where devotees pass through chinowa (grass rings) associated with Susanoo's blessing</li>",
    "worship practices": "Susanoo is primarily invoked for protection against disease, storms, and misfortune. The chinowa-kuguri ritual (passing through grass rings) purifies devotees and grants his protection. As Gozu Tenno in Buddhist syncretism, he was widely worshipped as a protector against epidemics - the Gion Festival's original purpose. Farmers pray to him for beneficial rain while seeking protection from destructive storms. Warriors invoked his courage and ferocity in battle.",
    "major shrines": "<li><strong>Yasaka Shrine (Kyoto):</strong> Also called Gion Shrine, one of the most important Susanoo shrines, center of the famous Gion Festival</li>\n<li><strong>Hikawa Shrine (Saitama):</strong> Over 2,400 years old, one of the oldest shrines in Japan dedicated to Susanoo</li>\n<li><strong>Susa Shrine (Shimane):</strong> Located in Izumo, traditional site of his earthly palace</li>\n<li><strong>Tsushima Shrine (Aichi):</strong> Center of the Tsushima Festival involving floats on the Tenno River</li>\n<li><strong>Numerous Tenmangu shrines:</strong> Through syncretism with Gozu Tenno</li>"
  },
  "name": "Japanese - Susanoo",
  "relationships": {
    "family": {
      "siblings": "Amaterasu-Omikami(elder sister, born from left eye),Tsukuyomi-no-Mikoto(brother, born from right eye)",
      "children": "Yashimajinumi-no-kami, Suseri-hime (who married Okuninushi), and many others through various relationships",
      "consorts": "Kushinadahime (the princess he saved from Orochi)"
    }
  },
  "description": "",
  "interlinks": {
    "cross_cultural_parallels": [
      {
        "name": "Thor",
        "url": "../../norse/deities/thor.html",
        "mythology": "Norse - Thunder God"
      },
      {
        "name": "Indra",
        "url": "../../hindu/deities/indra.html",
        "mythology": "Hindu - Storm God"
      },
      {
        "name": "Poseidon",
        "url": "../../greek/deities/poseidon.html",
        "mythology": "Greek - Sea God"
      },
      {
        "name": "Set",
        "url": "../../egyptian/deities/set.html",
        "mythology": "Egyptian - Chaos God"
      },
      {
        "name": "Perun",
        "url": "../../../index.html",
        "mythology": "Slavic - Thunder God"
      }
    ],
    "sacred_items": [
      {
        "name": "Kusanagi-no-Tsurugi",
        "url": "../../../spiritual-items/weapons/kusanagi.html",
        "type": "Divine Sword"
      }
    ],
    "archetype": {
      "name": "⚡ STORM GOD",
      "description": "Susanoo embodies the Storm God archetype - the wild, powerful force that brings both destruction and necessary renewal through chaos.",
      "url": "../../../archetypes/celestial/index.html"
    }
  },
  "icon": "🌊",
  "subtitle": "The Tempestuous God of Storms and Sea",
  "type": "deity",
  "cssColors": {},
  "searchTerms": [
    "god",
    "tempestuous",
    "japanese",
    "-",
    "sea",
    "the",
    "storms",
    "japanese - susanoo",
    "susanoo",
    "of",
    "and"
  ],
  "seeAlso": [
    {
      "url": "amaterasu.html",
      "text": "☀️Amaterasu"
    },
    {
      "url": "tsukuyomi.html",
      "text": "🌙Tsukuyomi"
    },
    {
      "url": "izanagi.html",
      "text": "✨Izanagi"
    },
    {
      "url": "izanami.html",
      "text": "🌈Izanami"
    },
    {
      "url": "../../../index.html",
      "text": "🌿Okuninushi"
    },
    {
      "url": "../myths/index.html",
      "text": "🗡️Slaying of Orochi"
    },
    {
      "url": "../../../archetypes/celestial/index.html",
      "text": "⚡Storm God Archetype"
    }
  ],
  "createdAt": {
    "_seconds": 1765798415,
    "_nanoseconds": 716000000
  },
  "metadata": {
    "extractionVersion": "2.6",
    "uploadedBy": "migration-script-v3.4",
    "completenessScore": 60,
    "sourceFile": "mythos/japanese/deities/susanoo.html",
    "uploadedAt": {
      "_seconds": 1765798415,
      "_nanoseconds": 716000000
    }
  },
  "updatedAt": {
    "_seconds": 1765798415,
    "_nanoseconds": 716000000
  }
}