{
  "id": "orlog",
  "type": "concept",
  "name": "Orlog",
  "icon": "⚖️",
  "slug": "orlog",
  "mythologies": ["norse"],
  "primaryMythology": "norse",
  "shortDescription": "The primal law and accumulated layers of past actions that shape fate and define the fundamental nature of existence",
  "fullDescription": "Orlog (Old Norse: ǫrlog, literally 'primal law' or 'primal layers') is a fundamental concept in Norse cosmology representing the accumulation of all past actions and their consequences, forming the foundation upon which wyrd (fate) is built. Orlog is more primordial than wyrd—it is the deep structure of reality itself, the layers of what has been done that cannot be undone. Every action adds to the orlog of individuals, families, and the cosmos itself. Unlike wyrd which has dynamic aspects, orlog represents the fixed, unchangeable past that constrains and shapes what can happen in the future. The term combines 'ór' (primal/original) and 'log' (law/layer), suggesting both fundamental law and stratified layers of accumulated consequences. Orlog explains why even the gods cannot prevent Ragnarök—the accumulated weight of past actions throughout cosmic history makes the end inevitable. The concept teaches that we inherit the consequences of our ancestors' actions while simultaneously creating consequences for our descendants.",
  "category": "principle",
  "colors": {
    "primary": "#2F4F4F",
    "secondary": "#696969",
    "primaryRgb": "47, 79, 79"
  },
  "tags": [
    "primal-law",
    "consequences",
    "past-actions",
    "cosmic-law",
    "layers",
    "accumulated-fate",
    "ancestral",
    "fundamental"
  ],

  "metaphysicalProperties": {
    "energyType": "ordered"
  },

  "mythologyContexts": [
    {
      "mythology": "norse",
      "usage": "Orlog represents the deep structure of reality in Norse thought—the fundamental law and accumulated past that cannot be changed. While wyrd is what you're becoming based on what has been, orlog is what has been itself. The concept explains intergenerational consequences: children inherit their parents' orlog, which is why family honor and reputation mattered so intensely in Norse culture. Orlog also explains why the gods cannot simply remake reality to prevent Ragnarök—the layers of past actions throughout all time create an unchangeable foundation. The Norse understanding that we are constrained but not wholly determined by orlog created a worldview balancing fate and free will.",
      "names": [
        "Ǫrlog (Primal Law)",
        "Primal Layers",
        "The Deep Fate",
        "The Unchangeable Past"
      ],
      "symbolism": "Orlog symbolizes the weight of history and the inescapable nature of consequences. The image of layers suggests geological strata—each age's actions forming bedrock for the next. Orlog teaches that we are built upon the past, constrained by what has already happened, yet we add our own layer through current choices. The concept represents cosmic justice in an impersonal sense—not moral judgment but inevitable consequence. Orlog reminds us that actions have permanent effects that ripple forward through time, affecting not just ourselves but our descendants and the wider world.",
      "culturalSignificance": "Orlog shaped Norse emphasis on reputation, honor, and family legacy. Since you inherit your family's orlog and add to it, every action affects not just yourself but your ancestors' memory and descendants' circumstances. This created intense pressure to act honorably and avoid bringing shame on the family line. Orlog influenced Norse law, which often held families responsible for members' actions. Modern Norse paganism uses orlog to understand karmic patterns and ancestral healing. The concept offers a sophisticated model of how past constrains without absolutely determining future."
    }
  ],

  "relatedEntities": {
    "deities": [
      {
        "id": "norns",
        "name": "The Norns",
        "type": "deity",
        "mythology": "norse",
        "icon": "🔮",
        "url": "/mythos/norse/deities/norns.html"
      }
    ],
    "places": [
      {
        "id": "yggdrasil",
        "name": "Yggdrasil",
        "type": "place",
        "mythology": "norse",
        "icon": "🌳",
        "url": "/mythos/norse/places/yggdrasil.html"
      }
    ],
    "concepts": [
      {
        "id": "wyrd",
        "name": "Wyrd (Fate)",
        "type": "concept",
        "mythology": "norse",
        "icon": "🔮",
        "url": "/mythos/norse/concepts/wyrd.html"
      },
      {
        "id": "ragnarok",
        "name": "Ragnarök",
        "type": "concept",
        "mythology": "norse",
        "icon": "🔥",
        "url": "/mythos/norse/concepts/ragnarok.html"
      }
    ]
  },

  "sources": [
    {
      "text": "Poetic Edda",
      "author": "Anonymous",
      "passage": "Völuspá 19-20",
      "context": "The Norns' relationship to orlog and wyrd",
      "mythology": "norse",
      "corpusUrl": "/corpus-search.html?term=voluspa+orlog"
    },
    {
      "text": "Prose Edda",
      "author": "Snorri Sturluson",
      "passage": "Gylfaginning 15-16",
      "mythology": "norse",
      "corpusUrl": "/corpus-search.html?term=gylfaginning+orlog"
    }
  ]
}
