{
  "connections": [
    "Techiyat HaMetim - Resurrection of the dead",
    "Valley of Dry Bones - Ezekiel 37 vision",
    "Daniel's Prophecy - \"Many shall awake\"",
    "Olam Ha-Ba - World to come",
    "Treatise on Resurrection - Gnostic text",
    "Return to Pleroma - Spiritual resurrection",
    "Soul's Ascent - Rising to divine realm",
    "Gospel of Philip - Resurrection teachings",
    "Osiris (Egyptian) - Dying and rising god",
    "Dionysus (Greek) - Death and rebirth",
    "Inanna (Sumerian) - Descent and return",
    "Frashegird (Zoroastrian) - Bodily resurrection"
  ],
  "mythology": "christian",
  "cosmologicalType": "realm_or_plane",
  "metadata": {
    "sourceFile": "mythos/christian/cosmology/resurrection.html",
    "source": "html_parser",
    "updatedAt": "2025-12-13T02:38:08.000Z",
    "verified": false,
    "createdAt": "2025-12-13T02:38:08.000Z",
    "polishedAt": "2025-12-25T04:49:57.078Z",
    "createdBy": "system",
    "enrichmentVersion": "1.0",
    "polishedBy": "agent_10_cosmology"
  },
  "inhabitants": [],
  "filename": "resurrection",
  "name": "Christian Cosmology",
  "layers": [],
  "primarySources": [],
  "id": "christian_resurrection",
  "description": "The resurrection of Jesus Christ is the cornerstone of Christian faith. Three days after His crucifixion and burial, Jesus rose bodily from the dead, conquering death and vindicating His claims to be the Son of God. The tomb was found empty, the grave clothes left behind, and Jesus appeared alive to numerous witnesses over forty days—to Mary Magdalene, to the disciples, to more than five hundred people at once.",
  "_enhanced": true,
  "_uploadedAt": "2025-12-25T15:46:32.586288",
  "features": [],
  "displayName": "Resurrection",
  "type": "realm",
  "extracted_title": "Dying and Rising Gods: Osiris, Jesus, and Resurrection Mythology | Eyes of Azrael",
  "batch4_migration_status": "completed",
  "extracted_headings": [
    "Dying and Rising Gods",
    "Introduction: The Death-and-Rebirth Archetype",
    "Osiris: Egyptian Lord of the Underworld",
    "The Myth of Osiris's Death and \"Resurrection\"",
    "The Story (from Plutarch's \"Isis and Osiris\" and Pyramid Texts)",
    "Nature of \"Resurrection\"",
    "Symbolic Significance",
    "Ritual Reenactment",
    "Key Sources",
    "Jesus Christ: Christian Resurrection",
    "The Resurrection Narrative",
    "The Story (from Four Gospels and Acts)",
    "Nature of Resurrection",
    "Theological Significance",
    "Historical Claims",
    "Key Sources",
    "Other Dying-and-Rising Gods: Comparative Survey",
    "Comparative Analysis: Key Differences",
    "Did Christianity Borrow from Dying-and-Rising God Myths?",
    "The Case for Borrowing (Religionsgeschichtliche Schule)",
    "The Case Against Borrowing (Current Scholarly Consensus)",
    "1. Chronological Issues",
    "2. Fundamental Theological Differences",
    "3. Jewish Roots, Not Pagan",
    "4. The \"Dying-and-Rising God\" Category Itself is Questionable",
    "Current Scholarly Consensus",
    "C.S. Lewis: \"Myth Became Fact\"",
    "Archetypal Interpretation",
    "Theological Implications: Why Jesus's Resurrection Differs",
    "Unique Claims of Christian Resurrection",
    "Conclusion: Archetype and Fulfillment",
    "Related Topics"
  ],
  "batch4_migration_timestamp": {
    "_seconds": 1766801080,
    "_nanoseconds": 962000000
  },
  "extracted_lists": [
    "Murder by Set: Osiris's jealous brother Set tricks him into a coffin, seals it, and throws it into the Nile.",
    "Isis's Search: Osiris's wife/sister Isis searches for the body, finds it lodged in a tamarisk tree in Byblos (Lebanon).",
    "Dismemberment: Set discovers the recovered body, dismembers Osiris into 14 (or 42) pieces, scattering them across Egypt.",
    "Reconstruction: Isis gathers all pieces except the phallus (eaten by fish), creates a golden replacement.",
    "Magical Revivification: Isis uses heka (magic) to temporarily restore Osiris to life, conceives Horus.",
    "Descent to Duat: Osiris cannot remain in the land of the living; he descends to the Duat (underworld) to become Lord of the Dead.",
    "Judgment Role: Osiris presides over the Hall of Maat, weighing hearts of the deceased against the feather of truth.",
    "Not bodily return to earthly life",
    "Becomes ruler of underworld, not this world",
    "Remains dead but reanimated in Duat",
    "Mummified, preserved, but not restored to living state",
    "Death and rebirth of Nile (annual flood cycle)",
    "Vegetation god (grain dies, is buried, sprouts anew)",
    "Cosmic order: Death is passage, not end",
    "Pharaohs become Osiris at death",
    "Annual festivals reenact death and revival",
    "Mystery rites at Abydos (Osiris's cult center)",
    "Cyclical, repeatable myth",
    "Not historical event but timeless pattern",
    "Pyramid Texts (c. 2400-2300 BCE): Earliest references, spells for pharaoh's afterlife identification with Osiris",
    "Coffin Texts (c. 2100-1800 BCE): Democratization of Osiris myth for non-royal dead",
    "Book of the Dead (c. 1550 BCE onward): Spells for navigating Duat, judgment before Osiris",
    "Plutarch, \"Isis and Osiris\" (c. 100 CE): Most complete narrative version (late, Hellenistic influence)",
    "Crucifixion: Jesus, condemned by Pontius Pilate, is crucified at Golgotha (c. 30-33 CE) (Matt 27, Mark 15, Luke 23, John 19).",
    "Death Confirmed: Roman soldiers verify death; spear pierces side, blood and water flow (John 19:34).",
    "Burial: Joseph of Arimathea places body in new tomb, sealed with stone, guarded by soldiers (Matt 27:57-66).",
    "Three Days: Jesus remains in tomb from Friday evening to Sunday morning.",
    "Empty Tomb: Women find tomb empty, angels announce \"He is risen\" (Matt 28:1-7, Mark 16:1-7, Luke 24:1-8, John 20:1-10).",
    "Post-Resurrection Appearances: Jesus appears to Mary Magdalene, disciples, over 500 witnesses over 40 days (1 Cor 15:3-8).",
    "Physical Body: Jesus eats fish, invites Thomas to touch wounds, demonstrates corporeal resurrection (Luke 24:36-43, John 20:24-29).",
    "Ascension: Jesus ascends to heaven 40 days post-resurrection (Acts 1:9-11).",
    "Eschatological Return: Will return to judge living and dead at end of age (Matt 25:31-46, Rev 20:11-15).",
    "Bodily, physical resurrection (not just spirit)",
    "Transformed body (passes through walls, yet tangible)",
    "Return to earthly realm before ascending",
    "One-time historical event, not cyclical",
    "Defeat of death itself (not seasonal cycle)",
    "\"Firstfruits\" of general resurrection (1 Cor 15:20-23)",
    "Redemption of humanity from sin",
    "Validates Jesus's divine claims",
    "Eyewitness testimony emphasized (Luke 1:1-4, 1 Cor 15:3-8)",
    "Specific time and place (Pontius Pilate, Jerusalem)",
    "Willing to die for claim (martyrdom of apostles)",
    "Empty tomb never disputed by opponents",
    "Gospel of Mark (c. 65-70 CE): Earliest Gospel, ends with empty tomb and angel's announcement",
    "1 Corinthians 15 (c. 53-55 CE): Paul's \"creed\" (vv. 3-8), earliest written resurrection account",
    "Gospels of Matthew, Luke, John (c. 70-100 CE): Expanded resurrection appearances, physical details",
    "Acts of the Apostles (c. 80-90 CE): Post-resurrection ministry, ascension",
    "Hellenistic Environment: Early Christianity spread in a world saturated with mystery religions (Isis-Osiris, Cybele-Attis, Dionysian mysteries)",
    "Surface Similarities: Death, resurrection, salvation, ritual meals, initiation rites",
    "Syncretism: Religious ideas freely mixed in Greco-Roman world",
    "Scholarly Proponents: 19th-20th century \"History of Religions School\" (e.g., Richard Reitzenstein, Wilhelm Bousset) argued for heavy pagan influence",
    "Most detailed dying-and-rising god myths post-date Christianity (e.g., full Attis resurrection myth develops 2nd-3rd century CE)",
    "Isis-Osiris cult's \"resurrection\" motif develops gradually; Plutarch's version (100 CE) is late",
    "Mystery religions may have borrowed from Christianity, not vice versa",
    "Cyclical vs. Linear: Pagan myths explain recurring seasons; Jesus's resurrection is one-time historical event",
    "Underworld vs. Heaven: Osiris remains dead, rules underworld; Jesus ascends, reigns in heaven",
    "Myth vs. History: Pagan gods operate in timeless myth; Jesus in documented history (Pilate, Herod, etc.)",
    "Bodily vs. Spiritual: Most pagan resurrections are spiritual/periodic; Jesus's is physical, permanent",
    "Resurrection hope rooted in Hebrew Bible (Job 19:25-27, Daniel 12:2, Isaiah 26:19)",
    "Pharisaic Judaism already believed in bodily resurrection (Acts 23:6-8)",
    "Jesus's resurrection fulfills Jewish messianic/prophetic expectation, not pagan fertility myth",
    "Early Christians were Jews hostile to paganism, unlikely to borrow from mystery cults",
    "Modern scholarship (e.g., Jonathan Z. Smith, Mark S. Smith) questions whether \"dying-and-rising god\" is valid category",
    "Osiris doesn't \"rise\" (stays dead in underworld)",
    "Tammuz, Baal, Adonis have seasonal disappearances/returns, not resurrections",
    "Only Attis and Dionysus have true \"resurrection,\" but evidence is late",
    "Category may be scholarly construct, not ancient reality",
    "Pagan myths express deep human longing for death defeated, life renewed, divine-human union",
    "These are \"good dreams\" sent by God, preparing humanity for the reality",
    "In Jesus, the archetype became historical event: \"myth became fact\"",
    "Christianity doesn't borrow from myths but fulfills them",
    "The similarities point to universal human hope; the differences show how Christ transcends and completes the pattern",
    "Firstfruits of General Resurrection: Jesus's resurrection inaugurates the final resurrection of all believers (1 Cor 15:20-23)—not just seasonal renewal but eschatological transformation.",
    "Defeat of Death Itself: \"Death is swallowed up in victory\" (1 Cor 15:54). Not accommodation to death (as Osiris in underworld) but victory over it.",
    "Validation of Divine Claims: Jesus claimed to be God incarnate; resurrection validates this (Rom 1:4). Pagan gods were always divine; Jesus became human, died, and was vindicated.",
    "Redemption from Sin: \"Raised for our justification\" (Rom 4:25). Not just explaining nature but redeeming humanity.",
    "New Creation: Resurrection is \"new creation\" (2 Cor 5:17), not restoration of old cycle. Linear, not cyclical.",
    "Historical Verifiability Claimed: Paul appeals to 500+ witnesses, most still alive when he wrote (1 Cor 15:6). Invites investigation, not ritual participation."
  ]
}