{
  "id": "jerusalem-city-of-peace-city-of-conflict",
  "longDescription": "Jerusalem stands unique among the world's cities as the spiritual center for three major\n                monotheistic religions: Judaism, Christianity, and Islam. No other place on Earth carries such\n                concentrated religious significance across diverse faith traditions. Located in the Judaean\n                Mountains between the Mediterranean Sea and the Dead Sea, this ancient city has been destroyed\n                and rebuilt multiple times, conquered by empires from Babylonia to Rome to Britain, yet has\n                remained the focal point of faith, longing, and pilgrimage for billions of believers throughout\n                history. For Jews, Jerusalem represents the eternal capital, the location of the First and Second Temples,\n                the city of King David and King Solomon, and the site toward which prayers have been directed\n                for nearly three millennia. The Western Wall, the last remnant of the Second Temple complex,\n                serves as the holiest site in Judaism where prayers can be offered. The entire city resonates\n                with Jewish memory, from the ancient City of David to modern neighborhoods bearing biblical\n                names.",
  "primaryMythology": "universal",
  "visibility": "public",
  "accessibility": "physical",
  "searchTerms": [
    "jerusalem: city of peace, city of conflict",
    "sacred crossroads of judaism, christianity, and islam",
    "universal"
  ],
  "shortDescription": "Jerusalem stands unique among the world's cities as the spiritual center for three major\n                monotheistic religions: Judaism, Christianity, and Islam. No other place on Earth carries such\n",
  "type": "place",
  "placeType": "pilgrimage_site",
  "name": "Jerusalem: City of Peace, City of Conflict",
  "_migration": {
    "migratedDate": "2025-12-13",
    "hasGPS": false,
    "sourceFile": "FIREBASE\\spiritual-places\\pilgrimage\\jerusalem.html"
  },
  "mythologies": [
    "universal"
  ],
  "status": "published"
}