{
  "id": "mount-athos",
  "shortDescription": "Mount Athos (Agion Oros, \"Holy Mountain\") is an autonomous monastic republic within Greece and the spiritual center of Eastern Orthodox Christianity. The peninsula has been continuously inhabited by m",
  "searchTerms": [
    "mount athos",
    "agion oros - the holy mountain of orthodox monasticism",
    "universal"
  ],
  "sacredSignificance": "Mount Athos (Agion Oros, \"Holy Mountain\") is an autonomous monastic republic within Greece and the spiritual center of Eastern Orthodox Christianity. The peninsula has been continuously inhabited by monks for over a thousand years, preserving Byzantine traditions, art, and spiritual practices unchanged since medieval times. The Holy Mountain is dedicated entirely to prayer and the veneration of the Virgin Mary, who according to tradition claimed the peninsula as her garden. Women and female anim...",
  "primaryMythology": "universal",
  "visibility": "public",
  "_enhanced": true,
  "mythologies": [
    "universal"
  ],
  "status": "published",
  "type": "place",
  "associatedEvents": [],
  "placeType": "pilgrimage_site",
  "geographical": {
    "primaryLocation": {
      "coordinates": {
        "accuracy": "exact",
        "longitude": 24.3258,
        "elevation": 2033,
        "latitude": 40.1575
      },
      "name": "Agion Oros - The Holy Mountain of Orthodox Monasticism"
    },
    "mythology": "universal"
  },
  "name": "Mount Athos",
  "longDescription": "Mount Athos (Agion Oros, \"Holy Mountain\") is an autonomous monastic republic within Greece and the spiritual center of Eastern Orthodox Christianity. The peninsula has been continuously inhabited by monks for over a thousand years, preserving Byzantine traditions, art, and spiritual practices unchanged since medieval times. The Holy Mountain is dedicated entirely to prayer and the veneration of the Virgin Mary, who according to tradition claimed the peninsula as her garden. Women and female animals have been prohibited from entering since the Avaton decree of 1046, making it the world's oldest continuously existing monastic community with unbroken male-only habitation.",
  "_migration": {
    "sourceFile": "FIREBASE\\spiritual-places\\pilgrimage\\mount-athos.html",
    "hasGPS": true,
    "migratedDate": "2025-12-13"
  },
  "accessibility": "physical",
  "_uploadedAt": "2025-12-25T15:46:37.071650"
}