{
  "id": "varanasi-the-city-of-light",
  "longDescription": "Varanasi, known in Hindu scripture as Kashi (the \"City of Light\") and formerly as Benares,\n                stands as one of the world's oldest continuously inhabited cities and the spiritual capital\n                of Hinduism. Situated on the western bank of the sacred Ganges River in Uttar Pradesh, India,\n                Varanasi has been a center of learning, philosophy, music, art, and spiritual seeking for over\n                3,000 years. The city embodies the Hindu concepts of dharma (righteous duty), moksha\n                (liberation from the cycle of rebirth), and the transcendence of death. For devout Hindus, Varanasi represents the axis mundi—the cosmic center where heaven meets\n                earth, where the sacred breaks through into the mundane world. The city is believed to rest\n                on the trident of Lord Shiva, one of Hinduism's principal deities, and to exist outside the\n                cycle of creation and destruction that governs the rest of the universe. This sacred geography\n                makes Varanasi the most auspicious place for death in Hindu belief; to die here and be cremated\n                on the burning ghats (riverfront steps) is believed to grant immediate moksha, freeing the soul\n                from the endless cycle of death and rebirth (samsara).",
  "primaryMythology": "universal",
  "visibility": "public",
  "accessibility": "physical",
  "searchTerms": [
    "varanasi: the city of light",
    "sacred city of death, liberation, and eternal rebirth",
    "universal"
  ],
  "shortDescription": "Varanasi, known in Hindu scripture as Kashi (the \"City of Light\") and formerly as Benares,\n                stands as one of the world's oldest continuously inhabited cities and the spiritual capital\n ",
  "type": "place",
  "placeType": "pilgrimage_site",
  "name": "Varanasi: The City of Light",
  "_migration": {
    "migratedDate": "2025-12-13",
    "hasGPS": false,
    "sourceFile": "FIREBASE\\spiritual-places\\pilgrimage\\varanasi.html"
  },
  "mythologies": [
    "universal"
  ],
  "status": "published"
}