[
  {
    "id": "babylonian_gilgamesh",
    "quests": [
      "Journey to the Cedar Forest to slay Humbaba",
      "Battle with the Bull of Heaven sent by Ishtar",
      "Quest for immortality after Enkidu's death",
      "Journey to meet Utnapishtim, survivor of the Flood",
      "Retrieval and loss of the plant of immortality"
    ],
    "displayName": "Gilgamesh - King of Uruk",
    "titles": [
      "King of Uruk",
      "He Who Saw the Deep",
      "Two-thirds divine, one-third mortal",
      "Builder of the Walls of Uruk",
      "The Wild Bull"
    ],
    "feats": [
      "Built the great walls of Uruk that still stood in historical times",
      "Slew Humbaba, the guardian of the Cedar Forest",
      "Killed the Bull of Heaven sent by the goddess Ishtar",
      "Journeyed to the ends of the earth seeking immortality",
      "Obtained the plant of youth from the sea floor",
      "Returned with wisdom to record his journeys"
    ],
    "mythology": "babylonian",
    "relationships": {
      "mother": "Ninsun (divine cow goddess)",
      "father": "Lugalbanda (deified king)",
      "companion": "Enkidu (wild man, sworn brother)",
      "rejected_by": "Ishtar (goddess of love and war)",
      "teacher": "Utnapishtim (flood survivor, granted immortality)"
    },
    "filename": "gilgamesh",
    "companions": [
      "Enkidu - wild man created by the gods, Gilgamesh's equal and dearest friend",
      "Shamash - sun god who aided in the quest against Humbaba",
      "Urshanabi - ferryman who transported Gilgamesh to Utnapishtim"
    ],
    "name": "Gilgamesh",
    "primarySources": [
      "Epic of Gilgamesh (Standard Babylonian version)",
      "Sumerian Gilgamesh poems",
      "Various Old Babylonian tablets",
      "Library of Ashurbanipal fragments"
    ],
    "attributes": [
      "Superhuman strength - two-thirds divine",
      "Unstoppable energy - never rested, oppressed his people",
      "Courage - feared no foe, mortal or divine",
      "Wisdom - gained through suffering and loss",
      "Friendship - capacity for deep love transformed him"
    ],
    "weapons": [
      "Axe - used against Humbaba in the Cedar Forest",
      "Sword - divine weapons for the battle",
      "Bow - for hunting and combat"
    ],
    "description": "Gilgamesh stands as the central figure of humanity's oldest literary epic, a semi-divine king of Uruk whose journey from tyrannical ruler to wise sovereign became the template for the hero's journey across world mythology. Two-thirds god and one-third mortal - son of the goddess Ninsun and the hero-king Lugalbanda - Gilgamesh possessed superhuman strength and beauty but oppressed his people with his restless energy until the gods created Enkidu as his equal. Their rivalry transformed into profound friendship, and together they slew the monster Humbaba and the Bull of Heaven. But Enkidu's death shattered Gilgamesh, driving him on a desperate quest for immortality that led him to Utnapishtim, the flood survivor. Though he failed to attain eternal life, Gilgamesh returned to Uruk with wisdom, recognizing that his immortality lay in his deeds and the walls of his city. The Epic of Gilgamesh, preserved on clay tablets from c. 2100 BCE onward, profoundly influenced later literature including the Hebrew Bible, Homer, and world mythology.",
    "type": "hero",
    "iconType": "svg",
    "icon": "<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 64 64\">\n  <circle cx=\"32\" cy=\"32\" r=\"28.8\" fill=\"#6a5acd\" opacity=\"0.2\"/>\n  <rect x=\"19.2\" y=\"16\" width=\"25.6\" height=\"32\" rx=\"4\" fill=\"#6a5acd\"/>\n  <text x=\"32\" y=\"44.8\" text-anchor=\"middle\" font-size=\"22.4\" fill=\"#ffffff\">⚔️</text>\n</svg>",
    "_modified": "2025-12-27T07:07:03.516Z",
    "createdAt": "2025-12-27T07:06:55.967Z",
    "metadata": {
      "createdAt": "2025-12-13T02:36:52.592Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/babylonian/heroes/gilgamesh.html",
      "enrichedBy": "completeness_analyzer",
      "finalEnrichment": true,
      "polishedBy": "Agent_8_HeroFixer",
      "updatedAt": {
        "_seconds": 1766819146,
        "_nanoseconds": 470000000
      },
      "created": {
        "_seconds": 1766819244,
        "_nanoseconds": 101000000
      },
      "historicalPeriod": "Early Dynastic through Neo-Assyrian (c. 2700-627 BCE)",
      "primaryRegion": "Mesopotamia, particularly Uruk (modern Iraq)"
    },
    "updated_at": "2025-12-27T07:06:55.967Z",
    "sections": {
      "origins": "Gilgamesh was likely a historical king of Uruk (modern Warka, Iraq) who ruled around 2700 BCE and was later deified. The Sumerian King List credits him with a 126-year reign and identifies his father as a phantom (lillu) or the hero Lugalbanda. Legends about him circulated orally before being written in Sumerian, then compiled into the Standard Babylonian Epic around 1200 BCE by the scholar Sin-leqi-unninni. The epic opens with praise for his wisdom and the walls he built, establishing his lasting legacy.",
      "attributes": "Gilgamesh's defining characteristic is his liminal nature - caught between mortality and divinity, unable to accept the limitations of either state. His early tyranny stemmed from superabundant energy with no outlet. The friendship with Enkidu channeled his power constructively, but Enkidu's death revealed his fundamental terror of mortality. His journey represents the human struggle to accept death while seeking meaning through achievement, relationship, and wisdom.",
      "significance": "The Epic of Gilgamesh is the world's first great work of literature and established themes that pervade world mythology: the hero's journey, the wild man's civilization, the quest for immortality, the flood narrative, and the acceptance of mortality as the human condition. Gilgamesh's relationship with Enkidu may represent humanity's earliest literary exploration of deep friendship. The epic's influence on the Hebrew Bible (Noah's flood, the snake stealing immortality) demonstrates its foundational role in Western religious thought.",
      "impact": "Rediscovered in the 19th century from Assyrian library tablets, the Epic of Gilgamesh revolutionized understanding of ancient literature and religion. Its flood narrative predating Genesis sparked scholarly debate that continues today. The epic influenced heroic literature from Homer to Beowulf. Modern adaptations in literature, film, and games testify to its enduring power. Gilgamesh remains the archetype of the hero who learns that immortality comes through remembered deeds, not eternal life."
    },
    "relatedEntities": [
      {"type": "hero", "id": "babylonian_enkidu", "relationship": "sworn companion, alter ego"},
      {"type": "deity", "id": "babylonian_ishtar", "relationship": "spurned suitor, antagonist"},
      {"type": "deity", "id": "babylonian_shamash", "relationship": "divine patron"},
      {"type": "creature", "id": "babylonian_humbaba", "relationship": "slew in Cedar Forest"},
      {"type": "hero", "id": "babylonian_utnapishtim", "relationship": "flood survivor, teacher"},
      {"type": "text", "id": "babylonian_epic-of-gilgamesh", "relationship": "protagonist"}
    ],
    "corpusQueries": [
      "Epic of Gilgamesh Mesopotamian literature",
      "Gilgamesh Enkidu friendship mythology",
      "Humbaba Cedar Forest Babylonian myth",
      "Gilgamesh immortality quest Utnapishtim",
      "Babylonian flood narrative Gilgamesh",
      "ancient Mesopotamian hero epic"
    ],
    "sources": [
      {"title": "Epic of Gilgamesh", "author": "Sin-leqi-unninni (compiler)", "type": "primary"},
      {"title": "Gilgamesh: A New Translation", "author": "Andrew George", "type": "translation"},
      {"title": "The Treasures of Darkness", "author": "Thorkild Jacobsen", "type": "scholarly"},
      {"title": "The Epic of Gilgamesh: A Critical Edition", "author": "Andrew George", "type": "scholarly"}
    ]
  },
  {
    "id": "babylonian_hammurabi",
    "quests": [
      "Unification of Mesopotamia under Babylonian rule",
      "Establishment of justice throughout the realm",
      "Building and restoration of temples to the gods",
      "Creation of the law code that bears his name"
    ],
    "displayName": "Hammurabi - The Lawgiver King",
    "titles": [
      "King of Babylon",
      "King of the Four Quarters of the World",
      "Shepherd of the People",
      "The Establisher of Justice",
      "Beloved of Marduk"
    ],
    "feats": [
      "Unified Mesopotamia through military conquest and diplomacy",
      "Created the famous Code of Hammurabi with 282 laws",
      "Restored temples throughout Babylonia",
      "Established efficient irrigation and administration",
      "Made Babylon the dominant power in Mesopotamia",
      "Received laws directly from Shamash, god of justice"
    ],
    "mythology": "babylonian",
    "relationships": {
      "father": "Sin-Muballit (king of Babylon)",
      "divine_patron": "Marduk (chief god of Babylon)",
      "law_giver": "Shamash (god of justice)",
      "successors": "Samsu-iluna and later Kassite dynasty"
    },
    "filename": "hammurabi",
    "companions": [
      "Marduk - patron deity of Babylon, legitimized his rule",
      "Shamash - god of justice who bestowed the law code",
      "Various generals and administrators"
    ],
    "name": "Hammurabi",
    "primarySources": [
      "Code of Hammurabi stele (Louvre)",
      "Royal inscriptions and building texts",
      "Letters from the royal archive at Mari",
      "Administrative documents from his reign"
    ],
    "attributes": [
      "Justice - central virtue, depicted receiving laws from Shamash",
      "Military genius - conquered all of Mesopotamia",
      "Administrative skill - organized empire efficiently",
      "Piety - devoted builder and restorer of temples",
      "Wisdom - remembered as ideal just king"
    ],
    "weapons": [],
    "description": "Hammurabi of Babylon (r. c. 1792-1750 BCE) stands as one of history's most influential rulers, a king who combined military conquest with administrative genius and is immortalized through his famous law code. Rising from the small kingdom of Babylon, Hammurabi systematically conquered all of Mesopotamia through a combination of warfare and diplomacy, creating an empire stretching from the Persian Gulf to the borders of Anatolia. His greatest legacy, the Code of Hammurabi, consists of 282 laws carved on a black diorite stele topped by an image of Shamash, the sun god of justice, bestowing the laws upon the king. These laws, based on the principle of 'an eye for an eye,' addressed property rights, commerce, family relations, and criminal matters with graduated penalties based on social class. Though building on earlier Sumerian legal traditions, Hammurabi's code became the model for ancient Near Eastern law and influenced later legal systems including biblical law. He transformed Babylon from a minor city-state into the cultural and political center of Mesopotamia, establishing the Babylonian identity that would persist for millennia.",
    "type": "hero",
    "iconType": "svg",
    "icon": "<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 64 64\">\n  <circle cx=\"32\" cy=\"32\" r=\"28.8\" fill=\"#6a5acd\" opacity=\"0.2\"/>\n  <rect x=\"19.2\" y=\"16\" width=\"25.6\" height=\"32\" rx=\"4\" fill=\"#6a5acd\"/>\n  <text x=\"32\" y=\"44.8\" text-anchor=\"middle\" font-size=\"22.4\" fill=\"#ffffff\">⚔️</text>\n</svg>",
    "_modified": "2025-12-27T07:07:03.550Z",
    "createdAt": "2025-12-27T07:06:55.967Z",
    "metadata": {
      "createdAt": "2025-12-13T02:36:52.616Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/babylonian/heroes/hammurabi.html",
      "enrichedBy": "completeness_analyzer",
      "finalEnrichment": true,
      "polishedBy": "Agent_8_HeroFixer",
      "updatedAt": {
        "_seconds": 1766819146,
        "_nanoseconds": 596000000
      },
      "created": {
        "_seconds": 1766819244,
        "_nanoseconds": 101000000
      },
      "historicalPeriod": "Old Babylonian Period (c. 1792-1750 BCE)",
      "primaryRegion": "Babylon, Mesopotamia (modern Iraq)"
    },
    "updated_at": "2025-12-27T07:06:55.967Z",
    "sections": {
      "origins": "Hammurabi inherited a small kingdom centered on Babylon from his father Sin-Muballit around 1792 BCE. Babylon was then a minor power surrounded by larger kingdoms including Larsa, Eshnunna, and the powerful Mari. Through patient diplomacy, strategic alliances, and well-timed military campaigns, Hammurabi spent his first thirty years consolidating power. In his final decade of rule, he conquered all rivals, creating the first truly Babylonian empire and establishing Babylon's cultural centrality that would define Mesopotamia for over a thousand years.",
      "attributes": "Hammurabi embodied the ideal of the just king (sharrum kinum) in Mesopotamian royal ideology. His inscriptions emphasize his role as shepherd protecting the weak from the strong, widow from oppressor. The image on his law stele - receiving the rod and ring of justice from Shamash - legitimized his laws as divinely sanctioned. His extensive correspondence shows him as a hands-on administrator, personally overseeing everything from irrigation projects to judicial appeals. This combination of military power, administrative efficiency, and justice ideology became the model for later Mesopotamian kings.",
      "significance": "The Code of Hammurabi represents one of humanity's earliest attempts at comprehensive written law. While not the first law code (earlier Sumerian codes exist), it is the best preserved and most extensive. The principle of lex talionis ('an eye for an eye') influenced biblical law, and the code's organization by topic (family, property, commerce, injury) established patterns for later legal systems. The code also reveals Old Babylonian society in detail - its class structure, economic practices, family relations, and concepts of justice.",
      "impact": "Hammurabi's legacy shaped Mesopotamian civilization for millennia. Babylon remained the cultural and religious center of the region even when politically subordinate. His law code was copied and studied for over a thousand years after his death. When Nebuchadnezzar II rebuilt Babylon in the 6th century BCE, he consciously evoked Hammurabi's glory. The Code of Hammurabi, rediscovered in 1901 at Susa (where Elamite conquerors had taken it), revolutionized understanding of ancient law. Today it stands in the Louvre, one of the most important artifacts of ancient civilization."
    },
    "relatedEntities": [
      {"type": "deity", "id": "babylonian_marduk", "relationship": "divine patron"},
      {"type": "deity", "id": "babylonian_shamash", "relationship": "bestowed the law code"},
      {"type": "text", "id": "babylonian_code-of-hammurabi", "relationship": "author"},
      {"type": "place", "id": "babylonian_babylon", "relationship": "capital city"},
      {"type": "hero", "id": "babylonian_gilgamesh", "relationship": "legendary predecessor"}
    ],
    "corpusQueries": [
      "Code of Hammurabi ancient law",
      "Hammurabi king of Babylon",
      "Old Babylonian empire Mesopotamia",
      "Shamash justice divine law ancient",
      "lex talionis eye for eye law",
      "ancient Near Eastern legal codes"
    ],
    "sources": [
      {"title": "The Code of Hammurabi", "author": "Various translations", "type": "primary"},
      {"title": "Hammurabi of Babylon", "author": "Marc Van De Mieroop", "type": "scholarly"},
      {"title": "The Laws of Hammurabi", "author": "M.E.J. Richardson", "type": "translation"},
      {"title": "Ancient Near Eastern Texts Relating to the Old Testament", "author": "James B. Pritchard", "type": "reference"}
    ]
  }
]