{
  "id": "greek_hero_eros-psyche",
  "name": "Eros and Psyche",
  "displayName": "Eros and Psyche - Love's Triumph",
  "icon": "💑",
  "mythology": "greek",
  "type": "hero",
  "status": "published",
  "authorId": "official",
  "createdAt": {
    "_seconds": 1765797566,
    "_nanoseconds": 689000000
  },
  "updatedAt": {
    "_seconds": 1765797566,
    "_nanoseconds": 689000000
  },
  "completeness": 95,
  "searchTerms": [
    "eros",
    "psyche",
    "cupid",
    "soul",
    "love",
    "greek_hero_eros-psyche",
    "greek",
    "hero",
    "apuleius",
    "golden ass",
    "metamorphoses"
  ],
  "description": "The tale of Eros and Psyche stands as one of the most beloved and enduring love stories from ancient mythology, preserved in Apuleius's 2nd-century CE work 'The Golden Ass' (Metamorphoses). This narrative tells of the mortal princess Psyche, whose extraordinary beauty rivaled that of Aphrodite herself, and the god of love Eros (Cupid in Roman tradition), who was sent to punish her but instead fell deeply in love. The story follows Psyche's journey through impossible trials set by the jealous Aphrodite, her temporary loss of Eros after breaking her vow not to look upon him, and her eventual apotheosis as she is granted immortality and welcomed among the gods. The tale represents the soul's journey toward divine love, with Psyche's name literally meaning 'soul' in Greek, making this myth a profound allegory for spiritual transformation and the union of the human soul with divine love.",
  "sections": {
    "origins": "The myth of Eros and Psyche originates from Apuleius's Latin novel 'Metamorphoses' (also known as 'The Golden Ass'), written around 160-180 CE during the Roman Imperial period. While Apuleius composed the most complete version, elements of the story appear to draw from older Greek folk tales and oral traditions about the marriage of a mortal to a divine being. The narrative framework shows influences from earlier Greek tales of divine-mortal unions and the tradition of the 'animal bridegroom' found in many Indo-European cultures. Some scholars suggest the tale preserves elements of mystery religion initiation rites, particularly those associated with the cult of Isis, to which Apuleius was devoted.",
    "attributes": "Psyche embodies the qualities of extraordinary beauty, curiosity, perseverance, and ultimately divine transcendence. Her defining characteristic is her willingness to undertake impossible tasks for love, demonstrating courage, resourcefulness, and unwavering devotion. Eros, traditionally depicted as the winged god of love with his bow and arrows, represents passionate love that defies even divine authority, choosing Psyche over obedience to his mother Aphrodite. Together they symbolize the transformative power of love that can elevate mortal souls to divine status. Their union produces a daughter named Voluptas (Pleasure or Bliss).",
    "significance": "The myth holds profound significance on multiple levels. Philosophically, it represents the Neoplatonic concept of the soul's journey toward union with the divine, with each of Psyche's trials symbolizing stages of spiritual purification and growth. The tale explores themes of trust, betrayal, redemption, and the transformative power of love. It addresses the tension between divine and mortal realms, the nature of beauty (both physical and spiritual), and the possibility of apotheosis through love and devotion. The myth also examines the relationship between curiosity and knowledge, as Psyche's forbidden glance at Eros both causes her downfall and initiates her path to godhood.",
    "culturalImpact": "The influence of Eros and Psyche on Western art, literature, and psychology is immeasurable. The story inspired countless Renaissance and Baroque artworks, including masterpieces by Raphael, Canova, and Bouguereau. In literature, the tale influenced fairy tales like 'Beauty and the Beast' and 'East of the Sun, West of the Moon.' Most significantly, the myth gave psychology its name and central concept - the psyche as the seat of consciousness and the soul. Sigmund Freud and Carl Jung both drew upon this myth, with the Psyche figure representing the archetype of the anima or soul's feminine aspect. The tale continues to resonate in modern adaptations, retellings, and psychological frameworks."
  },
  "feats": [
    "Survived four impossible tasks set by Aphrodite",
    "Sorted a vast heap of mixed grains in one night (aided by ants)",
    "Gathered golden fleece from dangerous sheep (guided by river reed)",
    "Retrieved water from the River Styx (helped by Zeus's eagle)",
    "Descended to the Underworld to obtain Persephone's beauty",
    "Achieved immortality and became goddess of the soul"
  ],
  "titles": [
    "The Soul",
    "The Beautiful Princess",
    "Goddess of the Soul",
    "Wife of Eros"
  ],
  "relationships": {
    "spouse": "Eros (Cupid) - God of Love",
    "motherInLaw": "Aphrodite (Venus) - Goddess of Beauty",
    "daughter": "Voluptas (Hedone) - Goddess of Pleasure",
    "father": "Unnamed mortal king",
    "sisters": "Two jealous elder sisters"
  },
  "attributes": [
    "Extraordinary beauty",
    "Perseverance through trials",
    "Curiosity and courage",
    "Devotion to love",
    "Spiritual transformation"
  ],
  "relatedEntities": [
    {
      "id": "aphrodite",
      "type": "deity",
      "name": "Aphrodite",
      "relationship": "Antagonist and eventual mother-in-law"
    },
    {
      "id": "eros",
      "type": "deity",
      "name": "Eros",
      "relationship": "Divine husband",
      "_unverified": true,
      "_unverifiedReason": "Referenced entity not found in database"
    },
    {
      "id": "zeus",
      "type": "deity",
      "name": "Zeus",
      "relationship": "Granted her immortality"
    },
    {
      "id": "persephone",
      "type": "deity",
      "name": "Persephone",
      "relationship": "Provided beauty from Underworld"
    },
    {
      "id": "greek_underworld",
      "type": "place",
      "name": "The Underworld",
      "relationship": "Location of final trial"
    }
  ],
  "corpusQueries": [
    "Apuleius Metamorphoses Golden Ass Cupid Psyche complete text",
    "Eros Psyche myth Neoplatonic interpretation soul divine",
    "Psyche trials Aphrodite Venus tasks symbolism",
    "Greek apotheosis mortal immortality divine union",
    "Animal bridegroom tale type comparative folklore",
    "Beauty and Beast fairy tale Psyche origins"
  ],
  "metadata": {
    "enrichedBy": "asset_enrichment_agent",
    "enrichmentVersion": "2.0",
    "finalEnrichment": true,
    "historicalPeriod": "2nd century CE (literary source); mythic time",
    "primaryRegion": "Greece, Roman Empire",
    "updatedAt": {
      "_seconds": 1766551142,
      "_nanoseconds": 81000000
    }
  },
  "primarySources": [
    {
      "title": "Metamorphoses (The Golden Ass)",
      "author": "Apuleius",
      "date": "c. 160-180 CE",
      "description": "Latin novel containing the complete Eros and Psyche narrative"
    },
    {
      "title": "Commentary on Plato's Symposium",
      "author": "Marsilio Ficino",
      "date": "15th century",
      "description": "Renaissance Neoplatonic interpretation of the myth"
    }
  ]
}