{
  "id": "jewish_enoch-calendar",
  "name": "Enochian Calendar System",
  "displayName": "The 364-Day Solar Calendar of Enoch",
  "mythology": "jewish",
  "type": "hero",
  "filename": "enoch-calendar",
  "iconType": "svg",
  "icon": "<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 64 64\">\n  <circle cx=\"32\" cy=\"32\" r=\"28.8\" fill=\"#6a5acd\" opacity=\"0.2\"/>\n  <rect x=\"19.2\" y=\"16\" width=\"25.6\" height=\"32\" rx=\"4\" fill=\"#6a5acd\"/>\n  <text x=\"32\" y=\"44.8\" text-anchor=\"middle\" font-size=\"22.4\" fill=\"#ffffff\">📅</text>\n</svg>",
  "_modified": "2025-12-27T07:07:04.768Z",
  "createdAt": "2025-12-27T07:06:55.967Z",
  "updated_at": "2025-12-27T07:06:55.967Z",
  "description": "The Enochian Calendar represents one of the most significant calendrical controversies in Second Temple Judaism, preserved in the apocalyptic literature attributed to the patriarch Enoch. This 364-day solar calendar, detailed in the Book of Enoch (1 Enoch) and the Book of Jubilees, stood in direct opposition to the 354-day lunar calendar that became standard in rabbinic Judaism. The controversy was not merely technical but deeply theological - the Enochian tradition claimed this calendar was revealed by angels to Enoch himself and represented the true divine order of creation, with festivals always falling on the same days of the week. The Qumran community (the Essenes who produced the Dead Sea Scrolls) fiercely adhered to this calendar, considering the Jerusalem Temple's use of the lunar calendar to be an abomination. This calendrical dispute reflects broader tensions about religious authority, proper worship, and the nature of divine revelation in ancient Judaism.",
  "sections": {
    "origins": "The Enochian Calendar system originates from the Astronomical Book (1 Enoch 72-82), one of the oldest sections of Enochic literature, dating to approximately the 3rd century BCE. According to the text, the angel Uriel revealed the workings of the heavenly luminaries to Enoch during his celestial journeys. The calendar appears to preserve very ancient Near Eastern astronomical traditions, possibly predating the Babylonian lunar calendar that influenced mainstream Jewish practice. The Book of Jubilees (2nd century BCE) reinforces the 364-day calendar, claiming it was the original calendar used from creation and known to the patriarchs. Archaeological evidence from Qumran confirms that the sectarian community there used this calendar, with numerous calendar texts among the Dead Sea Scrolls elaborating its details.",
    "attributes": "The 364-day solar calendar possesses distinctive mathematical and theological attributes. It divides the year into four equal seasons of 91 days each (13 weeks), with each quarter containing three months of 30-30-31 days. This produces exactly 52 weeks, meaning festivals always fall on the same day of the week - notably, all major festivals fall on Wednesdays, considered the day of the sun's creation. The calendar features: intercalation markers at the equinoxes and solstices; a priestly rotation of 24 courses serving in the Temple; synchronization with a 7-year sabbatical cycle and 49-year jubilee; and correspondence with angelic watches over time. The system emphasizes perfect mathematical harmony as evidence of divine design.",
    "significance": "The Enochian Calendar holds profound significance for understanding Second Temple Judaism's diversity and conflicts. It reveals that calendar observance was not merely practical but was viewed as participation in cosmic order - using the wrong calendar meant worshipping at wrong times, rendering sacrifices invalid and festivals meaningless. The calendar controversy illuminates the tensions between the Qumran sectarians and the Jerusalem priesthood, helping explain the Essenes' withdrawal from Temple worship. The figure of Enoch, who 'walked with God' and was taken to heaven without dying, served as the perfect recipient for such revelations, establishing the calendar's authority. The tradition influenced later Jewish mysticism and Christian apocalypticism.",
    "culturalImpact": "The Enochian Calendar's cultural impact extends across religious history. It demonstrates that early Judaism was far more diverse than later rabbinic literature suggests, with competing authorities and traditions. The Dead Sea Scrolls discovery brought renewed scholarly attention to this alternative calendrical tradition and its implications for understanding the development of Judaism and early Christianity. Some scholars argue that Jesus and his disciples may have followed an Enochian-style calendar, potentially explaining discrepancies in Gospel accounts of the Last Supper's timing. The calendar influenced Ethiopian Christianity, which preserved 1 Enoch as scripture and maintains related calendrical traditions. Modern scholars continue to debate the calendar's origins, astronomical accuracy, and relationship to other ancient Near Eastern systems."
  },
  "quests": [],
  "titles": [
    "The Angelic Calendar",
    "The Solar Calendar",
    "The Calendar of Enoch",
    "The 364-Day Calendar"
  ],
  "feats": [
    "Revealed by angels to Enoch during celestial journeys",
    "Preserved perfect mathematical harmony (52 weeks exactly)",
    "Maintained by Qumran community for centuries",
    "Influenced Ethiopian Christian calendar traditions"
  ],
  "relationships": {
    "revealer": "Uriel - Angel who taught Enoch celestial secrets",
    "recipient": "Enoch - Patriarch who received revelation",
    "adherents": "Qumran Community (Essenes)",
    "opponents": "Jerusalem Temple priesthood"
  },
  "companions": [],
  "primarySources": [
    {
      "title": "1 Enoch (Book of Enoch)",
      "section": "Astronomical Book (chapters 72-82)",
      "date": "3rd century BCE",
      "description": "Primary source for the 364-day calendar system"
    },
    {
      "title": "Book of Jubilees",
      "date": "2nd century BCE",
      "description": "Reinforces the solar calendar as original divine order"
    },
    {
      "title": "Dead Sea Scrolls",
      "document": "4Q317, 4Q318, 4Q320-330",
      "date": "2nd century BCE - 1st century CE",
      "description": "Qumran calendar texts and astronomical observations"
    }
  ],
  "attributes": [
    "364 days total (52 weeks exactly)",
    "Four seasons of 91 days each",
    "Festivals fall on fixed weekdays",
    "Solar rather than lunar basis",
    "Angelic revelation authority"
  ],
  "weapons": [],
  "relatedEntities": [
    {
      "id": "enoch",
      "type": "hero",
      "name": "Enoch the Patriarch",
      "relationship": "Recipient of calendar revelation",
      "_unverified": true,
      "_unverifiedReason": "Referenced entity not found in database"
    },
    {
      "id": "uriel",
      "type": "deity",
      "name": "Uriel",
      "relationship": "Angelic revealer of astronomical secrets",
      "_unverified": true,
      "_unverifiedReason": "Referenced entity not found in database"
    },
    {
      "id": "book_of_enoch",
      "type": "text",
      "name": "Book of Enoch",
      "relationship": "Primary textual source",
      "_unverified": true,
      "_unverifiedReason": "Referenced entity not found in database"
    },
    {
      "id": "dead_sea_scrolls",
      "type": "text",
      "name": "Dead Sea Scrolls",
      "relationship": "Archaeological evidence for calendar use",
      "_unverified": true,
      "_unverifiedReason": "Referenced entity not found in database"
    },
    {
      "id": "jewish_temple",
      "type": "place",
      "name": "Jerusalem Temple",
      "relationship": "Site of calendar controversy",
      "_unverified": true,
      "_unverifiedReason": "Referenced entity not found in database"
    }
  ],
  "corpusQueries": [
    "Enoch calendar 364 day solar year astronomical book",
    "Book Jubilees calendar lunar solar controversy",
    "Dead Sea Scrolls Qumran calendar 4Q320 calendrical texts",
    "Second Temple Judaism calendar disputes Essenes",
    "Uriel angel astronomical revelation 1 Enoch",
    "Ancient Israelite calendar solar lunar intercalation"
  ],
  "metadata": {
    "createdAt": "2025-12-13T02:36:53.165Z",
    "createdBy": "system",
    "verified": false,
    "source": "html_parser",
    "sourceFile": "mythos/jewish/heroes/enoch/enoch-calendar.html",
    "enrichedBy": "asset_enrichment_agent",
    "enrichmentVersion": "2.0",
    "finalEnrichment": true,
    "polishedBy": "Agent_8_HeroFixer",
    "historicalPeriod": "3rd century BCE - 1st century CE",
    "primaryRegion": "Judea, Qumran",
    "updatedAt": {
      "_seconds": 1766819148,
      "_nanoseconds": 939000000
    },
    "created": {
      "_seconds": 1766819244,
      "_nanoseconds": 101000000
    }
  }
}