{
  "id": "avebury-stone-circle",
  "_enhanced": true,
  "_uploadedAt": "2025-12-25T15:46:37.069941",
  "status": "published",
  "shortDescription": "Wiltshire, England Avebury is the largest prehistoric stone circle in Europe and one of the most remarkable\n                monuments of Neolithic Britain. Built around 2850 BCE, the site encompasses ",
  "visibility": "public",
  "accessibility": "physical",
  "associatedEvents": [],
  "type": "place",
  "primaryMythology": "universal",
  "geographical": {
    "mythology": "universal"
  },
  "mythologies": [
    "universal"
  ],
  "placeType": "sacred_grove",
  "searchTerms": [
    "avebury stone circle",
    "wiltshire, england",
    "universal"
  ],
  "_migration": {
    "migratedDate": "2025-12-13",
    "sourceFile": "FIREBASE\\spiritual-places\\groves\\avebury.html",
    "hasGPS": false
  },
  "name": "Avebury Stone Circle",
  "longDescription": "Wiltshire, England Avebury is the largest prehistoric stone circle in Europe and one of the most remarkable\n                monuments of Neolithic Britain. Built around 2850 BCE, the site encompasses a massive\n                circular ditch and bank (henge) enclosing an outer ring of originally around 100 sarsen\n                stones, with two smaller inner circles. The entire village of Avebury sits within the\n                monument, making it one of the few places where you can walk among megaliths while having\n                a pint at the pub. Unlike its more famous neighbor Stonehenge 25 miles to the south,\n                Avebury's sheer scale - the outer circle is 427 meters (1,400 feet) in diameter - and\n                accessibility allow visitors to experience the stones up close, touching stones placed\n                by hands 4,800 years ago.",
  "enhancedBy": "agent8-v2",
  "primarySources": [],
  "description": "Explore temples, mountains, groves, and holy sites that have served as gateways between the human and divine realms\n                across cultures and millennia. From ancient stone circles to living pilgrimage destinations, discover the places\n                where heaven touches earth.",
  "items": [
    "sacred-items",
    "items"
  ],
  "updatedAt": "2025-12-26T05:15:13.042Z"
}