{
  "id": "mount-tabor",
  "name": "Mount Tabor (Har Tavor)",
  "displayName": "Mount Tabor - Traditional Site of the Transfiguration",
  "searchTerms": [
    "mount tabor",
    "har tavor",
    "transfiguration",
    "lower galilee",
    "christian",
    "jewish"
  ],
  "primaryMythology": "christian",
  "visibility": "public",
  "mythologies": ["christian", "jewish"],
  "type": "place",
  "placeType": "mountain",
  "geographical": {
    "region": "Israel",
    "mythology": "christian",
    "primaryLocation": {
      "name": "Lower Galilee, Israel",
      "coordinates": {
        "elevation": 575,
        "accuracy": "exact",
        "latitude": 32.6864,
        "longitude": 35.3909
      }
    }
  },
  "description": "Mount Tabor (Hebrew: Har Tavor) is the traditional site of Jesus Christ's Transfiguration, where he appeared in divine glory before Peter, James, and John, conversing with Moses and Elijah. Rising distinctively from the Jezreel Valley, this dome-shaped mountain has been a place of pilgrimage since the 4th century CE.",
  "longDescription": "Mount Tabor (Hebrew: Har Tavor) is a distinctive, dome-shaped mountain rising 575 meters (1,886 feet) above the Jezreel Valley in Lower Galilee. Revered as the traditional site of Jesus Christ's Transfiguration - where he appeared in divine glory before Peter, James, and John, conversing with Moses and Elijah - Mount Tabor has been a place of Christian pilgrimage since at least the 4th century CE. Its isolated position, rising dramatically from the surrounding plain, has made it a natural sacred site since ancient times, mentioned in the Hebrew Bible in connection with the prophetess Deborah and the boundary of tribal territories.",
  "transfiguration": {
    "event": "The Transfiguration of Jesus Christ",
    "witnesses": ["Peter", "James son of Zebedee", "John"],
    "heavenlyVisitors": ["Moses", "Elijah"],
    "biblicalReferences": [
      {
        "reference": "Matthew 17:1-8",
        "text": "After six days Jesus took with him Peter, James and John the brother of James, and led them up a high mountain by themselves. There he was transfigured before them. His face shone like the sun, and his clothes became as white as the light. Just then there appeared before them Moses and Elijah, talking with Jesus. Peter said to Jesus, 'Lord, it is good for us to be here. If you wish, I will put up three shelters - one for you, one for Moses and one for Elijah.' While he was still speaking, a bright cloud covered them, and a voice from the cloud said, 'This is my Son, whom I love; with him I am well pleased. Listen to him!'"
      },
      {
        "reference": "Mark 9:2-8",
        "text": "After six days Jesus took Peter, James and John with him and led them up a high mountain, where they were all alone. There he was transfigured before them. His clothes became dazzling white, whiter than anyone in the world could bleach them. And there appeared before them Elijah and Moses, who were talking with Jesus."
      },
      {
        "reference": "Luke 9:28-36",
        "text": "About eight days after Jesus said this, he took Peter, John and James with him and went up onto a mountain to pray. As he was praying, the appearance of his face changed, and his clothes became as bright as a flash of lightning. Two men, Moses and Elijah, appeared in glorious splendor, talking with Jesus. They spoke about his departure (Greek: exodus), which he was about to bring to fulfillment at Jerusalem."
      },
      {
        "reference": "2 Peter 1:16-18",
        "text": "For we did not follow cleverly devised stories when we told you about the coming of our Lord Jesus Christ in power, but we were eyewitnesses of his majesty. He received honor and glory from God the Father when the voice came to him from the Majestic Glory, saying, 'This is my Son, whom I love; with him I am well pleased.' We ourselves heard this voice that came from heaven when we were with him on the sacred mountain."
      }
    ],
    "theologicalSignificance": [
      "Moses and Elijah represent the Law and the Prophets testifying to Christ",
      "The divine voice 'This is my Son... listen to him' supersedes Moses (Law) and Elijah (Prophets)",
      "Luke reveals they discussed Jesus' 'exodus' - his death, resurrection, and ascension",
      "Peter's suggestion of three tabernacles connects to Sukkot and Shekinah dwelling",
      "Jesus' glorified appearance anticipates his resurrection and Second Coming",
      "The cloud represents the Shekinah glory - divine presence"
    ],
    "jamesPerspective": "James son of Zebedee was one of only three apostles chosen to witness the Transfiguration. He saw Moses and Elijah in glory, heard the Father's voice from the cloud, and witnessed Christ's divine majesty. This experience confirmed that all Scripture - the Law given through Moses and the prophetic word through Elijah - testified to Jesus as the Messiah.",
    "connectionToSinai": [
      "Cloud covering the mountain (Exodus 24:15-18; Matthew 17:5)",
      "Voice from the cloud (Exodus 19:19; Matthew 17:5)",
      "Mountain setting for divine revelation",
      "Fear of the witnesses (Exodus 19:16; Matthew 17:6)",
      "Moses present at both events"
    ],
    "sukkotConnection": "Peter's suggestion to build three tabernacles (sukkot) may reflect the Feast of Tabernacles context. The Shekinah cloud recalls God's presence in the wilderness tabernacle and the messianic expectations associated with Sukkot."
  },
  "traditionalStatus": {
    "recognition": "Traditional site since at least 4th century CE",
    "alternatives": "Some scholars prefer Mount Hermon due to its proximity to Caesarea Philippi (Matthew 16:13)",
    "reasons": [
      "Distinctive, isolated mountain rising from the plain",
      "Early Christian pilgrimage tradition from Origen and Cyril of Jerusalem",
      "Significant in Old Testament as boundary and site of Deborah's battle"
    ]
  },
  "oldTestamentReferences": [
    {
      "reference": "Judges 4:6-14",
      "description": "Deborah and Barak assembled forces on Mount Tabor before defeating Sisera"
    },
    {
      "reference": "Joshua 19:22",
      "description": "Listed as a boundary marker for the tribe of Issachar"
    },
    {
      "reference": "Psalm 89:12",
      "description": "Tabor and Hermon sing for joy at God's name"
    },
    {
      "reference": "Jeremiah 46:18",
      "description": "Compared to the majesty of Pharaoh"
    }
  ],
  "sacredSites": [
    {
      "name": "Church of the Transfiguration",
      "description": "Franciscan basilica built 1924 on Byzantine and Crusader foundations",
      "tradition": "Roman Catholic"
    },
    {
      "name": "Greek Orthodox Church",
      "description": "Chapel commemorating the Transfiguration",
      "tradition": "Greek Orthodox"
    }
  ],
  "pilgrimageInfo": {
    "feast": "Feast of the Transfiguration (August 6)",
    "practices": [
      "Sunrise services on the feast day",
      "Reading of Transfiguration accounts",
      "Veneration at the Church of the Transfiguration",
      "Reflection on the glory of Christ"
    ]
  },
  "corpusQueries": [
    {"term": "Mount Tabor", "tradition": "christian", "context": "Transfiguration site"},
    {"term": "Transfiguration", "tradition": "christian", "context": "Moses and Elijah appear"},
    {"term": "Law and Prophets", "tradition": "christian", "context": "Moses and Elijah represent Scripture"},
    {"term": "Shekinah", "tradition": "jewish", "context": "The cloud of divine presence"},
    {"term": "Deborah Barak", "tradition": "jewish", "context": "Old Testament battle site"}
  ],
  "relatedEntities": {
    "heroes": ["moses", "elijah", "peter", "james-son-of-zebedee", "john"],
    "concepts": ["shekinah", "transfiguration"],
    "places": ["mount-hermon", "mount-sinai"],
    "rituals": ["sukkot"]
  },
  "status": "published",
  "_enhanced": true,
  "iconType": "svg",
  "icon": "<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 64 64\">\n  <circle cx=\"32\" cy=\"32\" r=\"28.8\" fill=\"#FFD700\" opacity=\"0.2\"/>\n  <path d=\"M 16 48 L 32 12 L 48 48 Z\" fill=\"none\" stroke=\"#FFD700\" stroke-width=\"3\"/>\n  <circle cx=\"32\" cy=\"24\" r=\"6\" fill=\"#FFD700\" opacity=\"0.8\"/>\n  <line x1=\"32\" y1=\"18\" x2=\"32\" y2=\"6\" stroke=\"#FFD700\" stroke-width=\"2\"/>\n  <line x1=\"26\" y1=\"20\" x2=\"18\" y2=\"12\" stroke=\"#FFD700\" stroke-width=\"2\"/>\n  <line x1=\"38\" y1=\"20\" x2=\"46\" y2=\"12\" stroke=\"#FFD700\" stroke-width=\"2\"/>\n</svg>",
  "_modified": "2025-12-29T00:00:00.000Z",
  "createdAt": "2025-12-27T07:06:55.967Z",
  "metadata": {
    "createdAt": "2025-12-13T00:00:00.000Z",
    "createdBy": "system",
    "verified": true,
    "enrichedBy": "Agent_James_Transfiguration",
    "finalEnrichment": true,
    "enhancementDate": "2025-12-29",
    "enhancementFocus": "Transfiguration event, James' witness, Shekinah connection"
  },
  "updated_at": "2025-12-29T00:00:00.000Z"
}
