{
  "id": "dodona",
  "type": "place",
  "name": "Dodona",
  "icon": "🌳",
  "slug": "dodona",
  "mythologies": ["greek"],
  "primaryMythology": "greek",
  "shortDescription": "Ancient oracle of Zeus in Epirus where priestesses interpreted divine will through rustling oak leaves",
  "fullDescription": "Dodona was Zeus's oracle sanctuary in Epirus, northwestern Greece—arguably Greece's oldest oracle, predating even Delphi. The site centered on a sacred oak grove where priestesses called Selli (or Peleiades, 'doves') interpreted Zeus's messages through the rustling of oak leaves, the cooing of doves, and the ringing of bronze vessels. According to legend, Zeus's first oracle began when two black doves flew from Egyptian Thebes—one to Dodona, one to the oracle of Ammon in Libya. The sanctuary's rustic simplicity contrasted with Delphi's grandeur, reflecting Zeus's role as both sky god and protector of agriculture. Pilgrims consulted Dodona on matters ranging from personal concerns to state affairs, receiving responses through the sacred oaks' voice.",
  "category": "sacred-site",
  "subCategory": "oracle",
  "colors": {
    "primary": "#654321",
    "secondary": "#DAA520",
    "primaryRgb": "101, 67, 33"
  },
  "tags": ["dodona", "oracle", "zeus", "oak", "divination", "epirus", "ancient-oracle"],
  "geography": {
    "realm": "Earth (mortal realm)",
    "location": "Epirus, Northwestern Greece",
    "accessibility": "mortal"
  },
  "metaphysicalProperties": {
    "element": "earth",
    "energyType": "divine",
    "planet": "jupiter"
  },
  "mythologyContexts": [
    {
      "mythology": "greek",
      "usage": "Zeus's primary oracle; interpretations through sacred oak leaves; oldest Greek oracle sanctuary",
      "names": ["Dodona", "Oak of Zeus", "Sanctuary of Dodona"],
      "textReferences": [
        {"text": "Homer - Iliad", "passage": "Book 16.233-235", "context": "Achilles prays to Zeus of Dodona"},
        {"text": "Homer - Odyssey", "passage": "Book 14.327-328", "context": "Reference to Dodona's oracle"}
      ],
      "symbolism": "Dodona symbolizes Zeus's voice speaking through nature, divine will communicated through creation's elements.",
      "culturalSignificance": "Dodona was Greece's oldest oracle, representing primordial connection between gods and nature. Archaeological site reveals ancient religious practices."
    }
  ],
  "sources": [
    {"text": "Iliad", "author": "Homer", "passage": "Book 16.233-235", "mythology": "greek"}
  ]
}
