{
  "id": "elysium",
  "type": "place",
  "name": "Elysium",
  "icon": "🌅",
  "slug": "elysium",
  "mythologies": ["greek"],
  "primaryMythology": "greek",
  "shortDescription": "Paradise within the Underworld where heroes and the righteous enjoy eternal bliss",
  "fullDescription": "Elysium (Greek: Ἠλύσιον πεδίον Elysion pedion, 'Elysian Fields') is the paradise region of the Underworld reserved for heroes, the righteous, and those favored by the gods. Unlike the shadowy Asphodel Meadows where ordinary souls dwell, Elysium enjoys perpetual spring, pleasant climate, and freedom from suffering. Souls feast, compete in games, pursue music and poetry, and enjoy eternal peace. According to some accounts, souls who reach Elysium three times through reincarnation move to the Isles of the Blessed. Heroes like Achilles, Heracles (after apotheosis), and Menelaus (as Zeus's son-in-law) were promised Elysium. The realm represents the Greek ideal of eternal reward for excellence (arete) and virtue.",
  "category": "underworld",
  "subCategory": "paradise",
  "colors": {
    "primary": "#87CEEB",
    "secondary": "#98FB98",
    "primaryRgb": "135, 206, 235"
  },
  "tags": ["elysium", "paradise", "heroes", "afterlife", "blessed", "eternal-reward"],
  "geography": {
    "realm": "Blessed region of the Underworld",
    "location": "Western edge of the world or special region of Hades",
    "accessibility": "deceased"
  },
  "metaphysicalProperties": {
    "element": "air",
    "energyType": "divine"
  },
  "mythologyContexts": [
    {
      "mythology": "greek",
      "usage": "Paradise for heroes and the virtuous; eternal reward for excellence and divine favor",
      "names": ["Elysium", "Elysian Fields", "Isles of the Blessed"],
      "textReferences": [
        {"text": "Homer - Odyssey", "passage": "Book 4.561-569", "context": "Menelaus promised Elysium as son-in-law of Zeus"},
        {"text": "Hesiod - Works and Days", "passage": "Lines 167-173", "context": "Heroes of old dwelling in the Isles of the Blessed"}
      ],
      "symbolism": "Elysium symbolizes ultimate reward for virtue, heroism, and divine favor. Represents Greek aspiration for eternal happiness and honor beyond death.",
      "culturalSignificance": "'Elysian' entered language meaning blissfully happy or paradisiacal. Influenced later concepts of Heaven and paradise."
    }
  ],
  "sources": [
    {"text": "Odyssey", "author": "Homer", "passage": "Book 4.561-569", "mythology": "greek"}
  ]
}
