{
  "id": "kailash",
  "type": "place",
  "name": "Mount Kailash",
  "icon": "⛰️",
  "slug": "kailash",
  "mythologies": [
    "hindu",
    "buddhist",
    "jain",
    "bon"
  ],
  "primaryMythology": "hindu",
  "shortDescription": "Sacred mountain in Tibet revered by four religions as the cosmic axis mundi—Shiva's throne, Mount Meru incarnate, and source of four major Asian rivers",
  "fullDescription": "Mount Kailash stands as one of the world's most venerated sacred sites, worshipped by over one billion adherents of Hinduism, Buddhism, Jainism, and Bon. Rising 6,638 meters (21,778 feet) in the remote Kailash Range of Tibet, this black rock pyramid-shaped peak has never been climbed—not due to technical difficulty, but because it remains protected as supremely sacred across multiple faiths. Hindus revere Kailash as the eternal abode of Lord Shiva and his consort Parvati, and as the physical manifestation of Mount Meru, the cosmic axis at the center of all physical and metaphysical universes. Buddhists identify it as Mount Sumeru, home of Demchok (Chakrasamvara) representing supreme bliss. Jains honor it as the site where their first Tirthankara, Rishabhadeva, attained liberation (moksha). Bon practitioners, followers of Tibet's pre-Buddhist religion, know it as the nine-story Swastika Mountain where their founder Tonpa Shenrab descended from heaven. The mountain serves as the source of four major rivers—the Indus, Sutlej, Brahmaputra (Yarlung Tsangpo), and Karnali (a Ganges tributary)—making it the literal hydrological axis of Asia, sustaining hundreds of millions of lives. Each year, thousands of pilgrims undertake the arduous kora (circumambulation) around the 52-kilometer path at 15,000+ feet elevation, a journey believed to erase lifetimes of sins and bring spiritual liberation.",
  "category": "pilgrimage",
  "subCategory": "sacred-mountain",
  "colors": {
    "primary": "#2C3E50",
    "secondary": "#ECF0F1",
    "primaryRgb": "44, 62, 80"
  },
  "tags": [
    "mount-kailash",
    "kailash",
    "mount-meru",
    "mount-sumeru",
    "shiva",
    "cosmic-axis",
    "axis-mundi",
    "sacred-mountain",
    "kora",
    "circumambulation",
    "pilgrimage",
    "tibet",
    "unclimbed",
    "hindu",
    "buddhist",
    "jain",
    "bon",
    "four-rivers",
    "mansarovar",
    "kailash-mansarovar"
  ],
  "geography": {
    "realm": "Earth / Cosmic Axis Mundi",
    "location": "Kailash Range, Ngari Prefecture, Tibet Autonomous Region, China (near Nepal, India borders)",
    "coordinates": {
      "lat": 31.0674,
      "lng": 81.3119
    },
    "accessibility": "restricted"
  },
  "metaphysicalProperties": {
    "element": "earth-ether",
    "energyType": "cosmic-transcendence",
    "planet": "earth-saturn"
  },
  "inhabitants": [
    {
      "id": "shiva",
      "name": "Shiva",
      "type": "deity",
      "mythology": "hindu",
      "icon": "🔱",
      "description": "Supreme deity of Shaivism who eternally meditates atop Kailash with consort Parvati"
    },
    {
      "id": "parvati",
      "name": "Parvati",
      "type": "deity",
      "mythology": "hindu",
      "icon": "👸",
      "description": "Consort of Shiva, daughter of Himavat (personification of Himalayas), resides on Kailash"
    },
    {
      "id": "demchok",
      "name": "Demchok (Chakrasamvara)",
      "type": "deity",
      "mythology": "buddhist",
      "icon": "☸️",
      "description": "Tantric Buddhist deity of supreme bliss dwelling on Kailash as Mount Sumeru"
    },
    {
      "id": "rishabhadeva",
      "name": "Rishabhadeva",
      "type": "tirthankara",
      "mythology": "jain",
      "icon": "🕉️",
      "description": "First Jain Tirthankara who attained liberation at Ashtapada (Kailash)"
    },
    {
      "id": "tonpa-shenrab",
      "name": "Tonpa Shenrab Miwoche",
      "type": "founder",
      "mythology": "bon",
      "icon": "🏔️",
      "description": "Founder of Bon religion who descended from heaven to the Nine-Story Swastika Mountain"
    }
  ],
  "events": [
    {
      "name": "Shiva's Eternal Meditation (Timeless)",
      "description": "According to Hindu tradition, Lord Shiva eternally sits in deep meditation atop Mount Kailash, maintaining cosmic balance through his yogic practice",
      "participants": [
        {
          "id": "shiva",
          "name": "Shiva",
          "type": "deity"
        },
        {
          "id": "parvati",
          "name": "Parvati",
          "type": "deity"
        }
      ]
    },
    {
      "name": "Rishabhadeva's Liberation (Jain Cosmology)",
      "description": "First Jain Tirthankara Rishabhadeva attained moksha (liberation) at Ashtapada, identified with Mount Kailash, after immense austerities",
      "participants": [
        {
          "id": "rishabhadeva",
          "name": "Rishabhadeva",
          "type": "tirthankara"
        }
      ]
    },
    {
      "name": "Tonpa Shenrab's Descent (Bon Tradition)",
      "description": "Tonpa Shenrab Miwoche, founder of Bon religion, descended from the celestial Olmolungring realm to the Nine-Story Swastika Mountain (Mount Kailash) to teach humanity",
      "participants": [
        {
          "id": "tonpa-shenrab",
          "name": "Tonpa Shenrab Miwoche",
          "type": "founder"
        }
      ]
    },
    {
      "name": "Milarepa's Victory (11th century CE)",
      "description": "Buddhist yogi Milarepa challenged Bon priest Naro Bonchung to a race to Kailash's summit. Milarepa miraculously ascended riding sunlight at dawn, establishing Buddhist supremacy in the region",
      "participants": []
    },
    {
      "name": "Opening of Kailash to Indian Pilgrims (1981 CE)",
      "description": "After decades of closure during Chinese Cultural Revolution, Mount Kailash reopened to international pilgrims, particularly Indians, allowing resumption of ancient kora pilgrimage traditions",
      "participants": []
    },
    {
      "name": "Annual Saga Dawa Festival",
      "description": "Thousands gather at Kailash during Saga Dawa (full moon of 4th lunar month) commemorating Buddha's enlightenment and parinirvana. Completing kora during this time multiplies spiritual merit",
      "participants": []
    },
    {
      "name": "Ravana's Penance (Hindu Epic)",
      "description": "Demon king Ravana performed severe tapasya (austerities) at Kailash to please Shiva. When Ravana tried to lift the mountain, Shiva crushed him beneath it until Ravana sang hymns of praise",
      "participants": [
        {
          "id": "shiva",
          "name": "Shiva",
          "type": "deity"
        }
      ]
    }
  ],
  "mythologyContexts": [
    {
      "mythology": "hindu",
      "usage": "Sacred abode (kailasa) of Lord Shiva; physical manifestation of Mount Meru cosmic axis; source of sacred rivers; pilgrimage site for liberation; location of Shiva's meditation; center of universe in Hindu cosmology",
      "names": [
        "Mount Kailash (कैलाश पर्वत)",
        "Kailasa",
        "Mount Meru",
        "Rajatadrisha (Silver Mountain)",
        "Sumeru"
      ],
      "associatedDeities": [
        {
          "id": "shiva",
          "name": "Shiva",
          "type": "deity",
          "mythology": "hindu",
          "icon": "🔱"
        },
        {
          "id": "parvati",
          "name": "Parvati",
          "type": "deity",
          "mythology": "hindu",
          "icon": "👸"
        },
        {
          "id": "ganesha",
          "name": "Ganesha",
          "type": "deity",
          "mythology": "hindu",
          "icon": "🐘"
        },
        {
          "id": "kartikeya",
          "name": "Kartikeya",
          "type": "deity",
          "mythology": "hindu",
          "icon": "🦚"
        }
      ],
      "textReferences": [
        {
          "text": "Shiva Purana",
          "passage": "Kailasa Samhita",
          "context": "Describes Kailash as Shiva's eternal abode where he resides with Parvati, Ganesha, and Kartikeya",
          "corpusUrl": "/mythos/hindu/corpus-search.html?term=kailash+shiva"
        },
        {
          "text": "Skanda Purana",
          "passage": "Manasa Khanda",
          "context": "Details pilgrimage to Kailash and Lake Manasarovar, emphasizing spiritual purification",
          "corpusUrl": "/mythos/hindu/corpus-search.html?term=kailash+pilgrimage"
        },
        {
          "text": "Ramayana",
          "passage": "Uttara Kanda",
          "context": "Recounts Ravana's attempt to lift Kailash and his subjugation by Shiva",
          "corpusUrl": "/mythos/hindu/corpus-search.html?term=ravana+kailash"
        },
        {
          "text": "Vishnu Purana",
          "passage": "Book 2",
          "context": "Describes Mount Meru as cosmic center with Kailash as its earthly manifestation",
          "corpusUrl": "/mythos/hindu/corpus-search.html?term=mount+meru"
        }
      ],
      "symbolism": "Kailash represents the axis mundi connecting heaven, earth, and underworld—the cosmic pillar around which all existence revolves. Its pyramid shape with four near-equal faces aligned to cardinal directions symbolizes cosmic order and perfection. As Shiva's abode, it embodies the transcendent yogi archetype—withdrawal from worldly concerns for spiritual realization. The perpetual snow cap represents purity and timelessness. The four rivers flowing from Kailash symbolize spiritual knowledge flowing to the four directions, nourishing all life. The unclimbed status preserves divine transcendence—humans do not ascend to God's throne but circumambulate in humility. The kora pilgrimage symbolizes samsara (cycle of birth and rebirth), with completion representing liberation. Lake Manasarovar (nearby) symbolizes consciousness and clarity, while Lake Rakshastal represents ego and darkness—the dual nature of existence. Kailash embodies the Hindu teaching that the divine dwells in remote, pristine nature, untouched by human corruption.",
      "culturalSignificance": "For Hindus, Kailash pilgrimage (Kailash-Mansarovar Yatra) is the ultimate sacred journey, surpassing even the Char Dham. Completing the kora is believed to erase sins of a lifetime; completing 108 koras grants enlightenment and escape from samsara. The pilgrimage tests physical endurance and spiritual devotion at extreme altitude. Many elderly Hindins save their entire lives for this final pilgrimage before death. The Dolma La Pass (18,600 ft), highest point of kora, is where pilgrims leave behind possessions symbolizing ego death and rebirth. The south face of Kailash, never touched by sunlight, represents the eternal mystery of divine nature. Kailash links geography to cosmology—the physical mountain manifests the mythological Mount Meru, making cosmic truths tangible. Hindu nationalism incorporates Kailash as cultural heritage, though it lies in Chinese-controlled Tibet, creating political dimensions to religious devotion."
    },
    {
      "mythology": "buddhist",
      "usage": "Mount Sumeru/Kang Rinpoche (Precious Jewel of Snow); home of Demchok; tantric Buddhist power place; circumambulation for merit and purification; site of Milarepa's enlightenment activities",
      "names": [
        "Mount Sumeru (須彌山)",
        "Kang Rinpoche (གངས་རིན་པོ་ཆེ - Precious Jewel of Snow)",
        "Kailasa",
        "Kangdisê"
      ],
      "associatedDeities": [
        {
          "id": "demchok",
          "name": "Demchok (Chakrasamvara)",
          "type": "deity",
          "mythology": "buddhist",
          "icon": "☸️"
        },
        {
          "id": "milarepa",
          "name": "Milarepa",
          "type": "yogi-saint",
          "mythology": "buddhist",
          "icon": "🧘"
        }
      ],
      "textReferences": [
        {
          "text": "Abhidharmakosa",
          "passage": "Chapter 3 - The World",
          "context": "Buddhist cosmology placing Mount Sumeru at center of universe",
          "corpusUrl": "/mythos/buddhist/corpus-search.html?term=mount+sumeru"
        },
        {
          "text": "Life of Milarepa",
          "passage": "Kailash chapters",
          "context": "Milarepa's contest with Bon priest Naro Bonchung and yogic accomplishments at Kailash",
          "corpusUrl": "/mythos/buddhist/corpus-search.html?term=milarepa+kailash"
        },
        {
          "text": "Chakrasamvara Tantra",
          "passage": "Mandala descriptions",
          "context": "Identifies Kailash as dwelling place of Chakrasamvara in tantric cosmology",
          "corpusUrl": "/mythos/buddhist/corpus-search.html?term=chakrasamvara"
        }
      ],
      "symbolism": "In Buddhist cosmology, Kailash as Mount Sumeru represents the cosmic mountain at the center of the universe, surrounded by continents and oceans. It symbolizes the enlightened mind—stable, unshakeable, transcendent. The circumambulation (kora) represents the Buddhist path itself—right-handed rotation symbolizes following the Dharma, progressing toward enlightenment through repeated practice. Prostration along the kora path represents surrender of ego and accumulation of merit. The mountain's isolation and harsh environment symbolize renunciation and ascetic practice necessary for liberation. In Vajrayana Buddhism, Kailash is the sacred abode of Demchok (Chakrasamvara), representing the union of wisdom and compassion. The mountain's four faces represent the Four Noble Truths or the four directions of Buddhist compassion extending to all beings.",
      "culturalSignificance": "Tibetan Buddhists consider Kailash (Kang Rinpoche) the most sacred of all pilgrimage destinations. The kora is traditionally performed clockwise, taking 1-3 days depending on devotion and physical ability. Highly devoted pilgrims perform full-body prostrations for the entire circuit, taking weeks. The Saga Dawa festival (Buddha's enlightenment/parinirvana) at Kailash attracts thousands, with kora merit multiplied. The Drolma La pass contains the 'stone of sins' where pilgrims symbolically die and are reborn. Monasteries like Chiu and Drirapuk house monks maintaining the sacred landscape. The legend of Milarepa's victory over the Bon priest represents Buddhism's triumph in Tibet while acknowledging pre-Buddhist traditions. For Tibetan refugees, Kailash represents lost homeland and cultural continuity despite Chinese occupation."
    },
    {
      "mythology": "jain",
      "usage": "Mount Ashtapada where first Tirthankara Rishabhadeva attained moksha; sacred pilgrimage site though now inaccessible to Jains due to political restrictions",
      "names": [
        "Ashtapada (अष्टपद - Eight Steps)",
        "Kailash",
        "Astapada"
      ],
      "associatedDeities": [
        {
          "id": "rishabhadeva",
          "name": "Rishabhadeva (Adinatha)",
          "type": "tirthankara",
          "mythology": "jain",
          "icon": "🕉️"
        }
      ],
      "textReferences": [
        {
          "text": "Jain Agamas",
          "passage": "References to Ashtapada",
          "context": "Identifies Ashtapada as location of Rishabhadeva's nirvana",
          "corpusUrl": "/mythos/jain/corpus-search.html?term=ashtapada"
        },
        {
          "text": "Adipurana",
          "passage": "Life of Rishabhadeva",
          "context": "Describes the first Tirthankara's austerities and liberation at Ashtapada",
          "corpusUrl": "/mythos/jain/corpus-search.html?term=rishabhadeva"
        }
      ],
      "symbolism": "In Jain tradition, Ashtapada (Mount Kailash) represents the pinnacle of spiritual achievement—the site where the first Tirthankara attained complete liberation (kevala jnana and moksha), escaping the cycle of rebirth forever. The name 'Ashtapada' (eight steps) may refer to the eight-fold path to liberation or the mountain's geometric appearance. As the location of the first liberation in this cosmic cycle, Ashtapada symbolizes the possibility of moksha for all beings and validates the Jain path of extreme asceticism and non-violence. The inaccessibility of Ashtapada to modern Jain pilgrims symbolizes the difficulty of the liberation path and the rarity of achieving moksha.",
      "culturalSignificance": "Historically, Jain pilgrims undertook arduous journeys to Ashtapada/Kailash. The site represents Jain presence in Himalayan regions and connections with Hindu and Buddhist pilgrimage traditions. Rishabhadeva's liberation at Ashtapada makes it the most sacred of all Jain sites, though accessibility restrictions (requiring travel through China) have made pilgrimage nearly impossible for modern Jains. This inaccessibility has created longing and preserved Ashtapada as an ideal rather than a commercialized pilgrimage destination. Jain art depicts Ashtapada with Rishabhadeva in meditation, inspiring devotion even without physical access."
    },
    {
      "mythology": "bon",
      "usage": "Nine-Story Swastika Mountain where Tonpa Shenrab descended; counterclockwise kora following Bon tradition; pre-Buddhist sacred site of Tibet",
      "names": [
        "Tise",
        "Nine-Story Swastika Mountain",
        "Yungdrung Gutsek",
        "Kangri Karchok"
      ],
      "associatedDeities": [
        {
          "id": "tonpa-shenrab",
          "name": "Tonpa Shenrab Miwoche",
          "type": "founder",
          "mythology": "bon",
          "icon": "🏔️"
        }
      ],
      "textReferences": [
        {
          "text": "Bonpo texts",
          "passage": "Founding narratives",
          "context": "Describes Tonpa Shenrab's descent to Swastika Mountain and founding of Bon",
          "corpusUrl": "/mythos/bon/corpus-search.html?term=tonpa+shenrab"
        }
      ],
      "symbolism": "In Bon tradition, the Nine-Story Swastika Mountain represents the bridge between celestial Olmolungring realm and the terrestrial world. The swastika (yungdrung in Tibetan) symbolizes permanence, eternity, and the Bon religion itself. The nine stories represent stages of spiritual ascent or cosmological levels. The mountain embodies the Bon belief that sacred power resides in natural landscape features. The counterclockwise circumambulation (opposite to Buddhist practice) symbolizes Bon's distinct identity while paralleling Buddhist devotion. Kailash as Tonpa Shenrab's descent point establishes Bon's primordial status as Tibet's original religion.",
      "culturalSignificance": "For Bon practitioners, Kailash is the supreme sacred site, predating Buddhism's arrival in Tibet. The counterclockwise kora distinguishes Bonpos from Buddhists, maintaining religious identity while sharing sacred geography. Bon tradition preserved ancient Tibetan spiritual practices, later influencing Tibetan Buddhism while remaining distinct. Kailash represents Bon resilience against Buddhist dominance and continuity of pre-Buddhist Tibetan culture. The shared sanctity of Kailash across Bon and Buddhism demonstrates syncretism and mutual influence in Tibetan religious history."
    }
  ],
  "relatedEntities": {
    "places": [
      {
        "id": "lake-manasarovar",
        "name": "Lake Manasarovar",
        "type": "place",
        "mythology": "hindu",
        "icon": "💧",
        "url": "/mythos/hindu/places/manasarovar.html"
      },
      {
        "id": "mount-meru",
        "name": "Mount Meru (Cosmic)",
        "type": "place",
        "mythology": "hindu",
        "icon": "🏔️",
        "url": "/mythos/hindu/places/mount-meru.html"
      },
      {
        "id": "varanasi",
        "name": "Varanasi",
        "type": "place",
        "mythology": "hindu",
        "icon": "🕉️",
        "url": "/mythos/hindu/places/varanasi.html"
      },
      {
        "id": "lhasa",
        "name": "Lhasa",
        "type": "place",
        "mythology": "buddhist",
        "icon": "🏛️",
        "url": "/mythos/buddhist/places/lhasa.html"
      }
    ],
    "deities": [
      {
        "id": "shiva",
        "name": "Shiva",
        "type": "deity",
        "mythology": "hindu",
        "icon": "🔱",
        "url": "/data/entities/deity/shiva.json"
      }
    ],
    "archetypes": [
      {
        "id": "sacred-mountain",
        "name": "Sacred Mountain",
        "type": "archetype",
        "mythology": "universal",
        "icon": "⛰️",
        "url": "/shared/archetypes/sacred-mountain.html"
      },
      {
        "id": "axis-mundi",
        "name": "Axis Mundi",
        "type": "archetype",
        "mythology": "universal",
        "icon": "🌍",
        "url": "/shared/archetypes/axis-mundi.html"
      },
      {
        "id": "pilgrimage",
        "name": "Pilgrimage",
        "type": "archetype",
        "mythology": "universal",
        "icon": "🚶",
        "url": "/shared/archetypes/pilgrimage.html"
      },
      {
        "id": "cosmic-center",
        "name": "Cosmic Center",
        "type": "archetype",
        "mythology": "universal",
        "icon": "🎯",
        "url": "/shared/archetypes/cosmic-center.html"
      }
    ],
    "concepts": [
      {
        "id": "circumambulation",
        "name": "Circumambulation (Kora/Parikrama)",
        "type": "concept",
        "mythology": "hindu",
        "icon": "🔄",
        "url": "/mythos/hindu/concepts/circumambulation.html"
      },
      {
        "id": "moksha",
        "name": "Moksha (Liberation)",
        "type": "concept",
        "mythology": "hindu",
        "icon": "✨",
        "url": "/mythos/hindu/concepts/moksha.html"
      }
    ]
  },
  "sources": [
    {
      "text": "The Sacred Mountain: Travelers and Traditions at Mount Kailash",
      "author": "Russell Johnson, Kerry Moran",
      "passage": "Comprehensive study of Kailash across four religions",
      "mythology": "universal"
    },
    {
      "text": "Mount Kailash and Lake Manasarovar: Geography, Mythology, and Pilgrimage",
      "author": "William S. Sax",
      "passage": "Academic analysis of geography and religious traditions",
      "mythology": "hindu"
    },
    {
      "text": "Shiva Purana",
      "author": "Traditional",
      "passage": "Kailasa Samhita describing Shiva's abode",
      "mythology": "hindu"
    },
    {
      "text": "To the Navel of the World: Pilgrimage to Mount Kailash",
      "author": "Charles Allen",
      "passage": "Historical accounts of Western explorers and Asian pilgrims",
      "mythology": "universal"
    },
    {
      "text": "The Life of Milarepa",
      "author": "Tsangnyön Heruka (translated by Andrew Quintman)",
      "passage": "Buddhist yogic tradition at Kailash",
      "mythology": "buddhist"
    },
    {
      "text": "The Sacred Landscape of Kailash and Manasarovar",
      "author": "Toni Huber",
      "passage": "Anthropological study of pilgrimage practices",
      "mythology": "universal"
    },
    {
      "text": "Swasthani Purana and Kailash Traditions",
      "author": "Traditional Hindu texts",
      "passage": "Ritual and mythological significance",
      "mythology": "hindu"
    },
    {
      "text": "Bon Religion: A Death Ritual of the Tibetan Bonpos",
      "author": "Per Kværne",
      "passage": "Bon traditions and Kailash's role",
      "mythology": "bon"
    }
  ],
  "linguistic": {
    "originalName": "Kailash",
    "originalScript": "कैलाश (Devanagari), གངས་རིན་པོ་ཆེ (Tibetan)",
    "transliteration": "Kailāsa (Sanskrit), Kang Rinpoche (Tibetan)",
    "pronunciation": "KAI-lash (English), kai-LAH-sah (Sanskrit), KAHNG rin-po-CHAY (Tibetan)",
    "etymology": {
      "origin": "From Sanskrit कैलाश (kailāsa), possibly derived from 'kelāsa' meaning 'crystal' or from Dravidian roots. Tibetan name གངས་རིན་པོ་ཆེ (Kang Rinpoche) means 'Precious Jewel of Snow.' Chinese 冈仁波齐 (Gāngrénbōqí) is phonetic rendering of Tibetan.",
      "development": "Proto-Indo-Aryan *kailāsa → Vedic Sanskrit kailāsa (crystal/crystal mountain) → Classical Sanskrit Kailāsa (Shiva's abode) → Tibetan Kang Rinpoche (Precious Snow Jewel) → Chinese Gāngrénbōqí → English Mount Kailash",
      "historicalForms": [
        {
          "period": "Vedic Sanskrit",
          "form": "कैलाश (kailāsa)",
          "script": "Devanagari",
          "date": "c. 1500-500 BCE"
        },
        {
          "period": "Classical Sanskrit",
          "form": "कैलास (kailāsa)",
          "script": "Devanagari",
          "date": "c. 500 BCE - present"
        },
        {
          "period": "Tibetan",
          "form": "གངས་རིན་པོ་ཆེ (Kang Rinpoche)",
          "script": "Tibetan",
          "date": "c. 7th century CE - present"
        },
        {
          "period": "Chinese",
          "form": "冈仁波齐 (Gāngrénbōqí)",
          "script": "Chinese characters",
          "date": "Modern"
        },
        {
          "period": "Bon",
          "form": "Yungdrung Gutsek",
          "script": "Tibetan",
          "date": "Pre-Buddhist to present"
        }
      ]
    },
    "cognates": [
      {
        "language": "Sanskrit",
        "term": "कैलाश (kailāsa)",
        "meaning": "Crystal mountain / Shiva's abode"
      },
      {
        "language": "Hindi",
        "term": "कैलाश (kailāsh)",
        "meaning": "Mount Kailash"
      },
      {
        "language": "Tibetan",
        "term": "གངས་རིན་པོ་ཆེ (Kang Rinpoche)",
        "meaning": "Precious Jewel of Snow"
      },
      {
        "language": "Chinese",
        "term": "冈仁波齐 (Gāngrénbōqí)",
        "meaning": "Mount Kailash (phonetic)"
      },
      {
        "language": "Nepali",
        "term": "कैलाश (Kailāsh)",
        "meaning": "Mount Kailash"
      }
    ]
  },
  "geographical": {
    "region": "Kailash Range, Transhimalayas, Tibet",
    "culturalArea": "Tibetan Plateau, Western Tibet (Ngari Prefecture)",
    "originPoint": {
      "name": "Mount Kailash peak, Ngari Prefecture, Tibet Autonomous Region, China",
      "coordinates": {
        "latitude": 31.0674,
        "longitude": 81.3119,
        "accuracy": "precise-verified"
      },
      "description": "Located in remote western Tibet near borders of India and Nepal. Elevation: 6,638 meters (21,778 feet). Part of Kailash Range in Transhimalayas. Kora circuit: ~52 km at 15,000+ feet elevation. Nearby: Lake Manasarovar (30 km), Lake Rakshastal. Source region of Indus, Sutlej, Brahmaputra, and Karnali rivers. Extreme continental climate, accessible May-September."
    }
  },
  "temporal": {
    "firstAttestation": {
      "date": {
        "year": -1500,
        "circa": true,
        "uncertainty": 500,
        "display": "c. 1500 BCE",
        "confidence": "textual-vedic"
      },
      "type": "textual",
      "description": "Vedic texts reference Kailasa as sacred mountain and abode of deities. Buddhist and Jain texts from first millennium BCE also reference the mountain. Exact dating uncertain but textual tradition extends at least 3,000 years.",
      "source": "Vedic literature, Puranas, early Buddhist and Jain texts"
    },
    "historicalDate": {
      "start": {
        "year": -1500,
        "circa": true,
        "uncertainty": 500,
        "display": "c. 1500 BCE"
      },
      "end": {
        "year": 2025,
        "display": "Present"
      },
      "display": "c. 1500 BCE - Present (3,500+ years of continuous veneration)"
    },
    "timelinePosition": {
      "period": "Prehistoric to present (continuous sacred status)",
      "specificDate": {
        "year": -1000,
        "circa": true,
        "display": "c. 1000 BCE"
      },
      "era": "Vedic period through Buddhist, Jain, Bon traditions to present",
      "context": "Mount Kailash has been continuously venerated as sacred for over 3,000 years across multiple religious traditions. Its remote location preserved it from conquest and commercialization. The mountain has never been climbed, maintaining its sacred inviolability. Pilgrimage traditions predate historical records and continue unbroken to present day.",
      "keyMoments": [
        {
          "date": {
            "year": -1500,
            "circa": true,
            "display": "c. 1500 BCE"
          },
          "event": "Vedic references to Kailasa",
          "significance": "Early Hindu texts establish Kailash as Shiva's abode"
        },
        {
          "date": {
            "year": -500,
            "circa": true,
            "display": "c. 500 BCE"
          },
          "event": "Jain tradition of Ashtapada",
          "significance": "Rishabhadeva's liberation site established in Jain cosmology"
        },
        {
          "date": {
            "year": 700,
            "circa": true,
            "display": "c. 7th-8th century CE"
          },
          "event": "Buddhism spreads to Tibet",
          "significance": "Kailash incorporated into Buddhist cosmology as Mount Sumeru"
        },
        {
          "date": {
            "year": 1050,
            "circa": true,
            "display": "c. 11th century CE"
          },
          "event": "Milarepa's contest at Kailash",
          "significance": "Buddhist-Bon contest establishes Buddhist dominance while respecting Bon traditions"
        },
        {
          "date": {
            "year": 1715,
            "display": "Early 18th century"
          },
          "event": "First Western accounts",
          "significance": "Jesuit missionaries report on sacred mountain"
        },
        {
          "date": {
            "year": 1926,
            "display": "1926"
          },
          "event": "Colonel R. C. Wilson expedition",
            "significance": "British colonial officer explores region, respects climbing prohibition"
        },
        {
          "date": {
            "year": 1966,
            "display": "1966-1976"
          },
          "event": "Cultural Revolution closure",
          "significance": "Pilgrimage forbidden during Chinese Cultural Revolution; monasteries destroyed"
        },
        {
          "date": {
            "year": 1981,
            "display": "1981"
          },
          "event": "Reopening to pilgrims",
          "significance": "China reopens Kailash to Indian and international pilgrims; revival of pilgrimage traditions"
        },
        {
          "date": {
            "year": 2000,
            "display": "2000"
          },
          "event": "Modern infrastructure development",
          "significance": "Improved roads make pilgrimage more accessible while raising concerns about commercialization"
        }
      ]
    }
  }
}
