{
  "id": "mount-ararat",
  "type": "place",
  "name": "Mount Ararat",
  "icon": "🗻",
  "slug": "mount-ararat",
  "mythologies": [
    "jewish",
    "christian",
    "islamic",
    "armenian"
  ],
  "primaryMythology": "abrahamic",
  "shortDescription": "The legendary resting place of Noah's Ark—a dormant volcanic mountain on the Turkish-Armenian border sacred to multiple Abrahamic traditions and Armenian national identity",
  "fullDescription": "Mount Ararat (Turkish: Ağrı Dağı; Armenian: Մասիս Masis) stands as one of the most potent symbols in religious and cultural history, revered across multiple traditions as the landing site of Noah's Ark after the Great Flood. This dormant stratovolcano, consisting of two major volcanic cones—Greater Ararat (5,137 m / 16,854 ft) and Lesser Ararat (3,896 m / 12,782 ft)—dominates the landscape of Eastern Anatolia. For millennia, the mountain has captured human imagination as the nexus between divine judgment and mercy, destruction and renewal. The biblical account in Genesis 8:4 specifies that 'the ark came to rest on the mountains of Ararat' on the seventeenth day of the seventh month, establishing this peak as the symbolic birthplace of post-diluvian humanity. Armenian tradition holds even deeper significance, viewing Ararat as the sacred heart of historic Armenia, the throne of the gods, and the eternal symbol of the Armenian nation—tragically visible from Yerevan yet located across the Turkish border since 1921. Islamic tradition similarly honors the mountain as Jebel Judi or connects it to the Quranic flood narrative. Modern expeditions have sought physical evidence of the Ark since the 19th century, with numerous claimed sightings of wooden structures beneath glaciers, though scientific consensus remains skeptical. The mountain's geological composition—layers of lava flows dating back to the Pliocene epoch—and its position along the collision zone between the Arabian and Eurasian tectonic plates make it prone to seismic activity. Whether viewed through the lens of religious tradition, national mythology, or geological wonder, Mount Ararat continues to stand as a powerful axis mundi connecting heaven and earth, ancient narrative and contemporary longing.",
  "category": "mountain",
  "subCategory": "sacred-peak",
  "colors": {
    "primary": "#FFFFFF",
    "secondary": "#4A5568",
    "primaryRgb": "255, 255, 255"
  },
  "tags": [
    "mount-ararat",
    "noahs-ark",
    "great-flood",
    "genesis",
    "armenian",
    "sacred-mountain",
    "biblical",
    "quran",
    "volcano",
    "ararat-anomaly",
    "ark-search",
    "masis",
    "diluvian",
    "covenant",
    "rainbow",
    "turkey",
    "armenia"
  ],
  "geography": {
    "realm": "Earth / Sacred Mountain of the Flood",
    "location": "Eastern Anatolia, Turkey (near Armenian border, Iğdır Province)",
    "coordinates": {
      "lat": 39.7025,
      "lng": 44.2979
    },
    "accessibility": "restricted"
  },
  "metaphysicalProperties": {
    "element": "earth-water",
    "energyType": "renewal-covenant",
    "planet": "earth"
  },
  "inhabitants": [
    {
      "id": "noah",
      "name": "Noah (Nuh)",
      "type": "patriarch-prophet",
      "mythology": "abrahamic",
      "icon": "⛵",
      "description": "Righteous man chosen by God to survive the Flood and preserve life, ark landed on Ararat's peak"
    },
    {
      "id": "hayk",
      "name": "Hayk",
      "type": "legendary-patriarch",
      "mythology": "armenian",
      "icon": "🏹",
      "description": "Legendary founder of Armenian nation, great-great-grandson of Noah, associated with Ararat region"
    }
  ],
  "events": [
    {
      "name": "The Great Flood (c. 2350 BCE, biblical chronology)",
      "description": "God sent worldwide flood to cleanse the earth of wickedness, sparing only Noah, his family, and animals in the Ark",
      "participants": [
        {
          "id": "noah",
          "name": "Noah",
          "type": "patriarch"
        }
      ]
    },
    {
      "name": "Ark Landing on Ararat (Genesis 8:4)",
      "description": "After 150 days afloat, the Ark came to rest on the mountains of Ararat on the 17th day of the 7th month, marking the beginning of humanity's renewal",
      "participants": [
        {
          "id": "noah",
          "name": "Noah",
          "type": "patriarch"
        }
      ]
    },
    {
      "name": "Noah's Covenant (Genesis 9)",
      "description": "God established covenant with Noah and all living creatures, promising never again to destroy earth by flood, marked by the rainbow",
      "participants": [
        {
          "id": "noah",
          "name": "Noah",
          "type": "patriarch"
        }
      ]
    },
    {
      "name": "St. Jacob of Nisibis' Ascent (4th century CE)",
      "description": "Armenian tradition holds that St. Jacob attempted to climb Ararat to find the Ark. God rewarded his faith by delivering a piece of Ark wood to him, establishing tradition that mountain is sacred and protected",
      "participants": []
    },
    {
      "name": "Parrot's First Documented Ascent (1829)",
      "description": "Friedrich Parrot, accompanied by Khachatur Abovian, made first recorded successful ascent of Greater Ararat, inaugurating modern era of Ararat exploration",
      "participants": []
    },
    {
      "name": "Turkish-Armenian Border Closure (1921)",
      "description": "Treaty of Kars placed Ararat within Turkish borders, separating the mountain from Armenia. The peak remains visible from Yerevan, symbolizing Armenian longing and loss",
      "participants": []
    },
    {
      "name": "Modern Ark Expeditions (1950s-present)",
      "description": "Numerous expeditions claim evidence of Ark on Ararat, including Navarra's wood samples (1955), satellite imagery of 'Ararat Anomaly,' and various geological formations interpreted as Ark remains",
      "participants": []
    }
  ],
  "mythologyContexts": [
    {
      "mythology": "jewish",
      "usage": "Landing site of Noah's Ark; symbol of divine judgment and mercy; beginning of renewed covenant between God and humanity; connection to universal flood narrative",
      "names": [
        "Har Ararat (הר אררט)",
        "Mountains of Ararat",
        "Urartu (ancient kingdom name)"
      ],
      "associatedDeities": [
        {
          "id": "yahweh",
          "name": "YHWH/Adonai",
          "type": "deity",
          "mythology": "jewish",
          "icon": "✡️"
        }
      ],
      "textReferences": [
        {
          "text": "Torah (Tanakh)",
          "passage": "Genesis 8:4",
          "context": "'And the ark rested in the seventh month, on the seventeenth day of the month, upon the mountains of Ararat.' Marks transition from judgment to mercy, destruction to renewal",
          "corpusUrl": "/mythos/jewish/corpus-search.html?term=genesis+ararat"
        },
        {
          "text": "Genesis",
          "passage": "Genesis 6-9",
          "context": "Complete flood narrative: Noah's righteousness, ark construction, flood duration (40 days rain + 150 days water), landing on Ararat, emergence, covenant, rainbow sign",
          "corpusUrl": "/mythos/jewish/corpus-search.html?term=noah+flood"
        }
      ],
      "symbolism": "Mount Ararat represents the axis between divine judgment and mercy, the end of one world and birth of another. The mountain symbolizes humanity's second chance, God's covenant faithfulness despite human wickedness, and the preservation of biodiversity through divine providence. The Ark's landing marks the moment when chaos (flood waters) yields to order (dry land), death to life. Ararat becomes the new Eden, the launching point for repopulated earth. The rainbow covenant establishes natural law's reliability—seasonal cycles will continue despite human failing.",
      "culturalSignificance": "Jewish tradition focuses less on the physical mountain than on the theological meaning of the flood narrative: consequences of corruption, importance of righteousness (Noah as tzaddik), divine patience (120 years of warning), and covenant relationship. The flood story establishes the Noahide Laws—seven universal commandments for all humanity. Jewish interpretation emphasizes moral lessons rather than literal geography, though medieval Jewish travelers and scholars referenced Ararat's location in their geographical works."
    },
    {
      "mythology": "christian",
      "usage": "Site of Ark landing; symbol of salvation through faith; typological prefiguring of baptism and Christ's church; destination for relic-seeking pilgrims",
      "names": [
        "Mount Ararat",
        "Mountains of Ararat",
        "Mount Masis (Armenian Christian tradition)"
      ],
      "associatedDeities": [
        {
          "id": "god-father",
          "name": "God the Father",
          "type": "deity",
          "mythology": "christian",
          "icon": "✝️"
        }
      ],
      "textReferences": [
        {
          "text": "New Testament",
          "passage": "1 Peter 3:20-21",
          "context": "Noah's flood as typology for baptism: 'eight persons were saved through water. Baptism, which corresponds to this, now saves you'",
          "corpusUrl": "/mythos/christian/corpus-search.html?term=noah+baptism"
        },
        {
          "text": "Gospel of Matthew",
          "passage": "Matthew 24:37-39",
          "context": "Jesus uses Noah's days as warning of end times: 'As were the days of Noah, so will be the coming of the Son of Man'",
          "corpusUrl": "/mythos/christian/corpus-search.html?term=matthew+noah"
        },
        {
          "text": "Hebrews",
          "passage": "Hebrews 11:7",
          "context": "Noah praised as exemplar of faith: 'By faith Noah...constructed an ark for the saving of his household'",
          "corpusUrl": "/mythos/christian/corpus-search.html?term=hebrews+noah"
        }
      ],
      "symbolism": "Christian tradition interprets Mount Ararat through typological lens: Noah's Ark prefigures the Church (vessel of salvation), the flood represents baptism (death to sin, resurrection to new life), and Noah foreshadows Christ (righteous savior of humanity). The eight people saved (Noah's family) symbolize the eighth day (resurrection day). Armenian Christianity particularly venerates Ararat as the mountain where God renewed his covenant with creation, connecting it to Christ's renewal of covenant through crucifixion and resurrection.",
      "culturalSignificance": "Christian pilgrims have sought Ararat since Byzantine times, searching for Ark relics. Armenian Apostolic Church traditions claim St. Jacob of Nisibis (4th c.) received Ark wood fragment from an angel. Medieval European travelers and Crusaders wrote accounts of Ararat. Modern evangelical and young-earth creationist expeditions seek archaeological proof of biblical literalism. The Armenian Church views Ararat as integral to national Christian identity, featuring the mountain prominently in religious art and iconography."
    },
    {
      "mythology": "islamic",
      "usage": "Landing site of Nuh's (Noah's) ark; part of prophetic lineage; Quranic flood narrative; some traditions identify different peak (Judi) as landing site",
      "names": [
        "Jabal Ararat (جبل أرارات)",
        "Jebel Judi (جبل الجودي) - alternative tradition",
        "Mountain of Nuh"
      ],
      "associatedDeities": [
        {
          "id": "allah",
          "name": "Allah",
          "type": "deity",
          "mythology": "islamic",
          "icon": "☪️"
        }
      ],
      "textReferences": [
        {
          "text": "Quran",
          "passage": "Surah 11:44 (Hud)",
          "context": "'And it was said, O earth, swallow your water, and O sky, withhold [your rain]. And the water subsided, and the matter was accomplished, and the ship came to rest on [Mount] Judi'",
          "corpusUrl": "/mythos/islamic/corpus-search.html?term=quran+noah+judi"
        },
        {
          "text": "Quran",
          "passage": "Surah 71 (Nuh)",
          "context": "Entire surah dedicated to Prophet Nuh's (Noah's) warnings to his people and the flood that followed their rejection",
          "corpusUrl": "/mythos/islamic/corpus-search.html?term=quran+surah+nuh"
        }
      ],
      "symbolism": "Islamic tradition emphasizes Nuh (Noah) as a prophet (nabi) and messenger (rasul) sent to warn his people. The flood represents divine justice against those who reject God's message. The ark symbolizes salvation through submission to Allah and following prophetic guidance. The mountain—whether Ararat or Judi—represents the foundation of renewed humanity based on tawhid (divine unity). Nuh is honored as one of the five great prophets (Ulul-'Azm) alongside Ibrahim, Musa, Isa, and Muhammad.",
      "culturalSignificance": "Islamic scholarship has debated whether 'Judi' in Quran 11:44 refers to Mount Ararat or a different peak (possibly in modern Turkey or Iraq). Some commentators identify Judi with Ararat; others distinguish them. Turkish Muslims living near Ararat recognize its significance in Abrahamic tradition. The Prophet Muhammad referenced Nuh's story multiple times as warning and lesson. Islamic tradition emphasizes the moral dimensions of the flood narrative—consequences of shirk (polytheism) and importance of heeding prophetic warnings."
    },
    {
      "mythology": "armenian",
      "usage": "Sacred national symbol; the Mother Mountain; throne of ancient gods; center of Armenian cosmology; symbol of lost homeland and national identity",
      "names": [
        "Մասիս (Masis) - sacred Armenian name",
        "Ագրի Լեռ (Agri Mountain)",
        "Արարատ (Ararat)"
      ],
      "associatedDeities": [
        {
          "id": "hayk",
          "name": "Hayk",
          "type": "legendary-patriarch",
          "mythology": "armenian",
          "icon": "🏹"
        },
        {
          "id": "ara-the-beautiful",
          "name": "Ara the Beautiful",
          "type": "legendary-king",
          "mythology": "armenian",
          "icon": "👑"
        }
      ],
      "textReferences": [
        {
          "text": "History of Armenia",
          "passage": "Movses Khorenatsi, 5th century",
          "context": "Chronicles Hayk's defeat of Bel and founding of Armenian nation near Ararat; establishes mountain as sacred center of Armenian identity",
          "corpusUrl": "/mythos/armenian/corpus-search.html?term=khorenatsi+ararat"
        }
      ],
      "symbolism": "For Armenians, Mount Ararat (Masis) transcends religious significance to become the supreme national symbol—the heart and soul of Armenian identity. The mountain represents: eternal Armenia (despite current borders), divine protection of the Armenian people, cultural continuity across millennia, and the axis mundi of Armenian cosmology. Pre-Christian Armenians viewed Ararat as the throne of the gods and the navel of the earth. The mountain's snow-capped twin peaks symbolize eternity, purity, and unreachable perfection. Post-1921, Ararat embodies Armenian tragedy and resilience—visible from Yerevan but politically inaccessible, representing the greater Armenian homeland (lost territories) and the enduring hope for return.",
      "culturalSignificance": "Mount Ararat dominates Armenian consciousness, culture, and symbolism despite being outside political borders since 1921. The mountain appears on Armenia's coat of arms, currency, literature, poetry, music, and art. The phrase 'the pain of Ararat' captures Armenian longing for lost lands. Ararat represents Armenian Christianity (first Christian nation, 301 CE), resilience through genocides and occupations, and diaspora connection to homeland. Every major Armenian organization, institution, and business worldwide references Ararat. The mountain is simultaneously religious symbol (Noah's Ark), national icon, geological wonder, and metaphor for Armenian survival. Its visibility from Yerevan yet political inaccessibility creates profound cultural poignancy."
    }
  ],
  "relatedEntities": {
    "places": [
      {
        "id": "mount-sinai",
        "name": "Mount Sinai",
        "type": "place",
        "mythology": "abrahamic",
        "icon": "⛰️",
        "url": "/mythos/abrahamic/places/mount-sinai.html"
      },
      {
        "id": "jerusalem",
        "name": "Jerusalem",
        "type": "place",
        "mythology": "abrahamic",
        "icon": "🕌",
        "url": "/data/entities/place/jerusalem.json"
      }
    ],
    "archetypes": [
      {
        "id": "sacred-mountain",
        "name": "Sacred Mountain",
        "type": "archetype",
        "mythology": "universal",
        "icon": "⛰️",
        "url": "/shared/archetypes/sacred-mountain.html"
      },
      {
        "id": "axis-mundi",
        "name": "Axis Mundi",
        "type": "archetype",
        "mythology": "universal",
        "icon": "🌍",
        "url": "/shared/archetypes/axis-mundi.html"
      },
      {
        "id": "flood-myth",
        "name": "Great Flood",
        "type": "archetype",
        "mythology": "universal",
        "icon": "🌊",
        "url": "/shared/archetypes/flood-myth.html"
      }
    ]
  },
  "sources": [
    {
      "text": "The Genesis Flood",
      "author": "John C. Whitcomb & Henry M. Morris",
      "passage": "Young-earth creationist interpretation of flood geology and Ararat",
      "mythology": "christian"
    },
    {
      "text": "Noah's Ark: A Feasibility Study",
      "author": "John Woodmorappe",
      "passage": "Analysis of ark logistics and Ararat expeditions",
      "mythology": "christian"
    },
    {
      "text": "The Quest for Noah's Ark",
      "author": "Tim LaHaye & John Morris",
      "passage": "Documentation of modern Ararat expeditions and claimed discoveries",
      "mythology": "christian"
    },
    {
      "text": "Mount Ararat and Armenian Identity",
      "author": "Robert H. Hewsen",
      "passage": "Scholarly analysis of Ararat's role in Armenian culture and nationalism",
      "mythology": "armenian"
    },
    {
      "text": "The Flood Myth",
      "author": "Alan Dundes (ed.)",
      "passage": "Comparative mythology of flood narratives across cultures",
      "mythology": "universal"
    },
    {
      "text": "Sacred Geography of the Ancient Armenians",
      "author": "Hrach Martirosyan",
      "passage": "Pre-Christian and Christian sacred geography centered on Ararat",
      "mythology": "armenian"
    },
    {
      "text": "Geology and Geomorphology of Mount Ararat",
      "author": "Turkish Geological Survey",
      "passage": "Scientific analysis of volcanic structure and seismic activity",
      "mythology": "scientific"
    },
    {
      "text": "The Gilgamesh Epic and Old Testament Parallels",
      "author": "Alexander Heidel",
      "passage": "Comparison of biblical flood narrative with Mesopotamian sources",
      "mythology": "comparative"
    }
  ],
  "linguistic": {
    "originalName": "Ararat / Masis",
    "originalScript": "אררט (Hebrew), Մասիս (Armenian), Ağrı Dağı (Turkish)",
    "transliteration": "Ararat (Hebrew), Masis (Armenian), Agri Dagi (Turkish)",
    "pronunciation": "AR-uh-rat (English), mah-SEES (Armenian), ah-ree dah-uh (Turkish)",
    "etymology": {
      "origin": "The name 'Ararat' derives from Hebrew אֲרָרָט (Ararat) in Genesis 8:4, which itself comes from Assyrian 'Urartu'—the name of the ancient kingdom (9th-6th c. BCE) that encompassed the region. Urartu may derive from Assyrian 'Uruatri' meaning 'land of mountains.' Armenian name 'Masis' (Մասիս) is of uncertain etymology, possibly from Indo-European root *maz- ('great, big') or named after legendary king Amasya. Turkish name 'Ağrı Dağı' means 'Mountain of Pain/Suffering,' possibly referencing harsh climbing conditions or local legends.",
      "development": "Urartu (Assyrian, 9th c. BCE) → Ararat (Biblical Hebrew, c. 6th c. BCE) → Masis (Armenian, ancient) → Ağrı Dağı (Turkish, Ottoman period) → Modern names coexist: Ararat (international), Masis (Armenian), Ağrı Dağı (Turkish official)",
      "protoIndoEuropean": "Possibly *maz- ('great') for Armenian 'Masis'; Ararat is Semitic/Hurrian origin",
      "historicalForms": [
        {
          "period": "Assyrian",
          "form": "Urartu / Uruatri",
          "script": "Cuneiform",
          "date": "9th-6th century BCE"
        },
        {
          "period": "Biblical Hebrew",
          "form": "אֲרָרָט (Ararat)",
          "script": "Hebrew",
          "date": "6th century BCE - present"
        },
        {
          "period": "Classical Armenian",
          "form": "Մասիս (Masis)",
          "script": "Armenian",
          "date": "Ancient - present"
        },
        {
          "period": "Ottoman Turkish",
          "form": "Ağrı Dağı",
          "script": "Arabic/Latin",
          "date": "Medieval - present"
        }
      ]
    },
    "cognates": [
      {
        "language": "Hebrew",
        "term": "אֲרָרָט (Ararat)",
        "meaning": "Mountains of Ararat"
      },
      {
        "language": "Armenian",
        "term": "Մասիս (Masis)",
        "meaning": "Great Mountain / Mother Mountain"
      },
      {
        "language": "Turkish",
        "term": "Ağrı Dağı",
        "meaning": "Mountain of Pain"
      },
      {
        "language": "Assyrian",
        "term": "Urartu",
        "meaning": "Land of Mountains / Ancient kingdom name"
      },
      {
        "language": "Arabic",
        "term": "جبل أرارات (Jabal Ararat)",
        "meaning": "Mount Ararat"
      }
    ]
  },
  "geographical": {
    "region": "Eastern Anatolia / Armenian Highlands",
    "culturalArea": "Ancient Urartu / Historic Armenia / Modern Turkey",
    "originPoint": {
      "name": "Greater Ararat Peak, Iğdır Province, Turkey",
      "coordinates": {
        "latitude": 39.7025,
        "longitude": 44.2979,
        "accuracy": "±500m (mountain peak)"
      },
      "description": "Mount Ararat consists of two volcanic cones: Greater Ararat (5,137 m / 16,854 ft elevation) and Lesser Ararat (3,896 m / 12,782 ft). Located in far eastern Turkey, 16 km south of Armenian border, 32 km from Iranian border. Dormant stratovolcano, last eruption 1840. Permanent ice cap above 4,000m. Visible from Yerevan, Armenia (60 km away). Military restricted zone requiring special permits."
    }
  },
  "temporal": {
    "firstAttestation": {
      "date": {
        "year": -800,
        "circa": true,
        "uncertainty": 100,
        "display": "c. 9th-8th century BCE",
        "confidence": "textual-historical"
      },
      "type": "historical",
      "description": "Earliest attestation as 'Urartu' in Assyrian records (9th-8th c. BCE) referring to the kingdom in the region. Biblical reference to 'mountains of Ararat' appears in Genesis 8:4, traditionally dated to 6th century BCE in final written form, though oral traditions much older.",
      "source": "Assyrian cuneiform inscriptions; Hebrew Bible (Torah)"
    },
    "historicalDate": {
      "start": {
        "year": -800,
        "circa": true,
        "uncertainty": 100,
        "display": "c. 9th century BCE"
      },
      "end": {
        "year": 2025,
        "circa": false,
        "display": "Present"
      },
      "display": "c. 9th century BCE - Present (continuous sacred significance)"
    },
    "timelinePosition": {
      "period": "Biblical Period to Present",
      "specificDate": {
        "year": -2350,
        "circa": true,
        "display": "c. 2350 BCE (traditional flood date)"
      },
      "era": "Bronze Age mythology to modern pilgrimage",
      "context": "Mount Ararat has been venerated for over 3,000 years. Biblical chronology places Noah's flood at c. 2350 BCE, though this is theological rather than geological dating. Geological evidence shows the mountain is a Pliocene-Quaternary volcano (5-2 million years old) with most recent major activity around 10,000 years ago and last eruption in 1840 CE.",
      "keyMoments": [
        {
          "date": {
            "year": -2350,
            "circa": true,
            "display": "c. 2350 BCE"
          },
          "event": "Noah's Flood (biblical chronology)",
          "significance": "Traditional date for Great Flood and Ark landing on Ararat"
        },
        {
          "date": {
            "year": -800,
            "circa": true,
            "display": "c. 9th-6th century BCE"
          },
          "event": "Kingdom of Urartu",
          "significance": "Region named in Assyrian records; later biblical references to 'mountains of Ararat'"
        },
        {
          "date": {
            "year": 301,
            "display": "301 CE"
          },
          "event": "Armenian Christianity adopted",
          "significance": "Armenia becomes first Christian nation; Ararat integrated into Christian Armenian identity"
        },
        {
          "date": {
            "year": 350,
            "circa": true,
            "display": "4th century CE"
          },
          "event": "St. Jacob of Nisibis tradition",
          "significance": "Armenian saint receives Ark wood fragment; establishes Christian pilgrimage tradition"
        },
        {
          "date": {
            "year": 1829,
            "display": "September 1829"
          },
          "event": "First documented ascent",
          "significance": "Friedrich Parrot and Khachatur Abovian reach summit, beginning modern mountaineering era"
        },
        {
          "date": {
            "year": 1840,
            "display": "July 2, 1840"
          },
          "event": "Last volcanic eruption",
          "significance": "Major earthquake and eruption destroy Ahora village and St. Jacob monastery on slopes"
        },
        {
          "date": {
            "year": 1921,
            "display": "1921"
          },
          "event": "Treaty of Kars",
          "significance": "Ararat placed within Turkish borders, separated from Armenia; becomes symbol of Armenian loss"
        },
        {
          "date": {
            "year": 1955,
            "display": "1955"
          },
          "event": "Navarra Ark wood discovery",
          "significance": "French explorer Fernand Navarra claims wood samples from glacier; carbon dating controversial"
        },
        {
          "date": {
            "year": 2000,
            "circa": true,
            "display": "Modern era"
          },
          "event": "Ongoing Ark expeditions",
          "significance": "Satellite imagery of 'Ararat Anomaly' fuels continued searches; Turkish military restricts access"
        }
      ]
    }
  }
}
