{
  "id": "parthenon",
  "type": "place",
  "name": "Parthenon",
  "icon": "🏛️",
  "slug": "parthenon",
  "mythologies": [
    "greek"
  ],
  "primaryMythology": "greek",
  "shortDescription": "The temple of Athena Parthenos atop the Acropolis of Athens—the architectural masterpiece of Classical Greece and enduring symbol of democracy, philosophy, and Western civilization",
  "fullDescription": "The Parthenon stands as the supreme achievement of Classical Greek architecture and one of the most influential buildings in Western history. Built between 447 and 432 BCE on the Acropolis of Athens under the leadership of Pericles, this Doric temple was dedicated to Athena Parthenos (Athena the Virgin), patron goddess of Athens who granted the city her protection and wisdom. The temple replaced an earlier structure destroyed by the Persians in 480 BCE, and its construction symbolized Athens's rise as the dominant power of the Greek world and the center of art, philosophy, and democratic ideals. Designed by architects Ictinus and Callicrates, with sculptor Phidias overseeing the artistic program, the Parthenon achieved unprecedented refinement through subtle optical corrections—columns that lean inward, a floor that curves upward, and columns of varying diameter—creating an illusion of perfect proportion that defies simple geometry. The temple originally housed Phidias's colossal chryselephantine (gold and ivory) statue of Athena Parthenos, standing approximately 12 meters tall, depicting the goddess in full armor with Nike (Victory) in her hand and a shield at her side. The building was adorned with elaborate sculptural programs: the frieze depicting the Panathenaic procession, metopes showing mythological battles (Greeks vs. Amazons, Lapiths vs. Centaurs, Olympians vs. Giants, Greeks vs. Trojans), and pediments portraying the birth of Athena and her contest with Poseidon for Athens. Over its 2,500-year history, the Parthenon has served as Greek temple, Christian church (Church of the Parthenos Maria, 6th century CE), mosque (1460s-1687), ammunition depot (exploded in 1687), and archaeological site. Despite damage from explosion, looting (notably Lord Elgin's removal of sculptures in 1801-1812), and weathering, the Parthenon remains the defining symbol of ancient Greek civilization and its contributions to Western culture: democracy, rational inquiry, aesthetic perfection, and the humanistic vision that humans could achieve greatness through reason, skill, and civic virtue.",
  "category": "temple",
  "subCategory": "classical-temple",
  "colors": {
    "primary": "#F5DEB3",
    "secondary": "#4169E1",
    "primaryRgb": "245, 222, 179"
  },
  "tags": [
    "parthenon",
    "athena",
    "acropolis",
    "athens",
    "classical-greece",
    "pericles",
    "phidias",
    "doric-temple",
    "greek-architecture",
    "democracy",
    "philosophy",
    "elgin-marbles",
    "panathenaic-procession",
    "golden-age",
    "western-civilization",
    "unesco-world-heritage"
  ],
  "geography": {
    "realm": "Earth / Classical Greek Temple",
    "location": "Acropolis of Athens, Athens, Greece",
    "coordinates": {
      "lat": 37.9715,
      "lng": 23.7267
    },
    "accessibility": "public"
  },
  "metaphysicalProperties": {
    "element": "earth-air",
    "energyType": "wisdom-civilization",
    "planet": "earth"
  },
  "inhabitants": [
    {
      "id": "athena",
      "name": "Athena Parthenos",
      "type": "deity",
      "mythology": "greek",
      "icon": "🦉",
      "description": "Virgin goddess of wisdom, warfare, and crafts; patron deity of Athens; her colossal statue stood within the temple"
    },
    {
      "id": "nike",
      "name": "Nike",
      "type": "deity",
      "mythology": "greek",
      "icon": "🕊️",
      "description": "Goddess of victory, held in the hand of Athena's statue, symbolizing Athens's military triumphs"
    }
  ],
  "events": [
    {
      "name": "Persian Destruction of Old Temple (480 BCE)",
      "description": "Persian forces under Xerxes sacked Athens and destroyed the Old Parthenon and other Acropolis buildings during the Greco-Persian Wars",
      "participants": []
    },
    {
      "name": "Construction Begins (447 BCE)",
      "description": "Under Pericles's leadership, Athens began construction of the new Parthenon using funds from the Delian League treasury, employing thousands of workers and craftsmen",
      "participants": [
        {
          "id": "pericles",
          "name": "Pericles",
          "type": "statesman"
        },
        {
          "id": "phidias",
          "name": "Phidias",
          "type": "sculptor"
        }
      ]
    },
    {
      "name": "Dedication of Temple (432 BCE)",
      "description": "The Parthenon was completed and dedicated to Athena during the Great Panathenaia festival, with Phidias's chryselephantine statue of Athena unveiled",
      "participants": [
        {
          "id": "pericles",
          "name": "Pericles",
          "type": "statesman"
        }
      ]
    },
    {
      "name": "Conversion to Christian Church (6th century CE)",
      "description": "The Parthenon was converted into a Christian church dedicated to the Virgin Mary (Parthenos Maria), with interior altered and Christian iconography added",
      "participants": []
    },
    {
      "name": "Conversion to Mosque (1460s)",
      "description": "Following Ottoman conquest of Athens, the Parthenon was converted into a mosque, with minaret added to southwest corner",
      "participants": []
    },
    {
      "name": "Explosion and Major Damage (September 26, 1687)",
      "description": "Venetian artillery struck the Parthenon during siege of Athens, igniting Ottoman ammunition stored inside. The resulting explosion destroyed the center of the building, killing 300 people",
      "participants": []
    },
    {
      "name": "Elgin's Removal of Sculptures (1801-1812)",
      "description": "Thomas Bruce, 7th Earl of Elgin, removed approximately half of the surviving sculptures from the Parthenon and shipped them to Britain (now in British Museum)",
      "participants": []
    },
    {
      "name": "Greek Independence and Restoration Begins (1832-present)",
      "description": "Following Greek independence, the Parthenon became a national symbol. Ongoing restoration efforts attempt to preserve and partially reconstruct the temple",
      "participants": []
    },
    {
      "name": "UNESCO World Heritage Designation (1987)",
      "description": "The Acropolis of Athens, including the Parthenon, was designated a UNESCO World Heritage Site",
      "participants": []
    }
  ],
  "mythologyContexts": [
    {
      "mythology": "greek",
      "usage": "Temple of Athena Parthenos; site of Panathenaic festival; civic and religious center of Athens; treasury; symbol of Athenian power and cultural achievement",
      "names": [
        "Parthenon (Παρθενών - Chamber of the Virgin)",
        "Temple of Athena Parthenos",
        "Naos (Inner Sanctuary)"
      ],
      "associatedDeities": [
        {
          "id": "athena",
          "name": "Athena Parthenos",
          "type": "deity",
          "mythology": "greek",
          "icon": "🦉"
        },
        {
          "id": "zeus",
          "name": "Zeus",
          "type": "deity",
          "mythology": "greek",
          "icon": "⚡"
        },
        {
          "id": "poseidon",
          "name": "Poseidon",
          "type": "deity",
          "mythology": "greek",
          "icon": "🔱"
        }
      ],
      "textReferences": [
        {
          "text": "Description of Greece",
          "passage": "Pausanias, Book 1.24",
          "context": "2nd century CE travel writer describes the Parthenon, Athena statue, and Acropolis monuments in detail",
          "corpusUrl": "/mythos/greek/corpus-search.html?term=pausanias+parthenon"
        },
        {
          "text": "Funeral Oration",
          "passage": "Thucydides, History of the Peloponnesian War 2.35-46",
          "context": "Pericles's famous speech celebrating Athenian democracy and values embodied in monuments like the Parthenon",
          "corpusUrl": "/mythos/greek/corpus-search.html?term=pericles+funeral+oration"
        },
        {
          "text": "Against the Sophists",
          "passage": "Plutarch, Life of Pericles 12-14",
          "context": "Account of Parthenon construction, Phidias's works, and political controversies surrounding the building program",
          "corpusUrl": "/mythos/greek/corpus-search.html?term=plutarch+pericles+parthenon"
        }
      ],
      "symbolism": "The Parthenon symbolizes the pinnacle of Classical Greek civilization and Athenian achievement during its Golden Age. Dedicated to Athena Parthenos, the temple embodies the goddess's attributes: wisdom (philosophy and learning), strategic warfare (military power), and skilled craftsmanship (artistic excellence). The architectural refinements represent Greek pursuit of perfect proportion and harmony—the mathematical and aesthetic expression of cosmic order (kosmos). The sculptural program celebrates Athenian identity: the Panathenaic frieze shows the unity of citizens in honoring their patron goddess; the metopes depict civilization's triumph over barbarism and chaos; the pediments portray divine narratives establishing Athens's special relationship with Athena. The Parthenon served as civic temple, treasury, and symbol of democracy—the collective achievement of free citizens working toward common purpose. The building represents the Greek conviction that human reason, skill, and virtue could create works approaching divine perfection.",
      "culturalSignificance": "The Parthenon was the religious and civic heart of Classical Athens, housing the city's sacred treasury and serving as the focal point of the Great Panathenaia festival (held every four years). The festival included athletic competitions, musical contests, and a grand procession bringing a new peplos (robe) to dress Athena's olive-wood statue in the nearby Erechtheion. The Parthenon's construction employed thousands of Athenian citizens and metics (resident foreigners), distributing Delian League wealth throughout the city and creating unprecedented sculptural and architectural innovation. The building established architectural principles that influenced Western architecture for 2,500 years. Today, the Parthenon is Greece's supreme national symbol, representing ancient cultural achievement, democracy's birthplace, and continuity between ancient and modern Hellenism. The ongoing dispute over the Parthenon Sculptures (Elgin Marbles) reflects tensions between universal cultural heritage and national patrimony."
    }
  ],
  "relatedEntities": {
    "places": [
      {
        "id": "delphi",
        "name": "Delphi",
        "type": "place",
        "mythology": "greek",
        "icon": "🏛️",
        "url": "/mythos/greek/places/delphi.html"
      },
      {
        "id": "olympia",
        "name": "Olympia",
        "type": "place",
        "mythology": "greek",
        "icon": "🏛️",
        "url": "/mythos/greek/places/olympia.html"
      },
      {
        "id": "athens-agora",
        "name": "Ancient Agora of Athens",
        "type": "place",
        "mythology": "greek",
        "icon": "🏛️",
        "url": "/mythos/greek/places/agora.html"
      }
    ],
    "archetypes": [
      {
        "id": "sacred-temple",
        "name": "Sacred Temple",
        "type": "archetype",
        "mythology": "universal",
        "icon": "🏛️",
        "url": "/shared/archetypes/temple.html"
      },
      {
        "id": "golden-age",
        "name": "Golden Age",
        "type": "archetype",
        "mythology": "universal",
        "icon": "✨",
        "url": "/shared/archetypes/golden-age.html"
      },
      {
        "id": "divine-order",
        "name": "Divine Order (Kosmos)",
        "type": "archetype",
        "mythology": "universal",
        "icon": "🌌",
        "url": "/shared/archetypes/cosmic-order.html"
      }
    ]
  },
  "sources": [
    {
      "text": "The Parthenon",
      "author": "Mary Beard",
      "passage": "Comprehensive cultural biography of the Parthenon from construction to modern controversies",
      "mythology": "greek"
    },
    {
      "text": "The Parthenon and Its Sculptures",
      "author": "Ian Jenkins",
      "passage": "Detailed analysis of sculptural program and artistic achievement",
      "mythology": "greek"
    },
    {
      "text": "Pericles of Athens and the Birth of Democracy",
      "author": "Donald Kagan",
      "passage": "Historical context of Parthenon construction within Periclean Athens",
      "mythology": "greek"
    },
    {
      "text": "The Athenian Acropolis: History, Mythology, and Archaeology",
      "author": "Jeffrey M. Hurwit",
      "passage": "Scholarly examination of Acropolis development including the Parthenon",
      "mythology": "greek"
    },
    {
      "text": "Athena and the Parthenon",
      "author": "Jenifer Neils (ed.)",
      "passage": "Essays on religious, political, and artistic dimensions of the Parthenon",
      "mythology": "greek"
    },
    {
      "text": "The Elgin Marbles: Should They Be Returned to Greece?",
      "author": "Christopher Hitchens",
      "passage": "Examination of the Parthenon Sculptures controversy and cultural heritage debates",
      "mythology": "greek"
    },
    {
      "text": "Greek Architecture",
      "author": "A.W. Lawrence (revised R.A. Tomlinson)",
      "passage": "Technical analysis of Parthenon's architectural innovations and optical refinements",
      "mythology": "greek"
    },
    {
      "text": "Pausanias's Description of Greece",
      "author": "Pausanias (trans. W.H.S. Jones)",
      "passage": "Ancient eyewitness account of Parthenon and Acropolis monuments",
      "mythology": "greek"
    }
  ],
  "linguistic": {
    "originalName": "Parthenon",
    "originalScript": "Παρθενών (Greek)",
    "transliteration": "Parthenon",
    "pronunciation": "PAR-theh-non (English), par-the-NON (Greek)",
    "etymology": {
      "origin": "Greek Παρθενών (Parthenōn) derives from παρθένος (parthenos) meaning 'virgin, maiden,' specifically referring to Athena's epithet Parthenos (the Virgin). The suffix -ών (-ōn) indicates a place or chamber. Thus Parthenon means 'Chamber/Apartment of the Virgin' or 'Virgin's Chamber.' The term originally referred to the western room of the temple (the treasury chamber) but came to designate the entire building. The epithet 'Parthenos' emphasizes Athena's virginity and perpetual maidenhood, distinguishing her from other female deities and symbolizing her independence, purity, and dedication to wisdom and warfare rather than marriage and childbearing.",
      "development": "Greek παρθένος (parthenos, 'virgin') → Παρθενών (Parthenōn, 'virgin's chamber') → Originally western treasury room → Extended to entire temple → Latin Parthenon → Modern languages preserve Greek form",
      "protoIndoEuropean": "*pr̥th₂enwós ('maiden, virgin') → Greek παρθένος (parthenos)",
      "historicalForms": [
        {
          "period": "Classical Greek",
          "form": "Παρθενών (Parthenōn)",
          "script": "Greek",
          "date": "5th century BCE - present"
        },
        {
          "period": "Latin",
          "form": "Parthenon",
          "script": "Latin",
          "date": "Roman period"
        },
        {
          "period": "Byzantine Greek",
          "form": "Παρθενών / Church of Parthenos Maria",
          "script": "Greek",
          "date": "6th-15th century CE"
        }
      ]
    },
    "cognates": [
      {
        "language": "Ancient Greek",
        "term": "παρθένος (parthenos)",
        "meaning": "Virgin, maiden"
      },
      {
        "language": "Ancient Greek",
        "term": "Παρθενών (Parthenōn)",
        "meaning": "Chamber of the Virgin"
      },
      {
        "language": "Latin",
        "term": "Parthenon",
        "meaning": "Temple of Athena (borrowed from Greek)"
      },
      {
        "language": "English",
        "term": "Parthenogenesis",
        "meaning": "Virgin birth / reproduction without fertilization (from parthenos)"
      }
    ]
  },
  "geographical": {
    "region": "Attica, Central Greece",
    "culturalArea": "Classical Athens / Ancient Greece",
    "originPoint": {
      "name": "Parthenon, Acropolis of Athens, Athens, Greece",
      "coordinates": {
        "latitude": 37.9715,
        "longitude": 23.7267,
        "accuracy": "±50m (temple structure)"
      },
      "description": "The Parthenon stands atop the Acropolis of Athens at approximately 156 meters above sea level, dominating the ancient and modern city. The temple measures 69.5 × 30.9 meters at its base with 46 Doric columns. Located on the southern summit of the Acropolis, it is the largest building on the sacred rock and is visible from throughout Athens and the surrounding Attic plain. The Acropolis itself is a flat-topped limestone outcrop rising 150 meters above the city."
    }
  },
  "temporal": {
    "firstAttestation": {
      "date": {
        "year": -447,
        "circa": false,
        "display": "447 BCE",
        "confidence": "historical"
      },
      "type": "historical",
      "description": "Construction of the Parthenon began in 447 BCE under Pericles's building program. The temple was substantially completed by 438 BCE, with final sculptural decoration finished in 432 BCE. Ancient sources including Thucydides, Plutarch, and building inscriptions document the construction dates.",
      "source": "Ancient historians (Thucydides, Plutarch); Athenian building inscriptions; archaeological evidence"
    },
    "historicalDate": {
      "start": {
        "year": -447,
        "circa": false,
        "display": "447 BCE"
      },
      "end": {
        "year": -432,
        "circa": false,
        "display": "432 BCE"
      },
      "display": "447-432 BCE (construction period); continuous existence to present"
    },
    "timelinePosition": {
      "period": "Classical Period / Athenian Golden Age",
      "specificDate": {
        "year": -438,
        "circa": false,
        "display": "438 BCE"
      },
      "era": "Peak of Athenian power and cultural achievement under Pericles",
      "context": "The Parthenon was constructed during Athens's Golden Age (480-404 BCE), following victory in the Persian Wars and during the height of Athenian imperial power as leader of the Delian League. The temple represents the cultural, political, and economic zenith of Classical Greece before the destructive Peloponnesian War (431-404 BCE).",
      "keyMoments": [
        {
          "date": {
            "year": -480,
            "display": "480 BCE"
          },
          "event": "Persian destruction of Old Parthenon",
          "significance": "Persians sack Athens, destroy earlier temple; establishes need for rebuilding"
        },
        {
          "date": {
            "year": -447,
            "display": "447 BCE"
          },
          "event": "Construction begins",
          "significance": "Pericles initiates building program; Ictinus and Callicrates architects, Phidias sculptor"
        },
        {
          "date": {
            "year": -438,
            "display": "438 BCE"
          },
          "event": "Temple dedication",
          "significance": "Main building completed, Athena Parthenos statue unveiled during Panathenaia"
        },
        {
          "date": {
            "year": -432,
            "display": "432 BCE"
          },
          "event": "Sculptural program completed",
          "significance": "Final decorative elements finished; temple reaches full completion"
        },
        {
          "date": {
            "year": 426,
            "circa": true,
            "display": "5th-6th century CE"
          },
          "event": "Conversion to Christian church",
          "significance": "Becomes Church of Parthenos Maria (Virgin Mary); interior modified"
        },
        {
          "date": {
            "year": 1460,
            "circa": true,
            "display": "1460s"
          },
          "event": "Conversion to mosque",
          "significance": "Ottoman conquest; minaret added, Christian frescoes whitewashed"
        },
        {
          "date": {
            "year": 1687,
            "display": "September 26, 1687"
          },
          "event": "Venetian bombardment and explosion",
          "significance": "Center of temple destroyed when ammunition depot explodes; greatest damage in history"
        },
        {
          "date": {
            "year": 1806,
            "display": "1801-1812"
          },
          "event": "Elgin's removal of sculptures",
          "significance": "Approximately half of surviving sculptures removed to Britain (now British Museum)"
        },
        {
          "date": {
            "year": 1832,
            "display": "1832"
          },
          "event": "Greek independence",
          "significance": "Parthenon becomes national symbol; restoration efforts begin"
        },
        {
          "date": {
            "year": 1987,
            "display": "1987"
          },
          "event": "UNESCO World Heritage designation",
          "significance": "Acropolis recognized as site of outstanding universal value"
        },
        {
          "date": {
            "year": 2009,
            "display": "2009"
          },
          "event": "New Acropolis Museum opens",
          "significance": "State-of-art museum displays Parthenon sculptures; Parthenon Gallery designed to receive Elgin Marbles if returned"
        }
      ]
    }
  }
}
