{
  "id": "pyramid-of-the-sun",
  "type": "place",
  "name": "Pyramid of the Sun",
  "icon": "☀️",
  "slug": "pyramid-of-the-sun",
  "mythologies": [
    "aztec",
    "mesoamerican"
  ],
  "primaryMythology": "mesoamerican",
  "shortDescription": "The monumental pyramid at Teotihuacan—third-largest pyramid in the world, built around 200 CE as a cosmic temple aligned with celestial phenomena and believed to house a sacred cave representing the origin of time and humanity",
  "fullDescription": "The Pyramid of the Sun (Spanish: Pirámide del Sol; Nahuatl name unknown) towers 75 meters (246 feet) above the ancient city of Teotihuacan in the Basin of Mexico, forming the third-largest pyramid in the world after Cholula and Giza. Built around 200 CE during Teotihuacan's zenith as Mesoamerica's largest and most influential city (population 100,000-200,000), this massive structure required approximately 3 million cubic meters of construction material and represents one of the supreme achievements of pre-Columbian American civilization. The pyramid's base measures 220 × 230 meters, and the structure originally stood even taller before the temple atop its summit was destroyed. The Teotihuacanos who built this monument remain mysterious—their ethnic identity, language, and political system are unknown, as they left no deciphered written records. By the time the Aztecs encountered Teotihuacan's ruins around 1400 CE, the city had been abandoned for 600 years, yet the Aztecs recognized it as a sacred site where, according to their cosmology, the gods gathered to create the Fifth Sun (current cosmic era) through sacrifice. Archaeological discoveries have revealed that the pyramid was constructed over a natural cave extending 100 meters beneath the structure—a cave modified with ritual chambers and ending in a four-lobed chamber resembling a flower. In Mesoamerican cosmology, caves represented the mouths of the earth, portals to the underworld (Xibalba), and places of origin (Chicomoztoc, 'Place of Seven Caves'). The cave beneath the Pyramid of the Sun likely served as a representation of the primordial place of creation, making the pyramid itself a cosmic mountain (altepetl) connecting the underworld, earthly plane, and celestial realm. The structure is precisely aligned 15.5° east of true north, orienting it to the point where the sun sets on August 12 and April 29—dates that divide the Mesoamerican 260-day ritual calendar into meaningful segments. This astronomical precision demonstrates sophisticated mathematical and observational knowledge. The pyramid sits on the Avenue of the Dead (Calzada de los Muertos), the main north-south axis of Teotihuacan, with the smaller Pyramid of the Moon to the north and the vast Ciudadela complex to the south. Though we may never know what the Teotihuacanos called this structure or precisely which deities they worshipped here, the Pyramid of the Sun endures as a testament to their cosmological vision, architectural genius, and the shared Mesoamerican conception of pyramids as sacred mountains mediating between cosmic realms.",
  "category": "pyramid",
  "subCategory": "mesoamerican-temple",
  "colors": {
    "primary": "#D2691E",
    "secondary": "#FFD700",
    "primaryRgb": "210, 105, 30"
  },
  "tags": [
    "pyramid-of-the-sun",
    "teotihuacan",
    "mesoamerican",
    "aztec",
    "mexico",
    "pyramid",
    "cave",
    "sacred-mountain",
    "avenue-of-the-dead",
    "fifth-sun",
    "cosmic-origin",
    "astronomical-alignment",
    "underworld",
    "cosmology"
  ],
  "geography": {
    "realm": "Earth / Cosmic Mountain of Creation",
    "location": "Teotihuacan Archaeological Zone, State of Mexico, Mexico (40 km NE of Mexico City)",
    "coordinates": {
      "lat": 19.6925,
      "lng": -98.8438
    },
    "accessibility": "public"
  },
  "metaphysicalProperties": {
    "element": "earth-fire-sun",
    "energyType": "cosmic-creation",
    "planet": "earth"
  },
  "inhabitants": [
    {
      "id": "sun-deity",
      "name": "Sun Deity (Teotihuacan)",
      "type": "deity",
      "mythology": "mesoamerican",
      "icon": "☀️",
      "description": "Unknown sun god worshipped by Teotihuacanos; later Aztecs associated pyramid with Fifth Sun creation myth"
    },
    {
      "id": "tonatiuh",
      "name": "Tonatiuh (Aztec Sun God)",
      "type": "deity",
      "mythology": "aztec",
      "icon": "☀️",
      "description": "Aztec sun god associated with the Fifth Sun; Aztecs believed Fifth Sun was created at Teotihuacan"
    },
    {
      "id": "great-goddess",
      "name": "Great Goddess of Teotihuacan",
      "type": "deity",
      "mythology": "mesoamerican",
      "icon": "🌺",
      "description": "Prominent deity depicted in Teotihuacan murals; possibly associated with water, fertility, earth, and the underworld"
    }
  ],
  "events": [
    {
      "name": "Construction of Pyramid (c. 200 CE)",
      "description": "Teotihuacanos constructed the Pyramid of the Sun over a sacred cave in a single building phase, establishing it as the city's primary ceremonial monument and cosmic center",
      "participants": []
    },
    {
      "name": "Teotihuacan's Peak (c. 200-550 CE)",
      "description": "During Teotihuacan's Classic period zenith, the pyramid served as focal point for rituals, processions, and ceremonies connecting rulers and people to cosmic forces",
      "participants": []
    },
    {
      "name": "Cave Ritual Chamber Use (c. 100-650 CE)",
      "description": "The cave beneath the pyramid was used for ritual activities, possibly including offerings, divination, and ceremonies invoking underworld powers and creation mythology",
      "participants": []
    },
    {
      "name": "Collapse and Abandonment of Teotihuacan (c. 550-650 CE)",
      "description": "Teotihuacan's central district, including the pyramid area, was deliberately burned and abandoned. The city's collapse remains mysterious—possibly internal uprising, resource depletion, or external invasion",
      "participants": []
    },
    {
      "name": "Aztec Pilgrimage and Myth-Making (c. 1400-1521 CE)",
      "description": "Aztecs made pilgrimages to abandoned Teotihuacan, incorporated it into their creation mythology as the birthplace of the Fifth Sun, and named the structures (Pyramid of Sun/Moon, Avenue of Dead)",
      "participants": []
    },
    {
      "name": "Spanish Colonial Period Awareness (1520s-1800s)",
      "description": "Spanish conquistadors and colonial authorities documented Teotihuacan's ruins; indigenous peoples continued reverence despite Christian suppression",
      "participants": []
    },
    {
      "name": "Archaeological Discovery of Cave (1971)",
      "description": "Archaeologist Jorge Ruffier discovered the cave system beneath the Pyramid of the Sun, revealing ritual chambers and providing crucial evidence for understanding the pyramid's sacred function",
      "participants": []
    },
    {
      "name": "Modern Archaeological Research and Tourism (1900s-present)",
      "description": "Systematic excavations revealed Teotihuacan's complexity. The site became UNESCO World Heritage (1987) and major tourist destination, though over-restoration in early 20th century added non-original features",
      "participants": []
    }
  ],
  "mythologyContexts": [
    {
      "mythology": "mesoamerican",
      "usage": "Cosmic mountain (altepetl) connecting underworld, earth, and sky; sacred cave representing place of origin; astronomical observatory aligned with solar phenomena; ritual center for unknown Teotihuacan religion",
      "names": [
        "Unknown Teotihuacan name (undeciphered)",
        "Tonatiuh Itzcuintli (Aztec speculation - 'House of the Sun')",
        "Pirámide del Sol (Spanish: Pyramid of the Sun)"
      ],
      "associatedDeities": [
        {
          "id": "sun-deity-teotihuacan",
          "name": "Teotihuacan Sun Deity",
          "type": "deity",
          "mythology": "mesoamerican",
          "icon": "☀️"
        },
        {
          "id": "great-goddess-teotihuacan",
          "name": "Great Goddess",
          "type": "deity",
          "mythology": "mesoamerican",
          "icon": "🌺"
        }
      ],
      "textReferences": [],
      "symbolism": "The Pyramid of the Sun embodies fundamental Mesoamerican cosmological principles shared across cultures (Olmec, Maya, Zapotec, Teotihuacan, Aztec). The pyramid represents the sacred mountain (altepetl)—the axis mundi connecting the nine levels of the underworld (Mictlan/Xibalba) below, the earthly plane, and the thirteen celestial levels above. The cave beneath the pyramid symbolizes the womb of the earth, the portal to the underworld, and the place of origin (Chicomoztoc in Aztec mythology). In Mesoamerican thought, caves were sources of water, fertility, ancestors, and the original emergence of humanity. The four-lobed chamber at the cave's terminus resembles a flower or the four-petaled symbol of the sun—suggesting this was conceptualized as the cosmic center, the navel of the earth. The pyramid's astronomical alignment demonstrates the Mesoamerican integration of timekeeping, cosmology, and ritual—the structure itself becomes a calendar in stone, marking sacred time through solar observation. The pyramid's position on the Avenue of the Dead creates a sacred landscape mapping celestial order onto terrestrial geography.",
      "culturalSignificance": "Though built by the mysterious Teotihuacanos (ethnic and linguistic identity unknown), the Pyramid of the Sun influenced all subsequent Mesoamerican civilizations. Teotihuacan at its peak (200-550 CE) was the largest city in the Americas and the sixth-largest in the world, with cultural influence extending from the Maya regions to Central Mexico. The city's grid plan, pyramid architecture, mural painting traditions, and likely religious concepts spread throughout Mesoamerica. When the Aztecs encountered Teotihuacan's ruins 800 years after abandonment, they recognized it as a place of cosmic significance, incorporating it into their own creation mythology and making pilgrimages to the site. The archaeological discovery of the cave beneath the pyramid confirmed indigenous oral traditions about sacred caves and validated the cosmological sophistication of pre-Columbian civilizations."
    },
    {
      "mythology": "aztec",
      "usage": "Sacred site where gods created the Fifth Sun (current cosmic era); pilgrimage destination; burial place of ancient lords; connection to Aztec creation mythology though pyramid built 1,200 years before Aztec Empire",
      "names": [
        "Tonatiuh Itzcuintli (speculated - 'House of the Sun')",
        "Teotihuacan ('Place Where Gods Were Born' in Nahuatl)"
      ],
      "associatedDeities": [
        {
          "id": "tonatiuh",
          "name": "Tonatiuh",
          "type": "deity",
          "mythology": "aztec",
          "icon": "☀️"
        },
        {
          "id": "nanahuatzin",
          "name": "Nanahuatzin",
          "type": "deity",
          "mythology": "aztec",
          "icon": "🔥"
        },
        {
          "id": "tecuciztecatl",
          "name": "Tecuciztecatl",
          "type": "deity",
          "mythology": "aztec",
          "icon": "🌙"
        }
      ],
      "textReferences": [
        {
          "text": "Florentine Codex",
          "passage": "Book 7, Chapter 2",
          "context": "Bernardino de Sahagún's account of Aztec informants describing Teotihuacan as birthplace of Fifth Sun through divine sacrifice",
          "corpusUrl": "/mythos/aztec/corpus-search.html?term=florentine+codex+teotihuacan"
        },
        {
          "text": "Leyenda de los Soles",
          "passage": "16th century Nahuatl manuscript",
          "context": "Aztec creation myth: gods gathered at Teotihuacan, Nanahuatzin sacrificed himself in fire to become Fifth Sun (Tonatiuh)",
          "corpusUrl": "/mythos/aztec/corpus-search.html?term=leyenda+soles"
        },
        {
          "text": "Historia de los Mexicanos por sus Pinturas",
          "passage": "16th century chronicle",
          "context": "Spanish colonial account of Aztec cosmology linking Teotihuacan to creation of sun and moon",
          "corpusUrl": "/mythos/aztec/corpus-search.html?term=historia+mexicanos"
        }
      ],
      "symbolism": "For the Aztecs, Teotihuacan was 'the place where gods were born' (teotl = god; hua = origin). According to Aztec cosmology, the universe had been created and destroyed four times, each iteration called a 'Sun.' After the Fourth Sun was destroyed by flood, the gods gathered at Teotihuacan in darkness to create the Fifth Sun (current era). Two gods, Nanahuatzin (humble and diseased) and Tecuciztecatl (proud and wealthy), were chosen to sacrifice themselves by leaping into a divine fire to become the sun and moon. Nanahuatzin bravely jumped first, becoming the sun (Tonatiuh), while the hesitant Tecuciztecatl became the lesser moon. But the sun remained motionless until the other gods sacrificed their blood to set it in motion—establishing the Aztec theological justification for human sacrifice to sustain the sun and prevent cosmic collapse. The Pyramid of the Sun thus represented the very place where the current cosmic era began through divine sacrifice, making it supremely sacred despite being built by unknown predecessors.",
      "culturalSignificance": "The Aztecs' reverence for Teotihuacan, despite the site's abandonment centuries before their rise, demonstrates cultural continuity and shared cosmology across Mesoamerican civilizations. Aztec rulers made pilgrimages to Teotihuacan, conducting rituals and possibly burying honored dead there. The Aztec names for the structures ('Pyramid of the Sun,' 'Pyramid of the Moon,' 'Avenue of the Dead') persist today, though they likely differ from original Teotihuacan names. The Aztec integration of Teotihuacan into their creation mythology shows how sacred sites accumulate meaning across generations, with later peoples incorporating ancient monuments into their own religious narratives."
    }
  ],
  "relatedEntities": {
    "places": [
      {
        "id": "pyramid-of-the-moon",
        "name": "Pyramid of the Moon, Teotihuacan",
        "type": "place",
        "mythology": "mesoamerican",
        "icon": "🌙",
        "url": "/mythos/mesoamerican/places/pyramid-moon.html"
      },
      {
        "id": "templo-mayor",
        "name": "Templo Mayor, Tenochtitlan",
        "type": "place",
        "mythology": "aztec",
        "icon": "⛰️",
        "url": "/mythos/aztec/places/templo-mayor.html"
      },
      {
        "id": "cholula-pyramid",
        "name": "Great Pyramid of Cholula",
        "type": "place",
        "mythology": "mesoamerican",
        "icon": "🏔️",
        "url": "/mythos/mesoamerican/places/cholula.html"
      }
    ],
    "archetypes": [
      {
        "id": "sacred-mountain",
        "name": "Sacred Mountain (Altepetl)",
        "type": "archetype",
        "mythology": "universal",
        "icon": "⛰️",
        "url": "/shared/archetypes/sacred-mountain.html"
      },
      {
        "id": "axis-mundi",
        "name": "Axis Mundi",
        "type": "archetype",
        "mythology": "universal",
        "icon": "🌍",
        "url": "/shared/archetypes/axis-mundi.html"
      },
      {
        "id": "cosmic-origin",
        "name": "Place of Origin",
        "type": "archetype",
        "mythology": "universal",
        "icon": "🌌",
        "url": "/shared/archetypes/cosmic-origin.html"
      },
      {
        "id": "sacred-cave",
        "name": "Sacred Cave",
        "type": "archetype",
        "mythology": "universal",
        "icon": "🕳️",
        "url": "/shared/archetypes/sacred-cave.html"
      }
    ]
  },
  "sources": [
    {
      "text": "Teotihuacan: An Experiment in Living",
      "author": "Esther Pasztory",
      "passage": "Comprehensive analysis of Teotihuacan culture, art, and architecture",
      "mythology": "mesoamerican"
    },
    {
      "text": "The Pyramid of the Sun at Teotihuacan: Its Construction and Meaning",
      "author": "Saburo Sugiyama",
      "passage": "Archaeological study of pyramid construction and cosmological significance",
      "mythology": "mesoamerican"
    },
    {
      "text": "The Cave Beneath the Pyramid of the Sun at Teotihuacan",
      "author": "Doris Heyden",
      "passage": "Analysis of 1971 cave discovery and its ritual significance",
      "mythology": "mesoamerican"
    },
    {
      "text": "Teotihuacan: City of Water, City of Fire",
      "author": "Matthew H. Robb (ed.)",
      "passage": "Multidisciplinary examination of Teotihuacan's urbanism and religion",
      "mythology": "mesoamerican"
    },
    {
      "text": "The Florentine Codex: General History of the Things of New Spain",
      "author": "Bernardino de Sahagún",
      "passage": "16th century Aztec accounts of Teotihuacan's cosmological significance",
      "mythology": "aztec"
    },
    {
      "text": "The Gods and Symbols of Ancient Mexico and the Maya",
      "author": "Mary Miller & Karl Taube",
      "passage": "Encyclopedia of Mesoamerican deities and iconography including Teotihuacan",
      "mythology": "mesoamerican"
    },
    {
      "text": "Astronomy and Empire in the Ancient Andes",
      "author": "Brian Bauer & David Dearborn",
      "passage": "Comparative study of astronomical alignments in pre-Columbian architecture (includes Teotihuacan parallels)",
      "mythology": "mesoamerican"
    },
    {
      "text": "Pyramids and Plaza Layouts at Teotihuacan",
      "author": "Rubén Cabrera Castro",
      "passage": "Archaeological documentation of Teotihuacan's monumental architecture",
      "mythology": "mesoamerican"
    }
  ],
  "linguistic": {
    "originalName": "Unknown (Teotihuacan language undeciphered)",
    "originalScript": "Unknown (Teotihuacan writing system not fully deciphered)",
    "transliteration": "N/A",
    "pronunciation": "N/A (original name unknown)",
    "etymology": {
      "origin": "The original Teotihuacan name for the Pyramid of the Sun is unknown. The Teotihuacanos' language and ethnic identity remain mysterious—possibly Totonac, Nahua, Otomi, or a now-extinct language. The modern name 'Pyramid of the Sun' (Pirámide del Sol) comes from the Aztecs who encountered the ruins around 1400 CE, centuries after abandonment. The Aztecs named the entire site 'Teotihuacan' (Nahuatl: Tēotihuahcān) meaning 'place where gods were born' or 'place of those who have the road of the gods,' from teotl (god/sacred) + hua (origin/possess) + can (place). The Spanish name 'Pirámide del Sol' translates the Aztec concept, though the specific Aztec name for this pyramid (as opposed to the site) is uncertain—possibly 'Tonatiuh Itzcuintli' (House of the Sun) though this is speculation. The name reflects Aztec cosmology rather than original Teotihuacan designation.",
      "development": "Unknown Teotihuacan name (undeciphered, c. 200 CE) → Aztec encounter and naming (c. 1400 CE): Teotihuacan site name + pyramid possibly called Tonatiuh Itzcuintli → Spanish colonial naming (1520s): Pirámide del Sol → English: Pyramid of the Sun",
      "protoIndoEuropean": "N/A (Uto-Aztecan/Mesoamerican languages, not Indo-European)",
      "historicalForms": [
        {
          "period": "Teotihuacan civilization",
          "form": "Unknown",
          "script": "Unknown/undeciphered",
          "date": "c. 200-650 CE"
        },
        {
          "period": "Aztec period",
          "form": "Speculated: Tonatiuh Itzcuintli (?) / Part of Teotihuacan",
          "script": "Nahuatl (oral/codices)",
          "date": "c. 1400-1521"
        },
        {
          "period": "Spanish colonial",
          "form": "Pirámide del Sol",
          "script": "Latin",
          "date": "1520s-present"
        }
      ]
    },
    "cognates": [
      {
        "language": "Nahuatl (Aztec)",
        "term": "Teōtl",
        "meaning": "God, sacred force, divine"
      },
      {
        "language": "Nahuatl",
        "term": "Tonatiuh",
        "meaning": "Sun (deity); 'He who goes forth shining'"
      },
      {
        "language": "Nahuatl",
        "term": "Teotihuacan (Tēotihuahcān)",
        "meaning": "Place where gods were born / Place of those who have the road of the gods"
      },
      {
        "language": "Spanish",
        "term": "Pirámide del Sol",
        "meaning": "Pyramid of the Sun"
      }
    ]
  },
  "geographical": {
    "region": "Basin of Mexico, Central Mexico",
    "culturalArea": "Mesoamerica / Central Mexican Highlands",
    "originPoint": {
      "name": "Pyramid of the Sun, Teotihuacan Archaeological Zone, State of Mexico",
      "coordinates": {
        "latitude": 19.6925,
        "longitude": -98.8438,
        "accuracy": "±100m (pyramid structure)"
      },
      "description": "The Pyramid of the Sun is located in the Teotihuacan Archaeological Zone, approximately 40 km northeast of Mexico City in the State of Mexico. The pyramid stands 75 meters (246 feet) tall with a base measuring approximately 220m × 230m (some sources: 225m × 225m). It occupies the eastern side of the Avenue of the Dead (Calzada de los Muertos), the main north-south ceremonial avenue. The structure is aligned 15.5° east of astronomical north, corresponding to sunset on August 12 and April 29. A cave system extends approximately 100 meters beneath the pyramid. Elevation: 2,300 meters above sea level."
    }
  },
  "temporal": {
    "firstAttestation": {
      "date": {
        "year": 200,
        "circa": true,
        "uncertainty": 50,
        "display": "c. 200 CE",
        "confidence": "archaeological"
      },
      "type": "archaeological",
      "description": "Archaeological dating indicates the Pyramid of the Sun was constructed around 200 CE (approximately 150-250 CE) during Teotihuacan's Tzacualli phase, in a single major building episode. Radiocarbon dating, ceramic analysis, and stratigraphic studies provide construction date estimates.",
      "source": "Archaeological excavations; radiocarbon dating; ceramic chronology; stratigraphic analysis"
    },
    "historicalDate": {
      "start": {
        "year": 200,
        "circa": true,
        "uncertainty": 50,
        "display": "c. 200 CE"
      },
      "end": {
        "year": 2025,
        "circa": false,
        "display": "Present"
      },
      "display": "c. 200 CE (construction) - Present (continuous structure)"
    },
    "timelinePosition": {
      "period": "Classic Mesoamerican Period / Teotihuacan Civilization",
      "specificDate": {
        "year": 200,
        "circa": true,
        "display": "c. 200 CE"
      },
      "era": "Peak of Teotihuacan urbanism and influence",
      "context": "The Pyramid of the Sun was constructed during Teotihuacan's rise as Mesoamerica's dominant city and cultural center. At its peak (200-550 CE), Teotihuacan covered 20 square kilometers with 100,000-200,000 inhabitants, making it the sixth-largest city in the world and the largest in the Americas.",
      "keyMoments": [
        {
          "date": {
            "year": -100,
            "circa": true,
            "display": "c. 100 BCE"
          },
          "event": "Foundation of Teotihuacan",
          "significance": "City founded; begins to consolidate population from Basin of Mexico"
        },
        {
          "date": {
            "year": 1,
            "circa": true,
            "display": "c. 1-150 CE"
          },
          "event": "Early monumental construction",
          "significance": "Pyramid of the Moon, Avenue of the Dead, Ciudadela complex built; city planning established"
        },
        {
          "date": {
            "year": 200,
            "circa": true,
            "display": "c. 200 CE"
          },
          "event": "Pyramid of the Sun constructed",
          "significance": "Massive pyramid built in single phase over sacred cave; establishes cosmic center"
        },
        {
          "date": {
            "year": 350,
            "circa": true,
            "display": "c. 200-550 CE"
          },
          "event": "Teotihuacan's zenith",
          "significance": "City reaches peak population and influence throughout Mesoamerica"
        },
        {
          "date": {
            "year": 550,
            "circa": true,
            "display": "c. 550-650 CE"
          },
          "event": "Collapse and abandonment",
          "significance": "Central ceremonial district burned; elite structures destroyed; city largely abandoned"
        },
        {
          "date": {
            "year": 900,
            "circa": true,
            "display": "c. 650-1400 CE"
          },
          "event": "Post-collapse period",
          "significance": "Small populations continue; site becomes pilgrimage destination for subsequent cultures"
        },
        {
          "date": {
            "year": 1400,
            "circa": true,
            "display": "c. 1400-1521"
          },
          "event": "Aztec sacred site",
          "significance": "Aztecs make pilgrimages, incorporate into creation mythology, name structures"
        },
        {
          "date": {
            "year": 1520,
            "display": "1520s"
          },
          "event": "Spanish conquest",
          "significance": "Conquistadors document ruins; indigenous reverence continues despite colonization"
        },
        {
          "date": {
            "year": 1905,
            "display": "1905-1910"
          },
          "event": "First restoration",
          "significance": "Leopoldo Batres conducts major excavation and controversial restoration for Mexican centennial"
        },
        {
          "date": {
            "year": 1971,
            "display": "1971"
          },
          "event": "Discovery of cave system",
          "significance": "Jorge Ruffier discovers 100-meter cave beneath pyramid; reveals ritual chambers and cosmological significance"
        },
        {
          "date": {
            "year": 1987,
            "display": "1987"
          },
          "event": "UNESCO World Heritage designation",
          "significance": "Teotihuacan recognized for outstanding universal value"
        },
        {
          "date": {
            "year": 2000,
            "circa": true,
            "display": "Modern era"
          },
          "event": "Ongoing research and tourism",
          "significance": "Site receives 4+ million annual visitors; continuous archaeological research reveals new discoveries"
        }
      ]
    }
  }
}