{
  "id": "apocryphal",
  "type": "mythology_page",
  "name": "Apocryphal Traditions",
  "icon": "📜",
  "tagline": "Hidden Texts and Forbidden Knowledge",
  "description": "Explore apocryphal and deuterocanonical texts excluded from mainstream biblical canons yet preserving ancient traditions.",
  "overview": "Apocryphal literature encompasses texts excluded from Protestant biblical canon but preserved in Catholic/Orthodox traditions, plus Jewish pseudepigrapha and Gnostic writings. These include: Books of Enoch describing fallen angels (Watchers), Nephilim giants, heavenly journeys, and apocalyptic visions; Book of Jubilees retelling Genesis with calendar emphasis; Tobit and Judith heroic narratives; Wisdom of Solomon; Maccabees historical books; and Gnostic gospels (Thomas, Mary, Philip). The texts preserve alternative perspectives on creation, angels, demons, afterlife, and divine wisdom often suppressed by orthodox authorities.",
  "culturalContext": {"period": "c. 300 BCE - 400 CE", "region": "Judea, Egypt, Syria", "language": "Hebrew, Aramaic, Greek, Coptic", "primarySources": "Dead Sea Scrolls, Nag Hammadi library, Septuagint"},
  "statistics": {"texts": 24, "angels": 12, "concepts": 18},
  "sections": [
    {"id": "browse-entities", "title": "Browse Apocryphal Content", "type": "category-grid", "categories": [
      {"type": "texts", "icon": "📜", "label": "Sacred Texts", "count": 24, "route": "#/browse/texts/apocryphal"},
      {"type": "deities", "icon": "👼", "label": "Angels & Watchers", "count": 12, "route": "#/browse/deities/apocryphal"}
    ]},
    {"id": "enoch", "title": "Books of Enoch", "type": "content", "body": "**1 Enoch:** Watchers (fallen angels) descend, teach forbidden knowledge, mate with human women producing Nephilim giants. Enoch journeys through heavens, receives cosmic revelations, witnesses divine judgment.\n\n**2 Enoch:** Additional heavenly journey describing ten heavens, creation secrets, astronomical knowledge.\n\n**3 Enoch (Hebrew Apocalypse):** Enoch transformed into angel Metatron, becomes scribe of heaven, reveals mystical Torah.\n\nEnochian literature influenced apocalyptic thought, angelology, and concepts of fallen angels."}
  ],
  "relatedMythologies": ["jewish", "christian", "gnostic"],
  "featured": false,
  "displayOrder": 21,
  "metadata": {"createdAt": "2025-12-28T00:00:00Z", "version": "1.0"}
}
