{
  "id": "comparative",
  "type": "mythology_page",
  "name": "Comparative Mythology",
  "icon": "🌍",
  "tagline": "Universal Patterns and Cross-Cultural Archetypes",
  "description": "Discover shared mythological patterns across cultures - flood myths, hero journeys, creation stories, and divine archetypes.",
  "overview": "Comparative mythology studies universal patterns, archetypes, and motifs appearing across diverse cultural mythologies. Scholars like Joseph Campbell, Carl Jung, and Mircea Eliade identified recurring themes: the Hero's Journey (monomyth) with departure-initiation-return structure; flood myths from Mesopotamia to Americas; dying and rising gods (Osiris, Jesus, Baldr); cosmic eggs and primordial chaos; world trees/axes connecting realms; trickster figures teaching through transgression; virgin births and miraculous conceptions; and apocalyptic world endings followed by renewal. These patterns suggest either: universal human psychology (Jungian archetypes), common ancestral origins (diffusion), or shared responses to human experience (functionalism).",
  "culturalContext": {"period": "Scholarly field, 19th century - Present", "region": "Global comparative analysis", "language": "Multiple academic languages", "primarySources": "Campbell's Hero with a Thousand Faces, Jung's archetypes, Eliade's comparative religion"},
  "statistics": {"patterns": 24, "archetypes": 18, "comparisons": 32},
  "sections": [
    {"id": "browse-entities", "title": "Browse Comparative Patterns", "type": "category-grid", "categories": [
      {"type": "archetypes", "icon": "🎭", "label": "Universal Archetypes", "count": 18, "route": "#/browse/archetypes"},
      {"type": "patterns", "icon": "🔄", "label": "Mythic Patterns", "count": 24, "route": "#/browse/patterns"}
    ]},
    {"id": "hero-journey", "title": "The Hero's Journey (Monomyth)", "type": "content", "body": "Joseph Campbell identified universal pattern in hero myths:\n\n**Departure:** Call to adventure, refusal, supernatural aid, crossing threshold\n**Initiation:** Road of trials, meeting goddess/temptress, atonement with father, apotheosis, ultimate boon\n**Return:** Refusal of return, magic flight, rescue, crossing return threshold, master of two worlds\n\nExamples: Gilgamesh, Odysseus, Buddha, Jesus, Osiris, Moses, Rama, hero myths globally.\n\nThe pattern maps psychological individuation - ego death and rebirth, integration of shadow, achieving wholeness."},
    {"id": "flood-myths", "title": "Universal Flood Myths", "type": "content", "body": "Flood narratives appear across cultures:\n\n**Mesopotamian:** Utnapishtim (Gilgamesh), Atrahasis - gods send flood, one man warned, builds ark, repopulates earth\n**Biblical:** Noah, Genesis 6-9 - God floods world for wickedness, Noah's ark saves animals/family\n**Hindu:** Manu warned by fish (Matsya avatar of Vishnu), survives flood\n**Greek:** Deucalion and Pyrrha survive Zeus's flood\n**Chinese:** Gun-Yu flood control myth\n**Native American:** Various tribes preserve flood stories\n\nPossible origins: ancestral memory of ice age flooding, common psychological symbol of destruction/renewal, or literary diffusion from Mesopotamia."}
  ],
  "relatedMythologies": ["all"],
  "featured": false,
  "displayOrder": 22,
  "metadata": {"createdAt": "2025-12-28T00:00:00Z", "version": "1.0"}
}
