{
  "id": "greek",
  "type": "mythology_page",
  "name": "Greek Mythology",
  "icon": "⚡",
  "tagline": "The Olympian Pantheon and Heroes of Ancient Greece",
  "description": "Explore the rich tapestry of Greek mythology, from the heights of Mount Olympus to the depths of Tartarus.",
  "overview": "Greek mythology forms one of the foundational pillars of Western civilization, encompassing the religious beliefs, rituals, and sacred narratives of ancient Greece. This vast mythological system includes the twelve Olympian gods led by Zeus, primordial deities who emerged from Chaos, the mighty Titans who ruled before the Olympians, legendary heroes who performed impossible feats, and fearsome creatures that tested mortal courage. The Greeks understood their gods as immortal beings with human-like personalities, desires, and flaws, living atop Mount Olympus and intervening constantly in human affairs. Their myths explored fundamental questions about creation, fate, mortality, justice, and the relationship between gods and humans through epic poetry, tragic drama, and sacred mystery cults.",
  "culturalContext": {
    "period": "c. 1200 BCE - 400 CE",
    "region": "Ancient Greece, Greek colonies throughout Mediterranean",
    "language": "Ancient Greek",
    "primarySources": "Homeric epics, Hesiod's Theogony, Homeric Hymns, Greek tragedies, Orphic texts"
  },
  "statistics": {
    "deities": 42,
    "heroes": 18,
    "creatures": 31,
    "places": 12,
    "items": 15,
    "myths": 24,
    "concepts": 8
  },
  "sections": [
    {
      "id": "browse-entities",
      "title": "Browse Greek Entities",
      "type": "category-grid",
      "description": "Explore the gods, heroes, and creatures of Greek mythology",
      "categories": [
        {
          "type": "deities",
          "icon": "⚡",
          "label": "Deities",
          "count": 42,
          "route": "#/browse/deities/greek",
          "description": "The Olympians, Titans, and primordial gods"
        },
        {
          "type": "heroes",
          "icon": "🦸",
          "label": "Heroes",
          "count": 18,
          "route": "#/browse/heroes/greek",
          "description": "Legendary mortals and demigods"
        },
        {
          "type": "creatures",
          "icon": "🐉",
          "label": "Creatures",
          "count": 31,
          "route": "#/browse/creatures/greek",
          "description": "Monsters, beasts, and mythical beings"
        },
        {
          "type": "places",
          "icon": "🏛️",
          "label": "Sacred Places",
          "count": 12,
          "route": "#/browse/places/greek",
          "description": "Mount Olympus, the Underworld, and divine realms"
        },
        {
          "type": "items",
          "icon": "⚔️",
          "label": "Sacred Items",
          "count": 15,
          "route": "#/browse/items/greek",
          "description": "Divine weapons and magical artifacts"
        },
        {
          "type": "concepts",
          "icon": "💭",
          "label": "Concepts",
          "count": 8,
          "route": "#/browse/concepts/greek",
          "description": "Philosophical and mystical ideas"
        }
      ]
    },
    {
      "id": "key-concepts",
      "title": "Key Concepts",
      "type": "content",
      "body": "The Greek pantheon operated on principles of divine hierarchy, fate (Moira), and cosmic balance. The Olympians ruled from Mount Olympus after overthrowing the Titans in the Titanomachy. Greek religion emphasized proper ritual sacrifice, hospitality (xenia), and maintaining good relationships with the gods through offerings and festivals. The concept of hubris (excessive pride) leading to divine punishment was central to Greek tragedy. The afterlife in Hades awaited all mortals, with judgment determining placement in Elysium, the Asphodel Meadows, or Tartarus. Mystery cults like the Eleusinian Mysteries offered initiates special knowledge about death and rebirth."
    },
    {
      "id": "olympian-pantheon",
      "title": "The Twelve Olympians",
      "type": "content",
      "body": "The principal deities dwelling atop Mount Olympus: Zeus (Sky King), Hera (Queen of Heaven), Poseidon (Sea), Athena (Wisdom), Apollo (Sun/Prophecy), Artemis (Hunt), Ares (War), Aphrodite (Love), Hephaestus (Forge), Hermes (Messenger), Demeter (Harvest), and Dionysus (Wine/Ecstasy). Though Hades ruled the Underworld as an equal brother to Zeus, he was not counted among the Twelve as he dwelt below rather than atop Olympus."
    },
    {
      "id": "creation-myth",
      "title": "Creation & Cosmogony",
      "type": "content",
      "body": "In the beginning was Chaos - the primordial void. From Chaos emerged Gaia (Earth), Tartarus (the Abyss), Eros (Love), Erebus (Darkness), and Nyx (Night). Gaia birthed Uranus (Sky), and together they produced the Titans, Cyclopes, and Hecatoncheires. Kronos, youngest Titan, overthrew Uranus but was himself overthrown by his son Zeus, who established the Olympian order. This succession myth reflects themes of generational conflict and the establishment of cosmic justice under Zeus's rule."
    },
    {
      "id": "hero-journey",
      "title": "The Age of Heroes",
      "type": "content",
      "body": "Greek mythology celebrates legendary heroes who performed superhuman feats: Heracles' Twelve Labors, Perseus' slaying of Medusa, Theseus' defeat of the Minotaur, Jason's quest for the Golden Fleece, and Odysseus' decade-long journey home. These heroes often had divine parentage, faced impossible challenges, and served as models of arete (excellence). The Trojan War brought together Greece's greatest heroes in an epic conflict that defined Greek cultural identity for centuries."
    },
    {
      "id": "mystery-traditions",
      "title": "Mystery Cults & Esoteric Wisdom",
      "type": "content",
      "body": "Beyond public religion, secret mystery cults offered initiates special knowledge about life, death, and the divine. The Eleusinian Mysteries honored Demeter and Persephone, promising initiates a blessed afterlife. Orphic mysteries taught that the soul was immortal and could achieve purification through ritual practice. Dionysian rites involved ecstatic communion with the god. These mystery traditions influenced later Western esotericism and early Christianity."
    },
    {
      "id": "sacred-texts",
      "title": "Primary Sources",
      "type": "list",
      "items": [
        "Homer's Iliad & Odyssey (c. 8th century BCE) - Epic poems of the Trojan War and Odysseus's journey",
        "Hesiod's Theogony (c. 700 BCE) - The genealogy of the gods and creation of the cosmos",
        "Hesiod's Works and Days (c. 700 BCE) - Agricultural wisdom and the Five Ages of Man",
        "Homeric Hymns (7th-6th century BCE) - Sacred hymns to the Olympian deities",
        "Greek Tragedies (5th century BCE) - Works of Aeschylus, Sophocles, and Euripides",
        "Orphic Hymns (3rd century BCE - 2nd century CE) - Mystery tradition hymns",
        "Apollodorus's Bibliotheca (1st-2nd century CE) - Comprehensive mythological handbook",
        "Ovid's Metamorphoses (1st century CE) - Roman retelling of Greek myths"
      ]
    },
    {
      "id": "cross-cultural-parallels",
      "title": "Cross-Cultural Connections",
      "type": "parallels",
      "parallels": [
        {
          "mythology": "roman",
          "connection": "Direct correspondence - Roman gods adapted from Greek deities with Latin names",
          "strength": "primary"
        },
        {
          "mythology": "norse",
          "connection": "Shared Indo-European roots, similar pantheon structure (sky father, earth mother)",
          "strength": "secondary"
        },
        {
          "mythology": "hindu",
          "connection": "Indo-European mythology parallels - divine succession myths, heroic epics",
          "strength": "secondary"
        },
        {
          "mythology": "egyptian",
          "connection": "Mystery cult influences, underworld journey parallels",
          "strength": "tertiary"
        }
      ]
    },
    {
      "id": "magical-practices",
      "title": "Magic & Ritual",
      "type": "content",
      "body": "Greek magic (mageia) encompassed divination, curse tablets (defixiones), love spells, protective amulets, and necromancy. The Delphic Oracle channeled Apollo's prophecies through the Pythia priestess. Orphic and Dionysian mystery rites used entheogens, music, and dance to achieve ecstatic states. Herbal magic (pharmakeia) employed plants sacred to various deities. Ritual sacrifice maintained relationships with the gods, while libations honored the dead."
    }
  ],
  "relatedMythologies": ["roman", "norse", "egyptian", "hindu", "celtic"],
  "featured": true,
  "displayOrder": 1,
  "metadata": {
    "createdAt": "2025-12-28T00:00:00Z",
    "updatedAt": "2025-12-28T00:00:00Z",
    "version": "1.0",
    "author": "EyesOfAzrael Content Team"
  }
}
