{
  "id": "hindu",
  "type": "mythology_page",
  "name": "Hindu Mythology",
  "icon": "icons/mythologies/hindu.svg",
  "tagline": "The Eternal Dharma and Divine Cycles",
  "description": "Explore the vast cosmos of Hindu mythology, where gods take endless forms and the universe dances through eternal cycles of creation and destruction.",
  "overview": "Hindu mythology (Sanatan Dharma - the Eternal Way) encompasses one of the world's oldest and most complex religious traditions, with roots stretching back over 4,000 years to the Vedic period. This rich mythological tapestry features the Trimurti (Brahma the Creator, Vishnu the Preserver, Shiva the Destroyer), countless devas and devis manifesting divine principles, epic narratives of the Ramayana and Mahabharata, the concept of avatar (divine incarnation), the cosmic dance of creation and destruction, karma and reincarnation across countless lifetimes, and paths of yoga leading to moksha (liberation). Unlike Western mythologies with definitive beginnings and endings, Hindu mythology operates in vast cosmic cycles (yugas and kalpas) where the universe is eternally born, sustained, destroyed, and reborn. The tradition embraces paradox, with the ultimate reality (Brahman) being both personal and impersonal, manifest and unmanifest, one and many.",
  "culturalContext": {
    "period": "c. 1500 BCE - Present (continuous living tradition)",
    "region": "Indian subcontinent (India, Nepal, Bali, SE Asia)",
    "language": "Sanskrit, regional Indian languages",
    "primarySources": "Vedas, Upanishads, Puranas, Ramayana, Mahabharata (including Bhagavad Gita), Tantras"
  },
  "statistics": {
    "deities": 33,
    "heroes": 12,
    "creatures": 15,
    "places": 8,
    "concepts": 24,
    "texts": 18
  },
  "sections": [
    {
      "id": "browse-entities",
      "title": "Browse Hindu Entities",
      "type": "category-grid",
      "description": "Explore the gods, heroes, and sacred concepts of Hindu mythology",
      "categories": [
        {
          "type": "deities",
          "icon": "🕉️",
          "label": "Deities",
          "count": 33,
          "route": "#/browse/deities/hindu",
          "description": "The Trimurti, devas, and divine manifestations"
        },
        {
          "type": "heroes",
          "icon": "🏹",
          "label": "Heroes & Avatars",
          "count": 12,
          "route": "#/browse/heroes/hindu",
          "description": "Rama, Krishna, Arjuna, and epic heroes"
        },
        {
          "type": "creatures",
          "icon": "🐉",
          "label": "Sacred Creatures",
          "count": 15,
          "route": "#/browse/creatures/hindu",
          "description": "Garuda, Nagas, and mythical beings"
        },
        {
          "type": "places",
          "icon": "🏔️",
          "label": "Sacred Places",
          "count": 8,
          "route": "#/browse/places/hindu",
          "description": "Mount Meru, holy rivers, divine realms"
        },
        {
          "type": "concepts",
          "icon": "☸️",
          "label": "Concepts",
          "count": 24,
          "route": "#/browse/concepts/hindu",
          "description": "Dharma, Karma, Maya, Moksha"
        },
        {
          "type": "texts",
          "icon": "📖",
          "label": "Sacred Texts",
          "count": 18,
          "route": "#/browse/texts/hindu",
          "description": "Vedas, Upanishads, Puranas, Epics"
        }
      ]
    },
    {
      "id": "trimurti",
      "title": "The Trimurti: Creation, Preservation, Destruction",
      "type": "content",
      "body": "The three primary aspects of the divine cosmic function:\n\n**Brahma (ब्रह्मा) - The Creator:** Four-faced god who creates the universe at the beginning of each cosmic cycle. Rides Hamsa (swan), holds the Vedas, and is often depicted seated on a lotus emerging from Vishnu's navel. Despite his importance in cosmology, few temples worship Brahma directly.\n\n**Vishnu (विष्णु) - The Preserver:** Blue-skinned god who maintains cosmic order (dharma) and descends to Earth in various avatars when evil threatens to overwhelm good. Rides Garuda (eagle), holds conch, discus, mace, and lotus. His consort is Lakshmi (prosperity). Major avatars include Rama and Krishna.\n\n**Shiva (शिव) - The Destroyer/Transformer:** The lord of yoga, asceticism, and cosmic dance (Nataraja). Third eye on forehead, crescent moon in matted hair, Ganga river flowing from his locks, serpent Vasuki around neck. Destroys the universe at the end of each cosmic cycle to enable renewal. His consort is Parvati (taking fierce form as Kali or Durga). Rides Nandi the bull.\n\nThese three represent the eternal cycle of creation-preservation-destruction that governs all existence. They are not separate beings but different aspects of Brahman (ultimate reality)."
    },
    {
      "id": "avatars",
      "title": "The Dashavatara: Vishnu's Divine Incarnations",
      "type": "content",
      "body": "Vishnu descends to Earth in various forms (avatars) to restore dharma when evil threatens cosmic order. The ten primary avatars (Dashavatara) show cosmic evolution:\n\n1. **Matsya (मत्स्य) - The Fish:** Saved Manu and the Vedas from the great flood\n2. **Kurma (कूर्म) - The Tortoise:** Supported Mount Mandara during the churning of the cosmic ocean\n3. **Varaha (वराह) - The Boar:** Rescued Earth (Bhudevi) from the demon Hiranyaksha\n4. **Narasimha (नरसिंह) - The Man-Lion:** Destroyed the demon Hiranyakashipu who could not be killed by man or beast\n5. **Vamana (वामन) - The Dwarf:** Took three steps to reclaim the three worlds from demon king Bali\n6. **Parashurama (परशुराम) - Rama with Axe:** Warrior who destroyed corrupt kshatriyas (warriors)\n7. **Rama (राम) - Prince of Ayodhya:** Hero of the Ramayana, exemplar of dharmic kingship\n8. **Krishna (कृष्ण) - The Divine Cowherd:** Teacher of Bhagavad Gita, central figure of Mahabharata\n9. **Buddha (बुद्ध) - The Enlightened One:** (In some traditions) Taught compassion and non-violence\n10. **Kalki (कल्कि) - The Future Warrior:** Yet to come, will end the Kali Yuga riding a white horse\n\nThese avatars represent increasing complexity - from aquatic to amphibian to mammal to human to superhuman - mirroring evolutionary development."
    },
    {
      "id": "cosmic-cycles",
      "title": "Yugas: The Cosmic Ages",
      "type": "content",
      "body": "Time in Hindu cosmology operates in vast cycles (yugas) characterized by declining dharma:\n\n**Satya Yuga (Krita Yuga) - Age of Truth:** 1,728,000 years. Humans are virtuous, live long lives, possess divine knowledge. Dharma walks on four legs (complete).\n\n**Treta Yuga - Age of Three:** 1,296,000 years. Righteousness declines by 1/4. Sacrifices and rituals begin. Dharma walks on three legs. (Age of Rama)\n\n**Dvapara Yuga - Age of Two:** 864,000 years. Dharma reduced by half. Disease, desire, and discord increase. (Age of Krishna)\n\n**Kali Yuga - Age of Discord:** 432,000 years (current age, began c. 3102 BCE). Only 1/4 dharma remains. Characterized by strife, ignorance, irreligion, vice. Kalki avatar will end this age.\n\nA complete cycle (Maha Yuga) = 4,320,000 years. 1,000 Maha Yugas = 1 Kalpa (day of Brahma = 4.32 billion years). At night, Brahma sleeps and the universe dissolves, only to be recreated at dawn. Brahma lives 100 Brahma years, after which complete dissolution (Maha Pralaya) occurs before a new Brahma is born."
    },
    {
      "id": "karma-reincarnation",
      "title": "Karma & Samsara: The Wheel of Rebirth",
      "type": "content",
      "body": "**Karma (कर्म):** The law of cause and effect governing moral action. Every action, thought, and intention creates karma - either good (punya) or bad (papa). This karma determines future circumstances and rebirths.\n\n**Samsara (संसार):** The cycle of death and rebirth (reincarnation) driven by karma. All beings - from insects to gods - are trapped in samsara, experiencing countless lives across different realms until achieving liberation.\n\n**Six Realms of Rebirth:**\n- Deva-loka (gods) - heavenly pleasures but still impermanent\n- Asura-loka (demigods) - power-hungry beings in constant conflict\n- Manushya-loka (humans) - considered the best realm for spiritual progress\n- Tiryak (animals) - driven by instinct\n- Preta-loka (hungry ghosts) - beings tormented by insatiable desires\n- Naraka (hells) - temporary realms of suffering for purification\n\n**Moksha (मोक्ष):** Liberation from samsara - the ultimate goal of human existence. Achieved through:\n- Jnana Yoga (knowledge/wisdom)\n- Bhakti Yoga (devotion)\n- Karma Yoga (selfless action)\n- Raja Yoga (meditation)\n\nMoksha represents union with Brahman (ultimate reality), ending the cycle of rebirth and achieving eternal bliss (ananda)."
    },
    {
      "id": "epics",
      "title": "The Great Epics: Ramayana & Mahabharata",
      "type": "content",
      "body": "**Ramayana (रामायण):** Composed by Valmiki (c. 500 BCE). The story of Rama, prince of Ayodhya and avatar of Vishnu, who with his wife Sita and brother Lakshmana defeats the demon king Ravana. Central themes: dharma (duty), devotion, ideal kingship, loyalty. Hanuman, the monkey god, exemplifies perfect devotion. The text explores the cost of maintaining dharma even when it causes personal suffering.\n\n**Mahabharata (महाभारत):** The world's longest epic poem (100,000 verses), traditionally attributed to Vyasa. Chronicles the dynastic struggle between Pandavas and Kauravas, culminating in the devastating Kurukshetra War. Central to the epic is the **Bhagavad Gita** - dialogue between Arjuna and Krishna on the battlefield, addressing duty, devotion, knowledge, and the nature of reality. The Gita remains the most widely read Hindu scripture.\n\nThemes include: the complexity of dharma, the consequences of desire and pride, the role of fate vs. free will, the importance of counsel, and the devastating nature of war even when fighting for righteousness."
    },
    {
      "id": "goddess-worship",
      "title": "Shakti: The Divine Feminine",
      "type": "content",
      "body": "**Shakti (शक्ति):** The primordial cosmic energy - the dynamic creative force of the universe. All goddesses are manifestations of Shakti.\n\n**Devi (देवी) - The Great Goddess:** Ultimate reality in Shaktism (goddess-centered tradition). Manifests in numerous forms:\n\n**Benevolent Forms:**\n- **Lakshmi (लक्ष्मी):** Consort of Vishnu, goddess of wealth, prosperity, fortune\n- **Saraswati (सरस्वती):** Consort of Brahma, goddess of learning, music, arts, wisdom\n- **Parvati (पार्वती):** Consort of Shiva, gentle mother goddess, daughter of mountains\n\n**Fierce Forms:**\n- **Durga (दुर्गा):** Warrior goddess who rides a lion/tiger, slays demons, protects cosmic order. Has eight/ten arms wielding divine weapons\n- **Kali (काली):** Fearsome dark goddess of time, death, and transformation. Wears skull garland, drinks demon blood, dances on Shiva's corpse. Represents the destruction of ego and illusion.\n\n**Tantric Goddesses:**\n- The Ten Mahavidyas (wisdom goddesses) including Tara, Tripura Sundari, Bhuvaneshwari, Chinnamasta\n\nShakti-Shiva duality represents the dynamic dance of creation - Shiva (consciousness) is inert without Shakti (energy). Together they create, sustain, and dissolve the universe."
    },
    {
      "id": "sacred-geography",
      "title": "Sacred Geography & Holy Sites",
      "type": "content",
      "body": "**Mount Meru (मेरु):** The cosmic mountain at the center of the universe, home of the gods. The North Star sits above it. Around it revolve sun, moon, and stars.\n\n**Seven Holy Rivers:** Ganga (Ganges), Yamuna, Godavari, Saraswati, Narmada, Sindhu, Kaveri. The Ganga descended from heaven through Shiva's hair.\n\n**Four Sacred Cities (Char Dham):** Badrinath (north), Puri (east), Rameshwaram (south), Dwarka (west)\n\n**Seven Sacred Cities:** Ayodhya, Mathura, Haridwar, Varanasi (Kashi), Kanchipuram, Ujjain, Dwarka\n\n**Kailash Parvat (कैलाश):** Mountain abode of Shiva and Parvati in the Himalayas\n\n**Vaikuntha (वैकुण्ठ):** Vishnu's celestial paradise\n\n**Kashi/Varanasi:** Most sacred city, where dying grants instant moksha. Here the Ganga flows north toward its heavenly source.\n\n**Kumbh Mela:** Massive pilgrimage occurring every 12 years where millions bathe in sacred rivers for purification."
    },
    {
      "id": "sacred-texts",
      "title": "Primary Sacred Texts",
      "type": "list",
      "items": [
        "Rigveda (c. 1500-1200 BCE) - Oldest Vedic hymns to gods",
        "Yajurveda, Samaveda, Atharvaveda - The four Vedas (revealed knowledge)",
        "Upanishads (c. 800-200 BCE) - Philosophical texts exploring Brahman and Atman",
        "Bhagavad Gita (c. 200 BCE) - Krishna's teachings to Arjuna, part of Mahabharata",
        "Mahabharata (c. 400 BCE-400 CE) - World's longest epic, Kurukshetra War",
        "Ramayana (c. 500 BCE) - Epic of Rama, ideal dharmic king",
        "Puranas (c. 300-1000 CE) - Mythological encyclopedias (18 major, 18 minor)",
        "Brahma Purana, Vishnu Purana, Shiva Purana - Sectarian mythologies",
        "Devi Bhagavata Purana - Goddess-centered mythology",
        "Yoga Sutras of Patanjali - Classical yoga philosophy",
        "Tantras - Esoteric texts of Shakti worship and ritual"
      ]
    },
    {
      "id": "cross-cultural-parallels",
      "title": "Cross-Cultural Connections",
      "type": "parallels",
      "parallels": [
        {
          "mythology": "buddhist",
          "connection": "Direct historical connection - Buddhism emerged from Hindu context, shares many deities and concepts",
          "strength": "primary"
        },
        {
          "mythology": "greek",
          "connection": "Indo-European roots - sky father (Dyaus/Zeus), similar pantheon structures",
          "strength": "secondary"
        },
        {
          "mythology": "norse",
          "connection": "Indo-European parallels - cosmic trees, world destruction/renewal cycles",
          "strength": "secondary"
        },
        {
          "mythology": "persian",
          "connection": "Indo-Iranian heritage - shared Vedic-Avestan roots, similar fire worship",
          "strength": "secondary"
        }
      ]
    }
  ],
  "relatedMythologies": [
    "buddhist",
    "greek",
    "norse",
    "persian",
    "chinese"
  ],
  "featured": true,
  "displayOrder": 4,
  "metadata": {
    "createdAt": "2025-12-28T00:00:00Z",
    "updatedAt": "2025-12-28T12:49:43.754Z",
    "version": "1.0",
    "author": "EyesOfAzrael Content Team",
    "iconUpdated": "2025-12-28T12:49:43.754Z",
    "previousIcon": "🕉️"
  }
}
