{
  "id": "japanese",
  "type": "mythology_page",
  "name": "Japanese Mythology",
  "icon": "⛩️",
  "tagline": "The Way of the Kami and Divine Islands",
  "description": "Journey through Shinto myths of creation, kami spirits dwelling in nature, and the divine origins of the Japanese islands.",
  "overview": "Japanese mythology (Shinto) centers on kami - divine spirits or sacred essence dwelling in nature, ancestors, and exceptional beings. The mythology describes the creation of the Japanese islands by Izanagi and Izanami, the birth of the sun goddess Amaterasu from whom the imperial family descends, the storm god Susanoo's wild exploits, and countless kami inhabiting mountains, rivers, trees, and sacred sites. Shinto emphasizes purity, harmony with nature, ritual cleanliness, and reverence for ancestors. The tradition later merged with Buddhism, creating a unique syncretic system (Shinbutsu-shugo). Unlike many mythologies, Shinto has no absolute good vs. evil - kami can be benevolent or malevolent, and proper ritual maintains balance.",
  "culturalContext": {
    "period": "c. 300 CE - Present",
    "region": "Japan",
    "language": "Japanese",
    "primarySources": "Kojiki (712 CE), Nihon Shoki (720 CE)"
  },
  "statistics": {
    "deities": 18,
    "heroes": 6,
    "creatures": 12,
    "places": 8,
    "concepts": 10
  },
  "sections": [
    {
      "id": "browse-entities",
      "title": "Browse Japanese Entities",
      "type": "category-grid",
      "categories": [
        {"type": "deities", "icon": "⛩️", "label": "Kami", "count": 18, "route": "#/browse/deities/japanese"},
        {"type": "heroes", "icon": "🗡️", "label": "Heroes & Legends", "count": 6, "route": "#/browse/heroes/japanese"},
        {"type": "creatures", "icon": "🦊", "label": "Yokai & Creatures", "count": 12, "route": "#/browse/creatures/japanese"}
      ]
    },
    {
      "id": "creation-myth",
      "title": "Creation of Japan",
      "type": "content",
      "body": "**Izanagi (伊邪那岐)** and **Izanami (伊邪那美):** The divine couple who created the Japanese islands. Standing on the Floating Bridge of Heaven, they stirred the primordial ocean with a jeweled spear. Drops falling from the spear formed the first island. They descended and gave birth to the islands of Japan and numerous kami. Izanami died giving birth to the fire god Kagutsuchi. Izanagi followed her to Yomi (underworld) but fled in horror upon seeing her decaying body. Purifying himself in a river, he gave birth to: **Amaterasu** (sun goddess) from his left eye, **Tsukuyomi** (moon god) from his right eye, and **Susanoo** (storm god) from his nose."
    },
    {
      "id": "amaterasu",
      "title": "Amaterasu & the Sun",
      "type": "content",
      "body": "**Amaterasu (天照大神):** Sun goddess and supreme deity of Shinto. Ancestor of the Japanese imperial family. When her brother Susanoo destroyed her rice fields and threw a flayed horse into her weaving hall, Amaterasu retreated into a cave, plunging the world into darkness. The gods lured her out with a sacred mirror, jewels, and the laughter caused by the dance of the goddess Ame-no-Uzume. This myth explains solar eclipses and establishes the Three Imperial Regalia: mirror, jewel, sword."
    }
  ],
  "relatedMythologies": ["chinese", "buddhist", "korean"],
  "featured": true,
  "displayOrder": 7,
  "metadata": {"createdAt": "2025-12-28T00:00:00Z", "updatedAt": "2025-12-28T00:00:00Z", "version": "1.0"}
}
