{
  "id": "norse",
  "type": "mythology_page",
  "name": "Norse Mythology",
  "icon": "icons/mythologies/norse.svg",
  "tagline": "The Sagas of Asgard and the Nine Realms",
  "description": "Journey through the nine realms of Norse mythology, from the golden halls of Asgard to the human realm of Midgard to the misty depths of Hel.",
  "overview": "Norse mythology encompasses the religious beliefs, sagas, and cosmic worldview of the Scandinavian and Germanic peoples during the Viking Age (c. 793-1066 CE) and earlier. This rich mythological tradition features the Aesir gods led by Odin the Allfather dwelling in Asgard, the Vanir fertility deities, the World Tree Yggdrasil (ᛁᚴᛏᚱᛅᛋᛁᛚ) connecting nine distinct realms, powerful runes won through sacrifice, and the inevitable twilight of Ragnarök. Unlike many mythologies, Norse tradition is defined by its emphasis on fate (wyrd), the certainty of the gods' eventual doom, heroic courage in the face of certain death, and the cyclical destruction and rebirth of the cosmos. The mythology survived primarily through Icelandic sagas and Eddic poetry preserved by Christian scholars centuries after the Viking conversion.",
  "culturalContext": {
    "period": "c. 500 CE - 1100 CE (Viking Age peak: 793-1066 CE)",
    "region": "Scandinavia (Norway, Sweden, Denmark, Iceland), Germanic territories",
    "language": "Old Norse, runic inscriptions (Elder and Younger Futhark)",
    "primarySources": "Poetic Edda, Prose Edda (Snorri Sturluson), Icelandic sagas, runic inscriptions"
  },
  "statistics": {
    "deities": 24,
    "heroes": 8,
    "creatures": 15,
    "places": 18,
    "items": 12,
    "concepts": 10,
    "events": 5
  },
  "sections": [
    {
      "id": "browse-entities",
      "title": "Browse Norse Entities",
      "type": "category-grid",
      "description": "Explore the gods, heroes, and creatures of Norse mythology",
      "categories": [
        {
          "type": "deities",
          "icon": "⚡",
          "label": "Deities",
          "count": 24,
          "route": "#/browse/deities/norse",
          "description": "Aesir and Vanir gods of Asgard"
        },
        {
          "type": "heroes",
          "icon": "🦸",
          "label": "Heroes",
          "count": 8,
          "route": "#/browse/heroes/norse",
          "description": "Legendary warriors and saga heroes"
        },
        {
          "type": "creatures",
          "icon": "🐉",
          "label": "Creatures",
          "count": 15,
          "route": "#/browse/creatures/norse",
          "description": "Giants, dragons, and mythical beasts"
        },
        {
          "type": "places",
          "icon": "🌳",
          "label": "Sacred Places",
          "count": 18,
          "route": "#/browse/places/norse",
          "description": "The Nine Realms of Yggdrasil"
        },
        {
          "type": "items",
          "icon": "🔨",
          "label": "Sacred Items",
          "count": 12,
          "route": "#/browse/items/norse",
          "description": "Mjolnir, Gungnir, and divine artifacts"
        },
        {
          "type": "concepts",
          "icon": "ᚱ",
          "label": "Concepts",
          "count": 10,
          "route": "#/browse/concepts/norse",
          "description": "Wyrd, honor, and Norse philosophy"
        },
        {
          "type": "events",
          "icon": "🔥",
          "label": "Events",
          "count": 5,
          "route": "#/browse/events/norse",
          "description": "Ragnarök and mythic events"
        }
      ]
    },
    {
      "id": "nine-realms",
      "title": "Yggdrasil & The Nine Realms",
      "type": "content",
      "body": "Yggdrasil (Old Norse: ᛁᚴᛏᚱᛅᛋᛁᛚ), the cosmic ash tree, connects nine distinct worlds across three levels of reality:\n\n**Upper Realms:** Asgard (Aesir gods), Vanaheim (Vanir gods), Alfheim (light elves)\n\n**Middle Realms:** Midgard (humans), Jotunheim (giants), Svartalfheim (dark elves/dwarves)\n\n**Lower Realms:** Niflheim (ice and mist), Muspelheim (fire), Helheim (the dead)\n\nThe tree is tended by the three Norns (fate goddesses), gnawed at its roots by the dragon Nidhogg, and home to the squirrel Ratatoskr who carries messages between realms. An eagle sits at the top, four stags browse among branches, and the tree's health reflects the state of the cosmos."
    },
    {
      "id": "aesir-vanir",
      "title": "The Aesir & Vanir",
      "type": "content",
      "body": "Norse deities are divided into two tribes: the **Aesir** (warrior gods of Asgard led by Odin) and the **Vanir** (fertility and nature deities). After the Aesir-Vanir War - the first war in the cosmos - the tribes merged through a treaty and exchange of hostages, creating a unified pantheon.\n\n**Key Aesir:** Odin (Wisdom/Magic), Thor (Thunder), Frigg (Marriage), Tyr (Law/War), Baldr (Light/Beauty), Heimdall (Guardian), Loki (Trickster)\n\n**Key Vanir:** Freyr (Fertility/Prosperity), Freyja (Love/Magic/War), Njord (Sea/Wind)\n\n**Other Deities:** Hel (Death), Skadi (Winter/Hunting), Eir (Healing), Idun (Youth)"
    },
    {
      "id": "ragnarok",
      "title": "Ragnarök - The Twilight of the Gods",
      "type": "content",
      "body": "Unlike most mythologies, Norse tradition foretells the certain doom of the gods in Ragnarök (ᚱᚨᚷᚾᚨᚱᚢᚲ) - the final battle between order and chaos:\n\n1. **Fimbulwinter:** Three successive winters with no summer\n2. **Breaking of Bonds:** Fenrir and Loki break free from their chains\n3. **Heimdall's Horn:** Gjallarhorn sounds, calling gods to battle\n4. **Yggdrasil Trembles:** The World Tree shakes violently\n5. **The Final Battle:** Gods fight giants, monsters, and chaos forces\n6. **Deaths of Gods:** Odin, Thor, Freyr, Tyr, and others fall\n7. **World Consumed:** Fire and flood destroy the nine realms\n8. **Rebirth:** A new world rises, purified and renewed\n\nTwo humans (Líf and Lífþrasir) survive by hiding in Yggdrasil, emerging to repopulate a green and fertile earth where surviving gods (Baldr, Hodr, Vidar, Vali) establish a new golden age."
    },
    {
      "id": "runic-magic",
      "title": "Runic Magic & The Elder Futhark",
      "type": "content",
      "body": "Norse magic encompasses seidr (shamanic magic), galdr (rune chanting), and the mysteries of the runes - ancient symbols of power that Odin won through self-sacrifice on Yggdrasil.\n\n**The 24 Runes of Elder Futhark:** ᚠ ᚢ ᚦ ᚨ ᚱ ᚲ ᚷ ᚹ ᚺ ᚾ ᛁ ᛃ ᛈ ᛇ ᛉ ᛊ ᛏ ᛒ ᛖ ᛗ ᛚ ᛜ ᛞ ᛟ\n\n**Seidr:** Shamanic magic practiced by volvas (wise women) and taught by Freyja to Odin. Involved divination, fate-weaving, and spirit journeys.\n\n**Galdr:** Vocal magic using rune songs and incantations. The power of spoken words combined with runic symbolism.\n\n**Wyrd:** The concept of fate as a web woven by the Norns. Not predetermined, but shaped by past actions (orlog) and present choices."
    },
    {
      "id": "sacred-items",
      "title": "Divine Weapons & Artifacts",
      "type": "content",
      "body": "**Mjolnir (🔨):** Thor's legendary hammer. Creates thunder and lightning, returns when thrown, consecrates sacred rites. Forged by dwarven brothers Sindri and Brokkr.\n\n**Gungnir (🗡️):** Odin's spear that never misses its mark. Carved with runes of power, used to start wars and bind oaths.\n\n**Draupnir (💍):** Odin's golden arm ring. Every ninth night, eight new rings of equal weight drip from it.\n\n**Sleipnir (🐴):** Odin's eight-legged horse, fastest of all steeds. Born from Loki, can travel between the nine realms.\n\n**Brisingamen:** Freyja's golden necklace of beauty and power.\n\n**Skidbladnir:** Freyr's magical ship that always has favorable wind and can be folded to fit in a pocket."
    },
    {
      "id": "valhalla-afterlife",
      "title": "The Afterlife: Valhalla & Beyond",
      "type": "content",
      "body": "Norse afterlife was not uniform - different fates awaited different people:\n\n**Valhalla:** Odin's hall in Asgard where einherjar (chosen slain warriors) feast and fight, preparing for Ragnarök. Valkyries choose who dies in battle and escort them to Valhalla.\n\n**Folkvangr:** Freyja's hall, receiving half of those who die in battle.\n\n**Helheim:** Hel's realm for those who die of sickness, old age, or non-heroic deaths. Not necessarily a place of punishment.\n\n**Ran's Hall:** Those who drown at sea go to the goddess Ran's underwater hall.\n\n**Burial Practices:** Ship burials, cremation, and grave goods reflected belief that the dead needed provisions for their journey."
    },
    {
      "id": "creation-myth",
      "title": "Creation & Cosmogony",
      "type": "content",
      "body": "In the beginning was Ginnungagap - the primordial void between Niflheim (ice/mist) and Muspelheim (fire). When ice and fire met, they melted to form Ymir, the first frost giant, and Audhumla, the primordial cow. From Ymir's sweat came more giants. Audhumla licked the salty ice, freeing Buri, ancestor of the gods. Buri's grandsons - Odin, Vili, and Ve - slew Ymir and created the world from his body: his flesh became earth, his blood the seas, his bones the mountains, his skull the sky, and his brain the clouds. Humans (Ask and Embla) were created from driftwood and given life by the three brother gods."
    },
    {
      "id": "sacred-texts",
      "title": "Primary Sources",
      "type": "list",
      "items": [
        "Poetic Edda (13th century) - Collection of Old Norse poems preserving pre-Christian mythology",
        "Prose Edda by Snorri Sturluson (c. 1220) - Comprehensive guide to Norse mythology and poetics",
        "Völuspá - Poetic prophecy describing creation and Ragnarök",
        "Hávamál - Odin's wisdom sayings and runic knowledge",
        "Icelandic Sagas - Family sagas and legendary sagas featuring heroes and gods",
        "Runic Inscriptions - Elder and Younger Futhark inscriptions on stones and artifacts",
        "Saxo Grammaticus's Gesta Danorum (c. 1200) - Danish history including mythological material"
      ]
    },
    {
      "id": "cross-cultural-parallels",
      "title": "Cross-Cultural Connections",
      "type": "parallels",
      "parallels": [
        {
          "mythology": "greek",
          "connection": "Shared Indo-European roots - sky father (Odin/Zeus), world tree/cosmic axis",
          "strength": "secondary"
        },
        {
          "mythology": "hindu",
          "connection": "Indo-European parallels - cosmic trees, world destruction/renewal cycles",
          "strength": "secondary"
        },
        {
          "mythology": "celtic",
          "connection": "Germanic-Celtic cultural exchange, similar tribal pantheons",
          "strength": "tertiary"
        },
        {
          "mythology": "christian",
          "connection": "Odin's self-sacrifice parallels crucifixion, influenced by Christianity in written sources",
          "strength": "tertiary"
        }
      ]
    }
  ],
  "relatedMythologies": [
    "greek",
    "germanic",
    "celtic",
    "hindu"
  ],
  "featured": true,
  "displayOrder": 2,
  "metadata": {
    "createdAt": "2025-12-28T00:00:00Z",
    "updatedAt": "2025-12-28T12:49:43.759Z",
    "version": "1.0",
    "author": "EyesOfAzrael Content Team",
    "iconUpdated": "2025-12-28T12:49:43.759Z",
    "previousIcon": "⚔️"
  }
}
