{
  "primarySources": [],
  "attributes": [
    "Appearance: Eagle-headed with golden feathers, human body, wings that span the sky. Sometimes depicted fully as an eagle, sometimes as anthropomorphic with wings.",
    "Speed: Can change size at will, fly faster than the wind or thought, and eclipse the sun with his wings",
    "Strength: Strong enough to carry Vishnu and Lakshmi, defeated entire armies of gods",
    "Immortality: Granted by Vishnu, making him eternal",
    "Enemy of Serpents: Nagas flee at the mere mention of his name; he devours them regularly",
    "Symbol: Represents freedom, power, devotion, and the victory of good over evil (especially the serpent of ego)"
  ],
  "mythology": "hindu",
  "physicalDescription": "King of Birds, Vahana of Vishnu [View in Corpus →]",
  "weaknesses": [],
  "abilities": [
    "Appearance: Eagle-headed with golden feathers, human body, wings that span the sky. Sometimes depicted fully as an eagle, sometimes as anthropomorphic with wings.",
    "Speed: Can change size at will, fly faster than the wind or thought, and eclipse the sun with his wings",
    "Strength: Strong enough to carry Vishnu and Lakshmi, defeated entire armies of gods",
    "Immortality: Granted by Vishnu, making him eternal",
    "Enemy of Serpents: Nagas flee at the mere mention of his name; he devours them regularly",
    "Symbol: Represents freedom, power, devotion, and the victory of good over evil (especially the serpent of ego)",
    "Strength: Strong enough to carry Vishnu and Lakshmi , defeated entire armies of gods",
    "Immortality: Granted by Vishnu , making him eternal"
  ],
  "_enhanced": true,
  "mythology_story": "Birth from the Cosmic Egg: Garuda was born to Sage Kashyapa and Vinata , one of his wives. Vinata desired children and received two eggs. Impatient after 500 years, she broke open one egg prematurely, giving birth to Aruna (charioteer of the sun god), who was incompletely formed. She waited for the second egg, from which Garuda hatched—fully formed, radiant, and powerful. The Quest for Amrita: Vinata had become enslaved to her co-wife Kadru , mother of the Nagas (serpents), through a lost wager. Kadru demanded that Garuda steal amrita (nectar of immortality) from the gods as the price of his mother's freedom. Despite the seemingly impossible task, Garuda flew to the heavens. The gods' defenses proved futile against Garuda 's might. He defeated the guardian devas, extinguished the ring of fire protecting the amrita, and navigated through deadly chakras (rotating blades). He seized the amrita and flew back, but was intercepted by Vishnu , who was impressed by Garuda 's strength and devotion to his mother. Vishnu offered Garuda a boon, and Garuda asked to be placed above Vishnu —thus becoming Vishnu 's vahana (mount), the only being to ride upon the Lord. Vishnu , in turn, granted Garuda immortality without drinking the amrita.",
  "metadata": {
    "polished": true,
    "createdBy": "system",
    "sourceFile": "mythos/hindu/creatures/garuda.html",
    "polishedBy": "Agent_11",
    "updatedAt": {
      "_seconds": 1766539877,
      "_nanoseconds": 42000000
    },
    "verified": false,
    "finalEnrichment": true,
    "createdAt": "2025-12-13T02:38:01.508Z",
    "htmlExtracted": true,
    "source": "html_parser"
  },
  "name": "Hindu Creatures",
  "relationships": {},
  "filename": "garuda",
  "completeness": 44,
  "habitats": [],
  "_uploadedAt": "2025-12-25T15:46:33.287541",
  "displayName": "🦅 Garuda",
  "type": "spirit",
  "symbolism": "Spiritual Symbolism: Garuda represents the soul's journey toward liberation. As the vehicle of Vishnu , he symbolizes the surrender of the individual self to the Divine . His enmity with serpents represents the conquest of ego, desire, and earthly attachments. National Symbol: Garuda appears in the national emblems of Indonesia and Thailand. The Garuda Pancasila is Indonesia's national emblem, and Garuda is the name of Indonesia's national airline.",
  "description": "Also known as 🦅 Garuda.",
  "id": "hindu_garuda",
  "icon": "✨",
  "subtitle": "Also known as 🦅 Garuda.",
  "searchTerms": [
    "hindu creatures",
    "🦅 garuda",
    "hindu garuda",
    "hindu",
    "spirit",
    "garuda"
  ],
  "sortName": "hinducreatures",
  "importance": 55,
  "popularity": 50,
  "_version": "2.0",
  "_modified": "2025-12-25T08:13:24.650Z",
  "_metadataEnhanced": true,
  "_enhancedAt": "2025-12-25T08:13:24.650Z"
}