[
  {
    "id": "buddhist_bodhisattva",
    "type": "concept",
    "mythology": "buddhist",
    "filename": "bodhisattva",
    "displayName": "🙏 Bodhisattva",
    "name": "Buddhist Mythology",
    "description": "An enlightened being who delays entry into final nirvana in order to help all sentient beings achieve liberation. The bodhisattva ideal is central to Mahayana Buddhism. Major bodhisattvas include Avalokiteshvara (compassion) and Manjushri (wisdom).",
    "philosophicalMeaning": {
      "coreIdea": "Compassionate enlightenment - spiritual awakening combined with the vow to liberate all beings",
      "ethicalImplications": "The bodhisattva path prioritizes altruism over personal salvation, establishing compassion as the highest spiritual virtue",
      "spiritualSignificance": "Represents the Mahayana ideal that true enlightenment cannot be achieved alone - liberation of all beings is the ultimate goal"
    },
    "theologicalSignificance": {
      "mahayanaTheology": "Central to Mahayana Buddhism - distinguishes it from Theravada's arhat ideal",
      "bodhisattvaVow": "The commitment to postpone final nirvana until all sentient beings are liberated from suffering",
      "skillfulMeans": "Bodhisattvas employ upaya (skillful means) to guide beings according to their capacities"
    },
    "practicalApplications": {
      "meditation": "Bodhisattva practice includes tonglen (taking and sending), visualizing taking others' suffering and sending them happiness",
      "ethics": "The Six Paramitas (perfections) - generosity, ethics, patience, diligence, meditation, wisdom",
      "aspiration": "Practitioners take bodhisattva vows to cultivate the enlightened mind for the benefit of all beings"
    },
    "keyFigures": [
      "Avalokiteshvara - Bodhisattva of Compassion",
      "Manjushri - Bodhisattva of Wisdom",
      "Ksitigarbha - Bodhisattva who vows to save beings in hell realms",
      "Samantabhadra - Bodhisattva of practice and meditation",
      "Maitreya - Future Buddha, currently a bodhisattva"
    ],
    "relatedConcepts": [
      "Compassion (Karuna)",
      "Nirvana",
      "Samsara",
      "Six Paramitas",
      "Mahayana Buddhism"
    ],
    "primarySources": [
      "Lotus Sutra",
      "Avatamsaka Sutra",
      "Bodhicharyavatara (The Way of the Bodhisattva) by Shantideva"
    ],
    "significance": [
      "Defines the Mahayana Buddhist path",
      "Elevates compassion to supreme spiritual virtue",
      "Provides accessible spiritual ideal for practitioners",
      "Bridges the divine and human through bodhisattva accessibility"
    ],
    "participants": [],
    "metadata": {
      "createdAt": "2025-12-13T02:52:29.323Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/buddhist/concepts/bodhisattva.html",
      "updatedAt": "2025-12-25T20:00:00.000Z",
      "enhancedBy": "Agent_16_ConceptPolishing",
      "enhancementDate": "2025-12-25T20:00:00.000Z"
    }
  },
  {
    "id": "buddhist_compassion",
    "type": "concept",
    "mythology": "buddhist",
    "filename": "compassion",
    "displayName": "💗 Compassion (Karuna)",
    "name": "Buddhist Mythology",
    "description": "One of the central virtues in Buddhism, the wish for all beings to be free from suffering. Combined with wisdom, compassion is the foundation of the bodhisattva path and is personified by Avalokiteshvara.",
    "philosophicalMeaning": {
      "coreIdea": "Karuna - the heartfelt wish that all sentient beings be free from suffering and its causes",
      "relationship": "Paired with Prajna (wisdom), compassion forms the two wings of enlightenment",
      "universality": "Extends equally to all beings without exception - friends, enemies, strangers, and all life forms"
    },
    "theologicalSignificance": {
      "fourImmeasurables": "One of the Brahma-viharas: loving-kindness, compassion, empathetic joy, and equanimity",
      "bodhichittaRoot": "Compassion is the foundation of bodhicitta - the enlightened mind that seeks awakening for all beings",
      "buddhahood": "All Buddhas are said to arise from the perfection of compassion and wisdom together"
    },
    "practicalApplications": {
      "meditation": "Karuna meditation - systematically cultivating compassion toward all beings, starting with oneself",
      "tonglen": "Taking and sending practice - visualizing taking others' suffering and sending them happiness",
      "dailyLife": "Acting with kindness, reducing harm, actively helping those who suffer",
      "cultivation": "Progressive stages: compassion for loved ones → neutral beings → difficult people → all beings equally"
    },
    "embodiments": [
      "Avalokiteshvara/Chenrezig - Bodhisattva who embodies perfect compassion",
      "Kuan Yin (Chinese) - Female manifestation of compassion",
      "Tara - Compassionate mother goddess who swiftly responds to prayers",
      "All Buddhas and Bodhisattvas embody perfect compassion"
    ],
    "relatedConcepts": [
      "Bodhisattva",
      "Loving-kindness (Metta)",
      "Wisdom (Prajna)",
      "Bodhicitta",
      "Four Immeasurables"
    ],
    "primarySources": [
      "Metta Sutta",
      "Karaniya Metta Sutta",
      "Bodhicharyavatara by Shantideva",
      "Visuddhimagga (Path of Purification)"
    ],
    "significance": [
      "Essential to Buddhist ethics and spiritual development",
      "Distinguishes Mahayana emphasis on universal liberation",
      "Provides practical method for transforming self-centeredness",
      "Bridges Buddhist practice with universal human values"
    ],
    "participants": [],
    "metadata": {
      "createdAt": "2025-12-13T02:52:29.335Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/buddhist/concepts/compassion.html",
      "updatedAt": "2025-12-25T20:00:00.000Z",
      "enhancedBy": "Agent_16_ConceptPolishing",
      "enhancementDate": "2025-12-25T20:00:00.000Z"
    }
  },
  {
    "id": "christian_demiurge-vs-monad",
    "type": "concept",
    "mythology": "christian",
    "filename": "demiurge-vs-monad",
    "displayName": "Demiurge vs. Monad",
    "name": "The False God and the True Father in Gnostic Christianity",
    "description": "The most revolutionary claim of Gnostic Christianity: the god of the Old Testament - the creator of the material world, the lawgiver of Sinai, the jealous deity demanding worship - is not the supreme God. That is Yaldabaoth, the Demiurge, the ignorant craftsman born from Sophia's defective emanation. Above him, beyond all the archontic spheres, dwelling in ineffable light and perfect silence, is the Monad - the true Father revealed by Christ. This is the distinction between the god of this world and the God of eternity, between the ruler of matter and the source of spirit, between law and grace, judgment and love, fear and gnosis.",
    "philosophicalMeaning": {
      "coreDistinction": "Two divine principles - the limited creator god (Demiurge) vs. the transcendent unknowable source (Monad)",
      "ontologicalImplications": "Material creation is not the work of the supreme deity but of an ignorant intermediate power",
      "epistemological": "Knowledge (gnosis) of this distinction is itself liberating - ignorance keeps souls trapped"
    },
    "theologicalSignificance": {
      "revolutionaryThesis": "The Old Testament god is not the same as the Father Jesus reveals",
      "textualEvidence": [
        "No one has ever seen God (John 1:18) - yet OT figures see YHWH repeatedly",
        "The ruler of this world will be cast out (John 12:31) - identifying a cosmic ruler distinct from the Father",
        "You are of your father the devil (John 8:44) - Jesus tells Pharisees their god is not his Father"
      ],
      "characterContrasts": {
        "demiurge": "Jealous, wrathful, legalistic, demands sacrifice, exclusive, violent",
        "monad": "Perfect love, gracious, lawless (beyond law), needs no worship, universal, peaceful"
      },
      "progressiveRevelation": "Some Gnostics saw the transition from Demiurge to Monad as pedagogical - law as guardian until Christ"
    },
    "practicalApplications": {
      "spiritualDiscernment": "Distinguishing between fear-based religion (Demiurge) and love-based spirituality (Monad)",
      "liberation": "Freedom from legalism, external rules, guilt-based compliance",
      "innerGnosis": "Shift from external obedience to inner spiritual knowledge",
      "selfExamination": [
        "Do I relate to God through fear or love?",
        "Do I follow external rules or inner truth?",
        "Is my spirituality based on obligation or liberation?"
      ]
    },
    "keyComparisons": {
      "worship": {
        "demiurge": "Demands exclusive worship, jealous of competitors",
        "monad": "Needs no worship, infinitely fulfilled in himself"
      },
      "law": {
        "demiurge": "613 commandments, endless regulations, legalistic system",
        "monad": "Freedom, grace, inner law written on the heart"
      },
      "punishment": {
        "demiurge": "Threatens death, destruction, eternal wrath",
        "monad": "Corrects through love, disciplines through wisdom, saves all"
      },
      "knowledge": {
        "demiurge": "Forbids eating from tree of knowledge (Genesis 2:17)",
        "monad": "Offers gnosis, truth that sets free (John 8:32)"
      }
    },
    "ultimateReconciliation": {
      "gnosticHope": "Even the Demiurge will eventually recognize the Father and be reconciled",
      "paulineVision": "God will be all in all (1 Cor 15:28) - every rule and authority subjected to Christ",
      "universalSalvation": "Even the creator of the prison will be set free, even the blind god will see"
    },
    "relatedConcepts": [
      "Yaldabaoth - The Demiurge in Detail",
      "Gnostic Cosmology - The Monad and the Pleroma",
      "Sabaoth - The Repentant Archon Who Recognized the Father",
      "The Archons - Servants of the Demiurge",
      "Sophia - Divine Wisdom and Mother of the Demiurge",
      "Christ the Redeemer - Revealer of the Unknown Father",
      "Universal Salvation - Even the Demiurge Will Be Redeemed"
    ],
    "primarySources": [
      "The Apocryphon of John",
      "The Hypostasis of the Archons",
      "On the Origin of the World",
      "The Gospel of Thomas",
      "Ptolemy's Letter to Flora"
    ],
    "significance": [
      "Radical reinterpretation of biblical theology",
      "Explains perceived contradictions between OT and NT God",
      "Provides framework for spiritual liberation from legalism",
      "Influences modern progressive Christianity and spiritual-but-not-religious movements"
    ],
    "participants": [
      "Perfect Love: \"God is love\" (1 John 4:8) - no wrath, no violence, no vengeance",
      "Universal Compassion: \"Makes his sun rise on the evil and on the good\" (Matthew 5:45)",
      "Forgiving: Forgives without sacrifice - \"Neither do I condemn you\" (John 8:11)",
      "Non-Judgmental: \"For God did not send his Son into the world to condemn the world\" (John 3:17)",
      "Merciful: \"Be merciful, even as your Father is merciful\" (Luke 6:36)",
      "Perfect: \"Be perfect, as your heavenly Father is perfect\" (Matthew 5:48)"
    ],
    "metadata": {
      "createdAt": "2025-12-13T02:52:29.425Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/christian/gnostic/concepts/demiurge-vs-monad.html",
      "updatedAt": "2025-12-25T20:00:00.000Z",
      "enhancedBy": "Agent_16_ConceptPolishing",
      "enhancementDate": "2025-12-25T20:00:00.000Z"
    }
  },
  {
    "id": "egyptian_maat",
    "type": "concept",
    "mythology": "egyptian",
    "filename": "maat",
    "displayName": "⚖️ Ma'at (Concept)",
    "name": "Egyptian Mythology",
    "description": "Ma'at is the ancient Egyptian concept of truth, justice, cosmic order, and harmony. It represents both the natural law that governs the universe and the ethical code that humans must follow. Ma'at is also personified as a goddess who embodies these principles.",
    "philosophicalMeaning": {
      "coreIdea": "Universal order, truth, and justice that permeates all existence - cosmic law made manifest",
      "naturalLaw": "Ethics grounded in cosmic order rather than arbitrary divine command - morality reflects reality's structure",
      "reciprocity": "What you do returns to you - actions create ripples through the cosmic order",
      "balance": "The universe tends toward equilibrium - ma'at is the restorative force maintaining cosmic balance"
    },
    "theologicalSignificance": {
      "divineFoundation": "The gods themselves live by ma'at - even they are subject to cosmic law",
      "pharaohicRole": "Pharaoh's primary duty is upholding ma'at - maintaining cosmic and social order",
      "judgment": "In the afterlife, the heart is weighed against the feather of ma'at - truth determines destiny",
      "oppositeForce": "Isfet (chaos, disorder, injustice) constantly threatens ma'at - requiring continual restoration"
    },
    "practicalApplications": {
      "ethics": [
        "Speak truth",
        "Act with justice",
        "Maintain social harmony",
        "Fulfill responsibilities to community and family",
        "Practice moderation and balance"
      ],
      "rituals": "Daily temple rituals present ma'at to the gods, sustaining cosmic order",
      "governance": "Egyptian law based on ma'at principles - justice aligned with cosmic law",
      "personalConduct": "The 42 Negative Confessions - declarations of living according to ma'at"
    },
    "afterlifeJudgment": {
      "weighingOfHeart": "Deceased's heart weighed against ma'at's feather in Hall of Two Truths",
      "judges": "Osiris presides, Thoth records, Ammit devours hearts heavier than the feather",
      "negativeConfessions": "Declarations before 42 divine judges of living according to ma'at",
      "outcome": "Those in ma'at join Osiris in the Field of Reeds; those in isfet are destroyed"
    },
    "relatedConcepts": [
      "Dike - Greek goddess of justice and moral order",
      "Dharma - Hindu cosmic law and moral order",
      "Asha - Zoroastrian truth and righteousness",
      "Me - Sumerian divine decrees of civilization",
      "Cosmic Order - Universal balance",
      "Divine Justice - Judgment of souls",
      "Sacred Duality - Order versus chaos",
      "Ma'at (Goddess) - Personification of cosmic order",
      "The Afterlife - Judgment of the heart",
      "Osiris - Judge of the dead",
      "Thoth - Recorder of judgment",
      "The Amduat - Journey through judgment"
    ],
    "primarySources": [
      "Book of the Dead - Instructions for navigating afterlife judgment",
      "Pyramid Texts - Royal funerary texts emphasizing ma'at",
      "Coffin Texts - Democratized afterlife texts",
      "Wisdom Literature - Teachings on living according to ma'at"
    ],
    "significance": [
      "Natural Law: Ethics grounded in cosmic order rather than arbitrary divine command",
      "Social Contract: Individual ethics connected to cosmic maintenance",
      "Merit-Based Afterlife: Judgment based on moral worth, not wealth or status",
      "Universal Principles: Truth and justice as absolute standards applying to all",
      "Cosmic Interdependence: Human actions affect divine realm and vice versa"
    ],
    "participants": [],
    "metadata": {
      "createdAt": "2025-12-13T02:52:29.313Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/egyptian/concepts/maat.html",
      "finalEnrichment": true,
      "updatedAt": "2025-12-25T20:00:00.000Z",
      "enhancedBy": "Agent_16_ConceptPolishing",
      "enhancementDate": "2025-12-25T20:00:00.000Z"
    }
  },
  {
    "id": "norse_aesir",
    "type": "concept",
    "mythology": "norse",
    "filename": "aesir",
    "displayName": "⚔️ The Aesir",
    "name": "Norse Mythology",
    "description": "The Aesir are one of the two main tribes of Norse gods (the other being the Vanir). They are primarily associated with war, governance, and cosmic order. Led by Odin, they dwell in Asgard and include major deities like Thor, Tyr, Frigg, and Baldur.",
    "philosophicalMeaning": {
      "coreIdea": "Divine embodiment of civilization, law, warfare, and sovereignty - gods of order and structure",
      "dualGoddess": "Contrasts with Vanir (gods of fertility, nature, magic) - representing complementary cosmic forces",
      "fatedDoom": "Unlike many pantheons, the Aesir know their destined destruction at Ragnarok - heroism despite inevitable defeat"
    },
    "theologicalSignificance": {
      "aesirVanirWar": "Ancient conflict between the two god tribes, ending in truce and exchange of hostages",
      "cosmicRole": "Maintainers of cosmic order against forces of chaos (giants, monsters)",
      "ragnarokDestiny": "Prophesied to die fighting at Ragnarok, but some will survive to rebuild",
      "asgardiansRulers": "Dwell in Asgard, the heavenly fortress connected to Midgard by Bifrost bridge"
    },
    "practicalApplications": {
      "warrior culture": "The Aesir embody Norse warrior values - courage, honor, oath-keeping, glory in battle",
      "kingship": "Germanic and Nordic kings claimed descent from Odin, legitimizing rule through divine lineage",
      "sacrifice": "Worship involved animal sacrifice, ritual feasts, and votive offerings",
      "runes": "Odin's discovery of runes provides magical/spiritual technology for practitioners"
    },
    "majorAesir": [
      "Odin - All-Father, god of wisdom, war, death, magic, poetry",
      "Thor - Thunder god, protector of humanity and Asgard",
      "Tyr - God of law, justice, heroic glory, single combat",
      "Frigg - Queen of Asgard, goddess of foresight and wisdom",
      "Baldur - God of light, beauty, love, purity (slain by Loki)",
      "Heimdall - Guardian of Bifrost, watchman of the gods",
      "Bragi - God of poetry and eloquence",
      "Forseti - God of justice and reconciliation"
    ],
    "relatedConcepts": [
      "Norse Deities - Full pantheon",
      "Asgard - Home of the Aesir",
      "Olympians - Greek sky gods of order",
      "Devas - Hindu gods of light and order",
      "Tuatha De Danann - Celtic divine race",
      "Anunnaki - Mesopotamian great gods",
      "Sky Gods - Divine rulers of heaven",
      "Divine War - Conflicts among the gods",
      "Cosmic Order - Gods of structure and law",
      "Odin - Chief of the Aesir",
      "Thor - Protector god of the Aesir",
      "Ragnarok - The fate of the Aesir",
      "Norse Deities - The full pantheon"
    ],
    "primarySources": [
      "Prose Edda by Snorri Sturluson",
      "Poetic Edda - Collection of Old Norse poems",
      "Ynglinga Saga - History of the Yngling dynasty claiming Odin descent",
      "Heimskringla - Sagas of Norwegian kings"
    ],
    "significance": [
      "Define Norse religious worldview and values",
      "Provide divine models for warrior culture",
      "Establish cosmic order against chaos",
      "Embody tragic heroism - fighting knowing defeat is fated"
    ],
    "participants": [],
    "metadata": {
      "createdAt": "2025-12-13T02:52:29.266Z",
      "createdBy": "system",
      "verified": false,
      "source": "html_parser",
      "sourceFile": "mythos/norse/concepts/aesir.html",
      "finalEnrichment": true,
      "updatedAt": "2025-12-25T20:00:00.000Z",
      "enhancedBy": "Agent_16_ConceptPolishing",
      "enhancementDate": "2025-12-25T20:00:00.000Z"
    }
  }
]