{
  "id": "pomegranate",
  "type": "item",
  "name": "Pomegranate",
  "icon": "🍎",
  "slug": "pomegranate",
  "mythologies": [
    "greek",
    "roman",
    "hebrew",
    "persian"
  ],
  "primaryMythology": "greek",
  "shortDescription": "Sacred fruit of the underworld, symbol of death, rebirth, fertility, and marriage",
  "fullDescription": "The pomegranate (Punica granatum) is one of mythology's most potent and complex symbols, best known in Greek mythology as the fruit that bound Persephone to the underworld after Hades abducted her. When Persephone ate six pomegranate seeds in the realm of the dead, she became bound to return there for six months of each year, creating the seasonal cycle of winter and summer. The pomegranate's hundreds of jewel-like seeds within a single fruit made it a powerful symbol of fertility, abundance, life from death, and hidden knowledge. Its deep red color evoked both blood and vitality, while its crown-like calyx suggested royalty and divine authority. In Greek culture, pomegranates were associated with marriage, death, rebirth, and the mysteries of Demeter and Persephone celebrated at Eleusis. The fruit appears throughout Mediterranean and Near Eastern mythology as a symbol of life, death, sexuality, and transformation.",
  "category": "herb",
  "subCategory": "sacred-fruit",
  "colors": {
    "primary": "#c5192d",
    "secondary": "#8b0000",
    "primaryRgb": "197, 25, 45"
  },
  "tags": [
    "fruit",
    "sacred-plant",
    "persephone",
    "hades",
    "underworld",
    "fertility",
    "death",
    "rebirth",
    "marriage",
    "seasonal-cycle"
  ],
  "properties": [
    {
      "name": "Botanical Name",
      "value": "Punica granatum"
    },
    {
      "name": "Type",
      "value": "Deciduous fruit-bearing shrub/small tree"
    },
    {
      "name": "Seeds per Fruit",
      "value": "200-1400 arils (seeds with juice sacs)"
    },
    {
      "name": "Symbolism",
      "value": "Fertility, abundance, death, rebirth, marriage, underworld binding"
    },
    {
      "name": "Color Significance",
      "value": "Deep red = blood, life force, passion, death"
    },
    {
      "name": "Crown (Calyx)",
      "value": "Six-pointed crown represents royalty, divine authority"
    }
  ],
  "uses": [
    "ritual",
    "offering",
    "consecration",
    "fertility-magic",
    "underworld-work"
  ],
  "metaphysicalProperties": {
    "element": "water",
    "energyType": "chthonic",
    "planet": "pluto",
    "chakra": "sacral",
    "world": "assiah"
  },
  "archetypes": [
    {
      "category": "underworld-journey",
      "score": 95,
      "strength": "strong",
      "role": "binding-object",
      "examples": [
        "Persephone eats six pomegranate seeds in Hades' underworld",
        "Seeds bind her to return to underworld for six months each year",
        "Eating underworld food represents acceptance of death and transformation",
        "The act creates the seasonal cycle of death and rebirth"
      ],
      "analysis": "The pomegranate is central to one of mythology's most famous underworld journeys. The seeds serve as the binding agent that ties Persephone to the realm of the dead, making them a powerful symbol of the threshold between life and death. The fruit represents the irrevocable nature of underworld experience - once you consume its essence, you are forever changed and bound to return. This mirrors shamanic initiation and psychological transformation where contact with death consciousness permanently alters one's nature. The pomegranate embodies the paradox that accepting death leads to renewed life, as Persephone's annual descent and return creates the agricultural cycle."
    },
    {
      "category": "dying-god",
      "score": 85,
      "strength": "strong",
      "role": "seasonal-symbol",
      "examples": [
        "Pomegranate's seasonal fruiting mirrors Persephone's descent/return cycle",
        "Fruit ripens in autumn when Persephone descends to underworld",
        "Seeds represent life potential preserved through death",
        "Annual cycle reflects agricultural death and rebirth"
      ],
      "analysis": "The pomegranate perfectly embodies the dying god archetype through its connection to Persephone and the seasonal cycle. The fruit's timing - ripening as autumn approaches - mirrors the goddess's annual descent to the underworld. Like grain that must be buried to sprout, the pomegranate's seeds represent life force that survives through apparent death. The fruit's hundreds of seeds within a single vessel symbolize how one sacrifice (descent, death) generates abundant new life. This mirrors dying god figures like Osiris, Dionysus, and Tammuz whose deaths ensure agricultural fertility and seasonal renewal."
    },
    {
      "category": "sacred-marriage",
      "score": 80,
      "strength": "strong",
      "role": "consummation-symbol",
      "examples": [
        "Pomegranate eating seals Persephone's marriage to Hades",
        "Fruit used in Greek and Roman wedding ceremonies",
        "Seeds symbolize fertility and conjugal union",
        "Breaking open pomegranate represents consummation"
      ],
      "analysis": "The pomegranate serves as a powerful symbol of sacred marriage, particularly the marriage between life and death, light and darkness. Persephone's consumption of the seeds represents the consummation of her marriage to Hades, binding her to him. The fruit's sexual symbolism is explicit - the act of breaking open the hard shell to release the seeds mirrors defloration, while the abundant seeds represent fertility. In Greek wedding customs, pomegranates were broken or scattered, blessing the marriage with fertility. The fruit thus represents the transformative power of sacred union to create new life from the joining of opposites."
    },
    {
      "category": "threshold",
      "score": 75,
      "strength": "strong",
      "role": "boundary-marker",
      "examples": [
        "Eating pomegranate marks point of no return in underworld",
        "Seeds represent crossing from innocence to experience",
        "Fruit mediates between life and death realms",
        "Six seeds = six months, creating temporal boundary"
      ],
      "analysis": "The pomegranate functions as a classic threshold object - consuming it marks an irreversible transition. The moment Persephone ate the seeds, she could no longer fully return to her former state of innocence. This mirrors initiation rites where consuming sacred substances marks the passage from one state of being to another. The fruit's physical properties reinforce this symbolism: the hard exterior must be breached to reach the interior seeds, representing the breaking of protective boundaries to access hidden knowledge or transformation."
    }
  ],
  "mythologyContexts": [
    {
      "mythology": "greek",
      "usage": "The pomegranate is inseparable from the myth of Persephone's abduction by Hades and the establishment of the Eleusinian Mysteries. After Hades seized Persephone and took her to the underworld, Demeter (her mother) searched everywhere, causing crops to fail. Zeus negotiated Persephone's return, but Hades had given her pomegranate seeds to eat. By consuming food from the underworld, Persephone became bound to return there. She had eaten six seeds, so she must spend six months each year in the underworld with Hades (autumn/winter) and six months above ground with Demeter (spring/summer), thus creating the seasons. Beyond this central myth, pomegranates were used in Greek wedding ceremonies as symbols of fertility and were sacred to Hera, goddess of marriage. The fruit appeared in mysteries and initiatory rites, representing hidden knowledge, sexual maturity, and the acceptance of mortality.",
      "names": [
        "Rhoia (ῥοιά)",
        "Sidē (σίδη)"
      ],
      "associatedDeities": [
        {
          "id": "persephone",
          "name": "Persephone",
          "type": "deity",
          "mythology": "greek",
          "icon": "👑"
        },
        {
          "id": "hades",
          "name": "Hades",
          "type": "deity",
          "mythology": "greek",
          "icon": "💀"
        },
        {
          "id": "demeter",
          "name": "Demeter",
          "type": "deity",
          "mythology": "greek",
          "icon": "🌾"
        },
        {
          "id": "hera",
          "name": "Hera",
          "type": "deity",
          "mythology": "greek",
          "icon": "👸"
        }
      ],
      "rituals": [
        {
          "name": "Eleusinian Mysteries",
          "description": "Pomegranates featured in secret initiatory rites celebrating Demeter and Persephone, representing death, rebirth, and revelation of hidden truths"
        },
        {
          "name": "Wedding Ceremonies",
          "description": "Brides scattered pomegranate seeds or broke pomegranates to ensure fertility. The fruit symbolized marital fidelity and abundance"
        },
        {
          "name": "Thesmophoria",
          "description": "Women's fertility festival honoring Demeter where pomegranates were offered to promote agricultural and human fertility"
        }
      ],
      "textReferences": [
        {
          "text": "Homeric Hymn to Demeter",
          "passage": "Lines 370-374, 411-413",
          "context": "Describes Persephone eating pomegranate seeds in underworld, binding her to Hades",
          "corpusUrl": "/mythos/greek/corpus-search.html?term=persephone+pomegranate"
        },
        {
          "text": "Ovid",
          "passage": "Metamorphoses 5.534-538",
          "context": "Details how Hades gave Persephone the pomegranate to bind her to underworld",
          "corpusUrl": "/mythos/greek/corpus-search.html?term=ovid+persephone"
        },
        {
          "text": "Pausanias",
          "passage": "Description of Greece 2.17.4",
          "context": "Describes pomegranate's sacred associations with underworld deities",
          "corpusUrl": "/mythos/greek/corpus-search.html?term=pausanias+pomegranate"
        }
      ],
      "symbolism": "The pomegranate's symbolism is multilayered and paradoxical. Its hundreds of seeds represent fertility, abundance, and the potential for life, yet it's the fruit of the underworld and death. The hard exterior protecting soft, vulnerable seeds symbolizes the mystery of life hidden within apparent sterility. The red color evokes both blood (death) and vitality (life). Breaking open the fruit represents revelation, loss of virginity, and the transition from innocence to experience. The six seeds Persephone ate created a perfect division between above and below, light and dark, representing the balance necessary in nature and psyche. The fruit embodies the principle that life and death are inseparable - death feeds life, and acceptance of mortality enables true living.",
      "culturalSignificance": "The Persephone-pomegranate myth was central to Greek religion, explaining the seasons and forming the foundation of the Eleusinian Mysteries - the most important mystery cult in ancient Greece. Initiates learned that death is not an ending but a transformation, and that accepting mortality brings spiritual rebirth. The myth influenced Greek attitudes toward death, agriculture, marriage, and the transition to adulthood. Pomegranates appeared extensively in Greek art, particularly in scenes of weddings, funerals, and the afterlife. The fruit's symbolism influenced later Mediterranean and Christian iconography."
    },
    {
      "mythology": "roman",
      "usage": "Romans adopted Greek reverence for pomegranates, associating the fruit with Proserpina (Persephone) and the underworld. The fruit was sacred to Juno (Hera), goddess of marriage, and used in wedding ceremonies. Roman brides wore pomegranate-adorned crowns. The fruit symbolized both marital fertility and the Roman values of fecundity and abundance.",
      "names": [
        "Malum punicum (Punic apple)",
        "Malum granatum (Seeded apple)"
      ],
      "associatedDeities": [
        {
          "id": "proserpina",
          "name": "Proserpina",
          "type": "deity",
          "mythology": "roman",
          "icon": "👑"
        },
        {
          "id": "juno",
          "name": "Juno",
          "type": "deity",
          "mythology": "roman",
          "icon": "👸"
        }
      ],
      "symbolism": "In Roman culture, the pomegranate represented the ideal of abundance, fertility, and the prosperity of Rome itself. The fruit's crown-like calyx symbolized imperial authority.",
      "culturalSignificance": "Pomegranates were cultivated throughout the Roman Empire and featured prominently in art, mosaics, and frescoes. The fruit appeared in tomb paintings, representing hope for rebirth in the afterlife."
    },
    {
      "mythology": "hebrew",
      "usage": "In Jewish tradition, pomegranates are said to contain 613 seeds, corresponding to the 613 commandments (mitzvot) in the Torah. The fruit symbolizes righteousness, knowledge, and wisdom. Pomegranates decorated the hem of the High Priest's robe and topped the pillars of Solomon's Temple. The fruit is eaten on Rosh Hashanah (Jewish New Year) with the blessing 'May we be as full of merits as the pomegranate is full of seeds.'",
      "names": [
        "Rimon (רִמּוֹן)"
      ],
      "symbolism": "The pomegranate represents the fullness of divine law, the sweetness of righteousness, and the hidden depths of Torah wisdom. The numerous seeds symbolize the unity of the Jewish people and the abundance of good deeds.",
      "culturalSignificance": "Pomegranates are one of the Seven Species blessed in the Land of Israel. The fruit appears throughout Jewish art, Torah mantles, and ceremonial objects. It remains a central symbol in Jewish culture and religious practice."
    }
  ],
  "relatedEntities": {
    "deities": [
      {
        "id": "persephone",
        "name": "Persephone",
        "type": "deity",
        "mythology": "greek",
        "icon": "👑"
      },
      {
        "id": "hades",
        "name": "Hades",
        "type": "deity",
        "mythology": "greek",
        "icon": "💀"
      },
      {
        "id": "demeter",
        "name": "Demeter",
        "type": "deity",
        "mythology": "greek",
        "icon": "🌾"
      },
      {
        "id": "hera",
        "name": "Hera",
        "type": "deity",
        "mythology": "greek",
        "icon": "👸"
      }
    ],
    "places": [
      {
        "id": "underworld",
        "name": "Underworld (Hades)",
        "type": "place",
        "mythology": "greek",
        "icon": "🌑"
      },
      {
        "id": "eleusis",
        "name": "Eleusis",
        "type": "place",
        "mythology": "greek",
        "icon": "🏛️"
      }
    ],
    "concepts": [
      {
        "id": "death-rebirth",
        "name": "Death and Rebirth",
        "type": "concept",
        "mythology": "greek",
        "icon": "🔄"
      },
      {
        "id": "seasons",
        "name": "Seasonal Cycle",
        "type": "concept",
        "mythology": "greek",
        "icon": "🍂"
      },
      {
        "id": "mysteries",
        "name": "Mystery Cults",
        "type": "concept",
        "mythology": "greek",
        "icon": "🔮"
      }
    ]
  },
  "sources": [
    {
      "text": "Homeric Hymn to Demeter",
      "passage": "Lines 370-374, 411-413",
      "mythology": "greek",
      "corpusUrl": "/mythos/greek/corpus-search.html?term=homeric+hymn+demeter"
    },
    {
      "text": "Metamorphoses",
      "author": "Ovid",
      "passage": "5.534-538",
      "mythology": "roman"
    },
    {
      "text": "Description of Greece",
      "author": "Pausanias",
      "passage": "2.17.4",
      "mythology": "greek"
    },
    {
      "text": "The Golden Bough",
      "author": "James George Frazer",
      "passage": "Chapter on Demeter and Persephone",
      "mythology": "greek"
    }
  ],
  "linguistic": {
    "originalName": "Pomegranate",
    "transliteration": "Pomegranate",
    "needsResearch": true
  },
  "geographical": {
    "region": "Greece",
    "culturalArea": "Hellenic World"
  },
  "temporal": {
    "firstAttestation": {
      "date": {
        "year": -750,
        "circa": true,
        "uncertainty": 100,
        "display": "c. 750 BCE",
        "confidence": "speculative"
      },
      "type": "literary",
      "description": "Estimated based on mythology literary tradition",
      "needsResearch": true
    },
    "historicalDate": {
      "start": {
        "year": -800,
        "circa": true,
        "uncertainty": 200,
        "display": "c. 800 BCE"
      },
      "end": {
        "year": 400,
        "circa": true,
        "uncertainty": 100,
        "display": "c. 400 CE"
      },
      "display": "800 BCE - 400 CE",
      "needsResearch": true
    }
  }
}