{
  "id": "thomas-belt",
  "type": "item",
  "name": "Belt of Thomas (Sacra Cintola)",
  "displayName": "The Belt/Girdle of Thomas",
  "icon": "T",
  "slug": "thomas-belt",
  "mythologies": [
    "christian",
    "marian",
    "medieval"
  ],
  "primaryMythology": "christian",
  "shortDescription": "The miraculous belt allegedly given by the Virgin Mary to Thomas at her Assumption - a legendary relic connecting Thomas's doubt to Marian devotion",
  "fullDescription": "The Belt of Thomas (also called the Girdle of Thomas, Sacra Cintola, or Holy Belt) is a legendary relic with roots in medieval tradition connecting the apostle Thomas to the Assumption of the Virgin Mary. According to the legend, which developed in the medieval period and became especially popular in Italy, Thomas was absent when Mary died and was assumed into heaven (mirroring his absence at Christ's resurrection appearance). When Thomas arrived, he initially doubted the other apostles' account of Mary's assumption - consistent with his character as the 'doubter.' As confirmation, Mary dropped her girdle (belt or sash) down to Thomas from heaven, providing the physical proof he characteristically required. This legend serves multiple theological functions: it rehabilitates Thomas by making his doubt serve a positive purpose (providing tangible evidence of the Assumption), it reinforces the doctrine of Mary's bodily assumption, and it connects the apostolic witness to Marian devotion. The most famous claimed relic is the Sacra Cintola (Holy Belt) venerated at the Cathedral of Prato in Tuscany, Italy, which has been housed there since approximately the 12th century. The relic is displayed five times a year from an external pulpit designed by Donatello and Michelozzo. Other churches have also claimed to possess portions of this belt. While the legend has no basis in canonical scripture or early tradition (the Assumption itself is not in the Bible but developed as church tradition), the Belt of Thomas became an important devotional object and artistic motif, particularly in Renaissance Italian art where the scene of Mary giving her belt to Thomas became a common subject.",
  "category": "marian-relic",
  "subCategory": "legendary-relic",
  "colors": {
    "primary": "#1E90FF",
    "secondary": "#FFD700",
    "primaryRgb": "30, 144, 255"
  },
  "tags": [
    "thomas",
    "belt",
    "girdle",
    "mary",
    "assumption",
    "relic",
    "sacra-cintola",
    "prato",
    "doubt",
    "marian",
    "medieval",
    "renaissance-art"
  ],
  "properties": [
    {
      "name": "Item Type",
      "value": "Marian Relic / Devotional Object"
    },
    {
      "name": "Associated Event",
      "value": "Assumption of the Virgin Mary"
    },
    {
      "name": "Primary Claimant",
      "value": "Cathedral of Prato, Tuscany, Italy"
    },
    {
      "name": "Material (claimed)",
      "value": "Green silk or wool girdle/sash"
    },
    {
      "name": "Historicity",
      "value": "Legendary - no early textual attestation"
    }
  ],
  "legend": {
    "narrative": "When the Virgin Mary died and was assumed bodily into heaven, Thomas was absent (just as he was absent at Christ's first resurrection appearance). When he arrived and heard what had happened, he characteristically doubted. As proof, Mary dropped her belt down from heaven to Thomas, providing tangible evidence of her assumption.",
    "firstAppearance": "The legend appears to have developed in the early medieval period, possibly 8th-9th century, though the Prato relic claims origins in the 1st century",
    "function": "The legend serves to: (1) Provide apostolic testimony to the Assumption, (2) Rehabilitate Thomas by making his doubt constructive, (3) Create a physical connection between earth and heaven, (4) Parallel Thomas's demand for proof of Christ's resurrection"
  },
  "pratoRelic": {
    "location": "Cathedral of Santo Stefano, Prato, Tuscany, Italy",
    "history": "According to local tradition, a merchant named Michele brought the relic from the Holy Land in 1141 after marrying a woman whose family possessed it. It was donated to the Cathedral of Prato in 1174.",
    "displayPulpit": "The relic is displayed from an external pulpit (Pulpito del Sacro Cingolo) with reliefs by Donatello and architectural design by Michelozzo (1428-1438)",
    "displayDays": [
      "Easter Sunday",
      "May 1 (Virgin Mary's Day)",
      "August 15 (Assumption)",
      "September 8 (Nativity of Mary)",
      "December 25 (Christmas)"
    ],
    "materialDescription": "The relic is described as a green woolen or silk girdle approximately 87 cm long with golden threads"
  },
  "artHistory": {
    "popularSubject": "The 'Madonna della Cintola' (Madonna of the Girdle) became a popular subject in Italian Renaissance art",
    "notableWorks": [
      {
        "title": "Madonna della Cintola",
        "artist": "Benozzo Gozzoli",
        "date": "1450-1452",
        "location": "Pinacoteca Vaticana"
      },
      {
        "title": "Assumption of the Virgin with St. Thomas Receiving the Girdle",
        "artist": "Fra Bartolomeo",
        "date": "1508",
        "location": "Galleria dell'Accademia, Florence"
      },
      {
        "title": "Madonna della Cintola",
        "artist": "Agnolo Gaddi",
        "date": "1392-1395",
        "location": "Cappella del Sacro Cingolo, Prato Cathedral"
      }
    ],
    "iconography": "Typically shows Mary in heavenly glory, surrounded by angels, dropping or handing her belt down to Thomas who stands below with upraised hands"
  },
  "theologicalConnections": {
    "thomasParallel": "Just as Thomas doubted the resurrection until given proof (John 20:24-29), he doubted the Assumption until given proof. His doubt again serves to provide evidence for those who were not present.",
    "assumptionDoctrine": "The legend supports belief in Mary's bodily assumption, later defined as dogma by Pope Pius XII in 1950 (Munificentissimus Deus)",
    "relicTheology": "The belt represents physical connection between heaven and earth, tangible proof of the supernatural"
  },
  "relatedEntities": {
    "heroes": [
      {
        "id": "thomas-apostle",
        "name": "Saint Thomas the Apostle",
        "relationship": "Recipient of the belt from Mary"
      }
    ],
    "deities": [
      {
        "id": "virgin-mary",
        "name": "Virgin Mary",
        "relationship": "Giver of the belt at her Assumption"
      }
    ],
    "places": [
      {
        "id": "prato-cathedral",
        "name": "Cathedral of Prato",
        "relationship": "Primary location of claimed relic"
      },
      {
        "id": "jerusalem",
        "name": "Jerusalem",
        "relationship": "Legendary location of the event"
      }
    ],
    "concepts": [
      {
        "id": "assumption",
        "name": "Assumption of Mary",
        "relationship": "The theological event the legend attests"
      },
      {
        "id": "doubt-and-faith",
        "name": "Doubt and Faith",
        "relationship": "Thomas's characteristic doubt leading to proof"
      }
    ]
  },
  "otherClaims": [
    {
      "location": "Homs, Syria",
      "description": "Church of Our Lady of the Holy Belt (Um al-Zinnar) claims to possess Mary's belt"
    },
    {
      "location": "Constantinople",
      "description": "Historical claim - belt allegedly kept in Chalcoprateia church"
    },
    {
      "location": "Various churches",
      "description": "Multiple churches claim fragments or related relics"
    }
  ],
  "sources": [
    {
      "title": "The Golden Legend (Legenda Aurea)",
      "author": "Jacobus de Voragine",
      "date": {
        "year": 1260,
        "circa": true,
        "display": "c. 1260"
      },
      "type": "medieval-legendary",
      "relevance": "comprehensive",
      "citation": "Chapter on the Assumption of the Virgin"
    },
    {
      "title": "Transitus Mariae literature",
      "author": "Various",
      "date": {
        "year": 500,
        "circa": true,
        "display": "c. 5th-6th century onward"
      },
      "type": "apocryphal",
      "relevance": "significant",
      "citation": "Various accounts of Mary's dormition and assumption"
    },
    {
      "title": "Prato Cathedral Archives",
      "author": "Cathedral records",
      "type": "primary",
      "relevance": "comprehensive",
      "citation": "Documentation of the Sacra Cintola"
    }
  ],
  "fullDescription": "The Belt of Thomas is a legendary relic allegedly given by the Virgin Mary to Thomas at her Assumption. According to medieval tradition, Thomas was absent when Mary was assumed into heaven, and he characteristically doubted the other apostles' account. As proof, Mary dropped her belt down to Thomas from heaven. The most famous claimed relic is at Prato Cathedral, Italy.",
  "metadata": {
    "created": "2025-12-29T00:00:00.000Z",
    "lastModified": "2025-12-29T00:00:00.000Z",
    "version": "2.0",
    "completeness": 85,
    "agent": "Agent Thomas - The Doubting Apostle",
    "agentNote": "Medieval legend that transforms Thomas's doubt into a gift - the doubter becomes the bearer of proof"
  }
}
