{
  "id": "yarrow",
  "type": "item",
  "name": "Yarrow",
  "icon": "🌿",
  "slug": "yarrow",
  "mythologies": [
    "norse",
    "germanic",
    "celtic",
    "chinese"
  ],
  "primaryMythology": "norse",
  "shortDescription": "Sacred healing herb used for wound treatment, divination, protection, and invoking courage in battle",
  "fullDescription": "Yarrow (Achillea millefolium) is one of the most magically and medicinally significant herbs in Norse and Germanic tradition, known for its powerful healing properties, protective qualities, and use in divination. The herb's name Achillea derives from the Greek hero Achilles, who used yarrow to staunch his warriors' wounds during the Trojan War, but yarrow was equally important in Northern European cultures. In Norse tradition, yarrow was associated with warriors, healing magic, and divination. The herb's ability to stop bleeding made it essential in Viking medical kits, earning names like 'soldier's woundwort' and 'bloodwort.' Yarrow was used by völvas (Norse seeresses) in divination rituals, and warriors carried it for protection and courage. The feathery leaves and sturdy stem made yarrow ideal for casting lots and reading omens. Beyond medicine and magic, yarrow had extensive use in Norse folk practices for love divination, weather magic, and blessing rituals.",
  "category": "herb",
  "subCategory": "healing-herb",
  "colors": {
    "primary": "#ffffff",
    "secondary": "#d4e6d4",
    "primaryRgb": "255, 255, 255"
  },
  "tags": [
    "herb",
    "healing",
    "medicine",
    "divination",
    "protection",
    "warrior",
    "wounds",
    "bloodwort",
    "courage",
    "völva"
  ],
  "properties": [
    {
      "name": "Botanical Name",
      "value": "Achillea millefolium"
    },
    {
      "name": "Type",
      "value": "Perennial flowering herb"
    },
    {
      "name": "Flowers",
      "value": "White, pink, or yellow flat-topped clusters"
    },
    {
      "name": "Leaves",
      "value": "Feathery, finely divided (thousand-leaf)"
    },
    {
      "name": "Primary Use",
      "value": "Styptic (stops bleeding), anti-inflammatory, fever reducer"
    },
    {
      "name": "Magical Uses",
      "value": "Divination, protection, courage, love magic, weather spells"
    },
    {
      "name": "Common Names",
      "value": "Soldier's Woundwort, Bloodwort, Thousand-Leaf, Devil's Nettle"
    }
  ],
  "uses": [
    "healing",
    "divination",
    "protection",
    "blessing",
    "courage-magic"
  ],
  "metaphysicalProperties": {
    "element": "air",
    "energyType": "vital",
    "planet": "venus",
    "chakra": "solar-plexus"
  },
  "mythologyContexts": [
    {
      "mythology": "norse",
      "usage": "Yarrow held central importance in Norse healing and magical practices. Warriors carried dried yarrow to staunch wounds on the battlefield - the herb's powerful styptic properties could save lives when far from healers. Völvas (seeresses who practiced seidr magic) used yarrow stalks for divination, casting them like runes to read patterns and divine the future. The herb was believed to enhance psychic abilities and facilitate communication with spirits. Yarrow tea was drunk before divination or ritual to sharpen inner sight. In love magic, young women placed yarrow under pillows to dream of future husbands, or used it in spells to attract love. Yarrow was also protective - hung over doorways or carried in pouches to ward off evil spirits and negative magic. The herb was associated with courage and vitality, invoking the warrior spirit.",
      "names": [
        "Röllike (Norwegian)",
        "Röllika (Swedish)",
        "Thousand-Leaf"
      ],
      "associatedDeities": [
        {
          "id": "odin",
          "name": "Odin",
          "type": "deity",
          "mythology": "norse",
          "icon": "👁️"
        },
        {
          "id": "freya",
          "name": "Freyja",
          "type": "deity",
          "mythology": "norse",
          "icon": "💎"
        }
      ],
      "rituals": [
        {
          "name": "Völva Divination",
          "description": "Yarrow stalks cast like runes or I Ching to divine the future. The pattern of fallen stalks interpreted by the seeress to answer questions or reveal hidden knowledge."
        },
        {
          "name": "Warrior's Protection",
          "description": "Dried yarrow sewn into pouches and worn by warriors for protection in battle and to ensure courage. Used immediately to treat wounds."
        },
        {
          "name": "Love Divination",
          "description": "Yarrow placed under pillow while reciting: 'Good night, fair yarrow, thrice good night to thee; I hope before tomorrow's dawn my true love I shall see.' Dreams reveal future spouse."
        },
        {
          "name": "Healing Rites",
          "description": "Fresh yarrow poultices applied to wounds, burns, and inflammations. Yarrow tea drunk to reduce fever and promote healing. Blessed by chants invoking healing powers."
        }
      ],
      "textReferences": [
        {
          "text": "Norse Folk Medicine texts",
          "context": "Multiple sources describe yarrow's use in treating battle wounds and its magical properties"
        }
      ],
      "symbolism": "Yarrow represents the warrior-healer duality central to Norse culture - the same plant that accompanies warriors to battle also heals their wounds. Its feathery leaves symbolize the delicate balance between life and death, while its sturdy stem represents resilience and courage. The plant's ability to grow in harsh conditions mirrors the Norse ideal of thriving despite hardship. Yarrow's use in divination connects it to the Norns and wyrd (fate), representing the human desire to glimpse destiny while accepting its immutable nature.",
      "culturalSignificance": "Yarrow was indispensable to Norse life, bridging medicine, magic, and warfare. The herb appeared in archaeological finds at Viking sites, confirming its practical importance. Folk traditions of using yarrow for divination and protection continued in Scandinavia through the medieval period into modern times. The plant's association with völvas connects it to Norse women's spiritual authority and shamanic practices. Yarrow's prominence in Norse culture reflects the integration of practical herbalism with magical worldview."
    },
    {
      "mythology": "germanic",
      "usage": "Germanic peoples revered yarrow for healing and protective magic. The herb was associated with weather magic - hanging yarrow could calm storms or ensure good weather. Yarrow was used in love divination and marriage charms. The plant appeared in Germanic folk medicine as 'carpenter's weed' for treating work injuries.",
      "names": [
        "Schafgarbe (German)",
        "Carpenter's Weed",
        "Field Hop"
      ],
      "symbolism": "In Germanic tradition, yarrow represents practical wisdom - the integration of healing knowledge with magical practice, and the warrior's code combining strength with care for fallen comrades.",
      "culturalSignificance": "Yarrow featured prominently in Germanic folk medicine and was cultivated in monastery gardens during the medieval period, bridging pagan and Christian herbalism."
    },
    {
      "mythology": "celtic",
      "usage": "Celtic druids used yarrow in healing and divination. The herb was associated with the fairy folk and was used to maintain good relations with them. Yarrow protected against negative magic and was thrown into bridal chambers to ensure lasting love. The Highlands of Scotland particularly valued yarrow, with specific charms for gathering it.",
      "names": [
        "Lus Chosgadh na Fola (Gaelic - Plant for Stanching Blood)",
        "Earr-Thalmainn (Irish)"
      ],
      "rituals": [
        {
          "name": "Highland Yarrow Charm",
          "description": "When gathering yarrow, recite: 'I will pluck the yarrow fair, that more benign shall be my face, that more warm shall be my lips, that more chaste shall be my speech.'"
        }
      ],
      "symbolism": "Celtic tradition emphasized yarrow's protective and beautifying properties, connecting physical healing with spiritual and social grace.",
      "culturalSignificance": "Yarrow remained important in Scottish and Irish folk medicine into the 20th century, with specific harvest rituals and medicinal preparations passed through generations."
    },
    {
      "mythology": "chinese",
      "usage": "In Chinese tradition, yarrow stalks (shi) were the original method for casting the I Ching, predating the use of coins. Fifty dried yarrow stalks were manipulated through a complex divination procedure to generate hexagrams. The plant's longevity and resilience made it ideal for this sacred purpose.",
      "names": [
        "Shi (蓍)"
      ],
      "symbolism": "Yarrow's use in I Ching divination associates it with the fundamental principles of change, wisdom, and the Tao. The plant represents the connection between heaven and earth, the microcosm and macrocosm.",
      "culturalSignificance": "Yarrow stalks remain the traditional and most respected method for consulting the I Ching, though the complex procedure takes much longer than coin method."
    }
  ],
  "relatedEntities": {
    "deities": [
      {
        "id": "odin",
        "name": "Odin",
        "type": "deity",
        "mythology": "norse",
        "icon": "👁️"
      },
      {
        "id": "freyja",
        "name": "Freyja",
        "type": "deity",
        "mythology": "norse",
        "icon": "💎"
      }
    ],
    "items": [
      {
        "id": "runes",
        "name": "Runes",
        "type": "item",
        "mythology": "norse",
        "icon": "ᚱ"
      }
    ],
    "concepts": [
      {
        "id": "seidr",
        "name": "Seidr (Norse Magic)",
        "type": "concept",
        "mythology": "norse",
        "icon": "🔮"
      },
      {
        "id": "healing",
        "name": "Healing Arts",
        "type": "concept",
        "mythology": "norse",
        "icon": "⚕️"
      },
      {
        "id": "wyrd",
        "name": "Wyrd (Fate)",
        "type": "concept",
        "mythology": "norse",
        "icon": "🕸️"
      }
    ]
  },
  "sources": [
    {
      "text": "Norse Folk Medicine and Magic",
      "author": "Various sources",
      "mythology": "norse"
    },
    {
      "text": "A Modern Herbal",
      "author": "Maude Grieve",
      "passage": "Yarrow entry",
      "mythology": "various"
    },
    {
      "text": "The Carmina Gadelica",
      "author": "Alexander Carmichael",
      "passage": "Highland yarrow charms",
      "mythology": "celtic"
    },
    {
      "text": "I Ching: The Book of Changes",
      "passage": "Traditional yarrow stalk method",
      "mythology": "chinese"
    }
  ],
  "linguistic": {
    "originalName": "Yarrow",
    "transliteration": "Yarrow",
    "needsResearch": true
  },
  "geographical": {
    "region": "Scandinavia",
    "culturalArea": "Germanic/Scandinavian"
  },
  "temporal": {
    "firstAttestation": {
      "date": {
        "year": 1200,
        "circa": true,
        "uncertainty": 100,
        "display": "c. 1200 CE",
        "confidence": "speculative"
      },
      "type": "literary",
      "description": "Estimated based on mythology literary tradition",
      "needsResearch": true
    },
    "historicalDate": {
      "start": {
        "year": -500,
        "circa": true,
        "uncertainty": 200,
        "display": "c. 500 BCE"
      },
      "end": {
        "year": 1100,
        "circa": true,
        "uncertainty": 100,
        "display": "c. 1100 CE"
      },
      "display": "500 BCE - 1100 CE",
      "needsResearch": true
    }
  }
}