[
  {
    "id": "yhwh",
    "entityType": "deity",
    "mythology": "jewish",
    "mythologies": ["jewish", "christian", "islamic"],
    "name": "YHWH - The Eternal One",
    "icon": "✡️",
    "title": "YHWH - HaShem, The Name",
    "subtitle": "The Eternal, Infinite, Ineffable God - Ein Sof",
    "shortDescription": "YHWH (the Tetragrammaton) is the singular, eternal, transcendent God of Judaism - the infinite Creator who spoke existence into being, revealed the Torah at Sinai, and enters into covenant with Israel. Beyond all limitation, gender, or form, yet intimately present in creation through divine attributes and names.",
    "longDescription": "YHWH is the ineffable Name of God revealed to Moses at the burning bush - 'I AM WHO I AM' or 'I WILL BE WHAT I WILL BE' (Ehyeh Asher Ehyeh). The four Hebrew letters יהוה (Yod-Heh-Vav-Heh) form the sacred Tetragrammaton, considered too holy to pronounce aloud. Instead, Jews say 'Adonai' (Lord) or 'HaShem' (The Name). YHWH is understood as absolutely One (Echad), without division, partner, or equal - the Ein Sof (Infinite) who transcends all human comprehension yet chooses to be known through revelation. In Kabbalah, the Tetragrammaton represents the totality of divine emanation through the ten Sefirot, the structure through which the Infinite relates to finite creation. YHWH is simultaneously transcendent (utterly beyond creation) and immanent (actively present within it), maintaining the universe through continuous creative will. The Name itself contains past, present, and future tenses of the verb 'to be,' suggesting God's eternal existence beyond time. YHWH is merciful and just, demanding righteousness while offering forgiveness, entering into covenant relationship with Abraham, Isaac, Jacob, and their descendants. The giving of Torah at Mount Sinai represents the supreme revelation of YHWH's will for human ethical and spiritual life.",
    "slug": "yhwh",
    "filePath": "",
    "status": "published",
    "visibility": "public",
    "attributes": {
      "Titles": "HaShem (The Name), Adonai (Lord), El Shaddai (God Almighty), Elohim (God/Gods - plural of majesty), Ribono shel Olam (Master of the Universe), HaKadosh Baruch Hu (The Holy One, Blessed Be He), Avinu Malkeinu (Our Father, Our King), Ein Sof (The Infinite), Ehyeh Asher Ehyeh (I Am That I Am), YHWH Tzva'ot (Lord of Hosts), Melech Malchei HaMelachim (King of Kings of Kings)",
      "Domains": "Creation, covenant, law (Torah), justice (Din), mercy (Rachamim), redemption, revelation, providence, absolute sovereignty over all existence, time, eternity",
      "Symbols": "The Tetragrammaton יהוה (never pronounced), burning bush, tablets of the Ten Commandments, Menorah, Star of David (later symbol), cloud and pillar of fire, the Name written in Hebrew letters, sacred Torah scroll",
      "SacredNumbers": "One (Echad - absolute unity), Three (patriarchs), Four (matriarchs, letters of the Name), Seven (Sabbath, completion), Ten (Sefirot, commandments), Twelve (tribes), Thirteen (divine attributes of mercy), Seventy (names of God in tradition)",
      "Colors": "White (purity, transcendence), Blue (heaven, divine presence - techelet), Gold (glory, holiness), Purple (royalty), No form or color - beyond physical attributes",
      "SacredItems": "Torah scroll, Ark of the Covenant, Holy of Holies in the Temple, phylacteries (tefillin), mezuzah, tallit (prayer shawl), shofar (ram's horn)"
    },
    "myths": [
      {
        "id": "creation-genesis",
        "title": "The Creation Through Speech",
        "summary": "YHWH creates the universe through divine speech - 'Let there be light' - bringing order from tohu va-vohu (chaos and void) in six days, resting on the seventh.",
        "fullText": "In the beginning, God (Elohim) created the heavens and the earth. The earth was tohu va-vohu (formless and void), and darkness covered the deep waters (tehom), while the Spirit of God (Ruach Elohim) hovered over the surface. Then God spoke: 'Let there be light' (Yehi Or), and light came into being. God saw that the light was good, and separated light from darkness, calling the light Day and the darkness Night. This was the first day. Over six days, YHWH spoke creation into existence - the firmament separating waters above from waters below, dry land and seas, vegetation bearing seed, sun and moon and stars to mark seasons and times, fish and birds, land animals, and finally humanity. On the sixth day, God said, 'Let Us make humanity in Our image, according to Our likeness' - creating adam (humanity) both male and female in the divine image (tzelem Elohim). YHWH blessed the seventh day and made it holy, resting from the work of creation. This establishes the pattern of Shabbat, the Sabbath rest. The creation narrative demonstrates God's absolute sovereignty, the goodness of creation, the special status of humanity as image-bearers with stewardship responsibilities, and the sacred rhythm of work and rest woven into the fabric of existence.",
        "sources": ["Torah - Genesis 1:1-2:3", "Zohar commentaries", "Midrash Rabbah on Creation"],
        "relatedEntities": ["shekhinah", "metatron", "adam", "primordial-light"]
      },
      {
        "id": "burning-bush-revelation",
        "title": "The Revelation of the Name at the Burning Bush",
        "summary": "YHWH reveals the sacred Name to Moses from a burning bush that is not consumed, commissioning him to free Israel from Egyptian bondage.",
        "fullText": "When Moses was tending his father-in-law Jethro's flock at Mount Horeb (Sinai), the Angel of YHWH appeared to him in a flame of fire from the midst of a bush. Moses saw that the bush burned with fire but was not consumed - a sign of God's eternal, self-sustaining nature. When Moses turned aside to investigate this great sight, God called to him from the bush: 'Moses, Moses!' and Moses answered, 'Here I am.' God said, 'Do not come closer. Remove your sandals, for the place where you stand is holy ground. I am the God of your father - the God of Abraham, the God of Isaac, and the God of Jacob.' Moses hid his face, afraid to look upon God. YHWH declared awareness of Israel's suffering in Egypt and intent to deliver them to a land flowing with milk and honey. When Moses asked what name he should give when the Israelites ask who sent him, God replied with the mysterious formula: 'Ehyeh Asher Ehyeh' - I AM WHO I AM, or I WILL BE WHAT I WILL BE. 'Tell them Ehyeh (I AM) has sent you.' Then God gave the sacred Name: YHWH, the God of your ancestors, has sent me to you. This is My name forever, My memorial for all generations.' This revelation established the eternal covenant name by which God would be known, a name suggesting absolute, self-existent being, unbound by time or limitation. The burning bush itself became a symbol of Israel - aflame with suffering and divine presence, yet never consumed or destroyed.",
        "sources": ["Torah - Exodus 3:1-15", "Talmud - tractate Shabbat", "Kabbalistic interpretations - Sefer ha-Bahir"],
        "relatedEntities": ["moses", "sinai", "covenant", "angel-of-yhwh"]
      },
      {
        "id": "sinai-revelation",
        "title": "The Giving of Torah at Mount Sinai",
        "summary": "YHWH descends upon Mount Sinai in fire, thunder, and smoke, speaking the Ten Commandments directly to all Israel and giving Moses the complete Torah.",
        "fullText": "Three months after the Exodus from Egypt, Israel camped before Mount Sinai. YHWH told Moses: 'You have seen what I did to Egypt, how I carried you on eagles' wings and brought you to Myself. Now if you will obey My voice and keep My covenant, you shall be My treasured possession among all peoples, for all the earth is Mine. You shall be to Me a kingdom of priests and a holy nation.' The people responded unanimously: 'All that YHWH has spoken, we will do!' On the third day, when morning came, there was thunder and lightning, a thick cloud on the mountain, and a very loud blast of the shofar (ram's horn). All the people in the camp trembled. Moses brought them out to meet God at the foot of the mountain. Mount Sinai was wrapped in smoke because YHWH descended upon it in fire. The smoke ascended like the smoke of a furnace, and the whole mountain quaked violently. The sound of the shofar grew louder and louder. Moses spoke, and God answered him in thunder. Then YHWH spoke the Ten Commandments (Aseret ha-Dibrot) directly to all the people - words of fire that entered their souls: 'I am YHWH your God who brought you out of Egypt, out of the house of slavery. You shall have no other gods before Me...' The people, overwhelmed by the direct divine voice, begged Moses to be intermediary: 'You speak to us and we will listen, but let not God speak to us lest we die.' Moses ascended the mountain, entering the thick darkness where God was, and received the complete Torah - written and oral teachings that would guide Israel's life. He remained forty days and nights, receiving the tablets of stone inscribed by the finger of God. This revelation at Sinai established the eternal covenant between YHWH and Israel, the foundation of Jewish law, ethics, and spiritual practice. According to tradition, not only those present but all Jewish souls - past, future, and unborn - stood at Sinai and accepted the Torah.",
        "sources": ["Torah - Exodus 19-24", "Talmud - Tractate Shabbat 88a-89a", "Pirkei Avot", "Midrash on the Giving of Torah"],
        "relatedEntities": ["moses", "torah", "ten-commandments", "sinai", "covenant"]
      }
    ],
    "relationships": {
      "family": {
        "parents": [],
        "siblings": [],
        "consorts": ["In monotheistic Judaism, YHWH has no consort, though Shekhinah represents the feminine divine presence. In ancient Israelite folk religion, some worshipped Asherah as consort, but this was rejected by prophetic Judaism."],
        "children": ["Israel (metaphorically - 'Israel is My firstborn son' - Exodus 4:22)", "No literal divine children in strict monotheism, though angels serve as divine messengers"]
      },
      "connections": [
        {
          "entityId": "shekhinah",
          "relationship": "Divine feminine presence, immanent aspect of YHWH dwelling with Israel",
          "mythology": "jewish"
        },
        {
          "entityId": "metatron",
          "relationship": "Greatest archangel, 'Lesser YHWH,' scribe of heavenly records",
          "mythology": "jewish"
        },
        {
          "entityId": "michael",
          "relationship": "Archangel, prince and protector of Israel",
          "mythology": "jewish"
        },
        {
          "entityId": "gabriel",
          "relationship": "Archangel, divine messenger of revelation and judgment",
          "mythology": "jewish"
        }
      ]
    },
    "worship": {
      "sacredSites": "The Temple in Jerusalem (First Temple built by Solomon, Second Temple rebuilt after Babylonian exile, destroyed 70 CE) - particularly the Holy of Holies (Kodesh HaKodashim) where the Ark of the Covenant rested and the High Priest entered once yearly on Yom Kippur. After the Temple's destruction, synagogues became houses of prayer and study. The Western Wall (Kotel) in Jerusalem remains the holiest accessible site. Mount Sinai (traditional location in the Sinai Peninsula), Cave of Machpelah in Hebron (tomb of the patriarchs and matriarchs), Rachel's Tomb near Bethlehem.",
      "festivals": [
        {
          "name": "Shabbat",
          "description": "The weekly Sabbath from Friday sunset to Saturday nightfall, commemorating God's rest after creation and the Exodus from Egypt. A taste of the World to Come, devoted to prayer, study, festive meals, and cessation from creative work.",
          "frequency": "weekly",
          "significance": "Observing Shabbat affirms YHWH as Creator and Redeemer"
        },
        {
          "name": "Rosh Hashanah",
          "description": "Jewish New Year, Day of Judgment when YHWH sits on the throne of judgment and all humanity passes before the divine gaze. The shofar is blown to awaken souls to repentance.",
          "frequency": "annual - 1st of Tishrei",
          "significance": "Recognition of YHWH as King and Judge, beginning Ten Days of Repentance"
        },
        {
          "name": "Yom Kippur",
          "description": "Day of Atonement, the holiest day of the Jewish year. A complete fast, devoted to repentance, prayer, and reconciliation with God and fellow humans. In Temple times, the High Priest entered the Holy of Holies and pronounced the Tetragrammaton.",
          "frequency": "annual - 10th of Tishrei",
          "significance": "Divine forgiveness, spiritual purification, renewal of covenant relationship"
        },
        {
          "name": "Passover (Pesach)",
          "description": "Celebration of the Exodus from Egypt when YHWH redeemed Israel from slavery, passing over Israelite homes marked with lamb's blood during the tenth plague.",
          "frequency": "annual - 15-22 Nisan",
          "significance": "YHWH as Redeemer, liberation from oppression, birth of the Jewish nation"
        },
        {
          "name": "Shavuot",
          "description": "Festival of Weeks, celebrating the giving of Torah at Mount Sinai. Study of Torah through the night, reading of the Ten Commandments.",
          "frequency": "annual - 6th of Sivan (50 days after Passover)",
          "significance": "Receiving divine revelation, accepting the covenant, Torah as gift"
        }
      ],
      "offerings": "In Temple times: daily burnt offerings (tamid), grain offerings (mincha), peace offerings (shelamim), sin offerings (chatat), guilt offerings (asham), incense (ketoret) burned twice daily. First fruits (bikkurim), tithes. After the Temple's destruction, prayer replaced sacrifice: 'the offering of our lips' (prayer), acts of loving-kindness (chesed), Torah study, and repentance became the primary forms of worship.",
      "prayers": "The Shema: 'Hear O Israel, YHWH is our God, YHWH is One' - central declaration of monotheistic faith recited twice daily. The Amidah (Standing Prayer) - eighteen benedictions praising YHWH, petitioning for needs, and offering thanks, recited three times daily facing Jerusalem. Kaddish - Aramaic prayer sanctifying God's Name. Modeh Ani - morning prayer thanking God for restoring the soul. Aleinu - prayer acknowledging YHWH's sovereignty over all creation. The Psalms - 150 poetic prayers attributed primarily to King David, expressing the full range of human relationship with God: praise, petition, lament, thanksgiving, trust.",
      "rituals": ["Daily prayer (Shacharit, Mincha, Maariv)", "Torah study", "Observance of 613 commandments (mitzvot)", "Circumcision (brit milah) on eighth day for males", "Bar/Bat Mitzvah coming-of-age rituals", "Marriage under chuppah (wedding canopy)", "Burial and mourning practices", "Ritual immersion in mikvah", "Blessing over bread and wine", "Lighting Sabbath and festival candles"]
    },
    "powers": [
      "Absolute creation ex nihilo (from nothing) through divine speech",
      "Omnipotence - unlimited power over all existence",
      "Omniscience - complete knowledge of past, present, future, and all possibilities",
      "Omnipresence - present everywhere simultaneously while remaining transcendent",
      "Providence - sustaining and guiding all creation continuously",
      "Miracles - suspension or alteration of natural law (splitting Red Sea, manna from heaven, etc.)",
      "Judgment - absolute moral authority, rewarding righteousness and punishing wickedness",
      "Mercy and forgiveness - capacity to pardon sin and restore relationship",
      "Revelation - communicating divine will through prophets, Torah, and direct experience",
      "Covenant-making - entering into binding relationships with humanity",
      "Eternity - existing beyond time, without beginning or end",
      "Unity - absolute indivisible oneness (Echad), unlike any created thing"
    ],
    "epithets": [
      "HaShem (The Name)",
      "Adonai (My Lord)",
      "El Shaddai (God Almighty)",
      "Elohim (God)",
      "YHWH Tzva'ot (Lord of Hosts)",
      "Avinu Malkeinu (Our Father, Our King)",
      "HaKadosh Baruch Hu (The Holy One, Blessed Be He)",
      "Ribono shel Olam (Master of the Universe)",
      "Ein Sof (The Infinite)",
      "HaRachaman (The Merciful One)",
      "Dayan HaEmet (Judge of Truth)",
      "Tzur Yisrael (Rock of Israel)",
      "Go'el Yisrael (Redeemer of Israel)",
      "Ro'eh Yisrael (Shepherd of Israel)",
      "Melech Malchei HaMelachim (Supreme King of Kings)"
    ],
    "searchTerms": ["yhwh", "hashem", "adonai", "god", "jewish", "hebrew", "tetragrammaton", "ein sof", "elohim", "creator", "covenant", "torah", "monotheism"],
    "tags": ["deity", "supreme-god", "creator", "covenant", "monotheism", "transcendent", "revelation"],
    "categories": ["deity", "supreme-being", "creator-god"],
    "relatedDeities": [
      {"name": "Shekhinah", "relationship": "Divine feminine presence"},
      {"name": "Metatron", "relationship": "Greatest angel"},
      {"name": "Michael", "relationship": "Archangel protector"},
      {"name": "Gabriel", "relationship": "Archangel messenger"}
    ],
    "sources": [
      {"title": "Torah (Five Books of Moses)", "type": "primary scripture"},
      {"title": "Tanakh (Hebrew Bible)", "type": "primary scripture"},
      {"title": "Talmud (Babylonian and Jerusalem)", "type": "rabbinic commentary"},
      {"title": "Zohar", "type": "kabbalistic text"},
      {"title": "Mishneh Torah (Maimonides)", "type": "legal code and philosophy"},
      {"title": "Sefer Yetzirah", "type": "early kabbalistic text"},
      {"title": "Guide for the Perplexed (Maimonides)", "type": "philosophical treatise"}
    ],
    "allowUserEdits": true,
    "allowUserContent": true,
    "moderationRequired": true,
    "timeperiod": {
      "era": "Eternal - revelation from Bronze Age to present",
      "startDate": "Before time - revelation circa 1300-1200 BCE at Sinai",
      "endDate": "Eternal - continuously worshipped",
      "modernRelevance": true
    },
    "geography": {
      "regions": ["Ancient Canaan/Israel", "Middle East", "Worldwide Jewish diaspora"],
      "modernCountries": ["Israel", "Worldwide - every nation with Jewish communities"],
      "climate": "Originally Mediterranean; now global"
    },
    "cultural": {
      "cultures": ["Ancient Israelite", "Jewish (Ashkenazi, Sephardi, Mizrahi, etc.)", "Influenced Christianity and Islam"],
      "languages": ["Biblical Hebrew", "Aramaic", "Modern Hebrew", "Yiddish", "Ladino"],
      "practices": ["Torah study", "Prayer", "Mitzvot observance", "Shabbat", "Festivals", "Ethical monotheism"]
    }
  },
  {
    "id": "shekhinah",
    "entityType": "deity",
    "mythology": "jewish",
    "mythologies": ["jewish", "kabbalah"],
    "name": "Shekhinah - The Divine Presence",
    "icon": "🕊️",
    "title": "Shekhinah - HaShechinah",
    "subtitle": "The Indwelling Presence, Bride of God, Mother of Creation",
    "shortDescription": "The Shekhinah is the feminine aspect of the Divine, the immanent presence of YHWH dwelling with and within creation, especially with the people of Israel. She is God's nearness made tangible - the cloud of glory, the presence in the Temple, the comfort in exile.",
    "longDescription": "The Shekhinah (from the Hebrew root sh-kh-n meaning 'to dwell') represents the indwelling, immanent presence of God in the world. While YHWH transcends all creation, the Shekhinah is the divine presence that dwells with humanity - in the Tabernacle, the Temple, and wherever holiness is found. In rabbinic literature, the Shekhinah rested between the cherubim on the Ark of the Covenant, appeared as the pillar of cloud and fire that guided Israel, and filled the Temple with radiant glory. In Kabbalistic tradition, the Shekhinah is identified with the tenth Sefirah, Malkhut (Kingdom), the feminine divine principle that receives the flow of divine emanation from the higher Sefirot and transmits it to the created worlds. She is understood as the Bride of the Holy One Blessed Be He, whose union with the masculine aspect of divinity (Tiferet, represented by the letter Vav in the Tetragrammaton) creates harmony and blessing in the cosmos. When Israel sinned or was exiled, the Shekhinah was said to go into exile with them - the divine presence sharing in their suffering and wandering. The reunion of the Shekhinah with her divine spouse represents the ultimate redemption and restoration of cosmic harmony. She is associated with the Sabbath Queen who descends each Friday evening, with the feminine wisdom (Chokhmah) of Proverbs, and with the Community of Israel (Knesset Yisrael) as the collective soul of the Jewish people. Every righteous deed helps reunite the Shekhinah with the Holy One, while every sin creates further separation and exile.",
    "slug": "shekhinah",
    "filePath": "",
    "status": "published",
    "visibility": "public",
    "attributes": {
      "Titles": "HaShechinah (The [Divine] Presence), Matronita (The Matron - Aramaic), Sabbath Queen (Shabbat HaMalkah), Bride of God (Kallah), Mother (Ima), Kneset Yisrael (Community of Israel), Malkhut (Kingdom - the tenth Sefirah), Bat Kol (Daughter of the Voice - echo of prophecy)",
      "Domains": "Divine immanence, indwelling presence, glory (Kavod), comfort in exile, blessing, Sabbath, prophecy, Torah, feminine wisdom, receptivity, kingdom, earth",
      "Symbols": "Dove (peace and presence), cloud of glory (Anan HaKavod), pillar of fire, radiant light, wings (sheltering protection), rose, moon (reflecting divine light), Sabbath candles, veil, bride's canopy",
      "SacredAnimals": "Dove (symbol of peace and gentle presence), hen gathering chicks (maternal protection)",
      "SacredPlants": "Rose (Song of Songs: 'I am the rose of Sharon'), myrtle (used in bridal processions and Sukkot), lily",
      "Colors": "White (purity, Sabbath garments), Blue (techelet - divine presence), Silver (moon, reflection), Purple (royalty), Gold (divine glory)"
    },
    "myths": [
      {
        "id": "temple-presence",
        "title": "The Shekhinah in the Temple",
        "summary": "When Solomon completed the First Temple, the Shekhinah descended as a cloud so thick the priests could not stand to minister, filling the House of YHWH with glory.",
        "fullText": "When Solomon finished building the Temple in Jerusalem and brought the Ark of the Covenant into the Holy of Holies, placing it beneath the wings of the golden cherubim, the Shekhinah descended in visible form. A cloud filled the House of YHWH, and the glory (Kavod) was so intense that the priests could not stand to perform their service. Solomon declared: 'YHWH has said He would dwell in thick darkness. I have built You an exalted house, a place for You to dwell forever.' The Shekhinah's presence between the cherubim on the Ark's mercy seat (Kapporet) was the most holy place on earth, where heaven and earth met. Once each year, on Yom Kippur, the High Priest would enter this sacred space and encounter the direct presence of God. The Shekhinah remained in the Temple as long as Israel was faithful, but as the prophets warned, when the people turned to idolatry and injustice, the divine presence began to withdraw. The prophet Ezekiel saw visions of the Shekhinah's reluctant departure from the Temple, moving from the Holy of Holies to the threshold, then to the eastern gate, and finally to the Mount of Olives, departing eastward with deep sorrow before the Babylonian destruction. According to tradition, when the Second Temple was built, five elements of the First Temple's glory were missing, among them the Ark of the Covenant and the fullness of the Shekhinah's manifest presence. Yet still the divine presence dwelt there in diminished form until the Roman destruction in 70 CE. The rabbis taught that even after the Temple's destruction, the Shekhinah never fully departed from the Western Wall.",
        "sources": ["Tanakh - 1 Kings 8:10-13", "Ezekiel 10-11", "Talmud - Tractate Sotah 9a", "Zohar on the Temple"],
        "relatedEntities": ["temple-jerusalem", "ark-covenant", "solomon", "ezekiel"]
      },
      {
        "id": "exile-with-israel",
        "title": "The Shekhinah in Exile",
        "summary": "When Israel was exiled from their land, the Shekhinah went with them into exile, sharing their suffering and wandering, never abandoning her people.",
        "fullText": "The ancient rabbis taught one of the most poignant doctrines of Jewish theology: that the Shekhinah, the divine presence, went into exile (galut) with the Jewish people. When the First Temple was destroyed and the people were taken captive to Babylon, the Shekhinah did not remain in the heavens but accompanied her children into exile and suffering. A midrash states: 'Come and see how beloved Israel is before the Holy One. In every place to which they were exiled, the Shekhinah went with them. They were exiled to Egypt - the Shekhinah was with them. They were exiled to Babylon - the Shekhinah was with them. They were exiled to Edom (Rome) - the Shekhinah was with them. And when they will be redeemed in the future, the Shekhinah will be redeemed with them.' This teaching means that God's presence directly experiences the pain of exile, persecution, and suffering alongside the Jewish people. The Shekhinah weeps when her children weep, wanders when they wander, and longs for redemption when they long for it. In Kabbalistic thought, this exile represents a cosmic fracture - the separation of the Shekhinah (the feminine, receptive, manifest aspect of divinity) from the Holy One Blessed Be He (the masculine, giving, transcendent aspect). This separation occurred due to human sin and the shattering of cosmic harmony. Every mitzvah (commandment) performed with intention helps reunite the separated divine aspects, bringing closer the ultimate redemption when the Shekhinah will return from exile and be reunited with her divine spouse in perfect unity. The Friday evening Sabbath ritual symbolically enacts this reunion: the Shekhinah descends as the Sabbath Queen, and for twenty-five hours, harmony is restored. The task of Israel is to make every day Shabbat - to restore cosmic unity through righteousness.",
        "sources": ["Talmud - Megillah 29a", "Midrash on Lamentations", "Zohar - portions on exile and redemption", "Lecha Dodi (Sabbath hymn)"],
        "relatedEntities": ["exile-babylon", "exile-roman", "redemption", "shabbat"]
      },
      {
        "id": "sabbath-queen",
        "title": "The Shekhinah as Sabbath Queen",
        "summary": "Each Friday at sunset, the Shekhinah descends as the Sabbath Queen, bringing peace, holiness, and an additional soul (neshamah yeteirah) to those who welcome her.",
        "fullText": "The Kabbalists of Safed in the 16th century developed the beautiful tradition of greeting the Shekhinah as the Sabbath Queen (Shabbat HaMalkah) each Friday evening. The hymn 'Lecha Dodi' (Come, My Beloved), composed by Rabbi Shlomo Alkabetz, invites the divine masculine aspect to 'go forth to greet the bride, to welcome the Sabbath presence.' Jewish communities would dress in white and go out into the fields at sunset, turning to the west to welcome the descending Shekhinah with song and dance. Upon returning to the synagogue, they would turn and bow as the Sabbath Queen entered. This ritual enacts the sacred marriage (hieros gamos) between the Holy One and the Shekhinah - a cosmic reunion that occurs every seventh day. When the Sabbath Queen arrives, she brings with her the neshamah yeteirah, an 'additional soul' that grants enhanced spiritual perception, joy, and peace for the duration of Shabbat. The home becomes a sanctuary, the Sabbath table an altar. Two candles are lit - representing the two forms of the Sabbath commandment ('Remember' and 'Observe') and also symbolizing the two divine aspects coming together. The woman of the household traditionally lights these candles, welcoming the Shekhinah into the home with a blessing and covering her eyes - a moment of mystical communion with the divine feminine. Kiddush (sanctification over wine) and Hamotzi (blessing over challah bread) further honor the Sabbath Queen's presence. During the Sabbath, the Shekhinah spreads her wings of protection over Israel, and the world experiences a taste of the World to Come (Olam HaBa) - the ultimate redemption when the Shekhinah will be permanently reunited with the Holy One. When Shabbat ends with the Havdalah ceremony, there is sadness at the Queen's departure, yet hope that through righteous living, the permanent Sabbath of redemption will come.",
        "sources": ["Talmud - Beitzah 16a (neshamah yeteirah)", "Lecha Dodi hymn", "Zohar on Sabbath", "Shabbat liturgy and customs"],
        "relatedEntities": ["shabbat", "sabbath-observance", "kiddush", "neshamah-yeteirah"]
      }
    ],
    "relationships": {
      "family": {
        "parents": ["Understood as an aspect or emanation of YHWH, not a separate being with separate parents"],
        "siblings": [],
        "consorts": ["The Holy One Blessed Be He (HaKadosh Baruch Hu) - the masculine aspect of divinity, represented by the upper Sefirot, especially Tiferet"],
        "children": ["The souls of Israel (metaphorically - she is called Mother)", "The righteous who are born through divine wisdom"]
      },
      "connections": [
        {
          "entityId": "yhwh",
          "relationship": "The immanent, feminine aspect of YHWH's presence in creation",
          "mythology": "jewish"
        },
        {
          "entityId": "metatron",
          "relationship": "Works alongside Metatron in governing the lower worlds and transmitting divine will",
          "mythology": "jewish"
        }
      ]
    },
    "worship": {
      "sacredSites": "Wherever holiness dwells: the Western Wall in Jerusalem (where the Shekhinah is said to never depart), synagogues (especially during communal prayer), houses of Torah study (Batei Midrash), any place where righteous people gather, the Sabbath table in Jewish homes, places of Jewish suffering (the Shekhinah is present even in exile)",
      "festivals": [
        {
          "name": "Shabbat",
          "description": "The weekly Sabbath is the primary celebration of the Shekhinah as the Sabbath Queen. Special songs, rituals, and the lighting of candles welcome her presence.",
          "frequency": "weekly",
          "significance": "Reunion of divine masculine and feminine, foretaste of ultimate redemption"
        },
        {
          "name": "Rosh Chodesh",
          "description": "The New Moon festival, traditionally associated with women and the feminine divine presence, celebrating renewal and the lunar cycle.",
          "frequency": "monthly",
          "significance": "Feminine time-marker, women's spiritual celebration"
        }
      ],
      "offerings": "The Shekhinah is honored through: lighting Sabbath candles (women's mitzvah connecting to divine feminine), acts of loving-kindness and justice (which 'repair' the separation), Torah study (the Shekhinah rests among those who study), prayer in community (the Shekhinah dwells among a minyan of ten), welcoming guests (hospitality), caring for the poor and oppressed (the Shekhinah suffers with them), marital intimacy on Shabbat (reflecting divine union), beautifying mitzvot (hiddur mitzvah)",
      "prayers": "Lecha Dodi - 'Come, my beloved, to greet the bride, let us welcome the Sabbath presence.' Blessing for lighting Sabbath candles: 'Blessed are You, YHWH our God, Sovereign of the universe, who has sanctified us with commandments and commanded us to kindle the Sabbath lights.' Psalm 45 and Song of Songs are read as allegories of the relationship between the Holy One and the Shekhinah. Kabbalistic meditations on the unity of the Tetragrammaton, visualizing the letters coming together in perfect union.",
      "rituals": ["Lighting Sabbath candles", "Kabbalat Shabbat (welcoming Sabbath) service", "Kiddush sanctification", "Havdalah (farewell to Sabbath)", "Kabbalistic meditations on divine unity", "Tikkun Chatzot (midnight lamentation for the exile of the Shekhinah)", "Study of mystical texts", "Acts of tikkun olam (repairing the world)"]
    },
    "powers": [
      "Indwelling presence - ability to be fully present within creation while maintaining connection to transcendence",
      "Shekinah's light - visible manifestation of divine glory (Kavod)",
      "Prophecy and inspiration - the Bat Kol (Daughter of the Voice) that speaks to the righteous",
      "Protection and sheltering - wings of the Shekhinah provide refuge",
      "Blessing and sanctification - wherever she rests becomes holy",
      "Empathy and compassion - experiences and shares in human suffering",
      "Receptivity - receives divine emanation from higher Sefirot and transmits to lower worlds",
      "Unification - her reunion with the masculine divine creates cosmic harmony and blessing",
      "Indwelling in the righteous - rests upon those who pursue holiness",
      "Sabbath transformation - brings the neshamah yeteirah and enhanced spiritual perception"
    ],
    "epithets": [
      "HaShechinah (The Divine Presence)",
      "Shabbat HaMalkah (Sabbath Queen)",
      "Kallah (The Bride)",
      "Matronita (The Matron)",
      "Malkhut (Kingdom)",
      "Knesset Yisrael (Community of Israel)",
      "Bat Kol (Daughter of the Voice)",
      "Ima (Mother)",
      "Atarah (Crown)",
      "Rachel (weeping mother)"
    ],
    "searchTerms": ["shekhinah", "shekinah", "divine presence", "feminine divine", "sabbath queen", "jewish goddess", "kabbalah", "malkhut", "bride of god"],
    "tags": ["deity", "divine-feminine", "presence", "kabbalah", "sabbath", "immanence"],
    "categories": ["deity", "divine-aspect", "kabbalistic-entity"],
    "relatedDeities": [
      {"name": "YHWH", "relationship": "Feminine immanent aspect of"},
      {"name": "Metatron", "relationship": "Works alongside in lower worlds"}
    ],
    "sources": [
      {"title": "Talmud (Bavli and Yerushalmi)", "type": "rabbinic literature"},
      {"title": "Zohar", "type": "primary kabbalistic text"},
      {"title": "Sefer ha-Bahir", "type": "early kabbalistic text"},
      {"title": "Writings of Isaac Luria (Arizal)", "type": "Lurianic Kabbalah"},
      {"title": "Lecha Dodi", "type": "liturgical hymn"},
      {"title": "Midrash Rabbah", "type": "rabbinic commentary"}
    ],
    "allowUserEdits": true,
    "allowUserContent": true,
    "moderationRequired": true
  },
  {
    "id": "metatron",
    "entityType": "deity",
    "mythology": "jewish",
    "mythologies": ["jewish", "kabbalah", "merkavah-mysticism"],
    "name": "Metatron - Prince of the Divine Presence",
    "icon": "👼",
    "title": "Metatron - The Lesser YHWH",
    "subtitle": "Angel of the Presence, Scribe of Heaven, Prince of the Countenance",
    "shortDescription": "Metatron is the highest of all angels, the celestial scribe who records all deeds in the heavenly books, and according to mystical tradition, the transformed human Enoch who ascended to become the Lesser YHWH. He sits enthroned next to God's glory and bears a name derived from the Divine Name itself.",
    "longDescription": "Metatron stands at the pinnacle of the angelic hierarchy in Jewish mysticism, bearing the title 'Lesser YHWH' (YHWH ha-Katan) because he carries God's Name within him and possesses delegated divine authority over all creation. According to 3 Enoch and other Merkavah (Chariot mysticism) texts, Metatron was originally the righteous antediluvian patriarch Enoch who 'walked with God, and he was not, for God took him' (Genesis 5:24). God transformed Enoch's flesh into fire, gave him seventy-two wings and innumerable eyes, expanded his body to cosmic proportions matching the world's dimensions, and crowned him with a magnificent diadem inscribed with the letters by which heaven and earth were created. His name 'Metatron' has been variously interpreted: from Greek 'meta-thronos' (near the throne/after the throne), from Hebrew 'matar' (guard/keeper), or as an encoded mystical formula. He serves as the celestial scribe, recording every human deed in the heavenly books from which souls are judged. He is the intermediary par excellence, standing before the Divine Throne, transmitting prayers upward and blessings downward. In Kabbalistic teaching, Metatron is associated with the Sefirah of Keter (Crown) or sometimes with Tiferet (Beauty), serving as the direct channel of divine will into creation. He governs the realm just below the highest heaven, commanding legions of angels. He taught Moses the secrets of Torah during the forty days on Mount Sinai, serves as the guardian angel of Israel, and will be the guide of souls in the messianic age. His name contains 314, the same gematria (numerical value) as Shaddai (Almighty), one of God's names. Some texts speak of Metatron as having a twin or counterpart, Sandalphon, who stands at the opposite end of the cosmic ladder.",
    "slug": "metatron",
    "filePath": "",
    "status": "published",
    "visibility": "public",
    "attributes": {
      "Titles": "YHWH ha-Katan (The Lesser YHWH), Sar ha-Panim (Prince of the Divine Presence), Sar ha-Olam (Prince of the World), The Great Scribe, Youth (Na'ar - mysteriously called despite vast age and power), Angel of the Covenant, Angel of the Lord (in some interpretations), The Measure of the Body (Shi'ur Komah), Chancellor of Heaven",
      "Domains": "Divine intermediary, heavenly scribe, guardian of divine secrets, transmitter of Torah, heavenly prince, judge of souls, cosmic order, mystical knowledge, transformation, bridge between human and divine",
      "Symbols": "Flaming quill and heavenly book, crown inscribed with divine letters, seventy-two wings, innumerable eyes, throne next to the Divine Throne, measuring rod for celestial dimensions, seal of God",
      "SacredNumbers": "Seventy-two (wings and names of God), 314 (gematria of Metatron = Shaddai), Thirteen (letters in his name in Hebrew), Seven (heavens through which he ascended)",
      "Colors": "White and gold (divine radiance), Blue (heavenly realm), Fire (transformation of Enoch), Purple (royalty and princely status)"
    },
    "myths": [
      {
        "id": "enoch-transformation",
        "title": "The Transformation of Enoch into Metatron",
        "summary": "The righteous Enoch walked with God for 365 years, then was taken to heaven and transformed into the archangel Metatron through a process of cosmic apotheosis.",
        "fullText": "According to the book of 3 Enoch (Sefer Hekhalot), Enoch the seventh from Adam was the most righteous man of his generation. He walked with God for 365 years - corresponding to the solar year, hinting at cosmic significance. When humanity's wickedness increased before the Flood, God said, 'I will take My righteous servant from among them, lest he be corrupted.' The Shekinah descended with her retinue of angels and, riding on the wings of the Spirit, brought Enoch to the highest heaven, Aravot, where the Divine Throne resides. Upon arrival, the Holy One commanded the archangels Michael, Gabriel, Uriel, and Raphael: 'Go and take Enoch from his earthly garment and anoint him with My goodly oil, and put upon him the clothes of My glory.' They stripped him of his mortal flesh and clothed him in fire. His body expanded to immense proportions - matching the breadth of the world. Seventy-two wings sprouted from his back - corresponding to the seventy-two names of God. Innumerable eyes opened across his form - each seeing throughout creation. His flesh became divine fire, his sinews became flames, his bones glowing coals, his eyes torches. Lightning flashed from his eyelids. God set upon his head a magnificent keter (crown) inscribed with the letters by which the heavens and earth were created - the same letters engraved on the crown of YHWH Himself. Then the Holy One called him by a new name: Metatron, and said, 'I have called you Youth (Na'ar), because you are the youngest of all the angels in height and age' - a mysterious paradox, since Metatron had become the greatest of angels. God declared: 'I have made him overseer and prince over all the princes of My kingdoms and over all the children of heaven, except the eight great princes, the honored and revered ones who are called YHWH by the name of their King.' Finally, God wrote with His finger and gave to Metatron the sacred knowledge of all that was, is, and will be - making him the heavenly scribe. Thus Enoch, who was mortal, became Metatron, the Lesser YHWH, seated on a throne at the entrance to the seventh heaven, second in authority only to God Himself.",
        "sources": ["3 Enoch (Sefer Hekhalot)", "Genesis 5:24", "Hebrews 11:5", "Zohar references to Metatron"],
        "relatedEntities": ["enoch", "divine-throne", "merkavah", "heavenly-ascent"]
      },
      {
        "id": "heavenly-scribe",
        "title": "Metatron as the Heavenly Scribe",
        "summary": "Metatron sits before the Divine Throne with quill of fire and book of remembrance, recording every deed of humanity for the Day of Judgment.",
        "fullText": "One of Metatron's primary functions is serving as the Heavenly Scribe (Safra d'Raḥamana - Scribe of the Merciful One). In the celestial court, Metatron sits - a privilege granted to no other angel - with a book of remembrance open before him and a quill of divine fire in his hand. This book contains the record of every human thought, word, and deed since creation. When a person performs a mitzvah (commandment), Metatron inscribes it with letters of white fire. When they commit a sin, he writes with black fire. These records determine a person's fate on the Day of Judgment. During the Ten Days of Repentance between Rosh Hashanah and Yom Kippur, Metatron presents these books before the Divine Throne. However, sincere repentance (teshuvah) has the power to transform the black letters into white - the scribe must erase and rewrite. A famous Talmudic story tells of Rabbi Ishmael's mystical ascent to heaven (following in Enoch's footsteps). When he arrived at the highest palace, he encountered Metatron, who said, 'I am Enoch, son of Jared. When the generation of the Flood sinned, the Holy One took me up to be a witness against them, and here I write down all the deeds of humanity.' Rabbi Ishmael asked, 'How long is the quill you write with?' Metatron answered, 'Three thousand parasangs.' 'And the book?' 'Two thousand five hundred parasangs.' Rabbi Ishmael marveled: 'How can you write so swiftly?' Metatron replied, 'The Holy One opens my understanding. In the same instant that a deed is performed on earth, it is inscribed in heaven.' This teaching emphasizes divine omniscience and the eternal significance of every moral choice. Metatron's role as scribe connects earthly action with heavenly consequence, maintaining the cosmic ledger of justice and mercy. He also records the Torah itself - according to some traditions, the Torah that Moses received was actually transcribed by Metatron from the primordial Torah that existed before creation, written in black fire on white fire before the Divine Throne.",
        "sources": ["Talmud - Hagigah 15a", "3 Enoch", "Zohar - various passages", "Merkavah mystical texts"],
        "relatedEntities": ["book-of-life", "judgment", "rosh-hashanah", "repentance"]
      },
      {
        "id": "moses-teacher",
        "title": "Metatron as Teacher of Moses",
        "summary": "During Moses' forty days on Mount Sinai, Metatron taught him the secrets of Torah, the mystical knowledge, and the heavenly paths that cannot be transmitted in earthly words.",
        "fullText": "When Moses ascended Mount Sinai to receive the Torah, he entered not only the cloud and fire but the very heavens themselves. According to mystical tradition, Moses spent forty days and forty nights being instructed by Metatron in the deepest mysteries of Torah. While the Holy One Blessed Be He gave the Written Torah (commandments and narratives) directly to Moses, Metatron taught the Oral Torah and the esoteric secrets (sod) that would be revealed only to the righteous in future generations. Metatron showed Moses the heavenly Temple, the exact pattern which the earthly Tabernacle and later the Temple in Jerusalem would follow. He revealed the secrets of the divine chariot (Merkavah), the angelic hierarchies, the structure of the heavens, and the hidden names of God. He taught the mystical meanings of the letters of the Hebrew alphabet, each one a creative force used in forming the cosmos. He explained the Sefirot - the ten emanations through which the Infinite (Ein Sof) relates to finite creation. Some traditions say Metatron placed his own hand over Moses' hand as Moses inscribed the Torah scroll, guiding the formation of each sacred letter. This is why the Torah is called 'the Torah of YHWH' even though Moses wrote it - because it was transmitted through Metatron, who bears the divine Name. When angels protested Moses receiving Torah, arguing that divine secrets should not be given to mortals, Metatron defended Moses, saying, 'This one is different - he has made himself humble like an angel and pure like the day of creation. He is worthy to learn the mysteries.' After the forty days, when Moses descended from the mountain, his face shone with such radiance that he had to veil it - a reflection of having been in the presence of Metatron's divine fire and the Shekinah's glory. In later generations, mystics who practiced Merkavah meditation sought to replicate Moses' ascent, hoping to encounter Metatron and learn the same celestial secrets. The tradition teaches that in the World to Come, Metatron will again serve as teacher, instructing the righteous in the infinite depths of Torah that could not be fully revealed in this world.",
        "sources": ["Exodus 24-34", "3 Enoch", "Talmud - Shabbat 88b-89a", "Zohar - Exodus portions", "Sefer ha-Bahir"],
        "relatedEntities": ["moses", "sinai", "torah", "oral-torah", "merkavah-mysticism"]
      }
    ],
    "relationships": {
      "family": {
        "parents": ["Originally: Jared (father) and unnamed mother as the human Enoch", "After transformation: considered 'born' from divine transformation, no angelic parents"],
        "siblings": ["As Enoch: had brothers and sisters in the line from Adam", "As Metatron: Sandalphon sometimes called his twin or counterpart"],
        "consorts": ["None - angels in mainstream Jewish tradition do not marry or procreate"],
        "children": ["None in literal sense", "Spiritually: all mystics and prophets who he teaches"]
      },
      "connections": [
        {
          "entityId": "yhwh",
          "relationship": "The Lesser YHWH, bearing delegated divine authority and the Divine Name",
          "mythology": "jewish"
        },
        {
          "entityId": "shekhinah",
          "relationship": "Serves before the Shekhinah, transmitting her presence and light to lower realms",
          "mythology": "jewish"
        },
        {
          "entityId": "michael",
          "relationship": "Fellow archangel, though Metatron holds higher rank as Prince of Princes",
          "mythology": "jewish"
        },
        {
          "entityId": "gabriel",
          "relationship": "Fellow archangel serving under Metatron's overall authority",
          "mythology": "jewish"
        }
      ]
    },
    "worship": {
      "sacredSites": "Not worshipped in the sense of prayer directed to him (as this would violate monotheism), but invoked in mystical practices. Sites associated with mystical study and Merkavah meditation: ancient rabbinic academies, Kabbalistic centers in Safed, places where mystics practiced heavenly ascent meditations. Mount Sinai (where he taught Moses). Places of intense Torah study (where he is said to be present).",
      "festivals": [],
      "offerings": "Not offered sacrifices or physical offerings. Honored through: deep Torah study (which draws his presence), mystical meditation, ethical perfection (which adds to the positive side of his heavenly ledger), acts of righteousness, preservation of divine secrets, transmission of oral Torah",
      "prayers": "Traditional Jewish prayer is directed only to God, never to angels. However, in mystical practices and some liturgical poems (piyyutim), Metatron is invoked as intermediary: 'Metatron, Prince of the Presence, who stands before the Inner Throne, may you present our prayers before the Holy One Blessed Be He, may you advocate for us in the heavenly court, may you inscribe our deeds in white fire in the book of life.' In Merkavah mysticism, specific incantations and divine names were used to encounter Metatron during heavenly ascent journeys. Some versions of the Bedtime Shema include angelic names as protective forces, sometimes including Metatron.",
      "rituals": ["Merkavah meditation and heavenly ascent practices", "Deep Torah study (especially mystical portions)", "Recitation of divine names", "Visualization of the divine chariot and throne", "Study of Shi'ur Komah (measurement of divine body) texts", "Ethical purification before mystical practices"]
    },
    "powers": [
      "Bearing the Divine Name - delegated authority to act in God's name",
      "Cosmic scribe - recording all deeds in the heavenly books",
      "Prince of the World - authority over angelic hierarchies and natural order",
      "Transmitter of Torah and divine wisdom",
      "Transformation power - ability to elevate human souls to angelic status",
      "Advocacy - presenting prayers and merits before the Divine Throne",
      "Omniscience of earthly events - sees all that occurs in creation through innumerable eyes",
      "Intermediary between transcendent God and immanent creation",
      "Teacher of mystical secrets and hidden knowledge",
      "Guardian of Israel - protecting the Jewish people",
      "Judgment - participating in the heavenly court",
      "Cosmic measurement - maintaining divine order and proportion in creation"
    ],
    "epithets": [
      "YHWH ha-Katan (Lesser YHWH)",
      "Sar ha-Panim (Prince of the Divine Presence)",
      "Sar ha-Olam (Prince of the World)",
      "The Great Scribe",
      "The Youth (Na'ar)",
      "Prince of the Torah",
      "Angel of the Covenant",
      "Chancellor of Heaven",
      "The Servant (Eved)",
      "Prince of Princes"
    ],
    "searchTerms": ["metatron", "enoch", "archangel", "lesser yhwh", "heavenly scribe", "prince of presence", "jewish angel", "kabbalah", "merkavah"],
    "tags": ["deity", "archangel", "scribe", "intermediary", "mysticism", "transformation", "enoch"],
    "categories": ["deity", "archangel", "mystical-being"],
    "relatedDeities": [
      {"name": "YHWH", "relationship": "Lesser YHWH bearing divine authority"},
      {"name": "Shekhinah", "relationship": "Serves before divine presence"},
      {"name": "Michael", "relationship": "Fellow archangel"},
      {"name": "Gabriel", "relationship": "Fellow archangel"}
    ],
    "sources": [
      {"title": "3 Enoch (Sefer Hekhalot)", "type": "mystical text"},
      {"title": "Talmud Bavli - Hagigah, Sanhedrin", "type": "rabbinic literature"},
      {"title": "Zohar", "type": "kabbalistic text"},
      {"title": "Sefer Raziel HaMalakh", "type": "mystical grimoire"},
      {"title": "Genesis 5:24", "type": "biblical reference"},
      {"title": "Shi'ur Komah texts", "type": "mystical measurements"}
    ],
    "allowUserEdits": true,
    "allowUserContent": true,
    "moderationRequired": true
  },
  {
    "id": "michael",
    "entityType": "deity",
    "mythology": "jewish",
    "mythologies": ["jewish", "christian", "islamic"],
    "name": "Michael - Prince of Israel",
    "icon": "⚔️",
    "title": "Michael - Mikha'el",
    "subtitle": "Who is Like God? Defender of Israel, Heavenly High Priest",
    "shortDescription": "Michael (Mikha'el) is the great archangel and heavenly prince who serves as protector and advocate of Israel. His name means 'Who is like God?' - a rhetorical question affirming God's incomparability. He is the angel of mercy, the heavenly high priest, and the defender of the righteous.",
    "longDescription": "Michael (Hebrew: מיכאל Mikha'el, 'Who is like God?') stands as one of the greatest archangels in Jewish tradition, identified explicitly in the book of Daniel as 'the great prince who stands guard over the children of your people.' His name itself is a theological statement - a rhetorical question declaring that nothing and no one can compare to YHWH. In the celestial hierarchy, Michael serves as the heavenly patron and protector of Israel, defending the Jewish people against both earthly and spiritual threats. He is the angel of mercy (as opposed to Gabriel, the angel of judgment), always seeking to defend humanity and advocate for compassion. According to rabbinic tradition, Michael served as one of the three angels who visited Abraham to announce Isaac's birth, specifically bringing the good news. He rescued Abraham from Nimrod's furnace. He prevented Isaac from being sacrificed by appearing to Abraham (or in some versions, helping the ram get caught in the thicket). He wrestled with Jacob at the Jabbok river (though some traditions assign this to Samael or another angel). He served as the spiritual force behind Moses in the struggle against the magicians of Egypt. In the desert, Michael was the prince of fire within the pillar of fire that guided Israel by night. On Mount Sinai, Michael served at God's right hand during the giving of Torah. He argued in heaven for Moses' right to receive the celestial secrets, defending him against angelic opposition. When Moses died, Michael was tasked with preparing his burial place, and according to the Testament of Moses, Michael disputed with Satan over Moses' body. In the heavenly Temple, Michael serves as the High Priest, offering the souls of the righteous as incense before the Divine Throne. In the apocalyptic tradition, Michael will blow the great shofar to announce the resurrection of the dead and will lead the forces of heaven against evil in the final days. He is described as standing at the right hand of the Divine Throne, clothed in garments of light, wielding a flaming sword.",
    "slug": "michael",
    "filePath": "",
    "status": "published",
    "visibility": "public",
    "attributes": {
      "Titles": "Sar Yisrael (Prince of Israel), HaGadol (The Great One), Cohen Gadol (High Priest - in heavenly Temple), Angel of Mercy, Defender of Israel, Right Hand of the Throne, Prince of the First Heaven",
      "Domains": "Protection of Israel, mercy and compassion, advocacy for humanity, heavenly priesthood, warfare against evil, resurrection of the dead, burial of the righteous, fire, divine judgment tempered with mercy",
      "Symbols": "Flaming sword, scales of justice (weighing souls), shofar (ram's horn for resurrection), priestly garments, shield emblazoned with cross or star, banner of Israel, white and blue robes",
      "SacredAnimals": "None specifically, though associated with the lion as symbol of strength and courage",
      "Colors": "White (purity and priestly garments), Blue (divine mercy and Israel), Gold (heavenly glory), Red (fire and protective power)"
    },
    "myths": [
      {
        "id": "binding-of-isaac",
        "title": "Michael at the Binding of Isaac",
        "summary": "When Abraham raised the knife to sacrifice Isaac in obedience to God's command, Michael intervened to stay his hand and provided the ram caught in the thicket.",
        "fullText": "According to rabbinic midrash, when Abraham bound his son Isaac on the altar at Mount Moriah in ultimate obedience to God's command, the angels wept. The heavens trembled at the sight of a father willing to sacrifice his beloved son. At the crucial moment when Abraham raised the knife, Michael the archangel - the angel of mercy - could not bear to watch the innocent suffer. He cried out from heaven: 'Abraham! Abraham!' and Abraham answered, 'Here I am.' Michael said, 'Do not lay your hand on the boy or do anything to him, for now I know that you fear God, seeing you have not withheld your son, your only son, from Him.' Some versions say Michael physically stayed Abraham's hand, holding back the knife. Then Michael drew Abraham's attention to the ram caught by its horns in a thicket behind them - a ram that had been prepared since the six days of creation for this precise moment. As Abraham sacrificed the ram in Isaac's place, Michael gathered the ashes and brought them before the Divine Throne as an eternal memorial of Abraham's faithfulness and Isaac's willingness. These 'ashes of Isaac' are invoked in Jewish prayer as merit for Israel: even though Isaac was not actually sacrificed, his willingness is counted as if he had been offered. From that day forward, Michael became the special protector of Isaac and all his descendants - the people of Israel. The place was called 'YHWH Yireh' (The LORD will provide/see), and became the future site of the Temple in Jerusalem, where Michael serves as heavenly High Priest offering the prayers and souls of Israel before God. The story demonstrates Michael's role as defender of the innocent and advocate of mercy, even while honoring righteous obedience. Some mystical commentaries suggest that Michael's intervention represents the divine attribute of Mercy (Rachamim) overruling the divine attribute of Justice (Din) at the crucial moment - a pattern that recurs throughout Israel's history whenever the people stand on the brink of destruction.",
        "sources": ["Torah - Genesis 22", "Midrash Rabbah on Genesis", "Pirkei d'Rabbi Eliezer", "Talmud - tractate Ta'anit"],
        "relatedEntities": ["abraham", "isaac", "binding-of-isaac", "temple-mount", "mercy"]
      },
      {
        "id": "dispute-over-moses",
        "title": "Michael's Dispute with Satan over Moses' Body",
        "summary": "When Moses died, Michael was tasked with burying him, but Satan appeared claiming Moses' body belonged to him because Moses had killed the Egyptian. Michael defended Moses' righteousness.",
        "fullText": "According to the Testament of Moses and rabbinic tradition, when Moses died on Mount Nebo after viewing the Promised Land, God commanded the archangel Michael to take Moses' body and bury it in a secret location where no human would find it and turn it into an idolatrous shrine. Michael descended with a company of angels to perform this sacred duty. However, Satan (the Accuser) appeared and challenged Michael's right to handle Moses' body. Satan argued: 'This man is a murderer. He killed the Egyptian overseer in Egypt and hid his body in the sand. According to the law, a murderer's body belongs to me, the angel of death, not to you, the angel of mercy.' Michael, being the angel of mercy and gentleness, did not respond with his own authority but said, 'The Lord rebuke you, Satan! This is not for me to judge, but for the Lord.' This phrase - 'The Lord rebuke you' - became a powerful formula in Jewish (and later Christian) tradition for countering demonic accusations. God then directly intervened, rebuking Satan and affirming that Moses' killing of the Egyptian was justified - it was righteous indignation against oppression, not murder. Moses had turned from Egyptian royalty to identify with his suffering people, and God accounted this as merit, not sin. Michael then buried Moses in a valley in the land of Moab, opposite Beth-peor, but no one knows his burial place to this day - because Michael concealed it to prevent idolatry. Some traditions say Michael did not merely bury Moses but took his soul with extraordinary gentleness. While other souls are extracted with difficulty, Moses' soul departed 'by the kiss of God' (according to one tradition) or was gently drawn forth by Michael. The dispute over Moses' body represents the cosmic struggle between accusation and advocacy, between justice that condemns and mercy that defends. Michael's role as defender of Moses extends to his role as defender of all Israel - standing against the Accuser in the heavenly court, presenting Israel's merits rather than their sins, advocating for mercy and redemption rather than strict judgment.",
        "sources": ["Deuteronomy 34:5-6", "Testament of Moses", "Jude 1:9 (New Testament reference)", "Midrash on Moses' death"],
        "relatedEntities": ["moses", "satan", "death-of-moses", "advocacy", "burial"]
      },
      {
        "id": "heavenly-high-priest",
        "title": "Michael as Heavenly High Priest",
        "summary": "In the celestial Temple, Michael serves as High Priest, offering the souls of the righteous as incense and presenting Israel's prayers before the Divine Throne.",
        "fullText": "Jewish mystical tradition teaches that there exists a heavenly Temple corresponding to the earthly Temple in Jerusalem - and just as the earthly Temple had a High Priest offering sacrifices, the heavenly Temple has Michael serving in that exalted role. Each day, as the earthly priests (in Temple times) offered the morning and evening sacrifices, Michael simultaneously performed corresponding services in heaven. But his offerings were not the blood of bulls or sheep - rather, he offered the souls of the righteous who had died in sanctification of God's Name (Kiddush HaShem), the prayers of Israel ascending like incense, and the merits of the patriarchs and matriarchs. The Talmud teaches that Michael stands at the right hand of the Divine Throne as High Priest, clothed in garments of light that correspond to the eight garments of the earthly High Priest: the breastplate, ephod, robe, tunic, turban, sash, and undergarments - each one radiant with celestial fire. On his breastplate are inscribed not the names of the twelve tribes as on Aaron's breastplate, but the secret names of God by which he advocates for Israel. When a righteous person dies, their soul is received by Michael, who purifies it and brings it before the Divine Presence. He prepares a place for it in Gan Eden (Paradise), the Garden of Eden where righteous souls await resurrection. On Rosh Hashanah and Yom Kippur, when all humanity stands in judgment, Michael serves as the defending attorney (kategor l'tov), presenting arguments for mercy and highlighting every mitzvah and good deed, while Satan serves as prosecuting attorney listing sins and failures. The scales of justice are held in Michael's hands - one side weighed with merits, the other with transgressions. His advocacy has saved Israel from destruction countless times throughout history. When the earthly Temple was destroyed in 70 CE and sacrifices ceased, the rabbis taught that Michael's service continues uninterrupted in the heavenly Temple - and thus the cosmic order is maintained even in exile. When the Temple is rebuilt in the messianic age, the earthly service will once again mirror the heavenly, and Michael will rejoice. Some mystics practiced visualizations of ascending to the heavenly Temple and encountering Michael in his priestly service, learning from him the deeper mysteries of divine worship and the proper intentions (kavvanot) for prayer.",
        "sources": ["Talmud - Chagigah 12b, Menachot 110a", "Zohar on heavenly Temple", "Revelation 8:3-4 (Christian text reflecting Jewish tradition)", "Merkavah mystical texts"],
        "relatedEntities": ["heavenly-temple", "high-priest", "prayer", "souls-of-righteous", "yom-kippur"]
      }
    ],
    "relationships": {
      "family": {
        "parents": ["Created by God, no parents in biological sense"],
        "siblings": ["Gabriel, Raphael, and Uriel are the other great archangels, sometimes called his brothers"],
        "consorts": ["None - angels do not marry in Jewish tradition"],
        "children": ["None"]
      },
      "connections": [
        {
          "entityId": "yhwh",
          "relationship": "Archangel serving at God's right hand, defender of divine mercy",
          "mythology": "jewish"
        },
        {
          "entityId": "metatron",
          "relationship": "Serves under Metatron's overall authority as Prince of Princes",
          "mythology": "jewish"
        },
        {
          "entityId": "gabriel",
          "relationship": "Brother archangel, counterpart - Michael represents mercy, Gabriel represents judgment",
          "mythology": "jewish"
        }
      ]
    },
    "worship": {
      "sacredSites": "Not worshipped directly (as this would violate monotheism), but invoked for protection. Associated with sites of deliverance and protection: the Western Wall in Jerusalem, places where Israel was saved from destruction, synagogues (especially on High Holy Days when his advocacy is needed), Mount Sinai",
      "festivals": [
        {
          "name": "Rosh Hashanah and Yom Kippur",
          "description": "Michael's role as heavenly advocate is especially invoked during the High Holy Days when all stand in judgment",
          "frequency": "annual",
          "significance": "Michael presents Israel's merits in the heavenly court"
        }
      ],
      "offerings": "Not given physical offerings, but honored through: acts of mercy and compassion (emulating his nature), defense of the oppressed, prayers for protection of Israel, righteous deeds that add weight to the side of merit in his heavenly scales",
      "prayers": "In the Bedtime Shema: 'In the name of YHWH, God of Israel: May Michael be at my right hand, Gabriel at my left, Uriel before me, Raphael behind me, and above my head the Shekhinah of God.' This prayer invokes angelic protection through the night. On Rosh Hashanah: 'May Michael, prince of mercy and prince of Israel, advocate for us before the Holy One Blessed Be He.' Prayers are directed to God but invoke Michael's advocacy.",
      "rituals": ["Recitation of protective prayers invoking angelic names", "Bedtime Shema with four archangels", "Appeals for mercy during judgment days", "Memorial prayers for the dead (Michael receives righteous souls)"]
    },
    "powers": [
      "Protection of Israel - defending the Jewish people from physical and spiritual threats",
      "Advocacy in heavenly court - presenting merits and arguing for mercy",
      "Heavenly priesthood - offering souls and prayers before God",
      "Warfare against evil - battling demonic forces and the Accuser",
      "Resurrection of the dead - will blow the great shofar to awaken the dead",
      "Receiving righteous souls - escorting the deceased to Paradise",
      "Mercy and compassion - tempering divine judgment with love",
      "Protection of the innocent - defending those who cannot defend themselves",
      "Fire - associated with the pillar of fire and divine protection through flames"
    ],
    "epithets": [
      "Mikha'el (Who is Like God?)",
      "Sar Yisrael (Prince of Israel)",
      "Cohen Gadol (High Priest)",
      "Angel of Mercy",
      "Defender of Israel",
      "Great Prince",
      "Right Hand of the Throne"
    ],
    "searchTerms": ["michael", "archangel", "prince of israel", "defender", "angel of mercy", "mikha'el", "jewish angel", "protection"],
    "tags": ["deity", "archangel", "protector", "mercy", "advocacy", "israel"],
    "categories": ["deity", "archangel", "protective-being"],
    "relatedDeities": [
      {"name": "YHWH", "relationship": "Archangel serving God"},
      {"name": "Metatron", "relationship": "Serves under as fellow archangel"},
      {"name": "Gabriel", "relationship": "Brother archangel, counterpart"}
    ],
    "sources": [
      {"title": "Book of Daniel 10:13, 10:21, 12:1", "type": "biblical text"},
      {"title": "Talmud Bavli - various tractates", "type": "rabbinic literature"},
      {"title": "Testament of Moses", "type": "apocryphal text"},
      {"title": "Midrash Rabbah", "type": "rabbinic commentary"},
      {"title": "Zohar", "type": "kabbalistic text"},
      {"title": "Pirkei d'Rabbi Eliezer", "type": "midrashic work"}
    ],
    "allowUserEdits": true,
    "allowUserContent": true,
    "moderationRequired": true
  },
  {
    "id": "gabriel",
    "entityType": "deity",
    "mythology": "jewish",
    "mythologies": ["jewish", "christian", "islamic"],
    "name": "Gabriel - God is My Strength",
    "icon": "📯",
    "title": "Gabriel - Gavri'el",
    "subtitle": "God is My Strength - Angel of Revelation and Judgment",
    "shortDescription": "Gabriel (Gavri'el) is the archangel of strength, revelation, judgment, and divine communication. His name means 'God is my strength.' He delivers God's most important messages, executes divine judgment, and will blow the great shofar to announce redemption.",
    "longDescription": "Gabriel (Hebrew: גבריאל Gavri'el, 'God is my strength' or 'Mighty one of God') stands as one of the four great archangels, the angel of revelation and divine judgment. Where Michael represents mercy, Gabriel represents strength and justice - the firm hand of God executing divine decrees. In the book of Daniel, Gabriel appears to interpret visions and prophecies, explaining the meaning of apocalyptic symbolism and announcing the timeline of redemption. Gabriel stands at God's left hand (while Michael stands at the right), positioned as the executor of divine will. According to Jewish tradition, Gabriel has appeared at crucial moments throughout history to deliver divine messages and execute judgments. He was one of the three angels who visited Abraham, specifically tasked with destroying Sodom and Gomorrah - executing judgment on the wicked cities while Michael brought good news and Raphael healed. He cast Abraham into Nimrod's furnace but then descended to cool the flames and save him, demonstrating that divine strength protects the righteous while destroying the wicked. Gabriel taught Joseph the seventy languages of humanity during a single night, preparing him to rule Egypt. He stood between the Egyptian army and Israel at the Red Sea, as the pillar of cloud and darkness to Egypt but light to Israel. He struck the Egyptian firstborn sons during the tenth plague, executing God's judgment. Some traditions say Gabriel was the 'man' who wrestled with Jacob at Jabbok, testing the patriarch's strength. In Daniel's visions, Gabriel appears 'with the appearance of a man' to explain the meaning of symbolic beasts and timelines, revealing when redemption would come. Gabriel is also the angel of fire, associated with divine judgment that purifies through burning. He destroyed Sodom with fire from heaven. When the Temple was destroyed, it was Gabriel who took coals from beneath the cherubim and scattered them over Jerusalem as it burned - executing the judgment that the people's sins had earned. Yet even in judgment, the purpose is ultimately redemptive. In messianic prophecy, Gabriel will blow the great shofar that announces the resurrection of the dead and the ingathering of exiles - using his mighty strength not to destroy but to proclaim ultimate redemption.",
    "slug": "gabriel",
    "filePath": "",
    "status": "published",
    "visibility": "public",
    "attributes": {
      "Titles": "Angel of Revelation, Angel of Judgment, Mighty One of God, The Strong One, The Herald, Left Hand of God, Prince of Fire, Interpreter of Visions, The Messenger",
      "Domains": "Divine revelation, prophecy and visions, strength and might, judgment and justice, fire, destruction of wickedness, protection through strength, interpretation of mysteries, announcements of redemption, execution of divine decrees",
      "Symbols": "Great shofar (ram's horn), trumpet, flaming sword, scroll of prophecy, lily (in Christian tradition, adapted from Jewish imagery), fire from heaven, scales of judgment",
      "SacredAnimals": "Lion (representing strength and judgment)",
      "Colors": "Red (fire and judgment), Gold (divine glory), White (purity of justice), Blue (heavenly origin)"
    },
    "myths": [
      {
        "id": "sodom-destruction",
        "title": "Gabriel's Destruction of Sodom and Gomorrah",
        "summary": "Gabriel was sent with two other angels to Abraham; while Michael announced Isaac's birth and Raphael healed Abraham, Gabriel was tasked with executing judgment on Sodom and Gomorrah.",
        "fullText": "According to rabbinic interpretation of Genesis 18-19, three angels appeared to Abraham in the plains of Mamre in the guise of travelers. Abraham, who embodied hospitality, rushed to provide them water, bread, and a feast. These three were Michael, Gabriel, and Raphael - each with a specific mission, for as the rabbis teach, one angel performs only one task. Michael brought the announcement that Sarah would bear Isaac. Raphael came to heal Abraham from his recent circumcision. Gabriel was tasked with the most terrible mission: the destruction of Sodom and Gomorrah, cities so wicked that their injustice had reached heaven. After delivering their messages to Abraham, Michael departed, having completed his task. Raphael and Gabriel continued toward Sodom. At the city gates, they encountered Lot, Abraham's nephew, who like his uncle practiced hospitality in a city that despised it. Lot insisted they stay in his house, protecting them when the men of Sodom surrounded his dwelling demanding to abuse the strangers - a violation of the most sacred law of hospitality. That night, Gabriel revealed to Lot that the city would be destroyed at dawn: 'Flee for your life! Do not look back, and do not stop anywhere in the valley. Flee to the hills, lest you be swept away!' As the sun rose, Gabriel stretched forth his hand and rained fire and brimstone from heaven upon Sodom and Gomorrah. The cities burned with divine fire that cannot be quenched by water - the fire of judgment that consumes wickedness. Lot's wife, contrary to the angelic command, looked back with longing for the wicked city she was leaving, and Gabriel transformed her into a pillar of salt - a monument to the danger of attachment to evil. The destruction was total, the smoke ascending like the smoke of a furnace, visible to Abraham who watched from afar. Yet even in this terrible judgment, mercy was present: Lot and his daughters were saved because of Abraham's merit and Lot's hospitality. The rabbis teach that Gabriel did not act with cruelty but with righteousness - removing a cancer from the earth, executing divine justice against those who oppressed the poor, violated travelers, and institutionalized injustice. The fire that destroyed Sodom was the same fire that would later appear on Mount Sinai giving Torah - for God's strength is expressed both in judgment against wickedness and in revelation of righteousness.",
        "sources": ["Torah - Genesis 18-19", "Midrash Rabbah on Genesis", "Talmud - Bava Metzia 86b", "Targum Jonathan"],
        "relatedEntities": ["abraham", "lot", "sodom", "judgment", "hospitality"]
      },
      {
        "id": "daniel-visions",
        "title": "Gabriel Interprets Daniel's Visions",
        "summary": "Gabriel appeared to the prophet Daniel to interpret apocalyptic visions, explaining the meaning of symbolic beasts and revealing the timeline of redemption, including the seventy weeks prophecy.",
        "fullText": "In the first year of Belshazzar king of Babylon, the prophet Daniel received terrifying visions of four great beasts rising from the sea - symbolizing successive world empires that would oppress Israel. Troubled by what he had seen, Daniel sought understanding. As he pondered the vision, he saw 'one having the appearance of a man' approaching. A voice called out: 'Gabriel, make this man understand the vision!' Gabriel came near to where Daniel stood, and Daniel fell on his face in terror at the angelic presence. Gabriel touched him and said, 'Understand, son of man, that the vision refers to the time of the end.' He then explained the meaning of the beasts: the kingdoms that would rise and fall, culminating in the kingdom of God that would never be destroyed. Years later, as Daniel was praying and confessing the sins of his people, pleading for Jerusalem's restoration, Gabriel appeared again 'in swift flight' at the time of the evening offering. Gabriel said, 'Daniel, I have now come to give you insight and understanding. As soon as you began to pray, a word went out, and I have come to tell it to you, for you are greatly loved. Consider the word and understand the vision.' Gabriel then delivered one of the most mysterious and debated prophecies in Scripture: the prophecy of the seventy weeks (or seventy sevens). 'Seventy weeks are decreed about your people and your holy city, to finish the transgression, to put an end to sin, to atone for iniquity, to bring in everlasting righteousness, to seal both vision and prophet, and to anoint a most holy place.' He detailed how these weeks would unfold: from the decree to rebuild Jerusalem to the coming of an anointed one, through times of rebuilding and times of trouble, to the ultimate establishment of righteousness. Gabriel's revelations to Daniel became foundational for Jewish (and later Christian) eschatology - the understanding of end times, resurrection, judgment, and redemption. The tradition teaches that Gabriel serves as the interpreter of divine mysteries, making known to prophets what God wills to reveal. His name - 'God is my strength' - means that he delivers these messages with divine authority and power. No force can prevent Gabriel from delivering God's word or executing God's decrees. He appears 'in swift flight' because divine purposes are not delayed. Through Gabriel, God communicates not just comfort but also difficult truths - the judgments that must come before redemption, the trials that precede triumph, the necessity of righteousness for the kingdom of God to be established.",
        "sources": ["Book of Daniel 8:15-27, 9:20-27", "Rabbinic commentaries on Daniel", "Medieval Jewish apocalyptic literature"],
        "relatedEntities": ["daniel", "prophecy", "apocalyptic-visions", "redemption", "seventy-weeks"]
      },
      {
        "id": "great-shofar",
        "title": "Gabriel and the Great Shofar of Redemption",
        "summary": "In the messianic age, Gabriel will blow the great shofar to announce the resurrection of the dead and the ingathering of exiles - the ultimate redemption of Israel and all righteous souls.",
        "fullText": "Jewish eschatology teaches that the final redemption will be announced by the sound of a great shofar (ram's horn) blown by the archangel Gabriel. This tradition is rooted in Isaiah's prophecy: 'In that day a great shofar will be blown, and those who were lost in the land of Assyria and those who were driven out to the land of Egypt will come and worship YHWH on the holy mountain at Jerusalem' (Isaiah 27:13). The great shofar (shofar gadol) is distinct from the shofar blown on Rosh Hashanah and Yom Kippur, which are ordinary ram's horns calling individuals to repentance and announcing yearly judgment. The great shofar is the cosmic trumpet that will sound once in all of history, announcing the final redemption and transformation of reality itself. According to tradition, this shofar was prepared at creation, held in reserve until the appointed time. When that moment comes - known only to God - Gabriel will place the shofar to his lips and blow with all the strength for which he is named. The sound will be heard from one end of the earth to the other, penetrating even to the depths of Sheol where the dead rest. At the sound of the great shofar, three miracles will occur simultaneously: First, the dead will awaken for resurrection (techiyat ha-metim). The bodies of the righteous will be reconstituted from the luz bone (a small bone at the base of the spine, believed indestructible) and their souls will return to them. They will rise from their graves and ascend to the Land of Israel. Second, the exiled Jews scattered among the nations will hear the shofar and begin the great ingathering (kibbutz galuyot). From the four corners of the earth, they will stream toward Jerusalem, guided by divine power. The prophecy says they will come 'one by one' - meaning each individual will be personally redeemed, none forgotten. Third, the Temple will be rebuilt - according to some, descending from heaven already complete; according to others, built by human hands inspired with divine wisdom, or constructed by the Messiah himself. The great shofar's sound is described as both terrifying and comforting: terrifying to the wicked who must face judgment, comforting to the righteous who inherit eternal life. Gabriel, who has throughout history executed judgment and delivered difficult prophecies, will in this final act announce not destruction but ultimate redemption. The angel of strength will use his might not to destroy but to gather; not to scatter but to unify; not to end but to begin the World to Come (Olam HaBa). In the daily Amidah prayer, Jews recite: 'Sound the great shofar for our freedom, raise the banner to gather our exiles, and gather us together from the four corners of the earth.' This is both a prayer to God and an invocation of Gabriel's future role - a calling forth of the redemption that is promised.",
        "sources": ["Isaiah 27:13", "Daily Amidah prayer", "Talmud - Rosh Hashanah 11b", "Maimonides - Mishneh Torah, Laws of Kings", "Apocalyptic midrashim"],
        "relatedEntities": ["resurrection", "messiah", "ingathering-exiles", "world-to-come", "redemption"]
      }
    ],
    "relationships": {
      "family": {
        "parents": ["Created by God, no biological parents"],
        "siblings": ["Michael, Raphael, Uriel - fellow archangels"],
        "consorts": ["None"],
        "children": ["None"]
      },
      "connections": [
        {
          "entityId": "yhwh",
          "relationship": "Archangel serving at God's left hand, executor of divine judgment and will",
          "mythology": "jewish"
        },
        {
          "entityId": "michael",
          "relationship": "Brother archangel, counterpart - Gabriel represents judgment/strength, Michael represents mercy",
          "mythology": "jewish"
        },
        {
          "entityId": "metatron",
          "relationship": "Serves under Metatron as Prince of Princes",
          "mythology": "jewish"
        }
      ]
    },
    "worship": {
      "sacredSites": "Not worshipped but invoked at sites associated with divine revelation: Mount Sinai (where Torah was given), places where prophets received visions, synagogues (especially during times when divine messages are sought)",
      "festivals": [
        {
          "name": "Rosh Hashanah",
          "description": "The shofar blown on Rosh Hashanah is understood as a echo or foretaste of the great shofar Gabriel will blow at redemption",
          "frequency": "annual",
          "significance": "Awakening to repentance, anticipating final redemption"
        }
      ],
      "offerings": "Not given physical offerings, but honored through: seeking divine revelation through Torah study, listening to prophetic messages, accepting divine judgment with humility, blowing the shofar with intention, longing for and praying for redemption",
      "prayers": "In the Bedtime Shema: 'May Gabriel be at my left hand' - invoking strength and protection through the night. In the Amidah: 'Sound the great shofar for our freedom' - invoking Gabriel's future role. Prayers for understanding visions and dreams.",
      "rituals": ["Blowing the shofar on Rosh Hashanah and Yom Kippur", "Bedtime Shema with four archangels", "Study of prophetic texts", "Prayers for redemption"]
    },
    "powers": [
      "Divine revelation - delivering and interpreting God's messages and visions",
      "Prophecy interpretation - explaining symbolic visions and mysteries",
      "Judgment execution - carrying out divine decrees of destruction",
      "Fire - commanding fire from heaven, associated with purifying and consuming fire",
      "Strength and might - supernatural power to accomplish any divine mission",
      "Swift flight - instantaneous travel to deliver urgent messages",
      "Language - teaching Joseph the seventy languages in one night",
      "Protection through strength - defending the righteous by destroying their enemies",
      "Blowing the great shofar - announcing resurrection and redemption",
      "Revelation of timelines - disclosing when prophetic events will occur"
    ],
    "epithets": [
      "Gavri'el (God is My Strength)",
      "The Mighty One of God",
      "Angel of Revelation",
      "Angel of Judgment",
      "The Herald",
      "Left Hand of God",
      "Prince of Fire",
      "The Interpreter"
    ],
    "searchTerms": ["gabriel", "archangel", "revelation", "judgment", "strength", "gavri'el", "jewish angel", "shofar", "prophecy"],
    "tags": ["deity", "archangel", "revelation", "judgment", "strength", "prophecy"],
    "categories": ["deity", "archangel", "messenger-being"],
    "relatedDeities": [
      {"name": "YHWH", "relationship": "Archangel serving God"},
      {"name": "Michael", "relationship": "Brother archangel, counterpart"},
      {"name": "Metatron", "relationship": "Serves under as fellow archangel"}
    ],
    "sources": [
      {"title": "Book of Daniel 8-9", "type": "biblical text"},
      {"title": "Torah - Genesis 18-19", "type": "biblical text"},
      {"title": "Isaiah 27:13", "type": "prophetic text"},
      {"title": "Talmud Bavli - Bava Metzia, Rosh Hashanah", "type": "rabbinic literature"},
      {"title": "Midrash Rabbah", "type": "rabbinic commentary"},
      {"title": "Daily Amidah prayer", "type": "liturgy"}
    ],
    "allowUserEdits": true,
    "allowUserContent": true,
    "moderationRequired": true
  },
  {
    "id": "creation",
    "entityType": "cosmology",
    "mythology": "jewish",
    "mythologies": ["jewish"],
    "name": "Creation - Bereshit",
    "icon": "🌍",
    "title": "Jewish Creation Story - Bereshit",
    "subtitle": "Creation Through Divine Speech - Ex Nihilo",
    "shortDescription": "The Jewish creation narrative describes how YHWH created the universe ex nihilo (from nothing) through divine speech over six days, bringing order from chaos and culminating in humanity created in the divine image, followed by Shabbat rest on the seventh day.",
    "longDescription": "The Jewish creation account, found in Genesis (Bereshit - 'In the Beginning'), presents a systematic cosmogony of the universe emerging through divine will expressed as speech. Unlike the violent conflict myths of surrounding Ancient Near Eastern cultures, the Jewish creation is peaceful and deliberate - YHWH speaks, and creation responds. The narrative emphasizes God's absolute sovereignty, the goodness of creation, the special status of humanity as bearers of the divine image (tzelem Elohim), and the sacred rhythm of work and rest embodied in Shabbat. The opening verse - 'In the beginning, God created the heavens and the earth' - establishes creatio ex nihilo (creation from nothing), a radical concept in the ancient world. Before God's creative act, there was only tohu va-vohu (formless void) and darkness over the deep waters (tehom). The Ruach Elohim (Spirit/Wind of God) hovered over the surface, and then came the first divine speech: 'Let there be light' (Yehi Or). Light appeared, was separated from darkness, and the first day began. Over six days, God spoke creation into ordered existence: the firmament separating waters above from waters below; dry land and seas; vegetation producing seed; sun, moon, and stars to mark times and seasons; fish and birds; land animals; and finally humanity. Each stage is declared 'good' (tov), and the completed creation 'very good' (tov me'od). On the sixth day, God speaks the most significant words: 'Let Us make humanity in Our image, according to Our likeness' - creating adam (humanity) both male and female as image-bearers with dominion (responsible stewardship) over creation. God blesses them and commands fruitfulness. On the seventh day, God rested, blessing and sanctifying Shabbat - establishing the eternal pattern of work and rest that structures Jewish life. Rabbinic and mystical interpretation has elaborated extensively on the creation narrative, exploring the mystical significance of the Hebrew letters, the pre-existence of Torah used as the blueprint for creation, the ten divine utterances ('Let there be...') corresponding to the ten Sefirot, and the purpose of creation as a dwelling place for the divine presence.",
    "slug": "creation",
    "filePath": "",
    "status": "published",
    "visibility": "public",
    "cosmologyType": "creation",
    "timeline": [
      {
        "stage": "Pre-Creation Void",
        "order": 0,
        "title": "Tohu Va-Vohu - Formless Void",
        "description": "Before creation, there was only tohu va-vohu (formless chaos/void), darkness over tehom (the deep waters), and the Ruach Elohim (Spirit of God) hovering over the surface. This is the state of potentiality before divine ordering. Kabbalistic tradition speaks of Ein Sof (the Infinite) contracting (tzimtzum) to create a 'space' for creation.",
        "entities": ["yhwh", "ruach-elohim", "tehom"],
        "duration": "Eternal/timeless before the creation of time itself"
      },
      {
        "stage": "Day One",
        "order": 1,
        "title": "Light and Separation of Light from Darkness",
        "description": "God's first creative speech: 'Let there be light' (Yehi Or). Light came into existence. God saw that the light was good and separated light from darkness, calling the light Day (Yom) and the darkness Night (Layla). This was the first day (Yom Echad - Day One). The light of the first day is understood mystically as primordial light, different from the light of sun and moon created on day four. This Or HaGanuz (hidden light) was so intense that one could see from one end of creation to the other. God hid it away for the righteous in the World to Come.",
        "entities": ["yhwh", "or-haganuz"],
        "duration": "One day - evening and morning, the first day"
      },
      {
        "stage": "Day Two",
        "order": 2,
        "title": "The Firmament and Separation of Waters",
        "description": "God said, 'Let there be a firmament (raki'a) in the midst of the waters, separating waters from waters.' God made the firmament, separating the waters below from waters above. He called the firmament Shamayim (Heaven/Skies). This established the vertical structure of the cosmos. Evening and morning, the second day. Notably, this is the only day not explicitly called 'good' - the rabbis explain this is because the work of separating waters was not completed until day three.",
        "entities": ["yhwh", "shamayim", "mayim"],
        "duration": "One day - the second day"
      },
      {
        "stage": "Day Three",
        "order": 3,
        "title": "Dry Land, Seas, and Vegetation",
        "description": "God said, 'Let the waters under heaven be gathered into one place, and let dry land appear.' The waters gathered into Seas (Yamim) and dry land appeared, called Earth (Eretz). Then God said, 'Let the earth sprout vegetation - plants yielding seed, fruit trees bearing fruit with seed in them.' The earth brought forth vegetation, each according to its kind. God saw that it was good. This day receives double affirmation of 'good' because it completed the unfinished work of day two and accomplished its own work. The principle of reproduction 'according to kind' (l'mino) is established.",
        "entities": ["eretz", "yamim", "vegetation"],
        "duration": "One day - the third day"
      },
      {
        "stage": "Day Four",
        "order": 4,
        "title": "Sun, Moon, and Stars",
        "description": "God said, 'Let there be lights in the firmament of heaven to separate day from night, to serve as signs for appointed times (mo'adim), days, and years, and to give light upon the earth.' God made two great lights - the greater light (sun) to rule the day, the lesser light (moon) to rule the night, and also the stars. He set them in the firmament to give light on earth and to separate light from darkness. God saw that it was good. These celestial bodies mark sacred time - the cycle of days, lunar months, and solar years that structure Jewish festivals and Sabbaths. The diminishment of the moon (originally equal to the sun but made smaller) became a rabbinic parable about humility and divine sovereignty.",
        "entities": ["sun", "moon", "stars"],
        "duration": "One day - the fourth day"
      },
      {
        "stage": "Day Five",
        "order": 5,
        "title": "Fish, Birds, and Sea Creatures",
        "description": "God said, 'Let the waters swarm with swarms of living creatures (nefesh chayah), and let birds fly above the earth across the firmament.' God created the great sea creatures (taninim gedolim - including Leviathan according to tradition) and every living creature that moves in the waters, and every winged bird according to its kind. God saw that it was good. God blessed them, saying, 'Be fruitful and multiply, fill the waters in the seas, and let birds multiply on the earth.' This is the first divine blessing on creatures - the gift of fertility and continuation. The term nefesh chayah (living soul/being) is first used here, indicating the beginning of animate, conscious life.",
        "entities": ["leviathan", "sea-creatures", "birds"],
        "duration": "One day - the fifth day"
      },
      {
        "stage": "Day Six",
        "order": 6,
        "title": "Land Animals and Humanity",
        "description": "God said, 'Let the earth bring forth living creatures according to their kinds - livestock, creeping things, and beasts of the earth.' And it was so. God made them all, and saw that it was good. Then came the pinnacle of creation: God said, 'Let Us make humanity (adam) in Our image (b'tzalmeinu), according to Our likeness (kid'muteinu), and let them have dominion over the fish of the sea, birds of the air, livestock, all the earth, and every creeping thing.' God created adam in the divine image - male and female He created them. God blessed them: 'Be fruitful and multiply, fill the earth and subdue it, have dominion over every living thing.' God gave them every seed-bearing plant and fruit tree for food, and to animals every green plant. God saw all that He had made - it was very good (tov me'od). Evening and morning, the sixth day. The plural 'Let Us make' is interpreted variously: as the royal 'we,' as God consulting with angels (teaching humility - seeking counsel even when not needed), or in Kabbalah, as the multiple Sefirot participating in creation.",
        "entities": ["adam", "eve", "animals"],
        "duration": "One day - the sixth day"
      },
      {
        "stage": "Day Seven",
        "order": 7,
        "title": "Shabbat - The Day of Rest",
        "description": "Heaven and earth and all their array were completed. On the seventh day, God completed the work He had done, and He rested (vayishbot) from all His work. God blessed the seventh day and made it holy (vayekadesh), because on it He rested from all the work of creation that He had done. This establishes Shabbat (Sabbath) as a foundational principle of existence - the rhythm of work and rest, doing and being, creating and contemplating. What did God create on the seventh day? Menucha - rest, tranquility, peace. Shabbat becomes a taste of the World to Come (Olam HaBa), a sanctuary in time rather than space. Observing Shabbat testifies to God as Creator and affirms the goodness of creation.",
        "entities": ["shabbat", "menucha"],
        "duration": "One day - the seventh day, blessed and sanctified"
      }
    ],
    "structure": {
      "realms": [
        {
          "name": "Shamayim (Heavens)",
          "description": "The upper realm, dwelling place of God and angels, source of rain and blessing. Contains multiple levels in rabbinic cosmology - seven heavens (according to some traditions), culminating in Aravot where the Divine Throne resides.",
          "ruler": "YHWH",
          "inhabitants": ["Angels", "Seraphim", "Cherubim", "Heavenly host"]
        },
        {
          "name": "Eretz (Earth)",
          "description": "The material world, home of humanity, animals, and vegetation. The meeting place of heaven and earth, where human moral choices determine cosmic harmony or disharmony.",
          "ruler": "Humanity given dominion under God's sovereignty",
          "inhabitants": ["Humans", "Animals", "Plants"]
        },
        {
          "name": "Tehom (The Deep)",
          "description": "The primordial waters beneath the earth, chaotic waters that God ordered and bounded during creation. Associated with the cosmic sea and the forces that God holds in check.",
          "ruler": "Under God's control",
          "inhabitants": ["Leviathan", "Sea creatures"]
        }
      ],
      "layers": [
        {
          "name": "Waters Above the Firmament",
          "description": "The upper waters separated on day two, held above the firmament, source of rain"
        },
        {
          "name": "The Firmament (Raki'a)",
          "description": "The dome/expanse of heaven where sun, moon, and stars are set"
        },
        {
          "name": "Earth and Seas",
          "description": "Dry land and gathered waters, home of terrestrial and aquatic life"
        },
        {
          "name": "Waters Below/Tehom",
          "description": "The deep waters beneath the earth, the primordial chaos held in order"
        }
      ]
    },
    "principles": [
      {
        "name": "Creatio Ex Nihilo",
        "concept": "Creation from Nothing",
        "description": "God created the universe not from pre-existing matter but from absolute nothingness by divine will and speech. This establishes God's absolute sovereignty and the contingency of all creation on divine sustenance.",
        "personification": "YHWH Elohim"
      },
      {
        "name": "Creation Through Speech",
        "concept": "Divine Utterance",
        "description": "God creates by speaking - 'Let there be...' and it is so. The Hebrew word 'davar' means both 'word' and 'thing,' indicating that divine speech brings things into existence. The ten utterances of creation correspond to the ten Sefirot in Kabbalah and the Ten Commandments, linking creation with revelation and ethics.",
        "personification": "The Word/Logos (Memra in Aramaic Targums)"
      },
      {
        "name": "Tzelem Elohim",
        "concept": "Divine Image",
        "description": "Humanity is created in the image of God - not physically but in possessing consciousness, moral capacity, creativity, free will, and the ability to enter into relationship. This grants humans unique dignity and responsibility as God's representatives on earth.",
        "personification": "Adam and Eve as archetypes"
      },
      {
        "name": "Tov - Goodness",
        "concept": "Essential Goodness of Creation",
        "description": "God repeatedly affirms that creation is 'good' (tov) and finally 'very good' (tov me'od). Creation is not inherently evil or illusory but fundamentally good, though capable of corruption through misuse of free will. This opposes dualistic and gnostic views.",
        "personification": "YHWH as source of all goodness"
      },
      {
        "name": "Shabbat",
        "concept": "Sacred Rest",
        "description": "The seventh day, blessed and sanctified, establishes the rhythm of work and rest as intrinsic to creation itself. Shabbat is not merely absence of work but positive presence of holiness, peace (shalom), and delight (oneg). It anticipates the World to Come.",
        "personification": "The Shekhinah as Sabbath Queen"
      }
    ],
    "process": [
      {
        "step": 1,
        "title": "Divine Will and Speech",
        "description": "God conceives the intention to create and speaks the creative word. The Hebrew verb 'bara' (created) is used exclusively for divine creation, indicating something only God can do.",
        "participants": ["YHWH Elohim"]
      },
      {
        "step": 2,
        "title": "Separation and Differentiation",
        "description": "Creation proceeds through acts of separation and distinction - light from darkness, waters above from waters below, sea from dry land, day from night. Order emerges from chaos through divine categorization.",
        "participants": ["YHWH Elohim"]
      },
      {
        "step": 3,
        "title": "Divine Naming",
        "description": "God names the created elements - Day, Night, Heaven, Earth, Seas. To name is to define essence and establish authority. Later, Adam participates in this naming by naming the animals, exercising delegated authority.",
        "participants": ["YHWH Elohim", "Adam"]
      },
      {
        "step": 4,
        "title": "Divine Evaluation",
        "description": "God sees that creation is good. This divine assessment establishes value and affirms the rightness of what has been made. God's seeing is both observation and bestowal of meaning.",
        "participants": ["YHWH Elohim"]
      },
      {
        "step": 5,
        "title": "Divine Blessing",
        "description": "God blesses the creatures with fertility ('be fruitful and multiply'), humanity with dominion and sustenance, and Shabbat with holiness. Blessing is the transmission of divine life-force and purpose.",
        "participants": ["YHWH Elohim"]
      },
      {
        "step": 6,
        "title": "Divine Rest",
        "description": "God rests on the seventh day, not from weariness but as a positive act of cessation, contemplation, and satisfaction. This models for humanity the sacred rhythm of work and rest, doing and being.",
        "participants": ["YHWH Elohim"]
      }
    ],
    "searchTerms": ["creation", "genesis", "bereshit", "jewish creation", "six days", "divine speech", "tzelem elohim", "shabbat"],
    "tags": ["cosmology", "creation", "genesis", "origins", "divine-speech"],
    "categories": ["cosmology", "creation-myth"],
    "relatedDeities": [
      {"name": "YHWH", "relationship": "Creator"},
      {"name": "Ruach Elohim", "relationship": "Spirit hovering over waters"},
      {"name": "Shekhinah", "relationship": "Divine presence resting on Shabbat"}
    ],
    "sources": [
      {"title": "Torah - Genesis 1:1-2:3", "type": "primary scripture"},
      {"title": "Talmud - Tractate Rosh Hashanah, Chagigah", "type": "rabbinic commentary"},
      {"title": "Midrash Rabbah on Genesis", "type": "rabbinic commentary"},
      {"title": "Sefer Yetzirah", "type": "kabbalistic text on letters and creation"},
      {"title": "Zohar - Bereshit portions", "type": "kabbalistic commentary"},
      {"title": "Rashi's commentary on Genesis", "type": "medieval commentary"},
      {"title": "Maimonides - Guide for the Perplexed", "type": "philosophical interpretation"}
    ],
    "allowUserEdits": true,
    "allowUserContent": true,
    "moderationRequired": true
  },
  {
    "id": "afterlife",
    "entityType": "cosmology",
    "mythology": "jewish",
    "mythologies": ["jewish"],
    "name": "Jewish Afterlife - Olam HaBa",
    "icon": "🌟",
    "title": "Jewish Afterlife - The World to Come",
    "subtitle": "Sheol, Gan Eden, Gehenna, and Resurrection",
    "shortDescription": "Jewish afterlife beliefs encompass Sheol (the shadowy underworld of the dead), Gan Eden (Paradise for righteous souls), Gehenna (purification for the wicked), and ultimately Techiyat HaMetim - the resurrection of the dead in the World to Come (Olam HaBa) when souls reunite with restored bodies.",
    "longDescription": "Jewish afterlife theology developed over millennia, with earlier biblical concepts of Sheol (a shadowy underworld where all the dead dwell) gradually complemented by beliefs in differentiated fates for righteous and wicked, paradise (Gan Eden), purification or punishment (Gehenna), and ultimately physical resurrection (Techiyat HaMetim). Unlike many religions that focus primarily on the afterlife, Judaism emphasizes righteous living in this world (Olam HaZeh), with the World to Come (Olam HaBa) serving as continuation rather than negation of earthly existence. Upon death, the soul (neshamah) separates from the body. The body is buried (cremation prohibited as it interferes with resurrection), returned to the earth from which Adam was formed. The soul undergoes judgment - not a single moment but a process. The righteous enter Gan Eden (the Garden of Eden, Paradise) where souls experience closeness to God, study Torah with perfect understanding, and bask in the radiance of the Shekhinah. The wicked enter Gehenna (sometimes called Gehinnom), a place of purification through spiritual fire that burns away attachment to sin. Traditional teaching holds that Gehenna's maximum duration is twelve months, after which even wicked souls (except the utterly irredeemable) are purified and enter Gan Eden. This reflects divine mercy and the Jewish belief that punishment serves educational and purifying purposes, not eternal torture. The intermediate - those neither wholly righteous nor wicked - undergo partial purification. During the eleven months after death, the living recite Kaddish (a prayer sanctifying God's name) on behalf of the deceased, aiding their purification process. Ultimately, Jewish eschatology culminates in Techiyat HaMetim (resurrection of the dead) in the messianic age. The archangel Gabriel will blow the great shofar, the dead will awaken from their graves, souls will reunite with restored bodies, and the righteous will live eternally in the World to Come - a transformed earth where God's presence is fully manifest, death is conquered, and divine purpose is completely fulfilled.",
    "slug": "afterlife",
    "filePath": "",
    "status": "published",
    "visibility": "public",
    "cosmologyType": "afterlife",
    "timeline": [
      {
        "stage": "Death and Separation",
        "order": 1,
        "title": "The Soul Departs the Body",
        "description": "At the moment of death, the neshamah (soul) separates from the guf (body). Traditional sources describe this as potentially difficult or gentle depending on the person's righteousness. Moses and other great tzaddikim (righteous ones) died 'by the kiss of God' - a gentle departure. The body is prepared for burial according to Jewish law: washed, clothed in simple white shrouds (tachrichim), and buried in the earth as soon as possible (ideally within 24 hours). The community begins sitting shiva (seven days of mourning).",
        "entities": ["neshamah", "angel-of-death", "chevra-kadisha"],
        "duration": "Immediate upon death"
      },
      {
        "stage": "Judgment",
        "order": 2,
        "title": "Judgment Before the Heavenly Court",
        "description": "The soul appears before the Heavenly Court (Beit Din shel Ma'alah). Metatron presents the book of deeds containing everything the person thought, said, and did. Michael advocates for mercy, presenting the person's good deeds and merits. Satan serves as prosecutor, listing sins and failings. The person's own conscience testifies. The judgment is not arbitrary but perfectly just, taking into account intent, circumstances, opportunities, struggles, and sincere repentance. The destination - Gan Eden or Gehenna - is determined not by belief alone but by the totality of one's life and character.",
        "entities": ["metatron", "michael", "satan", "heavenly-court"],
        "duration": "Timeless moment of spiritual truth"
      },
      {
        "stage": "Gehenna Purification",
        "order": 3,
        "title": "Gehenna - Purification Through Fire",
        "description": "Those requiring purification enter Gehenna (Gehinnom), named after the Valley of Hinnom near Jerusalem where garbage burned. Gehenna is not eternal hell but a place of spiritual purification through the fire of shame and remorse. The soul confronts the full reality of its sins, experiencing the pain it caused others, the distance from God it created, and the squandering of divine gifts. This burning awareness purges attachment to evil and refines the soul. Traditional teaching limits Gehenna's maximum duration to twelve months, except for the utterly wicked who deny God's existence or commit irredeemable evil. During the eleven months after death, the living recite Kaddish prayer daily to aid the soul's purification, and study Torah and perform mitzvot in the deceased's memory, adding merits to their account. Even in Gehenna, Sabbath provides respite - souls rest from purification on Shabbat.",
        "entities": ["gehenna", "kaddish", "purification"],
        "duration": "Maximum twelve months for most souls"
      },
      {
        "stage": "Gan Eden",
        "order": 4,
        "title": "Gan Eden - Paradise of Souls",
        "description": "The righteous, and those purified in Gehenna, enter Gan Eden (the Garden of Eden/Paradise). This is not a physical place but a spiritual state of being - closeness to God, understanding divine wisdom with perfect clarity, experiencing the radiance of the Shekhinah (Or HaShekhinah), and delighting in Torah study without the limitations of embodied existence. There are said to be levels in Gan Eden corresponding to degrees of righteousness. The souls are conscious, aware, and enjoy something like a foretaste of the World to Come, but they await resurrection when body and soul will reunite. Gan Eden is sometimes divided into Lower Gan Eden (where most righteous souls dwell) and Upper Gan Eden (where the greatest tzaddikim reside, closer to the Divine Throne).",
        "entities": ["gan-eden", "shekhinah", "tzaddikim"],
        "duration": "From death until resurrection"
      },
      {
        "stage": "Resurrection",
        "order": 5,
        "title": "Techiyat HaMetim - Resurrection of the Dead",
        "description": "In the messianic age, Gabriel will blow the great shofar announcing ultimate redemption. The dead will awaken from their graves - bodies reconstituted from the luz bone (an indestructible bone at the base of the spine), souls returning to inhabit them. The righteous will rise first. According to some traditions, those buried outside Israel will roll through underground tunnels to reach the Land of Israel for resurrection. The resurrected will have perfected bodies - no disease, disability, or death. They will live eternally in the World to Come on a transformed earth. This resurrection is physical and real, not merely spiritual - one of Maimonides' Thirteen Principles of Faith declares belief in resurrection as essential to Judaism.",
        "entities": ["gabriel", "messiah", "resurrection", "great-shofar"],
        "duration": "The messianic age and beyond"
      },
      {
        "stage": "Olam HaBa",
        "order": 6,
        "title": "Olam HaBa - The World to Come",
        "description": "The ultimate state of existence - the World to Come (Olam HaBa). This is a transformed physical world where the resurrected righteous live eternally in perfected bodies reunited with their souls. God's presence is fully manifest, evil is vanquished, death is conquered, and the divine purpose for creation is fulfilled. Some describe it as an eternal Shabbat - rest, peace, delight, study, closeness to God. The righteous will sit at a great feast (Se'udat Livyatan) eating the flesh of Leviathan and drinking wine preserved since creation. The Temple will be rebuilt, and all nations will worship YHWH. Different sources emphasize either spiritual delights (understanding Torah perfectly, experiencing divine radiance) or physical delights (feast, restored earth), but most rabbinic teaching suggests both - the integration of spiritual and physical in perfect harmony, reversing the separation caused by Adam's sin. The exact nature of Olam HaBa remains mysterious - 'Eye has not seen, O God, besides You, what You will do for those who wait for You' (Isaiah 64:4).",
        "entities": ["yhwh", "messiah", "leviathan", "rebuilt-temple"],
        "duration": "Eternal"
      }
    ],
    "structure": {
      "realms": [
        {
          "name": "Sheol",
          "description": "In biblical thought, Sheol is the underworld where all the dead - righteous and wicked - dwell in shadowy, diminished existence. It is beneath the earth, a place of silence, darkness, and separation from God's active presence. Later theology largely superseded this with differentiated afterlife realms, but Sheol remains the biblical term for the grave and the realm of the dead.",
          "ruler": "None specifically, though the Angel of Death delivers souls there",
          "inhabitants": ["All the dead in biblical cosmology"]
        },
        {
          "name": "Gehenna (Gehinnom)",
          "description": "Named after the Valley of Hinnom outside Jerusalem, Gehenna is the place of purification for souls who committed sins. It purifies through spiritual fire - the burning shame of confronting one's evil and its consequences. Maximum duration is twelve months for most. Sabbath provides weekly respite. Not eternal torture but corrective discipline.",
          "ruler": "Angels of destruction execute divine judgment, but under God's ultimate authority",
          "inhabitants": ["Souls undergoing purification", "The wicked (temporary, except the irredeemable)"]
        },
        {
          "name": "Gan Eden (Paradise)",
          "description": "The Garden of Eden exists in spiritual form as the dwelling place of righteous souls after death and purification. Divided into lower and upper levels. Souls experience closeness to God, study Torah with perfect understanding, and bask in the radiance of the Shekhinah. A state of spiritual bliss awaiting physical resurrection.",
          "ruler": "God, though the Shekhinah's presence is especially manifest",
          "inhabitants": ["Righteous souls", "Great tzaddikim in upper levels", "Angels who teach Torah"]
        },
        {
          "name": "Olam HaBa (World to Come)",
          "description": "The ultimate transformed physical world after resurrection. A perfected earth where the righteous live eternally in resurrected bodies reunited with souls. God's presence is fully manifest, evil vanquished, death conquered. Sometimes described as eternal Shabbat.",
          "ruler": "YHWH, with the Messiah as king under God",
          "inhabitants": ["Resurrected righteous", "All who turn from evil", "Angels", "All creation restored"]
        }
      ],
      "layers": []
    },
    "principles": [
      {
        "name": "Resurrection of the Dead",
        "concept": "Techiyat HaMetim",
        "description": "The body will be resurrected and reunited with the soul in the messianic age. This affirms the goodness of physical existence and the holistic nature of human being - body and soul together constitute the full person. One of Maimonides' Thirteen Principles of Faith.",
        "personification": "YHWH as source of life and resurrection"
      },
      {
        "name": "Divine Justice and Mercy",
        "concept": "Din and Rachamim",
        "description": "The afterlife reflects perfect justice (Din) balanced with perfect mercy (Rachamim). Punishment is not vengeful but corrective. Even Gehenna's fire is ultimately merciful, purifying rather than merely punishing. God's mercy ensures that even the wicked (except the irredeemable) eventually reach Paradise.",
        "personification": "Gabriel (judgment) and Michael (mercy) representing these attributes"
      },
      {
        "name": "Soul Immortality",
        "concept": "Eternal Neshamah",
        "description": "The soul is immortal, created by God's breath and returning to God upon death. The soul is the divine spark within each person, the image of God (tzelem Elohim). It continues consciously after bodily death, awaiting resurrection.",
        "personification": "The neshamah as piece of divine breath"
      },
      {
        "name": "Ethical Accountability",
        "concept": "Heavenly Judgment",
        "description": "Every deed, word, and thought is recorded and evaluated. The afterlife is not arbitrary but the natural consequence of how one lived. Free will creates real moral responsibility. Repentance (teshuvah) can transform even serious sins.",
        "personification": "Metatron as heavenly scribe recording all deeds"
      },
      {
        "name": "This-Worldly Focus",
        "concept": "Olam HaZeh Priority",
        "description": "Judaism emphasizes ethical living in this world (Olam HaZeh) over speculation about the next. The Talmud teaches: 'Better one hour of repentance and good deeds in this world than all the life of the World to Come.' Righteous action here matters most.",
        "personification": "The Torah as guide for this-worldly righteousness"
      }
    ],
    "process": [
      {
        "step": 1,
        "title": "Death and Burial",
        "description": "The soul separates from the body. The body is washed, clothed in simple shrouds, and buried in the earth. No embalming or cremation - the body must return to earth naturally. The community mourns and comforts the bereaved.",
        "participants": ["Chevra Kadisha (burial society)", "Mourners", "Angel of Death"]
      },
      {
        "step": 2,
        "title": "Soul's Journey and Judgment",
        "description": "The soul appears before the Heavenly Court. Metatron presents the book of deeds. Michael advocates for mercy. Satan prosecutes. The soul's destination is determined by its deeds, repentance, and character.",
        "participants": ["Metatron", "Michael", "Satan", "The deceased's soul", "Heavenly Court"]
      },
      {
        "step": 3,
        "title": "Purification or Paradise",
        "description": "Those requiring purification enter Gehenna (maximum twelve months). The righteous proceed directly to Gan Eden. Those in Gehenna are aided by Kaddish prayers and merits performed by the living in their memory.",
        "participants": ["Soul of deceased", "Angels of purification", "Living relatives reciting Kaddish"]
      },
      {
        "step": 4,
        "title": "Gan Eden Dwelling",
        "description": "Purified and righteous souls dwell in Gan Eden, experiencing spiritual bliss, studying Torah with perfect understanding, and basking in the Shekhinah's radiance. They await resurrection.",
        "participants": ["Righteous souls", "Shekhinah", "Teaching angels", "Great tzaddikim"]
      },
      {
        "step": 5,
        "title": "Resurrection",
        "description": "In the messianic age, Gabriel blows the great shofar. The dead awaken. Bodies are reconstituted from the luz bone. Souls reunite with bodies. The righteous rise to eternal life in perfected form.",
        "participants": ["Gabriel", "Messiah", "All the dead", "YHWH"]
      },
      {
        "step": 6,
        "title": "Olam HaBa - Eternal Life",
        "description": "The resurrected righteous live eternally in the World to Come - a transformed earth where God's presence is fully manifest, evil is vanquished, and divine purpose is fulfilled. Eternal Shabbat, perfect peace, complete knowledge.",
        "participants": ["Resurrected righteous", "YHWH", "Messiah", "All creation restored"]
      }
    ],
    "searchTerms": ["afterlife", "jewish afterlife", "olam haba", "gan eden", "gehenna", "sheol", "resurrection", "world to come"],
    "tags": ["cosmology", "afterlife", "resurrection", "paradise", "judgment"],
    "categories": ["cosmology", "afterlife-beliefs"],
    "relatedDeities": [
      {"name": "YHWH", "relationship": "Judge and resurrector"},
      {"name": "Metatron", "relationship": "Heavenly scribe recording deeds"},
      {"name": "Michael", "relationship": "Advocate for mercy in judgment"},
      {"name": "Gabriel", "relationship": "Blows shofar for resurrection"}
    ],
    "sources": [
      {"title": "Tanakh - Daniel 12:2, Isaiah 26:19, Ezekiel 37", "type": "biblical texts on resurrection"},
      {"title": "Talmud Bavli - Sanhedrin 90-92, Rosh Hashanah", "type": "rabbinic discussion of afterlife"},
      {"title": "Mishnah - Sanhedrin 10:1 (All Israel has a portion in the World to Come)", "type": "foundational teaching"},
      {"title": "Maimonides - Thirteen Principles of Faith", "type": "philosophical formulation"},
      {"title": "Midrash on death and afterlife", "type": "rabbinic elaboration"},
      {"title": "Zohar - portions on souls and afterlife", "type": "kabbalistic teaching"},
      {"title": "Mourning liturgy and Kaddish prayer", "type": "liturgical texts"}
    ],
    "allowUserEdits": true,
    "allowUserContent": true,
    "moderationRequired": true
  }
]
