{
  "id": "amun-ra",
  "type": "deity",
  "name": "Amun-Ra",
  "icon": "👁️",
  "mythologies": [
    "egyptian"
  ],
  "primaryMythology": "egyptian",
  "shortDescription": "Amun-Ra is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual...",
  "longDescription": "Amun-Ra is the syncretic fusion of Amun (the hidden one) and Ra (the sun). Supreme god of the New Kingdom, combining Amun's mysterious transcendence with Ra's manifest solar power. 'King of the Gods' worshipped at Karnak's vast temple complex. Consort of Mut, father of Khonsu. Pharaohs claimed divine descent from Amun-Ra.\n\n",
  "tags": [
    "amun-ra",
    "egyptian",
    "deity"
  ],
  "colors": {
    "primary": "#D4AF37",
    "secondary": "#8B4513"
  },
  "linguistic": {
    "originalName": "𓇋𓏠𓈖𓁛𓏺",
    "originalScript": "hieroglyphic",
    "transliteration": "jmn-rꜥ",
    "pronunciation": "/ʔaˈmaːn ɾaʕ/",
    "etymology": {
      "rootLanguage": "Ancient Egyptian",
      "meaning": "hidden one - sun",
      "derivation": "Middle Egyptian hieroglyphic: jmn-rꜥ"
    },
    "languageCode": "egy"
  },
  "geographical": {
    "primaryLocation": {
      "name": "Karnak",
      "coordinates": {
        "latitude": 25.7188,
        "longitude": 32.6573,
        "accuracy": "exact"
      },
      "modernName": "Luxor, Egypt",
      "type": "temple",
      "significance": "Primary cult center of Amun-Ra"
    },
    "region": "Nile Valley",
    "culturalArea": "Ancient Egypt",
    "modernCountries": [
      "Egypt"
    ]
  },
  "temporal": {
    "historicalDate": {
      "start": {
        "year": -3000,
        "circa": true,
        "display": "c. 3000 BCE"
      },
      "end": {
        "year": 400,
        "circa": true,
        "display": "c. 400 CE"
      },
      "display": "c. 3000 BCE - 400 CE"
    },
    "culturalPeriod": "Ancient Egyptian civilization"
  },
  "sources": [
    {
      "title": "Pyramid Texts",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -2400,
        "circa": true,
        "display": "c. 2400 BCE"
      }
    },
    {
      "title": "Coffin Texts",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -2000,
        "circa": true,
        "display": "c. 2000 BCE"
      }
    },
    {
      "title": "Book of the Dead",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -1550,
        "circa": true,
        "display": "c. 1550 BCE"
      }
    }
  ],
  "metadata": {
    "created": "2025-12-13T09:00:34.477Z",
    "lastModified": "2025-12-29T00:29:04.567Z",
    "version": "2.0",
    "completeness": "enhanced",
    "enhanced": true,
    "enhancementVersion": "2.0"
  },
  "fullDescription": "Amun-Ra is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual practices.",
  "richDescription": "Amun-Ra occupies an important position in the egyptian pantheon, representing sacred principles and divine forces that shaped ancient understanding of the cosmos and humanity's place within it. This deity's influence extended across multiple domains, touching various aspects of religious and cultural life.\n\nFollowers of Amun-Ra maintained traditions of worship and ritual that honored the deity's specific attributes and sought divine favor in relevant aspects of daily life. The deity's cult reflected the values and concerns of the communities that venerated this divine figure.\n\nThe legacy of Amun-Ra endures through mythology, art, and cultural memory, preserving ancient wisdom and spiritual insights that continue to resonate across the ages.",
  "topic_panels": {
    "origins": "The origins of Amun-Ra are shrouded in ancient mystery. This deity has been a central figure in egyptian mythology since ancient times, with traditions passed down through countless generations.",
    "worship": "Devotees honored Amun-Ra through traditional rituals, prayers, and offerings appropriate to the deity's sacred domains. The worship practices reflected deep reverence and the desire to maintain harmony with divine forces.",
    "symbols": "The iconography of Amun-Ra is rich with symbolic meaning. Traditional depictions capture the essence of the deity's sacred attributes and divine power.",
    "influence": "The influence of Amun-Ra extends far beyond ancient Egyptian culture. The deity's name has influenced language and continues to appear in modern contexts. As a figure of enduring fascination, Amun-Ra appears in literature, art, and popular culture, demonstrating the timeless appeal of these mythological traditions. The archetypal qualities embodied by Amun-Ra continue to resonate with contemporary audiences, offering insights into universal human experiences and spiritual yearnings."
  },
  "related_myths": [
    {
      "title": "Sacred Tales of Amun-Ra",
      "summary": "Numerous myths and legends feature Amun-Ra, each revealing different facets of the deity's character and illustrating important moral and spiritual lessons for devotees."
    }
  ],
  "background_image": "/assets/backgrounds/starfield-cosmic.jpg"
}