{
  "id": "aphrodite",
  "type": "deity",
  "name": "Aphrodite",
  "icon": "💘",
  "mythologies": [
    "greek"
  ],
  "primaryMythology": "greek",
  "shortDescription": "Goddess of Love, Beauty, and Desire\n\nBorn from the sea foam, Aphrodite embodies love, beauty, pleasure, and procreation. Her powers extend to gods...",
  "fullDescription": "Goddess of Love, Beauty, and Desire\n\nBorn from the sea foam, Aphrodite embodies love, beauty, pleasure, and procreation. Her powers extend to gods and mortals alike, causing desire, passion, and sometimes chaos in matters of the heart.\n\nAphrodite's mythology centers on love, desire, and the complications that arise from both. Her influence causes mortals and immortals to fall in love, sometimes with disastrous consequences.",
  "tags": [
    "aphrodite",
    "greek",
    "love",
    "beauty",
    "desire",
    "sexuality",
    "pleasure",
    "procreation",
    "foam-born",
    "cyprian",
    "dove",
    "swan",
    "rose",
    "myrtle",
    "scallop shell",
    "mirror",
    "girdle"
  ],
  "colors": {
    "primary": "#DAA520",
    "secondary": "#FFD700"
  },
  "linguistic": {
    "originalName": "Ἀφροδίτη",
    "originalScript": "greek",
    "transliteration": "Aphrodite",
    "pronunciation": "/ˌæfrəˈdaɪtiː/",
    "languageCode": "grc",
    "alternativeNames": [],
    "etymology": {
      "rootLanguage": "Proto-Indo-European",
      "meaning": "Foam-born",
      "derivation": ""
    }
  },
  "geographical": {
    "primaryLocation": {
      "name": "Paphos, Cyprus",
      "coordinates": {
        "latitude": 34.7581,
        "longitude": 32.4191,
        "accuracy": "exact"
      },
      "type": "temple",
      "description": "",
      "significance": ""
    },
    "region": "Mediterranean",
    "culturalArea": "Ancient Greece",
    "modernCountries": [
      "Greece"
    ]
  },
  "temporal": {
    "mythologicalDate": {
      "display": "Mythological Age"
    },
    "historicalDate": {
      "display": "c. 800 BCE - 400 CE"
    },
    "firstAttestation": {
      "date": {
        "year": -800,
        "circa": true,
        "display": "c. 800 BCE"
      },
      "source": "Homer's epics",
      "type": "literary",
      "confidence": "probable"
    },
    "culturalPeriod": "Classical Period"
  },
  "cultural": {
    "worshipPractices": [],
    "festivals": [],
    "socialRole": "Love, beauty, desire, sexuality, pleasure, procreation",
    "demographicAppeal": [],
    "modernLegacy": {}
  },
  "metaphysicalProperties": {
    "primaryElement": "water",
    "planets": [
      "Venus"
    ],
    "sefirot": [
      "netzach"
    ]
  },
  "relatedEntities": {
    "deities": [],
    "heroes": [],
    "creatures": [],
    "places": [],
    "items": [
      {
        "id": "myrtle",
        "name": "Sacred Myrtle"
      }
    ]
  },
  "sources": [],
  "archetypes": [],
  "metadata": {
    "created": "2025-12-13T09:03:10.541Z",
    "lastModified": "2025-12-29T00:29:04.579Z",
    "version": "2.0",
    "completeness": 75,
    "migratedFrom": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\greek\\deities\\aphrodite.html",
    "enriched": true,
    "enhanced": true,
    "enhancementVersion": "2.0"
  },
  "richDescription": "Aphrodite occupies an important position in the greek pantheon, representing sacred principles and divine forces that shaped ancient understanding of the cosmos and humanity's place within it. This deity's influence extended across multiple domains, touching various aspects of religious and cultural life.\n\nFollowers of Aphrodite maintained traditions of worship and ritual that honored the deity's specific attributes and sought divine favor in relevant aspects of daily life. The deity's cult reflected the values and concerns of the communities that venerated this divine figure.\n\nThe legacy of Aphrodite endures through mythology, art, and cultural memory, preserving ancient wisdom and spiritual insights that continue to resonate across the ages.",
  "topic_panels": {
    "origins": "The origins of Aphrodite are shrouded in ancient mystery. Historical evidence of this deity's worship dates to Homer's epics, demonstrating the long-standing significance of Aphrodite in greek culture.",
    "worship": "Devotees honored Aphrodite through traditional rituals, prayers, and offerings appropriate to the deity's sacred domains. The worship practices reflected deep reverence and the desire to maintain harmony with divine forces.",
    "symbols": "The iconography of Aphrodite is rich with symbolic meaning. Traditional depictions capture the essence of the deity's sacred attributes and divine power.",
    "influence": "The influence of Aphrodite extends far beyond ancient Greek culture. The deity's name has influenced language and continues to appear in modern contexts. As a figure of enduring fascination, Aphrodite appears in literature, art, and popular culture, demonstrating the timeless appeal of these mythological traditions. The archetypal qualities embodied by Aphrodite continue to resonate with contemporary audiences, offering insights into universal human experiences and spiritual yearnings."
  },
  "related_myths": [
    {
      "title": "Sacred Tales of Aphrodite",
      "summary": "Numerous myths and legends feature Aphrodite, each revealing different facets of the deity's character and illustrating important moral and spiritual lessons for devotees."
    }
  ],
  "background_image": "/assets/backgrounds/ocean-waves-mystic.jpg"
}