{
  "id": "apollo",
  "type": "deity",
  "name": "Apollo",
  "icon": "☀️",
  "mythologies": [
    "greek"
  ],
  "primaryMythology": "greek",
  "shortDescription": "God of Light, Music, Prophecy, and Healing\n\nThe most Greek of gods, Apollo embodies the ideals of kouros (beautiful youth), artistic excellence,...",
  "fullDescription": "God of Light, Music, Prophecy, and Healing\n\nThe most Greek of gods, Apollo embodies the ideals of kouros (beautiful youth), artistic excellence, rational thought, and divine order. As sun god, prophet, healer, and musician, he represents the civilized arts that elevate humanity above mere survival.\n\nApollo's myths reveal the duality of a god who brings both healing and plague, beauty and destruction, prophetic truth and poetic inspiration. He represents the ideal of balance—the tension between civilization and wildness, rationality and inspiration, punishment and mercy.",
  "tags": [
    "apollo",
    "greek",
    "sun/light",
    "music",
    "poetry",
    "prophecy",
    "healing",
    "plague",
    "archery",
    "truth",
    "order",
    "phoebus-apollo-(bright)",
    "musagetes-(leader-of-muses)",
    "lyre",
    "silver bow and arrows",
    "laurel wreath",
    "tripod",
    "raven",
    "swan"
  ],
  "colors": {
    "primary": "#DAA520",
    "secondary": "#FFD700"
  },
  "linguistic": {
    "originalName": "Ἀπόλλων",
    "originalScript": "greek",
    "transliteration": "Apollo",
    "pronunciation": "/əˈpɒloʊ/",
    "languageCode": "grc",
    "alternativeNames": [],
    "etymology": {
      "rootLanguage": "Proto-Indo-European",
      "meaning": "Possibly destroyer or assembler",
      "derivation": ""
    }
  },
  "geographical": {
    "primaryLocation": {
      "name": "Delphi",
      "coordinates": {
        "latitude": 38.4824,
        "longitude": 22.5009,
        "accuracy": "exact"
      },
      "type": "temple",
      "description": "",
      "significance": ""
    },
    "region": "Mediterranean",
    "culturalArea": "Ancient Greece",
    "modernCountries": [
      "Greece"
    ]
  },
  "temporal": {
    "mythologicalDate": {
      "display": "Mythological Age"
    },
    "historicalDate": {
      "display": "c. 800 BCE - 400 CE"
    },
    "firstAttestation": {
      "date": {
        "year": -800,
        "circa": true,
        "display": "c. 800 BCE"
      },
      "source": "Homer's epics",
      "type": "literary",
      "confidence": "probable"
    },
    "culturalPeriod": "Classical Period"
  },
  "cultural": {
    "worshipPractices": [],
    "festivals": [],
    "socialRole": "Sun/light, music, poetry, prophecy, healing, plague, archery, truth, order",
    "demographicAppeal": [],
    "modernLegacy": {}
  },
  "metaphysicalProperties": {
    "primaryElement": "fire",
    "planets": [
      "Sun"
    ],
    "sefirot": [
      "tiferet"
    ]
  },
  "relatedEntities": {
    "deities": [],
    "heroes": [
      {
        "id": "orpheus",
        "name": "Orpheus"
      }
    ],
    "creatures": [],
    "places": [],
    "items": [
      {
        "id": "laurel",
        "name": "Sacred Laurel"
      }
    ]
  },
  "sources": [],
  "archetypes": [],
  "metadata": {
    "created": "2025-12-13T09:03:10.573Z",
    "lastModified": "2025-12-29T00:29:04.569Z",
    "version": "2.0",
    "completeness": 75,
    "migratedFrom": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\greek\\deities\\apollo.html",
    "enriched": true,
    "enhanced": true,
    "enhancementVersion": "2.0"
  },
  "richDescription": "Apollo occupies an important position in the greek pantheon, representing sacred principles and divine forces that shaped ancient understanding of the cosmos and humanity's place within it. This deity's influence extended across multiple domains, touching various aspects of religious and cultural life.\n\nFollowers of Apollo maintained traditions of worship and ritual that honored the deity's specific attributes and sought divine favor in relevant aspects of daily life. The deity's cult reflected the values and concerns of the communities that venerated this divine figure.\n\nThe legacy of Apollo endures through mythology, art, and cultural memory, preserving ancient wisdom and spiritual insights that continue to resonate across the ages.",
  "topic_panels": {
    "origins": "The origins of Apollo are shrouded in ancient mystery. Historical evidence of this deity's worship dates to Homer's epics, demonstrating the long-standing significance of Apollo in greek culture.",
    "worship": "Devotees honored Apollo through traditional rituals, prayers, and offerings appropriate to the deity's sacred domains. The worship practices reflected deep reverence and the desire to maintain harmony with divine forces.",
    "symbols": "The iconography of Apollo is rich with symbolic meaning. Traditional depictions capture the essence of the deity's sacred attributes and divine power.",
    "influence": "The influence of Apollo extends far beyond ancient Greek culture. The deity's name has influenced language and continues to appear in modern contexts. As a figure of enduring fascination, Apollo appears in literature, art, and popular culture, demonstrating the timeless appeal of these mythological traditions. The archetypal qualities embodied by Apollo continue to resonate with contemporary audiences, offering insights into universal human experiences and spiritual yearnings."
  },
  "related_myths": [
    {
      "title": "Sacred Tales of Apollo",
      "summary": "Numerous myths and legends feature Apollo, each revealing different facets of the deity's character and illustrating important moral and spiritual lessons for devotees."
    }
  ],
  "background_image": "/assets/backgrounds/sacred-flames.jpg"
}