{
  "id": "artemis",
  "type": "deity",
  "name": "Artemis",
  "icon": "🏹",
  "mythologies": [
    "greek"
  ],
  "primaryMythology": "greek",
  "shortDescription": "Goddess of the Hunt, Wilderness, and the Moon\n\nVirgin goddess of the hunt, wild animals, and the moon. Twin sister of Apollo, Artemis roams the...",
  "fullDescription": "Goddess of the Hunt, Wilderness, and the Moon\n\nVirgin goddess of the hunt, wild animals, and the moon. Twin sister of Apollo, Artemis roams the wilderness with her band of nymphs, protecting young creatures and punishing those who offend her.\n\nArtemis's myths emphasize her independence, her protection of the natural world, and her fierce punishment of those who violate her sanctity or harm her companions.",
  "tags": [
    "artemis",
    "greek",
    "hunt",
    "wilderness",
    "wild-animals",
    "moon",
    "childbirth",
    "virginity",
    "young-girls",
    "huntress",
    "maiden",
    "bow and arrows",
    "crescent moon",
    "deer",
    "cypress",
    "hunting dogs"
  ],
  "colors": {
    "primary": "#DAA520",
    "secondary": "#FFD700"
  },
  "linguistic": {
    "originalName": "Ἄρτεμις",
    "originalScript": "greek",
    "transliteration": "Artemis",
    "pronunciation": "/ˈɑːrtɪmɪs/",
    "languageCode": "grc",
    "alternativeNames": [],
    "etymology": {
      "rootLanguage": "Proto-Indo-European",
      "meaning": "Safe, butcher, or bear",
      "derivation": ""
    }
  },
  "geographical": {
    "primaryLocation": {
      "name": "Temple of Artemis, Ephesus",
      "coordinates": {
        "latitude": 37.9487,
        "longitude": 27.3634,
        "accuracy": "exact"
      },
      "type": "temple",
      "description": "",
      "significance": ""
    },
    "region": "Mediterranean",
    "culturalArea": "Ancient Greece",
    "modernCountries": [
      "Greece"
    ]
  },
  "temporal": {
    "mythologicalDate": {
      "display": "Mythological Age"
    },
    "historicalDate": {
      "display": "c. 800 BCE - 400 CE"
    },
    "firstAttestation": {
      "date": {
        "year": -800,
        "circa": true,
        "display": "c. 800 BCE"
      },
      "source": "Homer's epics",
      "type": "literary",
      "confidence": "probable"
    },
    "culturalPeriod": "Classical Period"
  },
  "cultural": {
    "worshipPractices": [],
    "festivals": [],
    "socialRole": "Hunt, wilderness, wild animals, moon, childbirth, virginity, young girls",
    "demographicAppeal": [],
    "modernLegacy": {}
  },
  "metaphysicalProperties": {
    "primaryElement": "earth",
    "planets": [
      "Moon"
    ],
    "sefirot": [
      "yesod"
    ]
  },
  "relatedEntities": {
    "deities": [],
    "heroes": [
      {
        "id": "index",
        "name": "Atalanta"
      }
    ],
    "creatures": [
      {
        "id": "index",
        "name": "Ceryneian Hind"
      }
    ],
    "places": [],
    "items": []
  },
  "sources": [],
  "archetypes": [],
  "metadata": {
    "created": "2025-12-13T09:03:10.619Z",
    "lastModified": "2025-12-29T00:29:04.580Z",
    "version": "2.0",
    "completeness": 75,
    "migratedFrom": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\greek\\deities\\artemis.html",
    "enriched": true,
    "enhanced": true,
    "enhancementVersion": "2.0"
  },
  "richDescription": "Artemis occupies an important position in the greek pantheon, representing sacred principles and divine forces that shaped ancient understanding of the cosmos and humanity's place within it. This deity's influence extended across multiple domains, touching various aspects of religious and cultural life.\n\nFollowers of Artemis maintained traditions of worship and ritual that honored the deity's specific attributes and sought divine favor in relevant aspects of daily life. The deity's cult reflected the values and concerns of the communities that venerated this divine figure.\n\nThe legacy of Artemis endures through mythology, art, and cultural memory, preserving ancient wisdom and spiritual insights that continue to resonate across the ages.",
  "topic_panels": {
    "origins": "The origins of Artemis are shrouded in ancient mystery. Historical evidence of this deity's worship dates to Homer's epics, demonstrating the long-standing significance of Artemis in greek culture.",
    "worship": "Devotees honored Artemis through traditional rituals, prayers, and offerings appropriate to the deity's sacred domains. The worship practices reflected deep reverence and the desire to maintain harmony with divine forces.",
    "symbols": "The iconography of Artemis is rich with symbolic meaning. Traditional depictions capture the essence of the deity's sacred attributes and divine power.",
    "influence": "The influence of Artemis extends far beyond ancient Greek culture. The deity's name has influenced language and continues to appear in modern contexts. As a figure of enduring fascination, Artemis appears in literature, art, and popular culture, demonstrating the timeless appeal of these mythological traditions. The archetypal qualities embodied by Artemis continue to resonate with contemporary audiences, offering insights into universal human experiences and spiritual yearnings."
  },
  "related_myths": [
    {
      "title": "Sacred Tales of Artemis",
      "summary": "Numerous myths and legends feature Artemis, each revealing different facets of the deity's character and illustrating important moral and spiritual lessons for devotees."
    }
  ],
  "background_image": "/assets/backgrounds/ancient-forest-mystical.jpg"
}