{
  "id": "atum",
  "type": "deity",
  "name": "Atum",
  "icon": "🌅",
  "mythologies": [
    "egyptian"
  ],
  "primaryMythology": "egyptian",
  "shortDescription": "Atum is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual...",
  "longDescription": "Atum is the self-created primordial deity who emerged from the waters of Nun at creation. He represents completion and the setting sun. Often merged with Ra as Atum-Ra, he masturbated or spat to create Shu (air) and Tefnut (moisture), beginning the Ennead. He is both the first and last god, present at creation and at the end of time.\n\n",
  "tags": [
    "atum",
    "egyptian",
    "deity"
  ],
  "colors": {
    "primary": "#D4AF37",
    "secondary": "#8B4513"
  },
  "linguistic": {
    "originalName": "𓄤𓏏𓐀",
    "originalScript": "hieroglyphic",
    "transliteration": "jtm",
    "pronunciation": "/ʔaˈtuːm/",
    "etymology": {
      "rootLanguage": "Ancient Egyptian",
      "meaning": "the complete one",
      "derivation": "Middle Egyptian hieroglyphic: jtm"
    },
    "languageCode": "egy"
  },
  "temporal": {
    "historicalDate": {
      "start": {
        "year": -3000,
        "circa": true,
        "display": "c. 3000 BCE"
      },
      "end": {
        "year": 400,
        "circa": true,
        "display": "c. 400 CE"
      },
      "display": "c. 3000 BCE - 400 CE"
    },
    "culturalPeriod": "Ancient Egyptian civilization"
  },
  "sources": [
    {
      "title": "Pyramid Texts",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -2400,
        "circa": true,
        "display": "c. 2400 BCE"
      }
    },
    {
      "title": "Coffin Texts",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -2000,
        "circa": true,
        "display": "c. 2000 BCE"
      }
    },
    {
      "title": "Book of the Dead",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -1550,
        "circa": true,
        "display": "c. 1550 BCE"
      }
    }
  ],
  "metadata": {
    "created": "2025-12-13T09:00:34.480Z",
    "lastModified": "2025-12-29T00:29:04.580Z",
    "version": "2.0",
    "completeness": "enhanced",
    "enhanced": true,
    "enhancementVersion": "2.0"
  },
  "fullDescription": "Atum is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual practices.",
  "richDescription": "Atum occupies an important position in the egyptian pantheon, representing sacred principles and divine forces that shaped ancient understanding of the cosmos and humanity's place within it. This deity's influence extended across multiple domains, touching various aspects of religious and cultural life.\n\nFollowers of Atum maintained traditions of worship and ritual that honored the deity's specific attributes and sought divine favor in relevant aspects of daily life. The deity's cult reflected the values and concerns of the communities that venerated this divine figure.\n\nThe legacy of Atum endures through mythology, art, and cultural memory, preserving ancient wisdom and spiritual insights that continue to resonate across the ages.",
  "topic_panels": {
    "origins": "The origins of Atum are shrouded in ancient mystery. This deity has been a central figure in egyptian mythology since ancient times, with traditions passed down through countless generations.",
    "worship": "Devotees honored Atum through traditional rituals, prayers, and offerings appropriate to the deity's sacred domains. The worship practices reflected deep reverence and the desire to maintain harmony with divine forces.",
    "symbols": "The iconography of Atum is rich with symbolic meaning. Traditional depictions capture the essence of the deity's sacred attributes and divine power.",
    "influence": "The influence of Atum extends far beyond ancient Egyptian culture. The deity's name has influenced language and continues to appear in modern contexts. As a figure of enduring fascination, Atum appears in literature, art, and popular culture, demonstrating the timeless appeal of these mythological traditions. The archetypal qualities embodied by Atum continue to resonate with contemporary audiences, offering insights into universal human experiences and spiritual yearnings."
  },
  "related_myths": [
    {
      "title": "Sacred Tales of Atum",
      "summary": "Numerous myths and legends feature Atum, each revealing different facets of the deity's character and illustrating important moral and spiritual lessons for devotees."
    }
  ],
  "background_image": "/assets/backgrounds/starfield-cosmic.jpg"
}