{
  "id": "bastet",
  "type": "deity",
  "name": "Bastet",
  "icon": "🐱",
  "mythologies": [
    "egyptian"
  ],
  "primaryMythology": "egyptian",
  "shortDescription": "Bastet is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual...",
  "longDescription": "Bastet is the beloved feline goddess of ancient Egypt, protector of the home, guardian against evil spirits and disease, and embodiment of joy and feminine power. Originally depicted as a fierce lioness warrior, she evolved into the gentle domestic cat goddess, though she retained her fierce protective nature when defending those under her care. As daughter of Ra, she represents the warming, nurturing aspect of the sun, in contrast to her fiercer leonine counterpart Sekhmet.\n\nDaughter of Ra: Bastet was born from the fire of Ra's eye, making her one of the solar deities. As the Eye of Ra, she represents the sun's gentler, nurturing warmth—the morning sun that brings joy and awakening, rather than the scorching midday heat. She was said to accompany Ra on his daily journey across the sky, her feline eyes watching for threats to the sun god. In some myths, she helped defend Ra against the serpent Apophis, who sought to devour the sun each night.\n\nThe Lioness Who Became a Cat: In the Old Kingdom, Bastet was depicted as a fierce lioness, nearly indistinguishable from Sekhmet. Some theologians considered them two aspects of the same goddess—Sekhmet being her wrathful form, Bastet her peaceful one. As Egypt moved from constant warfare to periods of peace and prosperity, Bastet's iconography shifted from the wild lioness to the domestic cat, reflecting the civilization's own transformation. However, she never lost her protective ferocity—like a house cat that purrs gently but can turn deadly when her kittens are threatened.\n\nProtector Against Evil: Bastet was invoked to protect homes from evil spirits, disease, and misfortune. Cats were considered magical guardians, their ability to see in darkness suggesting they could perceive supernatural threats invisible to humans. Bastet was particularly called upon during childbirth and to protect young children, much as cats protect their kittens. Her presence was believed to drive away the demons of illness and the spirits that caused miscarriage or infant death.\n\nGuardian of the Pharaoh: As a solar deity and protector, Bastet was closely associated with the pharaoh's divine protection. The king was said to be suckled by Bastet in her lioness form, granting him divine strength and protection. Her fierce nature defended the throne against enemies, while her nurturing aspect ensured the land's fertility and prosperity.\n\nGoddess of Joy and Celebration: Bastet's festivals were among the most joyous in Egypt. Her annual celebration at Bubastis drew hundreds of thousands of pilgrims who traveled by boat, playing music, singing, dancing, and drinking wine liberally. This reflected her domain over joy, music, dance, and the pleasures of life. She represented the balance between duty and enjoyment, protection and celebration.",
  "tags": [
    "bastet",
    "egyptian",
    "deity",
    "cats",
    "protection",
    "home",
    "fertility",
    "motherhood",
    "music",
    "dance",
    "joy",
    "perfume",
    "ointments",
    "the-sun's-warmth",
    "women's-secrets",
    "childbirth",
    "sexuality"
  ],
  "colors": {
    "primary": "#D4AF37",
    "secondary": "#8B4513"
  },
  "linguistic": {
    "originalName": "𓎟𓏏𓁐",
    "originalScript": "hieroglyphic",
    "transliteration": "bꜣstt",
    "pronunciation": "/ˈbaːstet/",
    "etymology": {
      "rootLanguage": "Ancient Egyptian",
      "meaning": "she of the ointment jar",
      "derivation": "Middle Egyptian hieroglyphic: bꜣstt"
    },
    "languageCode": "egy"
  },
  "geographical": {
    "primaryLocation": {
      "name": "Bubastis",
      "coordinates": {
        "latitude": 30.5772,
        "longitude": 31.5117,
        "accuracy": "exact"
      },
      "modernName": "Zagazig, Egypt",
      "type": "temple",
      "significance": "Primary cult center of Bastet"
    },
    "region": "Nile Valley",
    "culturalArea": "Ancient Egypt",
    "modernCountries": [
      "Egypt"
    ]
  },
  "temporal": {
    "historicalDate": {
      "start": {
        "year": -3000,
        "circa": true,
        "display": "c. 3000 BCE"
      },
      "end": {
        "year": 400,
        "circa": true,
        "display": "c. 400 CE"
      },
      "display": "c. 3000 BCE - 400 CE"
    },
    "culturalPeriod": "Ancient Egyptian civilization"
  },
  "sources": [
    {
      "title": "Pyramid Texts",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -2400,
        "circa": true,
        "display": "c. 2400 BCE"
      }
    },
    {
      "title": "Coffin Texts",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -2000,
        "circa": true,
        "display": "c. 2000 BCE"
      }
    },
    {
      "title": "Book of the Dead",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -1550,
        "circa": true,
        "display": "c. 1550 BCE"
      }
    }
  ],
  "metadata": {
    "created": "2025-12-13T09:00:34.480Z",
    "lastModified": "2025-12-27T06:47:51.044Z",
    "version": "2.0",
    "completeness": "enhanced"
  },
  "fullDescription": "Bastet is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual practices."
}
