{
  "id": "dionysus",
  "type": "deity",
  "name": "Dionysus",
  "icon": "🍇",
  "mythologies": [
    "greek"
  ],
  "primaryMythology": "greek",
  "shortDescription": "God of Wine, Ecstasy, and Theater\n\nThe twice-born god of wine, revelry, and divine madness. Dionysus brings liberation through wine and ecstatic...",
  "fullDescription": "God of Wine, Ecstasy, and Theater\n\nThe twice-born god of wine, revelry, and divine madness. Dionysus brings liberation through wine and ecstatic ritual, breaking down barriers between mortal and divine, civilization and nature.\n\nDionysus's myths often involve transformation, madness, and the breaking of social boundaries. He traveled extensively, bringing the gift of wine and his mystery cult to lands far beyond Greece.",
  "tags": [
    "dionysus",
    "greek",
    "wine",
    "ecstasy",
    "fertility",
    "theater",
    "ritual-madness",
    "vegetation",
    "bacchus",
    "the-twice-born",
    "thyrsus (fennel staff)",
    "wine cup",
    "grape vine",
    "ivy crown",
    "leopard skin"
  ],
  "colors": {
    "primary": "#DAA520",
    "secondary": "#FFD700"
  },
  "linguistic": {
    "originalName": "Διόνυσος",
    "originalScript": "greek",
    "transliteration": "Dionysus",
    "pronunciation": "/daɪəˈnaɪsəs/",
    "languageCode": "grc",
    "alternativeNames": [],
    "etymology": {
      "rootLanguage": "Proto-Indo-European",
      "meaning": "Zeus of Nysa",
      "derivation": ""
    }
  },
  "geographical": {
    "primaryLocation": {
      "name": "Mount Nysa",
      "coordinates": {
        "latitude": 38.5,
        "longitude": 24,
        "accuracy": "approximate"
      },
      "type": "temple",
      "description": "",
      "significance": ""
    },
    "region": "Mediterranean",
    "culturalArea": "Ancient Greece",
    "modernCountries": [
      "Greece"
    ]
  },
  "temporal": {
    "mythologicalDate": {
      "display": "Mythological Age"
    },
    "historicalDate": {
      "display": "c. 800 BCE - 400 CE"
    },
    "firstAttestation": {
      "date": {
        "year": -800,
        "circa": true,
        "display": "c. 800 BCE"
      },
      "source": "Homer's epics",
      "type": "literary",
      "confidence": "probable"
    },
    "culturalPeriod": "Classical Period"
  },
  "cultural": {
    "worshipPractices": [],
    "festivals": [],
    "socialRole": "Wine, ecstasy, fertility, theater, ritual madness, vegetation",
    "demographicAppeal": [],
    "modernLegacy": {}
  },
  "metaphysicalProperties": {
    "primaryElement": "water",
    "planets": [
      "Venus"
    ],
    "sefirot": [
      "yesod"
    ]
  },
  "relatedEntities": {
    "deities": [],
    "heroes": [
      {
        "id": "theseus",
        "name": "Theseus"
      }
    ],
    "creatures": [],
    "places": [
      {
        "id": "index",
        "name": "Greek Theater"
      }
    ],
    "items": []
  },
  "sources": [],
  "archetypes": [],
  "metadata": {
    "created": "2025-12-13T09:03:10.693Z",
    "lastModified": "2025-12-29T00:29:04.584Z",
    "version": "2.0",
    "completeness": 75,
    "migratedFrom": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\greek\\deities\\dionysus.html",
    "enriched": true,
    "enhanced": true,
    "enhancementVersion": "2.0"
  },
  "richDescription": "Dionysus occupies an important position in the greek pantheon, representing sacred principles and divine forces that shaped ancient understanding of the cosmos and humanity's place within it. This deity's influence extended across multiple domains, touching various aspects of religious and cultural life.\n\nFollowers of Dionysus maintained traditions of worship and ritual that honored the deity's specific attributes and sought divine favor in relevant aspects of daily life. The deity's cult reflected the values and concerns of the communities that venerated this divine figure.\n\nThe legacy of Dionysus endures through mythology, art, and cultural memory, preserving ancient wisdom and spiritual insights that continue to resonate across the ages.",
  "topic_panels": {
    "origins": "The origins of Dionysus are shrouded in ancient mystery. Historical evidence of this deity's worship dates to Homer's epics, demonstrating the long-standing significance of Dionysus in greek culture.",
    "worship": "Devotees honored Dionysus through traditional rituals, prayers, and offerings appropriate to the deity's sacred domains. The worship practices reflected deep reverence and the desire to maintain harmony with divine forces.",
    "symbols": "The iconography of Dionysus is rich with symbolic meaning. Traditional depictions capture the essence of the deity's sacred attributes and divine power.",
    "influence": "The influence of Dionysus extends far beyond ancient Greek culture. The deity's name has influenced language and continues to appear in modern contexts. As a figure of enduring fascination, Dionysus appears in literature, art, and popular culture, demonstrating the timeless appeal of these mythological traditions. The archetypal qualities embodied by Dionysus continue to resonate with contemporary audiences, offering insights into universal human experiences and spiritual yearnings."
  },
  "related_myths": [
    {
      "title": "Sacred Tales of Dionysus",
      "summary": "Numerous myths and legends feature Dionysus, each revealing different facets of the deity's character and illustrating important moral and spiritual lessons for devotees."
    }
  ],
  "background_image": "/assets/backgrounds/ocean-waves-mystic.jpg"
}