{
  "id": "hades",
  "type": "deity",
  "name": "Hades",
  "icon": "🏛️",
  "mythologies": [
    "greek"
  ],
  "primaryMythology": "greek",
  "shortDescription": "Lord of the Underworld, God of the Dead\n\nRuler of the underworld and keeper of the dead, Hades is one of the three great brothers who divided the...",
  "fullDescription": "Lord of the Underworld, God of the Dead\n\nRuler of the underworld and keeper of the dead, Hades is one of the three great brothers who divided the cosmos. Though feared and rarely worshipped openly, he maintains the balance between life and death, ensuring souls reach their proper destination.\n\nHades rules the realm of the dead with stern but fair justice. Unlike his brothers Zeus and Poseidon who actively involve themselves in mortal affairs, Hades remains in his dark kingdom, rarely leaving except on essential business.",
  "tags": [
    "hades",
    "greek",
    "underworld",
    "death",
    "the-dead",
    "hidden-wealth",
    "precious-metals",
    "lord-of-the-dead",
    "the-unseen-one",
    "helm of darkness",
    "bident",
    "cerberus",
    "cypress",
    "narcissus",
    "keys"
  ],
  "colors": {
    "primary": "#DAA520",
    "secondary": "#FFD700"
  },
  "linguistic": {
    "originalName": "ᾍδης",
    "originalScript": "greek",
    "transliteration": "Hades",
    "pronunciation": "/ˈheɪdiːz/",
    "languageCode": "grc",
    "alternativeNames": [],
    "etymology": {
      "rootLanguage": "Proto-Indo-European",
      "meaning": "The unseen one",
      "derivation": ""
    }
  },
  "geographical": {
    "primaryLocation": {
      "name": "Eleusis",
      "coordinates": {
        "latitude": 37.9838,
        "longitude": 23.7275,
        "accuracy": "approximate"
      },
      "type": "temple",
      "description": "",
      "significance": ""
    },
    "region": "Mediterranean",
    "culturalArea": "Ancient Greece",
    "modernCountries": [
      "Greece"
    ]
  },
  "temporal": {
    "mythologicalDate": {
      "display": "Mythological Age"
    },
    "historicalDate": {
      "display": "c. 800 BCE - 400 CE"
    },
    "firstAttestation": {
      "date": {
        "year": -800,
        "circa": true,
        "display": "c. 800 BCE"
      },
      "source": "Homer's epics",
      "type": "literary",
      "confidence": "probable"
    },
    "culturalPeriod": "Classical Period"
  },
  "cultural": {
    "worshipPractices": [],
    "festivals": [],
    "socialRole": "Underworld, death, the dead, hidden wealth, precious metals",
    "demographicAppeal": [],
    "modernLegacy": {}
  },
  "metaphysicalProperties": {
    "primaryElement": "earth",
    "planets": [
      "Pluto"
    ],
    "sefirot": [
      "gevurah"
    ]
  },
  "relatedEntities": {
    "deities": [],
    "heroes": [],
    "creatures": [],
    "places": [
      {
        "id": "afterlife",
        "name": "The Afterlife"
      }
    ],
    "items": []
  },
  "sources": [],
  "archetypes": [],
  "metadata": {
    "created": "2025-12-13T09:03:10.754Z",
    "lastModified": "2025-12-29T00:29:04.588Z",
    "version": "2.0",
    "completeness": 75,
    "migratedFrom": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\greek\\deities\\hades.html",
    "enriched": true,
    "enhanced": true,
    "enhancementVersion": "2.0"
  },
  "richDescription": "Hades occupies an important position in the greek pantheon, representing sacred principles and divine forces that shaped ancient understanding of the cosmos and humanity's place within it. This deity's influence extended across multiple domains, touching various aspects of religious and cultural life.\n\nFollowers of Hades maintained traditions of worship and ritual that honored the deity's specific attributes and sought divine favor in relevant aspects of daily life. The deity's cult reflected the values and concerns of the communities that venerated this divine figure.\n\nThe legacy of Hades endures through mythology, art, and cultural memory, preserving ancient wisdom and spiritual insights that continue to resonate across the ages.",
  "topic_panels": {
    "origins": "The origins of Hades are shrouded in ancient mystery. Historical evidence of this deity's worship dates to Homer's epics, demonstrating the long-standing significance of Hades in greek culture.",
    "worship": "Devotees honored Hades through traditional rituals, prayers, and offerings appropriate to the deity's sacred domains. The worship practices reflected deep reverence and the desire to maintain harmony with divine forces.",
    "symbols": "The iconography of Hades is rich with symbolic meaning. Traditional depictions capture the essence of the deity's sacred attributes and divine power.",
    "influence": "The influence of Hades extends far beyond ancient Greek culture. The deity's name has influenced language and continues to appear in modern contexts. As a figure of enduring fascination, Hades appears in literature, art, and popular culture, demonstrating the timeless appeal of these mythological traditions. The archetypal qualities embodied by Hades continue to resonate with contemporary audiences, offering insights into universal human experiences and spiritual yearnings."
  },
  "related_myths": [
    {
      "title": "Sacred Tales of Hades",
      "summary": "Numerous myths and legends feature Hades, each revealing different facets of the deity's character and illustrating important moral and spiritual lessons for devotees."
    }
  ],
  "background_image": "/assets/backgrounds/ancient-forest-mystical.jpg"
}