{
  "id": "hathor",
  "type": "deity",
  "name": "Hathor",
  "icon": "🐄",
  "mythologies": [
    "egyptian"
  ],
  "primaryMythology": "egyptian",
  "shortDescription": "Goddess of Love, Joy, Music, Beauty, and Motherhood",
  "longDescription": "Hathor is the cow-horned goddess of love, beauty, music, dance, motherhood, and joy. Mother or wife of Horus (depending on tradition), she could transform into Sekhmet when angered. Patron of miners, musicians, and dancers. The Eye of Ra in wrathful form, but usually benevolent goddess who brings joy and abundance.\n\n",
  "tags": [
    "hathor",
    "egyptian",
    "deity"
  ],
  "colors": {
    "primary": "#D4AF37",
    "secondary": "#8B4513"
  },
  "linguistic": {
    "originalName": "𓉡𓏏𓁐",
    "originalScript": "hieroglyphic",
    "transliteration": "ḥwt-ḥr",
    "pronunciation": "/ˈħatħar/",
    "etymology": {
      "rootLanguage": "Ancient Egyptian",
      "meaning": "house of Horus",
      "derivation": "Middle Egyptian hieroglyphic: ḥwt-ḥr"
    },
    "languageCode": "egy"
  },
  "geographical": {
    "primaryLocation": {
      "name": "Dendera",
      "coordinates": {
        "latitude": 26.1417,
        "longitude": 32.6708,
        "accuracy": "exact"
      },
      "modernName": "Dendera, Egypt",
      "type": "temple",
      "significance": "Primary cult center of Hathor"
    },
    "region": "Nile Valley",
    "culturalArea": "Ancient Egypt",
    "modernCountries": [
      "Egypt"
    ]
  },
  "temporal": {
    "historicalDate": {
      "start": {
        "year": -3000,
        "circa": true,
        "display": "c. 3000 BCE"
      },
      "end": {
        "year": 400,
        "circa": true,
        "display": "c. 400 CE"
      },
      "display": "c. 3000 BCE - 400 CE"
    },
    "culturalPeriod": "Ancient Egyptian civilization"
  },
  "sources": [
    {
      "title": "Pyramid Texts",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -2400,
        "circa": true,
        "display": "c. 2400 BCE"
      }
    },
    {
      "title": "Coffin Texts",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -2000,
        "circa": true,
        "display": "c. 2000 BCE"
      }
    },
    {
      "title": "Book of the Dead",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -1550,
        "circa": true,
        "display": "c. 1550 BCE"
      }
    }
  ],
  "metadata": {
    "created": "2025-12-13T09:00:34.481Z",
    "lastModified": "2025-12-29T00:29:04.589Z",
    "version": "2.0",
    "completeness": "enhanced",
    "enhanced": true,
    "enhancementVersion": "2.0"
  },
  "fullDescription": "Goddess of Love, Joy, Music, Beauty, and Motherhood This deity holds significant importance in egyptian mythology and spiritual traditions.",
  "richDescription": "Hathor occupies an important position in the egyptian pantheon, representing sacred principles and divine forces that shaped ancient understanding of the cosmos and humanity's place within it. This deity's influence extended across multiple domains, touching various aspects of religious and cultural life.\n\nFollowers of Hathor maintained traditions of worship and ritual that honored the deity's specific attributes and sought divine favor in relevant aspects of daily life. The deity's cult reflected the values and concerns of the communities that venerated this divine figure.\n\nThe legacy of Hathor endures through mythology, art, and cultural memory, preserving ancient wisdom and spiritual insights that continue to resonate across the ages.",
  "topic_panels": {
    "origins": "The origins of Hathor are shrouded in ancient mystery. This deity has been a central figure in egyptian mythology since ancient times, with traditions passed down through countless generations.",
    "worship": "Devotees honored Hathor through traditional rituals, prayers, and offerings appropriate to the deity's sacred domains. The worship practices reflected deep reverence and the desire to maintain harmony with divine forces.",
    "symbols": "The iconography of Hathor is rich with symbolic meaning. Traditional depictions capture the essence of the deity's sacred attributes and divine power.",
    "influence": "The influence of Hathor extends far beyond ancient Egyptian culture. The deity's name has influenced language and continues to appear in modern contexts. As a figure of enduring fascination, Hathor appears in literature, art, and popular culture, demonstrating the timeless appeal of these mythological traditions. The archetypal qualities embodied by Hathor continue to resonate with contemporary audiences, offering insights into universal human experiences and spiritual yearnings."
  },
  "related_myths": [
    {
      "title": "Sacred Tales of Hathor",
      "summary": "Numerous myths and legends feature Hathor, each revealing different facets of the deity's character and illustrating important moral and spiritual lessons for devotees."
    }
  ],
  "background_image": "/assets/backgrounds/starfield-cosmic.jpg"
}