{
  "id": "hera",
  "type": "deity",
  "name": "Hera",
  "icon": "👑",
  "mythologies": [
    "greek"
  ],
  "primaryMythology": "greek",
  "shortDescription": "Queen of the Gods, Goddess of Marriage and Family\n\nWife and sister of Zeus, Hera rules as Queen of Olympus and protector of marriage, women, and...",
  "fullDescription": "Queen of the Gods, Goddess of Marriage and Family\n\nWife and sister of Zeus, Hera rules as Queen of Olympus and protector of marriage, women, and childbirth. Though her mythology is dominated by Zeus's infidelities and her vengeful responses, she represents the sacred institution of marriage and the sovereignty of divine queenship.\n\nHera's mythology centers on her tumultuous marriage to Zeus, her fierce protection of marital sanctity, and her vengeful pursuit of Zeus's lovers and illegitimate children. Yet she also represents legitimate sovereignty and the power of the divine queen.",
  "tags": [
    "hera",
    "greek",
    "marriage",
    "women",
    "childbirth",
    "family",
    "queenship",
    "fidelity",
    "sovereignty",
    "queen-of-heaven",
    "cow-eyed-(boöpis)",
    "diadem (crown)",
    "scepter",
    "peacock",
    "pomegranate",
    "cow",
    "cuckoo"
  ],
  "colors": {
    "primary": "#DAA520",
    "secondary": "#FFD700"
  },
  "linguistic": {
    "originalName": "Ἥρα",
    "originalScript": "greek",
    "transliteration": "Hera",
    "pronunciation": "/ˈhɛr.ə/",
    "languageCode": "grc",
    "alternativeNames": [],
    "etymology": {
      "rootLanguage": "Proto-Indo-European",
      "meaning": "Protectress",
      "derivation": ""
    }
  },
  "geographical": {
    "primaryLocation": {
      "name": "Sanctuary of Hera, Olympia",
      "coordinates": {
        "latitude": 37.6467,
        "longitude": 21.63,
        "accuracy": "exact"
      },
      "type": "temple",
      "description": "",
      "significance": ""
    },
    "region": "Mediterranean",
    "culturalArea": "Ancient Greece",
    "modernCountries": [
      "Greece"
    ]
  },
  "temporal": {
    "mythologicalDate": {
      "display": "Mythological Age"
    },
    "historicalDate": {
      "display": "c. 800 BCE - 400 CE"
    },
    "firstAttestation": {
      "date": {
        "year": -800,
        "circa": true,
        "display": "c. 800 BCE"
      },
      "source": "Homer's epics",
      "type": "literary",
      "confidence": "probable"
    },
    "culturalPeriod": "Classical Period"
  },
  "cultural": {
    "worshipPractices": [],
    "festivals": [],
    "socialRole": "Marriage, women, childbirth, family, queenship, fidelity, sovereignty",
    "demographicAppeal": [],
    "modernLegacy": {}
  },
  "metaphysicalProperties": {
    "primaryElement": "air",
    "planets": [
      "Moon"
    ],
    "sefirot": [
      "binah"
    ]
  },
  "relatedEntities": {
    "deities": [],
    "heroes": [
      {
        "id": "heracles",
        "name": "Heracles"
      }
    ],
    "creatures": [],
    "places": [
      {
        "id": "mount-olympus",
        "name": "Mount Olympus"
      }
    ],
    "items": []
  },
  "sources": [],
  "archetypes": [],
  "metadata": {
    "created": "2025-12-13T09:03:10.792Z",
    "lastModified": "2025-12-29T00:29:04.571Z",
    "version": "2.0",
    "completeness": 75,
    "migratedFrom": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\greek\\deities\\hera.html",
    "enriched": true,
    "enhanced": true,
    "enhancementVersion": "2.0"
  },
  "richDescription": "Hera occupies an important position in the greek pantheon, representing sacred principles and divine forces that shaped ancient understanding of the cosmos and humanity's place within it. This deity's influence extended across multiple domains, touching various aspects of religious and cultural life.\n\nFollowers of Hera maintained traditions of worship and ritual that honored the deity's specific attributes and sought divine favor in relevant aspects of daily life. The deity's cult reflected the values and concerns of the communities that venerated this divine figure.\n\nThe legacy of Hera endures through mythology, art, and cultural memory, preserving ancient wisdom and spiritual insights that continue to resonate across the ages.",
  "topic_panels": {
    "origins": "The origins of Hera are shrouded in ancient mystery. Historical evidence of this deity's worship dates to Homer's epics, demonstrating the long-standing significance of Hera in greek culture.",
    "worship": "Devotees honored Hera through traditional rituals, prayers, and offerings appropriate to the deity's sacred domains. The worship practices reflected deep reverence and the desire to maintain harmony with divine forces.",
    "symbols": "The iconography of Hera is rich with symbolic meaning. Traditional depictions capture the essence of the deity's sacred attributes and divine power.",
    "influence": "The influence of Hera extends far beyond ancient Greek culture. The deity's name has influenced language and continues to appear in modern contexts. As a figure of enduring fascination, Hera appears in literature, art, and popular culture, demonstrating the timeless appeal of these mythological traditions. The archetypal qualities embodied by Hera continue to resonate with contemporary audiences, offering insights into universal human experiences and spiritual yearnings."
  },
  "related_myths": [
    {
      "title": "Sacred Tales of Hera",
      "summary": "Numerous myths and legends feature Hera, each revealing different facets of the deity's character and illustrating important moral and spiritual lessons for devotees."
    }
  ],
  "background_image": "/assets/backgrounds/sky-clouds-ethereal.jpg"
}