{
  "id": "maat",
  "type": "deity",
  "name": "Ma'at",
  "icon": "⚖️",
  "mythologies": [
    "egyptian"
  ],
  "primaryMythology": "egyptian",
  "shortDescription": "Goddess of Truth, Justice, Cosmic Order, and Balance",
  "longDescription": "Ma'at is both goddess and cosmic principle, embodying truth, justice, harmony, balance, order, and righteousness. She is the foundation of Egyptian civilization and the moral law that governs both gods and humans. Ma'at represents the opposite of chaos (isfet) and her feather weighs souls in the afterlife. To \"do ma'at\" meant to live righteously, maintain social order, and uphold divine law.\n\nCosmic Foundation: Ma'at was present at creation when Ra emerged from the primordial waters of Nun. She represents the order that replaced chaos. Ra stood on ma'at as his foundation when creating the world. Without ma'at, the universe would collapse back into chaos (isfet).\n\nThe Weighing of the Heart: In the Hall of Two Truths, the deceased's heart is weighed against Ma'at's feather by Anubis. A heart heavy with sin outweighs the feather and is devoured by Ammit, denying the soul eternal life. A heart lighter than or equal to the feather proves the deceased lived according to ma'at and may enter the Field of Reeds. Thoth records the result.\n\nPharaoh's Duty: Every pharaoh was crowned with the responsibility to \"do ma'at\" and \"present ma'at to the gods.\" Temple reliefs show pharaohs offering a small figure of Ma'at to the gods, symbolizing that just rule maintains cosmic order. If a pharaoh failed to uphold ma'at, chaos would engulf Egypt.\n\nCompanion of Ra: Ma'at rides in Ra's solar barque during his daily journey across the sky. Her presence maintains order and helps Ra resist Apep's chaos. She represents the stability that allows the sun to rise each day.\n\nEthical Living: Ma'at encompassed practical ethics: speaking truth, acting justly, being generous to the poor, respecting parents, honoring the gods, maintaining proper conduct. The \"Negative Confession\" in the Book of the Dead lists 42 sins the deceased must deny committing, each denial affirming they lived by ma'at.",
  "tags": [
    "maat",
    "egyptian",
    "deity",
    "truth",
    "justice",
    "cosmic-order",
    "balance",
    "harmony",
    "morality",
    "law",
    "righteousness",
    "proper-conduct"
  ],
  "colors": {
    "primary": "#D4AF37",
    "secondary": "#8B4513"
  },
  "linguistic": {
    "originalName": "𓁦𓏏",
    "originalScript": "hieroglyphic",
    "transliteration": "mꜣꜥt",
    "pronunciation": "/ˈmaʕat/",
    "etymology": {
      "rootLanguage": "Ancient Egyptian",
      "meaning": "truth, order",
      "derivation": "Middle Egyptian hieroglyphic: mꜣꜥt"
    },
    "languageCode": "egy"
  },
  "temporal": {
    "historicalDate": {
      "start": {
        "year": -3000,
        "circa": true,
        "display": "c. 3000 BCE"
      },
      "end": {
        "year": 400,
        "circa": true,
        "display": "c. 400 CE"
      },
      "display": "c. 3000 BCE - 400 CE"
    },
    "culturalPeriod": "Ancient Egyptian civilization"
  },
  "sources": [
    {
      "title": "Pyramid Texts",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -2400,
        "circa": true,
        "display": "c. 2400 BCE"
      }
    },
    {
      "title": "Coffin Texts",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -2000,
        "circa": true,
        "display": "c. 2000 BCE"
      }
    },
    {
      "title": "Book of the Dead",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -1550,
        "circa": true,
        "display": "c. 1550 BCE"
      }
    }
  ],
  "metadata": {
    "created": "2025-12-13T09:00:34.483Z",
    "lastModified": "2025-12-29T00:29:04.594Z",
    "version": "2.0",
    "completeness": "enhanced",
    "enhanced": true,
    "enhancementVersion": "2.0"
  },
  "fullDescription": "Goddess of Truth, Justice, Cosmic Order, and Balance This deity holds significant importance in egyptian mythology and spiritual traditions.",
  "richDescription": "Ma'at occupies an important position in the egyptian pantheon, representing sacred principles and divine forces that shaped ancient understanding of the cosmos and humanity's place within it. This deity's influence extended across multiple domains, touching various aspects of religious and cultural life.\n\nFollowers of Ma'at maintained traditions of worship and ritual that honored the deity's specific attributes and sought divine favor in relevant aspects of daily life. The deity's cult reflected the values and concerns of the communities that venerated this divine figure.\n\nThe legacy of Ma'at endures through mythology, art, and cultural memory, preserving ancient wisdom and spiritual insights that continue to resonate across the ages.",
  "topic_panels": {
    "origins": "The origins of Ma'at are shrouded in ancient mystery. This deity has been a central figure in egyptian mythology since ancient times, with traditions passed down through countless generations.",
    "worship": "Devotees honored Ma'at through traditional rituals, prayers, and offerings appropriate to the deity's sacred domains. The worship practices reflected deep reverence and the desire to maintain harmony with divine forces.",
    "symbols": "The iconography of Ma'at is rich with symbolic meaning. Traditional depictions capture the essence of the deity's sacred attributes and divine power.",
    "influence": "The influence of Ma'at extends far beyond ancient Egyptian culture. The deity's name has influenced language and continues to appear in modern contexts. As a figure of enduring fascination, Ma'at appears in literature, art, and popular culture, demonstrating the timeless appeal of these mythological traditions. The archetypal qualities embodied by Ma'at continue to resonate with contemporary audiences, offering insights into universal human experiences and spiritual yearnings."
  },
  "related_myths": [
    {
      "title": "Sacred Tales of Ma'at",
      "summary": "Numerous myths and legends feature Ma'at, each revealing different facets of the deity's character and illustrating important moral and spiritual lessons for devotees."
    }
  ],
  "background_image": "/assets/backgrounds/starfield-cosmic.jpg"
}