{
  "id": "nephthys",
  "type": "deity",
  "name": "Nephthys",
  "icon": "🕊️",
  "mythologies": [
    "egyptian"
  ],
  "primaryMythology": "egyptian",
  "shortDescription": "Lady of the House - Goddess of Death, Funerary Rites, and Hidden Things",
  "longDescription": "Nephthys is the mysterious goddess of death, night, and mourning in ancient Egyptian mythology. As the \"Lady of the House\" and \"Lady of Hidden Things,\" she presides over funerary rites, protects the dead on their journey through the underworld, and stands as the divine mourner alongside her sister Isis. Though wife of Set, she aided Isis in resurrecting Osiris and is mother to Anubis through a union with Osiris. Her presence represents the unseen aspects of existence—darkness, secrets, and the transition between life and death.\n\nAiding Isis in Resurrecting Osiris: When Set murdered and dismembered Osiris, Nephthys betrayed her husband to help her sister Isis. Together, the two sisters searched throughout Egypt, gathering the scattered pieces of Osiris. They transformed into kite birds, circling over the reassembled body while chanting the \"Lamentations of Isis and Nephthys,\" powerful magical incantations that helped restore Osiris to temporary life. This ritual became the prototype for all Egyptian funerary rites, with professional mourners reenacting the roles of Isis and Nephthys at every funeral. Nephthys represented the hidden, darker aspects of mourning and death—the night to Isis's day, the shadow to her light.\n\nThe Birth of Anubis: In one tradition, Nephthys was childless in her marriage to the sterile Set. Desiring a child and attracted to the vitality of Osiris, she disguised herself as Isis and seduced him. From this union was born Anubis, the jackal-headed god of mummification. Fearing Set's wrath, Nephthys abandoned the infant in the wilderness. Isis, discovering the child, raised him as her own with compassion rather than jealousy. Anubis grew to become the divine embalmer who would prepare his father Osiris for resurrection—a fitting role that connected mother and son through death rites. This myth explains Nephthys's association with hidden things (the secret affair) and her deep connection to funerary practices through her son.\n\nGuardian of the Coffin: In funerary texts and art, Nephthys stands as one of the four protective goddesses guarding the corners of the coffin and the canopic shrine. She specifically protects the canopic jar containing the lungs (guarded by the god Hapy, one of the Four Sons of Horus). Her wings spread protectively over the deceased, shielding them from malevolent forces in the underworld. In the Book of the Dead, she speaks protective spells that guide the deceased through the dangerous passages of the Duat. Unlike Isis, who represents resurrection and return to life, Nephthys ensures peaceful passage into death and protection within the realm of the dead.\n\nThe Invisible Companion: Nephthys was called \"Lady of Hidden Things\" because she represented everything unseen—the darkness of night when mysteries occur, the hidden processes of decay that must happen before rebirth, the secret knowledge possessed only by priestesses and embalmers. While Isis performed visible, active magic, Nephthys worked in shadows and silence. She was present at every death but rarely invoked directly, her power operating through subtle influence rather than dramatic intervention. Her name itself—\"Lady of the House\"—refers to the temple enclosure or the \"house\" of death (tomb), the hidden dwelling place where the dead reside.",
  "tags": [
    "nephthys",
    "egyptian",
    "deity",
    "death",
    "funerary-rites",
    "mourning",
    "night",
    "darkness",
    "hidden-things",
    "protection-of-the-dead",
    "transition",
    "secrets",
    "temples",
    "service"
  ],
  "colors": {
    "primary": "#D4AF37",
    "secondary": "#8B4513"
  },
  "linguistic": {
    "originalName": "𓎞𓏏𓁐",
    "originalScript": "hieroglyphic",
    "transliteration": "nbt-ḥwt",
    "pronunciation": "/nebˈteħwet/",
    "etymology": {
      "rootLanguage": "Ancient Egyptian",
      "meaning": "lady of the house",
      "derivation": "Middle Egyptian hieroglyphic: nbt-ḥwt"
    },
    "languageCode": "egy"
  },
  "temporal": {
    "historicalDate": {
      "start": {
        "year": -3000,
        "circa": true,
        "display": "c. 3000 BCE"
      },
      "end": {
        "year": 400,
        "circa": true,
        "display": "c. 400 CE"
      },
      "display": "c. 3000 BCE - 400 CE"
    },
    "culturalPeriod": "Ancient Egyptian civilization"
  },
  "sources": [
    {
      "title": "Pyramid Texts",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -2400,
        "circa": true,
        "display": "c. 2400 BCE"
      }
    },
    {
      "title": "Coffin Texts",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -2000,
        "circa": true,
        "display": "c. 2000 BCE"
      }
    },
    {
      "title": "Book of the Dead",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -1550,
        "circa": true,
        "display": "c. 1550 BCE"
      }
    }
  ],
  "metadata": {
    "created": "2025-12-13T09:00:34.484Z",
    "lastModified": "2025-12-13T09:00:34.484Z",
    "version": "2.0",
    "completeness": "enhanced"
  }
}