{
  "id": "osiris",
  "type": "deity",
  "name": "Osiris",
  "icon": "👑",
  "mythologies": [
    "egyptian"
  ],
  "primaryMythology": "egyptian",
  "shortDescription": "Lord of the Afterlife, God of Death and Resurrection",
  "longDescription": "Osiris is the ancient Egyptian god of the dead, resurrection, and agriculture. Murdered by his brother Set and resurrected by his wife Isis, Osiris became the eternal king of the underworld (Duat), judge of the deceased, and symbol of eternal life. His myth of death and rebirth mirrors the agricultural cycle and offers hope of immortality to all who live by Ma'at.\n\nThe Murder of Osiris: Osiris ruled Egypt as a wise and beneficent king, teaching humanity agriculture, civilization, and law. His jealous brother Set (god of chaos and desert) conspired to seize the throne. Set crafted an ornate chest precisely fitted to Osiris's measurements and held a great feast. He promised to give the chest to whomever fit inside perfectly. When Osiris lay down in it, Set and 72 conspirators slammed the lid shut, sealed it with molten lead, and cast it into the Nile. The chest floated to Byblos (in Phoenicia) where a tamarisk tree grew around it, encasing the god's body within its trunk.\n\nIsis's Quest and First Resurrection: Isis, Osiris's devoted wife and sister, searched desperately for her husband's body. She found the tree in Byblos, serving as a pillar in the king's palace, and brought Osiris's body back to Egypt, hiding it in the Nile Delta marshes. But Set discovered the body and tore it into fourteen pieces (or forty-two in some versions, one for each nome of Egypt), scattering them throughout the land. Isis, aided by her sister Nephthys (Set's wife), traveled Egypt collecting every piece. The only part never found was his phallus, devoured by an oxyrhynchus fish (forever after forbidden as food). Isis fashioned a replacement from gold and, using her powerful magic, temporarily resurrected Osiris long enough to conceive their son Horus. She transformed into a kite (bird) and hovered over Osiris's body, fanning life into him with her wings.\n\nMummification and Transformation: After conception, Osiris could not remain in the world of the living. Anubis, the jackal-headed god of embalming, performed the first mummification on Osiris's body, establishing the prototype for all Egyptian funerary rites. Osiris descended to become eternal ruler of the Duat, the underworld realm of the dead. Though he could not return to life, he achieved transformation into an eternal state, becoming the first being to die and be reborn. His green skin represents this regenerated state—life emerging from death, like crops from planted seeds.\n\nThe Judgment of the Dead: In his role as Lord of the Duat, Osiris presides over the weighing of the heart ceremony in the Hall of Ma'at. The deceased's heart is weighed against the feather of Ma'at (truth and justice) by Anubis, while Thoth records the result. Osiris sits enthroned, attended by the 42 divine judges, observing whether the heart is lighter than the feather (indicating a life lived by Ma'at) or heavier (laden with sin). If the heart is light, the deceased is declared \"justified\" (maa-kheru) and welcomed into the Field of Reeds, a paradise version of Egypt. If heavy, the heart is devoured by Ammit (the devourer), and the soul ceases to exist. Justified souls are called \"Osiris [Name],\" becoming one with the god.\n\nHorus Avenges His Father: After Osiris's death, Isis raised their son Horus in secret in the Delta marshes, protecting him from Set's murderous intent. When Horus reached maturity, he challenged Set for the throne of Egypt. Their contendings lasted eighty years, involving battles, trials before the divine tribunal (presided over by Ra), and tests of strength and cunning. Ultimately, the gods awarded kingship to Horus, establishing the principle that the living pharaoh embodies Horus while the dead pharaoh becomes Osiris. This myth legitimized royal succession and linked every pharaoh to divine ancestry.",
  "tags": [
    "osiris",
    "egyptian",
    "deity",
    "death",
    "afterlife",
    "resurrection",
    "rebirth",
    "agriculture",
    "fertility",
    "vegetation",
    "judgment-of-the-dead",
    "kingship",
    "transformation"
  ],
  "colors": {
    "primary": "#D4AF37",
    "secondary": "#8B4513"
  },
  "linguistic": {
    "originalName": "𓊨𓁹𓁛",
    "originalScript": "hieroglyphic",
    "transliteration": "wsjr",
    "pronunciation": "/wəˈsiːrə/",
    "etymology": {
      "rootLanguage": "Ancient Egyptian",
      "meaning": "mighty one",
      "derivation": "Middle Egyptian hieroglyphic: wsjr"
    },
    "languageCode": "egy"
  },
  "geographical": {
    "primaryLocation": {
      "name": "Abydos",
      "coordinates": {
        "latitude": 26.1843,
        "longitude": 31.9205,
        "accuracy": "exact"
      },
      "modernName": "Abydos, Egypt",
      "type": "temple",
      "significance": "Primary cult center of Osiris"
    },
    "region": "Nile Valley",
    "culturalArea": "Ancient Egypt",
    "modernCountries": [
      "Egypt"
    ]
  },
  "temporal": {
    "historicalDate": {
      "start": {
        "year": -3000,
        "circa": true,
        "display": "c. 3000 BCE"
      },
      "end": {
        "year": 400,
        "circa": true,
        "display": "c. 400 CE"
      },
      "display": "c. 3000 BCE - 400 CE"
    },
    "culturalPeriod": "Ancient Egyptian civilization"
  },
  "sources": [
    {
      "title": "Pyramid Texts",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -2400,
        "circa": true,
        "display": "c. 2400 BCE"
      }
    },
    {
      "title": "Coffin Texts",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -2000,
        "circa": true,
        "display": "c. 2000 BCE"
      }
    },
    {
      "title": "Book of the Dead",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -1550,
        "circa": true,
        "display": "c. 1550 BCE"
      }
    }
  ],
  "metadata": {
    "created": "2025-12-13T09:00:34.485Z",
    "lastModified": "2025-12-27T06:47:37.241Z",
    "version": "2.0",
    "completeness": "enhanced"
  },
  "fullDescription": "Lord of the Afterlife, God of Death and Resurrection This deity holds significant importance in egyptian mythology and spiritual traditions."
}
