{
  "id": "persephone",
  "type": "deity",
  "name": "Persephone - Greek Mythology",
  "icon": "🌸",
  "mythologies": [
    "greek"
  ],
  "primaryMythology": "greek",
  "shortDescription": "Queen of the Underworld, Goddess of Spring and Vegetation",
  "fullDescription": "Queen of the Underworld, Goddess of Spring and Vegetation\n\nDaughter of Demeter and Zeus, Persephone embodies the cycle of life, death, and rebirth. Abducted by Hades to become Queen of the Underworld, she spends half the year below with the dead and half above bringing spring's renewal, creating the seasons through her eternal journey between realms.\n\nPersephone's mythology centers on her abduction and the resulting explanation for the seasons, but she also holds sovereign power as Queen of the Underworld, ruling alongside Hades and presiding over the mysteries of death and rebirth.",
  "tags": [
    "persephone",
    "greek",
    "spring",
    "vegetation",
    "the-dead",
    "underworld",
    "seasons",
    "renewal",
    "mystery-rites",
    "kore-(the-maiden)",
    "despoina-(the-mistress)",
    "pomegranate",
    "torch",
    "flowers (especially narcissus)",
    "grain",
    "wreath of flowers"
  ],
  "colors": {
    "primary": "#DAA520",
    "secondary": "#FFD700"
  },
  "linguistic": {
    "originalName": "",
    "originalScript": "greek",
    "transliteration": "Persephone - Greek Mythology",
    "pronunciation": "",
    "languageCode": "grc",
    "alternativeNames": [],
    "etymology": {
      "rootLanguage": "Ancient Greek",
      "meaning": "",
      "derivation": ""
    }
  },
  "geographical": {
    "primaryLocation": {
      "name": "",
      "coordinates": {
        "latitude": 38,
        "longitude": 23,
        "accuracy": "general_area"
      },
      "type": "temple",
      "description": "",
      "significance": ""
    },
    "region": "Mediterranean",
    "culturalArea": "Ancient Greece",
    "modernCountries": [
      "Greece"
    ]
  },
  "temporal": {
    "mythologicalDate": {
      "display": "Mythological Age"
    },
    "historicalDate": {
      "display": "c. 800 BCE - 400 CE"
    },
    "firstAttestation": {
      "date": {
        "year": -800,
        "circa": true,
        "display": "c. 800 BCE"
      },
      "source": "Homer",
      "type": "literary",
      "confidence": "probable"
    },
    "culturalPeriod": "Classical Period"
  },
  "cultural": {
    "worshipPractices": [],
    "festivals": [],
    "socialRole": "Spring, vegetation, the dead, underworld, seasons, renewal, mystery rites",
    "demographicAppeal": [],
    "modernLegacy": {}
  },
  "metaphysicalProperties": {},
  "relatedEntities": {
    "deities": [],
    "heroes": [],
    "creatures": [],
    "places": [
      {
        "id": "underworld",
        "name": "The Underworld"
      }
    ],
    "items": []
  },
  "sources": [],
  "archetypes": [],
  "metadata": {
    "created": "2025-12-13T09:03:10.839Z",
    "lastModified": "2025-12-29T00:29:04.597Z",
    "version": "2.0",
    "completeness": 60,
    "migratedFrom": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\greek\\deities\\persephone.html",
    "enhanced": true,
    "enhancementVersion": "2.0"
  },
  "richDescription": "Persephone - Greek Mythology occupies an important position in the greek pantheon, representing sacred principles and divine forces that shaped ancient understanding of the cosmos and humanity's place within it. This deity's influence extended across multiple domains, touching various aspects of religious and cultural life.\n\nFollowers of Persephone - Greek Mythology maintained traditions of worship and ritual that honored the deity's specific attributes and sought divine favor in relevant aspects of daily life. The deity's cult reflected the values and concerns of the communities that venerated this divine figure.\n\nThe legacy of Persephone - Greek Mythology endures through mythology, art, and cultural memory, preserving ancient wisdom and spiritual insights that continue to resonate across the ages.",
  "topic_panels": {
    "origins": "The origins of Persephone - Greek Mythology are shrouded in ancient mystery. Historical evidence of this deity's worship dates to Homer, demonstrating the long-standing significance of Persephone - Greek Mythology in greek culture.",
    "worship": "Devotees honored Persephone - Greek Mythology through traditional rituals, prayers, and offerings appropriate to the deity's sacred domains. The worship practices reflected deep reverence and the desire to maintain harmony with divine forces.",
    "symbols": "The iconography of Persephone - Greek Mythology is rich with symbolic meaning. Traditional depictions capture the essence of the deity's sacred attributes and divine power.",
    "influence": "The influence of Persephone - Greek Mythology extends far beyond ancient Greek culture. The deity's name has influenced language and continues to appear in modern contexts. As a figure of enduring fascination, Persephone - Greek Mythology appears in literature, art, and popular culture, demonstrating the timeless appeal of these mythological traditions. The archetypal qualities embodied by Persephone - Greek Mythology continue to resonate with contemporary audiences, offering insights into universal human experiences and spiritual yearnings."
  },
  "related_myths": [
    {
      "title": "Sacred Tales of Persephone - Greek Mythology",
      "summary": "Numerous myths and legends feature Persephone - Greek Mythology, each revealing different facets of the deity's character and illustrating important moral and spiritual lessons for devotees."
    }
  ],
  "background_image": "/assets/backgrounds/starfield-cosmic.jpg"
}