{
  "id": "pluto",
  "type": "deity",
  "name": "Pluto",
  "icon": "✨",
  "mythologies": [
    "greek"
  ],
  "primaryMythology": "greek",
  "shortDescription": "Roman name for Hades, emphasizing his role as god of wealth.\n\nThis page is under development. More content coming soon.\n\nPluto represents the wealth...",
  "fullDescription": "Roman name for Hades, emphasizing his role as god of wealth.\n\nThis page is under development. More content coming soon.\n\nPluto represents the wealth hidden beneath the earth and dominion over the dead.",
  "tags": [
    "pluto",
    "greek"
  ],
  "colors": {
    "primary": "#DAA520",
    "secondary": "#FFD700"
  },
  "linguistic": {
    "originalName": "",
    "originalScript": "greek",
    "transliteration": "Pluto",
    "pronunciation": "",
    "languageCode": "grc",
    "alternativeNames": [],
    "etymology": {
      "rootLanguage": "Ancient Greek",
      "meaning": "",
      "derivation": ""
    }
  },
  "geographical": {
    "primaryLocation": {
      "name": "",
      "coordinates": {
        "latitude": 38,
        "longitude": 23,
        "accuracy": "general_area"
      },
      "type": "temple",
      "description": "",
      "significance": ""
    },
    "region": "Mediterranean",
    "culturalArea": "Ancient Greece",
    "modernCountries": [
      "Greece"
    ]
  },
  "temporal": {
    "mythologicalDate": {
      "display": "Mythological Age"
    },
    "historicalDate": {
      "display": "c. 800 BCE - 400 CE"
    },
    "firstAttestation": {
      "date": {
        "year": -800,
        "circa": true,
        "display": "c. 800 BCE"
      },
      "source": "Homer",
      "type": "literary",
      "confidence": "probable"
    },
    "culturalPeriod": "Classical Period"
  },
  "cultural": {
    "worshipPractices": [],
    "festivals": [],
    "socialRole": "",
    "demographicAppeal": [],
    "modernLegacy": {}
  },
  "metaphysicalProperties": {},
  "relatedEntities": {
    "deities": [],
    "heroes": [],
    "creatures": [],
    "places": [
      {
        "id": "underworld",
        "name": "Underworld"
      }
    ],
    "items": []
  },
  "sources": [],
  "archetypes": [],
  "metadata": {
    "created": "2025-12-13T09:03:10.846Z",
    "lastModified": "2025-12-29T00:29:04.597Z",
    "version": "2.0",
    "completeness": 45,
    "migratedFrom": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\greek\\deities\\pluto.html",
    "enhanced": true,
    "enhancementVersion": "2.0"
  },
  "richDescription": "Pluto occupies an important position in the greek pantheon, representing sacred principles and divine forces that shaped ancient understanding of the cosmos and humanity's place within it. This deity's influence extended across multiple domains, touching various aspects of religious and cultural life.\n\nFollowers of Pluto maintained traditions of worship and ritual that honored the deity's specific attributes and sought divine favor in relevant aspects of daily life. The deity's cult reflected the values and concerns of the communities that venerated this divine figure.\n\nThe legacy of Pluto endures through mythology, art, and cultural memory, preserving ancient wisdom and spiritual insights that continue to resonate across the ages.",
  "topic_panels": {
    "origins": "The origins of Pluto are shrouded in ancient mystery. Historical evidence of this deity's worship dates to Homer, demonstrating the long-standing significance of Pluto in greek culture.",
    "worship": "Devotees honored Pluto through traditional rituals, prayers, and offerings appropriate to the deity's sacred domains. The worship practices reflected deep reverence and the desire to maintain harmony with divine forces.",
    "symbols": "The iconography of Pluto is rich with symbolic meaning. Traditional depictions capture the essence of the deity's sacred attributes and divine power.",
    "influence": "The influence of Pluto extends far beyond ancient Greek culture. The deity's name has influenced language and continues to appear in modern contexts. As a figure of enduring fascination, Pluto appears in literature, art, and popular culture, demonstrating the timeless appeal of these mythological traditions. The archetypal qualities embodied by Pluto continue to resonate with contemporary audiences, offering insights into universal human experiences and spiritual yearnings."
  },
  "related_myths": [
    {
      "title": "Sacred Tales of Pluto",
      "summary": "Numerous myths and legends feature Pluto, each revealing different facets of the deity's character and illustrating important moral and spiritual lessons for devotees."
    }
  ],
  "background_image": "/assets/backgrounds/starfield-cosmic.jpg"
}