{
  "id": "poseidon",
  "type": "deity",
  "name": "Poseidon",
  "icon": "🔱",
  "mythologies": [
    "greek"
  ],
  "primaryMythology": "greek",
  "shortDescription": "God of the Sea, Earthquakes, and Horses\n\nOne of the three great sons of Kronos who divided the cosmos, Poseidon commands the vast oceans, shakes the...",
  "fullDescription": "God of the Sea, Earthquakes, and Horses\n\nOne of the three great sons of Kronos who divided the cosmos, Poseidon commands the vast oceans, shakes the earth with his mighty trident, and created the first horses. Known as the Earth-Shaker and Lord of the Seas, he embodies the dual nature of water itself: life-giving sustenance and terrifying destruction. Sailors, fishermen, and coastal peoples throughout the ancient world honored this tempestuous deity.\n\nPoseidon's mythology reflects the ancient Greeks' profound and ambivalent relationship with the sea. As god of all waters, he could grant safe passage and bountiful catches, or unleash devastating storms and earthquakes. His temperament was as changeable as the ocean itself, quick to anger but capable of great benevolence to those who honored him.",
  "tags": [
    "poseidon",
    "greek",
    "seas",
    "oceans",
    "storms",
    "earthquakes",
    "horses",
    "navigation",
    "floods",
    "springs",
    "coastal-regions",
    "trident",
    "dolphins",
    "horses",
    "bull",
    "chariot",
    "anchor",
    "fish",
    "seashells"
  ],
  "colors": {
    "primary": "#DAA520",
    "secondary": "#FFD700"
  },
  "linguistic": {
    "originalName": "Ποσειδῶν",
    "originalScript": "greek",
    "transliteration": "Poseidon",
    "pronunciation": "/pəˈsaɪdən/",
    "languageCode": "grc",
    "alternativeNames": [],
    "etymology": {
      "rootLanguage": "Proto-Indo-European",
      "meaning": "Husband of earth",
      "derivation": ""
    }
  },
  "geographical": {
    "primaryLocation": {
      "name": "Temple of Poseidon, Cape Sounion",
      "coordinates": {
        "latitude": 37.8833,
        "longitude": 23.4667,
        "accuracy": "exact"
      },
      "type": "temple",
      "description": "",
      "significance": ""
    },
    "region": "Mediterranean",
    "culturalArea": "Ancient Greece",
    "modernCountries": [
      "Greece"
    ]
  },
  "temporal": {
    "mythologicalDate": {
      "display": "Mythological Age"
    },
    "historicalDate": {
      "display": "c. 800 BCE - 400 CE"
    },
    "firstAttestation": {
      "date": {
        "year": -800,
        "circa": true,
        "display": "c. 800 BCE"
      },
      "source": "Homer's epics",
      "type": "literary",
      "confidence": "probable"
    },
    "culturalPeriod": "Classical Period"
  },
  "cultural": {
    "worshipPractices": [],
    "festivals": [],
    "socialRole": "Seas, oceans, storms, earthquakes, horses, navigation, floods, springs, coastal regions",
    "demographicAppeal": [],
    "modernLegacy": {}
  },
  "metaphysicalProperties": {
    "primaryElement": "water",
    "planets": [
      "Neptune"
    ],
    "sefirot": [
      "chesed"
    ]
  },
  "relatedEntities": {
    "deities": [],
    "heroes": [
      {
        "id": "theseus",
        "name": "Theseus"
      },
      {
        "id": "odysseus",
        "name": "Odysseus"
      }
    ],
    "creatures": [
      {
        "id": "index",
        "name": "Polyphemus"
      }
    ],
    "places": [],
    "items": []
  },
  "sources": [],
  "archetypes": [],
  "metadata": {
    "created": "2025-12-13T09:03:10.866Z",
    "lastModified": "2025-12-29T00:29:04.575Z",
    "version": "2.0",
    "completeness": 75,
    "migratedFrom": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\greek\\deities\\poseidon.html",
    "enriched": true,
    "enhanced": true,
    "enhancementVersion": "2.0"
  },
  "richDescription": "Poseidon occupies an important position in the greek pantheon, representing sacred principles and divine forces that shaped ancient understanding of the cosmos and humanity's place within it. This deity's influence extended across multiple domains, touching various aspects of religious and cultural life.\n\nFollowers of Poseidon maintained traditions of worship and ritual that honored the deity's specific attributes and sought divine favor in relevant aspects of daily life. The deity's cult reflected the values and concerns of the communities that venerated this divine figure.\n\nThe legacy of Poseidon endures through mythology, art, and cultural memory, preserving ancient wisdom and spiritual insights that continue to resonate across the ages.",
  "topic_panels": {
    "origins": "The origins of Poseidon are shrouded in ancient mystery. Historical evidence of this deity's worship dates to Homer's epics, demonstrating the long-standing significance of Poseidon in greek culture.",
    "worship": "Devotees honored Poseidon through traditional rituals, prayers, and offerings appropriate to the deity's sacred domains. The worship practices reflected deep reverence and the desire to maintain harmony with divine forces.",
    "symbols": "The iconography of Poseidon is rich with symbolic meaning. Traditional depictions capture the essence of the deity's sacred attributes and divine power.",
    "influence": "The influence of Poseidon extends far beyond ancient Greek culture. The deity's name has influenced language and continues to appear in modern contexts. As a figure of enduring fascination, Poseidon appears in literature, art, and popular culture, demonstrating the timeless appeal of these mythological traditions. The archetypal qualities embodied by Poseidon continue to resonate with contemporary audiences, offering insights into universal human experiences and spiritual yearnings."
  },
  "related_myths": [
    {
      "title": "Sacred Tales of Poseidon",
      "summary": "Numerous myths and legends feature Poseidon, each revealing different facets of the deity's character and illustrating important moral and spiritual lessons for devotees."
    }
  ],
  "background_image": "/assets/backgrounds/ocean-waves-mystic.jpg"
}