{
  "id": "ra",
  "type": "deity",
  "name": "Ra",
  "icon": "☀️",
  "mythologies": [
    "egyptian"
  ],
  "primaryMythology": "egyptian",
  "shortDescription": "The Sun God, Creator, King of the Gods",
  "longDescription": "Ra is the supreme solar deity of ancient Egypt, the self-created god who emerged from the primordial waters of Nun to bring light, life, and order to the cosmos. As the sun traversing the sky in his golden barque, Ra embodies divine kingship, the eternal cycle of death and rebirth, and the ultimate source of all existence.\n\nCreation from Nun: In the beginning was only Nun, the primordial waters of chaos. From these waters arose the benben stone, the first land, and upon it Ra (as Atum-Ra) created himself through an act of will and divine masturbation or spitting. He spoke his own name, bringing himself into existence, then created Shu (air) and Tefnut (moisture), beginning the Ennead lineage. Ra's tears became the first humans.\n\nThe Daily Solar Journey: Each day, Ra travels across the sky in his golden solar barque called the Mandjet (Day Boat). He is accompanied by Ma'at (order), Thoth (wisdom), and defenders against chaos. At noon he reaches his zenith as Ra-Horakhty. At dusk, he boards the Mesektet (Night Boat) and descends into the Duat (underworld), where he must traverse twelve hours of night, facing demons and the chaos serpent Apep. Each dawn he is reborn as Khepri (the scarab), emerging victorious from darkness.\n\nThe Secret Name of Ra: Ra possessed a secret true name which held the source of his power. Isis, desiring ultimate magical authority, crafted a serpent from Ra's spittle and earth, which bit him. Only Isis could heal the poison, but demanded his true name as payment. Reluctantly, Ra whispered his secret name into Isis's ear, transferring immense magical power to her. This myth explains Isis's supremacy in magic and shows even the greatest god could be manipulated through knowledge.\n\nRa's Eye and the Destruction of Humanity: When Ra grew old and humanity rebelled against his rule, he sent his Eye - manifesting as the goddess Sekhmet (or Hathor in wrathful form) - to punish them. Sekhmet became drunk on bloodlust and nearly destroyed all humanity. Ra relented and tricked her into drinking beer dyed red with pomegranate juice, which she mistook for blood. Intoxicated, she ceased her slaughter. This myth established the Sekhmet festival where beer was consumed to commemorate humanity's salvation.\n\nThe Contendings of Horus and Set: Ra presided over the divine tribunal that judged between Horus and Set for rulership of Egypt. Though Ra initially favored Set (who defended his barque nightly from Apep), the other gods and Ra's own daughter Hathor persuaded him to award kingship to Horus, establishing the principle of rightful succession.",
  "tags": [
    "ra",
    "egyptian",
    "deity",
    "sun",
    "light",
    "creation",
    "kingship",
    "cosmic-order-(ma'at)",
    "life-force-(ka)",
    "time"
  ],
  "colors": {
    "primary": "#FFD700",
    "secondary": "#8B4513"
  },
  "linguistic": {
    "originalName": "𓁛𓏺",
    "originalScript": "hieroglyphic",
    "transliteration": "rꜥ",
    "pronunciation": "/ɾaʕ/",
    "etymology": {
      "rootLanguage": "Ancient Egyptian",
      "meaning": "sun",
      "derivation": "Middle Egyptian hieroglyphic: rꜥ"
    },
    "languageCode": "egy"
  },
  "geographical": {
    "primaryLocation": {
      "name": "Heliopolis",
      "coordinates": {
        "latitude": 30.1213,
        "longitude": 31.3037,
        "accuracy": "exact"
      },
      "modernName": "Cairo, Egypt",
      "type": "temple",
      "significance": "Primary cult center of Ra"
    },
    "region": "Nile Valley",
    "culturalArea": "Ancient Egypt",
    "modernCountries": [
      "Egypt"
    ]
  },
  "temporal": {
    "historicalDate": {
      "start": {
        "year": -3000,
        "circa": true,
        "display": "c. 3000 BCE"
      },
      "end": {
        "year": 400,
        "circa": true,
        "display": "c. 400 CE"
      },
      "display": "c. 3000 BCE - 400 CE"
    },
    "culturalPeriod": "Ancient Egyptian civilization"
  },
  "sources": [
    {
      "title": "Pyramid Texts",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -2400,
        "circa": true,
        "display": "c. 2400 BCE"
      }
    },
    {
      "title": "Coffin Texts",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -2000,
        "circa": true,
        "display": "c. 2000 BCE"
      }
    },
    {
      "title": "Book of the Dead",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -1550,
        "circa": true,
        "display": "c. 1550 BCE"
      }
    }
  ],
  "metadata": {
    "created": "2025-12-13T09:00:34.486Z",
    "lastModified": "2025-12-13T09:00:34.486Z",
    "version": "2.0",
    "completeness": "enhanced"
  }
}