{
  "id": "tefnut",
  "type": "deity",
  "name": "Tefnut",
  "icon": "💧",
  "mythologies": [
    "egyptian"
  ],
  "primaryMythology": "egyptian",
  "shortDescription": "Goddess of Moisture, Dew, and Rain",
  "longDescription": "Tefnut is one of the primordial deities of the Ennead of Heliopolis, the first goddess brought into existence by Atum's creative act. As the personification of moisture and atmospheric water, she represents the vital humidity needed for life in the arid Egyptian landscape. Sister-wife to Shu (air) and mother to Geb (earth) and Nut (sky), Tefnut embodies the moisture that pervades the air—from morning dew to rain clouds—and the life-giving power of water in all its atmospheric forms.\n\nThe Distant Goddess: One of Tefnut's most important myths describes her becoming angry and fleeing to Nubia (or sometimes Libya), abandoning Egypt. In her absence, moisture disappeared from the land, causing drought and suffering. Ra sent Thoth and Shu to retrieve her. Thoth disguised himself and told her stories and parables, gradually persuading her to return. When Tefnut came back to Egypt, she brought moisture and rain, restoring fertility to the land. This myth explains seasonal changes in moisture and the importance of the goddess's presence for agricultural prosperity.\n\nThe Eye of Ra: Tefnut is identified with the solar eye, the fierce protective aspect of the sun god. In this role, she embodies both creative moisture and destructive fire—the dual nature of water and the burning sun. As the Eye, she could become wrathful and dangerous, requiring appeasement. This connects her moisture aspect with solar theology, showing her role in cosmic balance.\n\nCreation with Shu: With her brother-husband Shu, Tefnut formed the primordial couple that gave birth to the physical world. Their union of air and moisture created the conditions for earth and sky to come into being. They represent the inseparable nature of atmospheric elements—air cannot exist without some moisture, and moisture requires air to be dispersed.",
  "tags": [
    "tefnut",
    "egyptian",
    "deity",
    "moisture",
    "dew",
    "rain",
    "atmospheric-water",
    "humidity",
    "divine-order-(paired-with-shu)",
    "solar-eye"
  ],
  "colors": {
    "primary": "#D4AF37",
    "secondary": "#8B4513"
  },
  "linguistic": {
    "originalName": "𓏏𓆑𓈖𓏏",
    "originalScript": "hieroglyphic",
    "transliteration": "tfnt",
    "pronunciation": "/tefˈnuːt/",
    "etymology": {
      "rootLanguage": "Ancient Egyptian",
      "meaning": "moisture",
      "derivation": "Middle Egyptian hieroglyphic: tfnt"
    },
    "languageCode": "egy"
  },
  "temporal": {
    "historicalDate": {
      "start": {
        "year": -3000,
        "circa": true,
        "display": "c. 3000 BCE"
      },
      "end": {
        "year": 400,
        "circa": true,
        "display": "c. 400 CE"
      },
      "display": "c. 3000 BCE - 400 CE"
    },
    "culturalPeriod": "Ancient Egyptian civilization"
  },
  "sources": [
    {
      "title": "Pyramid Texts",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -2400,
        "circa": true,
        "display": "c. 2400 BCE"
      }
    },
    {
      "title": "Coffin Texts",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -2000,
        "circa": true,
        "display": "c. 2000 BCE"
      }
    },
    {
      "title": "Book of the Dead",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -1550,
        "circa": true,
        "display": "c. 1550 BCE"
      }
    }
  ],
  "metadata": {
    "created": "2025-12-13T09:00:34.488Z",
    "lastModified": "2025-12-13T09:00:34.488Z",
    "version": "2.0",
    "completeness": "enhanced"
  }
}