{
  "id": "thoth",
  "type": "deity",
  "name": "Thoth",
  "icon": "📜",
  "mythologies": [
    "egyptian"
  ],
  "primaryMythology": "egyptian",
  "shortDescription": "Thoth is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual...",
  "longDescription": "Thoth is the ibis-headed god of knowledge, writing, science, and magic. As the divine scribe, he records the judgment of souls and maintains the cosmic order. Master of hieroglyphs and sacred wisdom, Thoth embodies the intellectual and magical power of the written word and serves as mediator, messenger, and keeper of divine secrets.\n\nInvention of Writing: Thoth created hieroglyphs, the sacred writing of the gods. He presented this gift to humanity through the pharaohs, enabling the recording of history, magic spells, and divine wisdom. The Egyptians called hieroglyphs \"medu netjer\" (words of the gods), believing them to possess inherent magical power.\n\nHealing the Eye of Horus: During the battle between Horus and Set, Set tore out Horus's eye. Thoth restored it through magic and mathematics, making it whole again. The restored Eye of Horus (Wedjat) became a symbol of healing, wholeness, and protection. This myth established Thoth as patron of medicine and healing arts.\n\nArbitrator Between Horus and Set: Thoth served as mediator in the divine tribunal judging between Horus and Set for rulership of Egypt. His wisdom and impartiality helped resolve the conflict, advocating for justice and rightful succession. His role as arbitrator established him as god of law and fair judgment.\n\nScribe of the Judgment: In the Hall of Two Truths, while Anubis weighs hearts against the feather of Ma'at, Thoth records the results. His perfect record-keeping ensures cosmic justice. He announces whether souls are \"justified\" and may enter the afterlife, or must be devoured by Ammit.\n\nThe Gambling with the Moon: When Nut (sky goddess) was cursed by Ra not to give birth on any day of the year, Thoth gambled with the moon god Khonsu and won 1/72nd of the moon's light from each day. With this light, he created five extra days (epagomenal days) outside the regular 360-day calendar, allowing Nut to give birth to Osiris, Isis, Set, Nephthys, and Horus the Elder.\n\nPartner in Mummification: Thoth spoke the magical spells necessary for successful mummification and resurrection. His words of power, recorded in funerary texts, gave the dead power to navigate the underworld and transform into akh (effective spirits).",
  "tags": [
    "thoth",
    "egyptian",
    "deity",
    "writing",
    "wisdom",
    "magic",
    "science",
    "mathematics",
    "astronomy",
    "medicine",
    "judgment",
    "arbitration",
    "the-moon",
    "time",
    "languages",
    "knowledge"
  ],
  "colors": {
    "primary": "#FFFFFF",
    "secondary": "#8B4513"
  },
  "linguistic": {
    "originalName": "𓅤𓅿",
    "originalScript": "hieroglyphic",
    "transliteration": "ḏḥwty",
    "pronunciation": "/dʒeħuːtiː/",
    "etymology": {
      "rootLanguage": "Ancient Egyptian",
      "meaning": "he who is like the ibis",
      "derivation": "Middle Egyptian hieroglyphic: ḏḥwty"
    },
    "languageCode": "egy"
  },
  "geographical": {
    "primaryLocation": {
      "name": "Hermopolis",
      "coordinates": {
        "latitude": 27.7911,
        "longitude": 30.8081,
        "accuracy": "exact"
      },
      "modernName": "el-Ashmunein, Egypt",
      "type": "temple",
      "significance": "Primary cult center of Thoth"
    },
    "region": "Nile Valley",
    "culturalArea": "Ancient Egypt",
    "modernCountries": [
      "Egypt"
    ]
  },
  "temporal": {
    "historicalDate": {
      "start": {
        "year": -3000,
        "circa": true,
        "display": "c. 3000 BCE"
      },
      "end": {
        "year": 400,
        "circa": true,
        "display": "c. 400 CE"
      },
      "display": "c. 3000 BCE - 400 CE"
    },
    "culturalPeriod": "Ancient Egyptian civilization"
  },
  "sources": [
    {
      "title": "Pyramid Texts",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -2400,
        "circa": true,
        "display": "c. 2400 BCE"
      }
    },
    {
      "title": "Coffin Texts",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -2000,
        "circa": true,
        "display": "c. 2000 BCE"
      }
    },
    {
      "title": "Book of the Dead",
      "type": "primary",
      "relevance": "comprehensive",
      "date": {
        "year": -1550,
        "circa": true,
        "display": "c. 1550 BCE"
      }
    }
  ],
  "metadata": {
    "created": "2025-12-13T09:00:34.488Z",
    "lastModified": "2025-12-27T06:47:51.035Z",
    "version": "2.0",
    "completeness": "enhanced"
  },
  "fullDescription": "Thoth is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual practices."
}
