{
  "id": "yamantaka",
  "type": "deity",
  "name": "Yamantaka",
  "displayName": "Yamantaka (Conqueror of Death)",
  "icon": "⚔️",
  "slug": "yamantaka",
  "mythologies": [
    "buddhist",
    "mahayana",
    "vajrayana"
  ],
  "primaryMythology": "buddhist",
  "shortDescription": "Wrathful manifestation of Manjushri who conquered Yama, the lord of death",
  "category": "wrathful-deity",
  "subCategory": "dharmapala",
  "colors": {
    "primary": "#8B0000",
    "secondary": "#FFFFFF",
    "primaryRgb": "8B0000"
  },
  "tags": [
    "yamantaka",
    "buddhist",
    "bodhisattva",
    "mahayana"
  ],
  "metaphysicalProperties": {
    "element": "fire",
    "energyType": "enlightened",
    "chakra": "solar-plexus"
  },
  "fullDescription": "Wrathful manifestation of Manjushri who conquered Yama, the lord of death This deity holds significant importance in buddhist mythology and spiritual traditions.",
  "metadata": {
    "lastModified": "2025-12-29T00:29:04.605Z",
    "version": "2.0",
    "enhanced": true,
    "enhancementVersion": "2.0"
  },
  "richDescription": "Yamantaka occupies an important position in the buddhist pantheon, representing sacred principles and divine forces that shaped ancient understanding of the cosmos and humanity's place within it. This deity's influence extended across multiple domains, touching various aspects of religious and cultural life.\n\nFollowers of Yamantaka maintained traditions of worship and ritual that honored the deity's specific attributes and sought divine favor in relevant aspects of daily life. The deity's cult reflected the values and concerns of the communities that venerated this divine figure.\n\nThe legacy of Yamantaka endures through mythology, art, and cultural memory, preserving ancient wisdom and spiritual insights that continue to resonate across the ages.",
  "topic_panels": {
    "origins": "The origins of Yamantaka are shrouded in ancient mystery. This deity has been a central figure in buddhist mythology since ancient times, with traditions passed down through countless generations.",
    "worship": "Devotees honored Yamantaka through traditional rituals, prayers, and offerings appropriate to the deity's sacred domains. The worship practices reflected deep reverence and the desire to maintain harmony with divine forces.",
    "symbols": "The iconography of Yamantaka is rich with symbolic meaning. Traditional depictions capture the essence of the deity's sacred attributes and divine power.",
    "influence": "The influence of Yamantaka extends far beyond ancient Buddhist culture. As a figure of enduring fascination, Yamantaka appears in literature, art, and popular culture, demonstrating the timeless appeal of these mythological traditions. The archetypal qualities embodied by Yamantaka continue to resonate with contemporary audiences, offering insights into universal human experiences and spiritual yearnings."
  },
  "related_myths": [
    {
      "title": "Sacred Tales of Yamantaka",
      "summary": "Numerous myths and legends feature Yamantaka, each revealing different facets of the deity's character and illustrating important moral and spiritual lessons for devotees."
    }
  ],
  "background_image": "/assets/backgrounds/starfield-cosmic.jpg"
}