{
  "temporal": {
    "historicalDate": {
      "end": {
        "year": 1500,
        "display": "c. 1500 CE",
        "uncertainty": 100,
        "circa": true
      },
      "needsResearch": true,
      "start": {
        "uncertainty": 200,
        "year": -300,
        "display": "c. 300 BCE",
        "circa": true
      },
      "display": "300 BCE - 1500 CE"
    },
    "timelinePosition": "Asuka Period (538-710 CE)",
    "firstAttestation": {
      "needsResearch": true,
      "date": {
        "year": 700,
        "uncertainty": 100,
        "confidence": "speculative",
        "display": "c. 700 CE",
        "circa": true
      },
      "type": "literary",
      "description": "Estimated based on mythology literary tradition"
    }
  },
  "tags": [
    "imperial-regalia",
    "sword",
    "yamata-no-orochi",
    "susanoo",
    "amaterasu",
    "yamato-takeru",
    "atsuta-shrine",
    "divine-weapon",
    "three-treasures",
    "valor"
  ],
  "primaryMythology": "japanese",
  "longDescription": "Kusanagi-no-Tsurugi (草薙の剣, 'Grass-Cutting Sword'), also known as Ame-no-Murakumo-no-Tsurugi ('Sword of the Gathering Clouds of Heaven'), is one of the Three Imperial Regalia of Japan (Sanshu no Jingi). According to the Kojiki and Nihon Shoki, the storm god Susanoo discovered the sword in the tail of the eight-headed serpent Yamata-no-Orochi after slaying it. The sword was originally called Ame-no-Murakumo because it was found amid the clouds above the serpent. Susanoo presented it to his sister Amaterasu as a reconciliation gift. Later, Amaterasu gave it to her grandson Ninigi when he descended to rule the earthly realm. The sword gained its name Kusanagi ('Grass-Cutter') when the legendary hero Yamato Takeru used it to cut down burning grass during a battle, saving his life. The sword represents valor and is said to reside at Atsuta Shrine in Nagoya, though its exact location and condition remain one of Japan's greatest mysteries.",
  "subtype": "sacred-sword",
  "cultural": {
    "worshipPractices": [
      "Kusanagi is one of the Three Imperial Regalia that validate the Emperor's divine descent from Amaterasu. The sword represents valor and the Emperor's role as military protector. It has been involved in several legendary events: its discovery by Susanoo, its use by Yamato Takeru in his conquests, and its near-loss at the Battle of Dan-no-ura in 1185. The sword's possession symbolizes legitimate rule over Japan."
    ],
    "festivals": [
      {
        "description": "The sword is presented to the new Emperor as proof of divine authority",
        "name": "Imperial Succession Ceremony"
      },
      {
        "description": "The sword has been enshrined at Atsuta Shrine for over 1,900 years",
        "name": "Atsuta Shrine Enshrinement"
      }
    ],
    "modernLegacy": {
      "culturalImpact": "Kusanagi remains central to Japanese imperial tradition and national identity. The sword has never been publicly displayed, adding to its mystique. Its location at Atsuta Shrine makes the shrine one of Japan's most important Shinto sites. The sword's legend influenced countless samurai who saw it as the ideal of martial virtue. During World War II, concerns about the sword's safety during American bombing led to special protection measures. The sword's mystery continues to inspire literature, anime, manga, and video games."
    }
  },
  "geographical": {
    "region": "Japan",
    "culturalArea": "East Asia"
  },
  "shortDescription": "Legendary grass-cutting sword, one of the Three Imperial Regalia of Japan",
  "name": "Kusanagi-no-Tsurugi",
  "colors": {
    "secondary": "#808080",
    "primaryRgb": "192, 192, 192",
    "primary": "#C0C0C0"
  },
  "mediaReferences": {
    "images": [
      {
        "type": "artwork",
        "url": "/assets/images/items/kusanagi-illustration.jpg",
        "caption": "Artistic depiction of the legendary Kusanagi sword",
        "alt": "Kusanagi-no-Tsurugi sacred sword"
      }
    ],
    "diagrams": []
  },
  "status": "published",
  "linguistic": {
    "originalScript": "kanji-hiragana",
    "cognates": [
      {
        "term": "Kusanagi-no-Tsurugi",
        "language": "Classical Japanese"
      },
      {
        "term": "Kusanagi-no-Tsurugi",
        "language": "Chinese",
        "notes": "Chinese borrowing or cognate"
      }
    ],
    "etymology": {
      "meaning": "Japanese term",
      "derivation": "Classical Japanese development",
      "rootLanguage": "Old Japanese"
    },
    "originalName": "Kusanagi-no-Tsurugi",
    "needsResearch": true,
    "transliteration": "Kusanagi-no-Tsurugi"
  },
  "extendedContent": [
    {
      "content": "Kusanagi-no-Tsurugi, also known as Ame-no-Murakumo-no-Tsurugi (\"Sword of the Gathering Clouds of Heaven\"),\n                    stands as one of the Three Sacred Treasures of Japan (Sanshu no Jingi) and represents the virtue of valor.\n                    As part of the imperial regalia, this legendary blade embodies the divine legitimacy of the Japanese\n                    imperial line, having been passed down through generations from the Age of the Gods to the present day.\n                \n                \n                    The sword occupies a unique position in Japanese mythology and history—simultaneously a powerful divine\n                    weapon capable of cutting through supernatural forces, a sacred relic never to be drawn except in the\n                    gravest circumstances, and a living symbol of the covenant between the heavens and the imperial throne.\n                    Its very existence bridges the mythological past with historical tradition, making it one of the most\n                    significant sacred objects in Shinto belief and Japanese cultural identity.\n                \n                \n                    Unlike typical Japanese swords, Kusanagi is described as a tsurugi—a double-edged straight sword in the\n                    ancient style, predating the curved katana design that would become iconic of Japanese sword-making. This\n                    archaic form emphasizes its divine origin and great antiquity, placing it in the mythological age before\n                    historical sword-smithing techniques were established.",
      "title": "Description and Appearance"
    },
    {
      "content": "Unlike many legendary weapons forged by divine smiths or created through deliberate craftsmanship,\n                    Kusanagi-no-Tsurugi emerged fully formed from within the body of a great monster—discovered rather than\n                    made. This unique origin story is recorded in both the Kojiki (Record of Ancient Matters, 712 CE) and\n                    the Nihon Shoki (Chronicles of Japan, 720 CE), the two foundational texts of Japanese mythology and\n                    early history.\n                \n\n                The Exile of Susanoo\n                \n                    The sword's story begins with Susanoo-no-Mikoto, the storm god and brother of Amaterasu Omikami (the sun\n                    goddess) and Tsukuyomi (the moon god). These three deities were born from the purification ritual of their\n                    father Izanagi after his return from Yomi (the underworld). Amaterasu emerged from Izanagi's left eye,\n                    Tsukuyomi from his right eye, and Susanoo from his nose.\n                \n                \n                    Izanagi assigned his children their domains: Amaterasu would rule the heavens and the sun, Tsukuyomi\n                    would govern the night and moon, and Susanoo would command the seas. However, Susanoo refused his appointed\n                    role, weeping and raging because he wished to visit his mother Izanami in the land of the dead. His\n                    tantrums caused mountains to wither and seas to dry up.\n                \n                \n                    When Susanoo visited his sister Amaterasu in the heavens before departing to Yomi, his arrival was so\n                    violent—shaking mountains and churning seas—that Amaterasu feared he came to steal her domain. To prove\n                    his sincerity, Susanoo proposed a ritual contest to create deities. However, even after proving his good\n                    intentions, Susanoo's wild nature led him to commit terrible outrages: he destroyed Amaterasu's rice\n                    fields, defiled her sacred halls, and ultimately caused the death of one of her attendants by flinging\n                    a flayed horse through the roof of her weaving hall.\n                \n                \n                    Horrified and grieving, Amaterasu withdrew into the Heavenly Rock Cave (Ama-no-Iwato), plunging the\n                    world into darkness. Only through the clever stratagem of the eight million kami—creating a great\n                    celebration outside the cave—was she lured back out, restoring light to the world. As punishment for\n                    causing this catastrophe, Susanoo was expelled from heaven, his beard cut, his fingernails and toenails\n                    pulled, and massive fines imposed. He was cast down to the land of Izumo in mortal Japan.\n                \n\n                The Slaying of Yamata no Orochi\n                \n                    Descending to earth near the Hi River in Izumo Province, the humbled storm god encountered an elderly\n                    couple, Ashinazuchi and Tenazuchi (their names meaning \"Foot-Stroking Elder\" and \"Hand-Stroking Elder\"),\n                    who were weeping beside their beautiful daughter Kushinadahime. Susanoo asked why they grieved.\n                \n                \n                    The old man explained that they once had eight daughters, but for seven consecutive years, a terrible\n                    monster called Yamata no Orochi had come to devour one. Now only Kushinadahime remained, and the time\n                    had come for the creature to claim her as well. They were powerless to prevent it.\n                \n                \n                    When Susanoo asked about this monster, they described a horror beyond imagining: Yamata no Orochi was\n                    an enormous serpent with eight heads and eight tails. Its eyes glowed red like winter cherries. Its body\n                    was so vast that it stretched across eight valleys and eight hills. Moss and cypress trees grew on its\n                    back. Its belly was perpetually bloody and inflamed. Storm clouds constantly gathered above it—hence the\n                    sword's original name, \"Gathering Clouds of Heaven.\"",
      "title": "Creation Myth and Crafting"
    },
    {
      "title": "Powers and Abilities",
      "content": "As one of the Three Sacred Treasures and a blade born from a divine serpent, Kusanagi-no-Tsurugi\n                    possesses powers that transcend ordinary weapons. Its abilities have been demonstrated throughout Japanese\n                    mythology and have become fundamental to understanding its sacred role in the imperial succession."
    },
    {
      "content": "Susanoo-no-Mikoto - The Storm God\n                \n                    Susanoo-no-Mikoto, whose name means \"Impetuous Male,\" is one of the principal kami in Shinto mythology.\n                    Born from the nose of Izanagi during his purification after visiting the underworld, Susanoo embodies\n                    the wild, untamed aspects of nature—storms, the sea, chaos, and transformation. His character arc from\n                    destructive troublemaker to heroic monster-slayer parallels the sword's own journey from the corpse of\n                    a monster to sacred imperial regalia.\n                \n                \n                    After discovering Kusanagi within Yamata no Orochi, Susanoo's act of gifting it to Amaterasu\n                    demonstrated his reformation and re-established harmony between him and the heavens. He married\n                    Kushinadahime and settled in Izumo, where he built a grand palace and fathered the lineage of the\n                    Izumo deities. The descendants of Susanoo eventually intermarried with the descendants of Amaterasu,\n                    uniting the two divine lineages.\n                \n                \n                    Susanoo is venerated particularly in Izumo Province (modern-day Shimane Prefecture), where the Izumo\n                    Grand Shrine honors him and his descendants. His worship emphasizes his protective and heroic aspects—\n                    the god who slays monsters, protects the innocent, and brings order from chaos, rather than the wild\n                    troublemaker of earlier myths.\n                \n\n                Amaterasu Omikami - The Sun Goddess\n                \n                    Amaterasu, the supreme deity in Shinto and ancestral goddess of the imperial family, became the keeper\n                    of Kusanagi when Susanoo presented it to her. As the goddess of the sun and the heavens, Amaterasu\n                    represents order, cultivation, civilization, and divine sovereignty. Her possession of the sword\n                    transformed it from a weapon recovered from a monster into a sacred treasure of heaven.\n                \n                \n                    When Amaterasu's grandson Ninigi-no-Mikoto descended from heaven to rule the earthly realm, she bestowed\n                    upon him the Three Sacred Treasures: Kusanagi-no-Tsurugi (the sword), Yata no Kagami (the sacred mirror),\n                    and Yasakani no Magatama (the jewel). These objects symbolized his divine mandate and ensured the\n                    prosperity of his rule. Through Ninigi's line, the regalia passed to Emperor Jimmu, the legendary first\n                    emperor, establishing the unbroken imperial succession.\n                \n\n                Major Myths Involving Kusanagi\n\n                \n                    The Legend of Yamato Takeru\n                    \n                        Prince Yamato Takeru (also called Ousu no Mikoto) was the son of Emperor Keiko and one of Japan's\n                        greatest legendary heroes. His father, perceiving his violent temperament, sent him on dangerous\n                        missions, hoping either to civilize him through heroic deeds or to be rid of a troublesome son.\n                    \n                    \n                        After subduing rebellious tribes in Kyushu, Yamato Takeru visited his aunt, Princess Yamato-hime,\n                        who served as high priestess at Ise Grand Shrine. Sensing more perilous missions ahead, she gave\n                        him Kusanagi-no-Tsurugi and a bag, telling him to open the bag only in dire emergency.\n                    \n                    \n                        In Suruga Province (modern Shizuoka), a treacherous local chieftain invited Yamato Takeru to hunt\n                        in a large meadow. Once the prince was in the midst of the grassland, the chieftain's men set fire\n                        to the dry grass on all sides, attempting to burn him alive. Trapped in the growing inferno with\n                        flames closing in from every direction, Yamato Takeru opened the bag his aunt had given him and\n                        found a fire striker (flint and steel).\n                    \n                    \n                        Understanding her intention, he used Kusanagi to cut down the grass around him, creating a cleared\n                        area. Then he started a counter-fire using the striker. The sword demonstrated its power by not\n                        only cutting the grass with supernatural ease but by commanding the wind itself—the wind shifted,\n                        driving the flames back toward his enemies, who were consumed by their own trap.\n                    \n                    \n                        This episode gave the sword its famous name \"Kusanagi\" (Grass Cutter), replacing or supplementing\n                        its original name of Ame-no-Murakumo-no-Tsurugi. The prince's survival demonstrated that heaven\n                        itself protected those of imperial blood who wielded the sacred regalia righteously.\n                    \n                    \n                        Later in his campaigns, Yamato Takeru grew arrogant and left Kusanagi with his wife Miyazu-hime\n                        while he climbed Mount Ibuki to slay a white boar (actually a mountain deity in disguise). Without\n                        the sword's protection, he was poisoned by the deity's curse and fell gravely ill. Though he managed\n                        to descend from the mountain, he died on the plain of Nobo, far from home.\n                    \n                    \n                        His death became a cautionary tale about the importance of the sacred treasures—separated from\n                        Kusanagi, even the mightiest hero was vulnerable. His soul transformed into a white bird that flew\n                        toward the heavens. Kusanagi was recovered and eventually enshrined at Atsuta, where it has remained\n                        for over a thousand years.\n                    \n\n                    The Theft by Emperor Tenmu\n                    \n                        In the 7th century, a historical incident involved the sword directly. Emperor Tenmu, who reigned\n                        from 673-686, reportedly fell ill and wished to have Kusanagi brought from Ise Shrine (where it\n                        was then kept) to his palace. The sword was transported to the palace, but immediately after its\n                        arrival, terrible omens appeared: the emperor's condition worsened dramatically, supernatural\n                        phenomena occurred in the palace, and disasters threatened the realm.\n                    \n                    \n                        The court diviners determined that the sword was wrathful at being removed from its proper shrine.\n                        It was quickly returned to Ise, but the emperor died shortly thereafter. Following this incident,\n                        the sword was transferred to Atsuta Shrine in Nagoya, where it has remained ever since. The story\n                        reinforced the understanding that the regalia had their proper places and attempting to move them\n                        improperly, even by an emperor, would bring calamity.\n                    \n\n                    The Battle of Dan-no-ura (1185)\n                    \n                        This historical event represents the most dramatic crisis in the sword's recorded history. During\n                        the Genpei War between the Taira and Minamoto clans, the child emperor Antoku (then only eight years\n                        old) was kept with the Taira forces and the Three Sacred Treasures.\n                    \n                    \n                        When the Taira fleet was decisively defeated at Dan-no-ura, Antoku's grandmother, Nii no Ama,\n                        determined that death was preferable to capture. Taking the child emperor in her arms along with\n                        the sacred treasures, she leapt into the sea, declaring \"In the depths of the ocean is our capital.\"\n                    \n                    \n                        While the mirror and jewel were recovered from the sea floor, Kusanagi was reported lost. This\n                        created a massive crisis of legitimacy—how could there be a proper emperor without the complete\n                        regalia? Some sources claim a replica was made to substitute for the lost blade. However, official\n                        shrine records maintain that the sword at Atsuta is and has always been the original, suggesting\n                        perhaps what was lost was itself a replica that had been taken to war while the true sword remained\n                        safely enshrined.\n                    \n                    \n                        This ambiguity has never been officially resolved. The sword's hidden nature means no one can verify\n                        which account is true, and the sacred protocol prohibits investigation that would require unwrapping\n                        and examining the blade. In this way, the mystery itself has become part of the sword's legend.",
      "title": "Associated Deity and Myths"
    },
    {
      "content": "Imperial Legitimacy and Divine Right\n                \n                    Kusanagi's primary symbolic function is to legitimize imperial authority. The Three Sacred Treasures—\n                    sword, mirror, and jewel—represent the emperor's divine descent from Amaterasu and the mandate of heaven\n                    to rule Japan. Without these treasures, particularly the sword, the coronation ceremony is considered\n                    incomplete, and the emperor's authority questionable.\n                \n                \n                    This differs from European concepts of divine right in important ways. The Japanese emperor does not\n                    rule by personal divine nature (at least not solely) but as a custodian of sacred objects that embody\n                    the covenant between heaven and earth. The emperor serves as the bridge between the kami and humanity,\n                    and the regalia are the physical manifestation of this sacred role.\n                \n                \n                    Throughout Japanese history, control of the Three Sacred Treasures has been crucial during succession\n                    disputes. Even when shoguns held actual political power, they could not claim to rule without the\n                    emperor, who possessed the regalia. This sacred symbolism allowed the imperial line to maintain\n                    continuity even during periods of powerlessness, as no military leader dared claim the treasures\n                    improperly.\n                \n\n                Valor and Martial Virtue\n                \n                    Of the Three Sacred Treasures, Kusanagi specifically represents valor (the mirror represents wisdom,\n                    the jewel benevolence). The sword symbolizes the warrior spirit, the courage to face danger, and the\n                    strength to protect the realm from threats. This martial aspect connects the spiritual authority of the\n                    emperor with the practical necessity of defending the nation.\n                \n                \n                    However, Japanese concepts of valor emphasize righteousness and duty over mere aggression. Yamato\n                    Takeru's eventual downfall came when he left the sword behind out of arrogance—true courage means\n                    humility before divine power and adherence to sacred duty. The sword thus represents not just the\n                    ability to fight but the wisdom to know when and how to wield power.\n                \n\n                Transformation of Chaos into Order\n                \n                    Kusanagi's origin within Yamata no Orochi carries deep symbolic meaning. The serpent represented\n                    primordial chaos—destructive natural forces that terrorized humanity. Susanoo's slaying of the beast\n                    and discovery of the sword within it symbolizes the transformation of chaos into order, of destructive\n                    power into protective authority.\n                \n                \n                    This theme resonates throughout Japanese culture: the understanding that civilization requires the\n                    domestication of wild forces, that order emerges from chaos, and that even from the greatest monsters\n                    can come treasures. The sword is not created fresh but discovered within the serpent, suggesting that\n                    power already exists in nature and must be recognized and properly channeled.\n                \n\n                National Identity and Cultural Continuity\n                \n                    Beyond its religious significance, Kusanagi represents Japanese national identity and cultural\n                    continuity. The unbroken imperial line, stretching from mythological times to the present day, provides\n                    a sense of historical continuity unique among world nations. The sword physically embodies this\n                    continuity—allegedly the same object held by Susanoo in the Age of Gods, it bridges mythological and\n                    historical time.\n                \n                \n                    During periods of national crisis, particularly during World War II and the post-war occupation, the\n                    preservation of the Three Sacred Treasures was considered essential to maintaining Japanese identity.\n                    Even as political structures changed and the emperor renounced claims to divinity in the post-war\n                    constitution, the regalia remained symbols of cultural identity that transcended politics.\n                \n\n                Sacred Mystery and Hidden Power\n                \n                    Perhaps uniquely among legendary weapons, Kusanagi's power derives partly from not being seen. The\n                    sword's concealment is not merely practical preservation but fundamental to its nature. In Shinto belief,\n                    the deepest sacred objects must remain hidden—exposure to common view would profane them and diminish\n                    their spiritual power.\n                \n                \n                    This concept, called hijiri (sacred concealment), reflects a worldview where mystery itself is sacred.\n                    Not everything can or should be known. Some truths must remain veiled. The hidden sword represents this\n                    philosophy—its power is greatest precisely because it remains unseen, known only through faith and\n                    tradition rather than empirical observation.\n                \n\n                Elemental Control and Natural Harmony\n                \n                    The sword's association with wind and storms, derived from its origin in the storm-wreathed serpent,\n                    symbolizes humanity's relationship with natural forces. Proper rulership, in East Asian philosophy,\n                    maintains harmony between human society and the natural world. The emperor, wielding Kusanagi (at least\n                    symbolically), ensures this harmony.\n                \n                \n                    When disasters strike—earthquakes, typhoons, floods—traditional interpretation sometimes viewed them\n                    as signs that the cosmic order was disturbed. The emperor's possession of the regalia and proper\n                    performance of rituals help maintain balance. The sword, having mastered the storm power of Yamata no\n                    Orochi, represents controlled natural force serving human flourishing rather than destroying it.",
      "title": "Symbolism and Spiritual Meaning"
    },
    {
      "content": "Anime and Manga\n                \n                    Kusanagi-no-Tsurugi appears frequently in Japanese popular culture, often as the ultimate legendary\n                    weapon or an object of immense power:\n                \n                \n                    Naruto: Orochimaru, named after the eight-headed serpent, wields the \"Kusanagi\n                    no Tsurugi\" as his signature weapon—a blade that can extend to great lengths and cut through nearly\n                    anything. This directly references the sword's mythological origin.\n                    Fate/Grand Order and the Fate series: Features multiple references to Kusanagi,\n                    sometimes as a Noble Phantasm (legendary weapon) and explores various interpretations of its mythological\n                    origins and powers.\n                    InuYasha: While not explicitly named, several legendary swords in the series draw\n                    inspiration from Kusanagi's mythology, particularly blades with elemental powers and divine origins.\n                    Noragami: References the Three Sacred Treasures and Japanese mythology extensively,\n                    with Kusanagi representing ultimate divine authority among weapons.\n                    Blue Exorcist (Ao no Exorcist): Features the sword as one of the most powerful\n                    demon-slaying weapons, drawing on its mythological role in defeating Yamata no Orochi.\n                \n\n                Video Games\n                \n                    Final Fantasy series: Kusanagi appears as a legendary weapon in multiple entries,\n                    often with wind or lightning elemental properties, referencing its storm origins.\n                    Okami: This game extensively draws on Japanese mythology, and while the protagonist\n                    wields a divine instrument rather than Kusanagi directly, references to the sword and its mythology\n                    appear throughout.\n                    Nioh and Nioh 2: Features Kusanagi as an extremely powerful legendary weapon\n                    obtainable in the game, often with special abilities reflecting its mythological powers.\n                    Warriors Orochi series: Directly features characters from the myth, including\n                    Susanoo and the eight-headed serpent, with Kusanagi as a key plot element and powerful weapon.\n                    Persona series: References Kusanagi as one of the ultimate weapons, tying into\n                    the games' heavy use of Japanese mythology and Shinto symbolism.\n                    Ghost of Tsushima: While not featuring the actual Kusanagi, the game's treatment\n                    of katana as sacred objects and the spiritual significance of swords draws on traditions surrounding\n                    the legendary blade.\n                    Puzzle & Dragons: Features Kusanagi-no-Tsurugi as a high-rarity divine weapon\n                    with powerful abilities.\n                \n\n                Literature and Film\n                \n                    Historical novels: Many Japanese historical fiction works feature the sword,\n                    particularly those set during the Genpei War or dealing with imperial succession.\n                    \"Yamato Takeru\" (1994 film): Depicts the legendary prince's adventures with the\n                    sword, including the famous grass-cutting incident.\n                    Contemporary fantasy: Numerous light novels and modern fantasy stories use\n                    Kusanagi as the ultimate legendary Japanese weapon, often in contests with weapons from other mythologies.\n                    Scholarly works: Academic books exploring the imperial regalia and their role in\n                    Japanese history and national identity frequently discuss Kusanagi's symbolic importance.\n                \n\n                Martial Arts and Sword Culture\n                \n                    Beyond direct fictional depictions, Kusanagi influences Japanese sword culture broadly:\n                \n                \n                    Modern swordsmiths sometimes create replicas (though never claiming them as the actual treasure),\n                    imagining what the divine blade might have looked like.\n                    The sword represents the spiritual ideal in Japanese swordsmanship—the perfect blade, the sacred\n                    weapon that transcends mere martial function to embody spiritual principles.\n                    Martial arts philosophies sometimes reference Kusanagi when discussing the concept of the sword\n                    as spiritual tool rather than just weapon.\n                    Atsuta Shrine hosts sword-related festivals and ceremonies that honor both the physical blade and\n                    the broader tradition of Japanese swordcraft.\n                \n\n                National and Cultural Symbolism\n                \n                    Imperial ceremonies: The enthronement ceremony (Sokui no Rei) includes rituals\n                    involving the Three Sacred Treasures, though the actual Kusanagi never leaves Atsuta Shrine—a replica\n                    or representation is used.\n                    Diplomatic contexts: References to the imperial regalia appear in discussions of\n                    Japanese sovereignty and national identity, particularly during constitutional debates.\n                    Tourism and pilgrimage: Atsuta Shrine is one of the most important pilgrimage\n                    sites in Japan, second only to Ise Grand Shrine, largely due to housing Kusanagi.\n                    Educational contexts: Japanese students learn about Kusanagi as part of studying\n                    national mythology and history, understanding its role in cultural identity.\n                \n\n                Comparative Mythology\n                \n                    In global comparative mythology discussions, Kusanagi is often compared to:\n                \n                \n                    Excalibur (Arthurian legend) - another sword that legitimizes royal authority\n                    Durandal (French legend) - indestructible holy sword\n                    Gram/Balmung (Norse legend) - dragon-slaying blade\n                    Zulfiqar (Islamic tradition) - sword of divine authority\n                \n                \n                    These comparisons highlight common themes across cultures: legendary swords as symbols of legitimate\n                    authority, weapons with origins in slaying monsters or given by divine sources, and blades that cannot\n                    be wielded by the unworthy.",
      "title": "Modern Depictions in Culture"
    },
    {
      "title": "Related Weapons and Items",
      "content": "The Other Sacred Treasures of Japan\n                \n                    Yata no Kagami (Eight-Span Mirror): The sacred mirror used to lure Amaterasu\n                    from the Heavenly Rock Cave, enshrined at Ise Grand Shrine, represents wisdom\n                    Yasakani no Magatama (Curved Jewel): The sacred jewel of the imperial regalia,\n                    kept in the Imperial Palace, represents benevolence\n                \n\n                Other Legendary Japanese Swords\n                \n                    Totsuka-no-Tsurugi: The \"Sword of Ten Spans\" wielded by Susanoo to slay Yamata\n                    no Orochi, from which Kusanagi was recovered\n                    Ame-no-Habakiri: Another sword wielded by Susanoo in some versions of the myth\n                    Kogarasu-maru: A legendary sword with a unique double-pointed tip, said to be\n                    forged by Amakuni, legendary swordsmith\n                    Onimaru Kunitsuna: A blade said to have killed a demon that haunted the Hojo\n                    clan, considered one of the \"Tenka Goken\" (Five Greatest Swords Under Heaven)\n                    Dojigiri Yasutsuna: Famous for beheading the demon Shuten-doji, another of the\n                    Tenka Goken\n                    Muramasa blades: Legendary cursed swords made by the swordsmith Muramasa, said\n                    to thirst for blood\n                    Masamune blades: Swords by the greatest historical Japanese swordsmith, representing\n                    the perfect balance of art and martial function\n                \n\n                Dragon-Slaying Swords from Other Cultures\n                \n                    Gram/Balmung (Norse): Sigurd's sword used to slay the dragon Fafnir, with parallels\n                    to Kusanagi's origin in slaying a serpent\n                    Ascalon (Christian legend): St. George's lance used to slay the dragon, representing\n                    good triumphing over evil\n                    Excalibur (Arthurian): While not specifically a dragon-slayer, shares themes of\n                    divine origin and royal legitimacy with Kusanagi\n                    Tyrfing (Norse): Cursed sword that must kill a man every time it's drawn, showing\n                    the dangerous nature of legendary weapons\n                \n\n                Imperial Regalia from Other Cultures\n                \n                    British Crown Jewels: Particularly the Sword of State and Crown Jewels representing\n                    British monarchical authority\n                    Holy Lance (Spear of Destiny): Christian relic used in imperial coronations\n                    Sword of Mercy (Curtana): British coronation sword\n                    Reichssword: Used in Holy Roman Empire coronations\n                    Joyeuse: Legendary sword of Charlemagne, used in French coronations"
    },
    {
      "content": "🌍 Cross-Cultural Serpent-Slaying & Legitimacy Blades\n                \n                    \n                        ⚔️\n                        Gram\n                        Norse\n                    \n                    \n                        🗡️\n                        Excalibur\n                        Arthurian\n                    \n                    \n                        ⚔️\n                        Zulfiqar\n                        Islamic\n                    \n                    \n                        🐉\n                        Gan Jiang Mo Ye\n                        Chinese",
      "title": "🔗\n                Related Across the Mythos"
    }
  ],
  "mythologies": [
    "japanese"
  ],
  "_enhanced": true,
  "usage": "As one of the Three Sacred Treasures and a blade born from a divine serpent, Kusanagi-no-Tsurugi\n                    possesses powers that transcend ordinary weapons. Its abilities have been demonstrated throughout Japanese\n                    mythology and have become fundamental to understanding its sacred role in the imperial succession.",
  "type": "item",
  "sources": [
    {
      "text": "Kojiki",
      "author": "Ō no Yasumaro",
      "passage": "Book 1-2 (Age of the Gods, Yamato Takeru legends)",
      "mythology": "japanese",
      "corpusUrl": "/corpus-search.html?term=kojiki+kusanagi"
    },
    {
      "corpusUrl": "/corpus-search.html?term=nihon+shoki+kusanagi",
      "author": "Various court scholars",
      "passage": "Books 1-7",
      "text": "Nihon Shoki",
      "mythology": "japanese"
    },
    {
      "text": "Atsuta Shrine Records",
      "corpusUrl": "/corpus-search.html?term=atsuta+shrine",
      "mythology": "japanese"
    }
  ],
  "_uploadedAt": "2025-12-25T15:46:34.254592",
  "materials": [
    "Unknown divine metal, possibly celestial iron"
  ],
  "slug": "kusanagi",
  "migratedFrom": "legacy-repository",
  "relatedEntities": {
    "places": [
      {
        "name": "Atsuta Shrine",
        "type": "place",
        "icon": "⛩️",
        "mythology": "japanese",
        "url": "/mythos/japanese/places/atsuta-shrine.html",
        "id": "atsuta-shrine"
      },
      {
        "type": "place",
        "name": "Takamagahara",
        "icon": "☁️",
        "id": "takamagahara",
        "mythology": "japanese",
        "url": "/mythos/japanese/places/takamagahara.html"
      }
    ],
    "items": [
      {
        "type": "item",
        "url": "/mythos/japanese/items/yata-no-kagami.html",
        "icon": "🪞",
        "mythology": "japanese",
        "name": "Yata no Kagami",
        "id": "yata-no-kagami"
      },
      {
        "url": "/mythos/japanese/items/yasakani-no-magatama.html",
        "icon": "📿",
        "type": "item",
        "id": "yasakani-no-magatama",
        "mythology": "japanese",
        "name": "Yasakani no Magatama"
      }
    ],
    "heroes": [
      {
        "mythology": "japanese",
        "name": "Yamato Takeru",
        "icon": "⚔️",
        "url": "/mythos/japanese/heroes/yamato-takeru.html",
        "type": "hero",
        "id": "yamato-takeru"
      }
    ],
    "deities": [
      {
        "icon": "⛈️",
        "mythology": "japanese",
        "type": "deity",
        "url": "/mythos/japanese/deities/susanoo.html",
        "name": "Susanoo-no-Mikoto",
        "id": "susanoo"
      },
      {
        "type": "deity",
        "icon": "☀️",
        "mythology": "japanese",
        "name": "Amaterasu-Omikami",
        "url": "/mythos/japanese/deities/amaterasu.html",
        "id": "amaterasu"
      }
    ],
    "creatures": [
      {
        "icon": "🐉",
        "mythology": "japanese",
        "id": "yamata-no-orochi",
        "name": "Yamata-no-Orochi",
        "type": "creature",
        "url": "/mythos/japanese/creatures/yamata-no-orochi.html"
      }
    ],
    "concepts": [
      {
        "icon": "👑",
        "name": "Sanshu no Jingi (Three Imperial Regalia)",
        "mythology": "japanese",
        "id": "imperial-regalia",
        "url": "/mythos/japanese/concepts/imperial-regalia.html",
        "type": "concept"
      }
    ]
  },
  "mythologyContexts": [
    {
      "associatedDeities": [
        {
          "mythology": "japanese",
          "id": "susanoo",
          "icon": "⛈️",
          "url": "/mythos/japanese/deities/susanoo.html",
          "name": "Susanoo-no-Mikoto",
          "type": "deity"
        },
        {
          "type": "deity",
          "url": "/mythos/japanese/deities/amaterasu.html",
          "name": "Amaterasu-Omikami",
          "icon": "☀️",
          "mythology": "japanese",
          "id": "amaterasu"
        },
        {
          "icon": "⚔️",
          "mythology": "japanese",
          "name": "Yamato Takeru",
          "type": "hero",
          "url": "/mythos/japanese/heroes/yamato-takeru.html",
          "id": "yamato-takeru"
        }
      ],
      "culturalSignificance": "Kusanagi remains central to Japanese imperial tradition and national identity. The sword has never been publicly displayed, adding to its mystique. Its location at Atsuta Shrine makes the shrine one of Japan's most important Shinto sites. The sword's legend influenced countless samurai who saw it as the ideal of martial virtue. During World War II, concerns about the sword's safety during American bombing led to special protection measures. The sword's mystery continues to inspire literature, anime, manga, and video games.",
      "rituals": [
        {
          "description": "The sword is presented to the new Emperor as proof of divine authority",
          "url": "/mythos/japanese/rituals/imperial-succession.html",
          "name": "Imperial Succession Ceremony"
        },
        {
          "url": "/mythos/japanese/places/atsuta-shrine.html",
          "description": "The sword has been enshrined at Atsuta Shrine for over 1,900 years",
          "name": "Atsuta Shrine Enshrinement"
        }
      ],
      "usage": "Kusanagi is one of the Three Imperial Regalia that validate the Emperor's divine descent from Amaterasu. The sword represents valor and the Emperor's role as military protector. It has been involved in several legendary events: its discovery by Susanoo, its use by Yamato Takeru in his conquests, and its near-loss at the Battle of Dan-no-ura in 1185. The sword's possession symbolizes legitimate rule over Japan.",
      "symbolism": "Kusanagi represents the virtue of valor (武 bu) and the Emperor's role as protector of Japan. The sword's origin from a defeated monster symbolizes the triumph of order over chaos. Its association with storms (Susanoo) and clouds suggests divine power over natural forces. The grass-cutting incident represents resourcefulness and the ability to overcome adversity. As one of the Three Sacred Treasures, it forms part of the cosmic trinity: mirror (wisdom), jewel (benevolence), and sword (valor).",
      "textReferences": [
        {
          "corpusUrl": "/corpus-search.html?term=kojiki+kusanagi",
          "text": "Kojiki",
          "passage": "Book 1, Age of the Gods",
          "context": "Susanoo slays Yamata-no-Orochi and discovers the sword in its tail"
        },
        {
          "corpusUrl": "/corpus-search.html?term=nihon+shoki+kusanagi",
          "text": "Nihon Shoki",
          "passage": "Book 1-2",
          "context": "Alternate account of the sword's origin and transfer to Amaterasu"
        },
        {
          "text": "Kojiki",
          "corpusUrl": "/corpus-search.html?term=kojiki+yamato+takeru",
          "passage": "Book 2, Yamato Takeru Legends",
          "context": "Yamato Takeru receives the sword and uses it to cut burning grass"
        }
      ],
      "names": [
        "Kusanagi-no-Tsurugi (Grass-Cutting Sword)",
        "Ame-no-Murakumo-no-Tsurugi (Sword of the Gathering Clouds of Heaven)",
        "Tsumugari-no-Tachi (another name for the sword)"
      ],
      "mythology": "japanese"
    }
  ],
  "metaphysicalProperties": {
    "world": "takamagahara",
    "energyType": "divine",
    "element": "wind"
  },
  "symbolism": "Imperial Legitimacy and Divine Right\n                \n                    Kusanagi's primary symbolic function is to legitimize imperial authority. The Three Sacred Treasures—\n                    sword, mirror, and jewel—represent the emperor's divine descent from Amaterasu and the mandate of heaven\n                    to rule Japan. Without these treasures, particularly the sword, the coronation ceremony is considered\n                    incomplete, and the emperor's authority questionable.\n                \n                \n                    This differs from European concepts of divine right in important ways. The Japanese emperor does not\n                    rule by personal divine nature (at least not solely) but as a custodian of sacred objects that embody\n                    the covenant between heaven and earth. The emperor serves as the bridge between the kami and humanity,\n                    and the regalia are the physical manifestation of this sacred role.\n                \n                \n                    Throughout Japanese history, control of the Three Sacred Treasures has been crucial during succession\n                    disputes. Even when shoguns held actual political power, they could not claim to rule without the\n                    emperor, who possessed the regalia. This sacred symbolism allowed the imperial line to maintain\n                    continuity even during periods of powerlessness, as no military leader dared claim the treasures\n                    improperly.\n                \n\n                Valor and Martial Virtue\n                \n                    Of the Three Sacred Treasures, Kusanagi specifically represents valor (the mirror represents wisdom,\n                    the jewel benevolence). The sword symbolizes the warrior spirit, the courage to face danger, and the\n                    strength to protect the realm from threats. This martial aspect connects the spiritual authority of the\n                    emperor with the practical necessity of defending the nation.\n                \n                \n                    However, Japanese concepts of valor emphasize righteousness and duty over mere aggression. Yamato\n                    Takeru's eventual downfall came when he left the sword behind out of arrogance—true courage means\n                    humility before divine power and adherence to sacred duty. The sword thus represents not just the\n                    ability to fight but the wisdom to know when and how to wield power.\n                \n\n                Transformation of Chaos into Order\n                \n                    Kusanagi's origin within Yamata no Orochi carries deep symbolic meaning. The serpent represented\n                    primordial chaos—destructive natural forces that terrorized humanity. Susanoo's slaying of the beast\n                    and discovery of the sword within it symbolizes the transformation of chaos into order, of destructive\n                    power into protective authority.\n                \n                \n                    This theme resonates throughout Japanese culture: the understanding that civilization requires the\n                    domestication of wild forces, that order emerges from chaos, and that even from the greatest monsters\n                    can come treasures. The sword is not created fresh but discovered within the serpent, suggesting that\n                    power already exists in nature and must be recognized and properly channeled.\n                \n\n                National Identity and Cultural Continuity\n                \n                    Beyond its religious significance, Kusanagi represents Japanese national identity and cultural\n                    continuity. The unbroken imperial line, stretching from mythological times to the present day, provides\n                    a sense of historical continuity unique among world nations. The sword physically embodies this\n                    continuity—allegedly the same object held by Susanoo in the Age of Gods, it bridges mythological and\n                    historical time.\n                \n                \n                    During periods of national crisis, particularly during World War II and the post-war occupation, the\n                    preservation of the Three Sacred Treasures was considered essential to maintaining Japanese identity.\n                    Even as political structures changed and the emperor renounced claims to divinity in the post-war\n                    constitution, the regalia remained symbols of cultural identity that transcended politics.\n                \n\n                Sacred Mystery and Hidden Power\n                \n                    Perhaps uniquely among legendary weapons, Kusanagi's power derives partly from not being seen. The\n                    sword's concealment is not merely practical preservation but fundamental to its nature. In Shinto belief,\n                    the deepest sacred objects must remain hidden—exposure to common view would profane them and diminish\n                    their spiritual power.\n                \n                \n                    This concept, called hijiri (sacred concealment), reflects a worldview where mystery itself is sacred.\n                    Not everything can or should be known. Some truths must remain veiled. The hidden sword represents this\n                    philosophy—its power is greatest precisely because it remains unseen, known only through faith and\n                    tradition rather than empirical observation.\n                \n\n                Elemental Control and Natural Harmony\n                \n                    The sword's association with wind and storms, derived from its origin in the storm-wreathed serpent,\n                    symbolizes humanity's relationship with natural forces. Proper rulership, in East Asian philosophy,\n                    maintains harmony between human society and the natural world. The emperor, wielding Kusanagi (at least\n                    symbolically), ensures this harmony.\n                \n                \n                    When disasters strike—earthquakes, typhoons, floods—traditional interpretation sometimes viewed them\n                    as signs that the cosmic order was disturbed. The emperor's possession of the regalia and proper\n                    performance of rituals help maintain balance. The sword, having mastered the storm power of Yamata no\n                    Orochi, represents controlled natural force serving human flourishing rather than destroying it.",
  "searchTerms": [
    "kusanagi-no-tsurugi",
    "kusanagi",
    "kusanagi-no-tsurugi (grass-cutting sword)",
    "ame-no-murakumo-no-tsurugi (sword of the gathering clouds of heaven)",
    "tsumugari-no-tachi (another name for the sword)",
    "imperial-regalia",
    "sword",
    "yamata-no-orochi",
    "susanoo",
    "amaterasu",
    "yamato-takeru",
    "atsuta-shrine",
    "divine-weapon",
    "three-treasures",
    "valor",
    "japanese"
  ],
  "migrationDate": "2025-12-13T10:16:35.695Z",
  "visibility": "public",
  "itemType": "weapon",
  "wielders": [
    "susanoo",
    "amaterasu",
    "yamato-takeru"
  ],
  "id": "kusanagi",
  "createdBy": [],
  "powers": [
    "Control over wind, ability to cut through anything, protection in battle"
  ],
  "owner": "",
  "significance": "",
  "enhancedBy": "agent8",
  "origin": "",
  "primarySources": [],
  "relatedItems": [],
  "description": "The Grass-Cutting Sword, Sacred Blade from the Tail of Yamata no Orochi",
  "deities": [
    "susanoo",
    "amaterasu"
  ],
  "updatedAt": "2025-12-26T05:13:52.235Z",
  "last_updated": {
    "_seconds": 1766795186,
    "_nanoseconds": 597000000
  },
  "batch5_migration": {
    "htmlRawContent": "<!DOCTYPE html>\r\n<html lang=\"en\">\r\n<head>\r\n    <meta charset=\"UTF-8\">\r\n    <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">\r\n    <title>Totsuka-no-Tsurugi - Divine Weapons - World Mythos Explorer</title>\r\n    <link rel=\"stylesheet\" href=\"../../themes/theme-base.css\">\r\n    <link rel=\"stylesheet\" href=\"../../themes/corpus-links.css\">\r\n    <link rel=\"stylesheet\" href=\"../../styles.css\">\r\n    <script defer src=\"../../themes/theme-picker.js\"></script>\r\n    <script defer src=\"../../themes/theme-animations.js\"></script>\r\n    <link rel=\"stylesheet\" href=\"../../themes/smart-links.css\">\r\n    <script defer src=\"../../themes/smart-links.js\"></script>\r\n\r\n    <style>\r\n        .hero-section { background: linear-gradient(135deg, rgba(var(--color-primary-rgb), 0.8), rgba(var(--color-secondary-rgb), 0.8)); backdrop-filter: blur(10px); border: 2px solid var(--color-primary); color: var(--color-text-primary); padding: 3rem 2rem; text-align: center; border-radius: var(--radius-xl); margin-bottom: 2rem; box-shadow: var(--shadow-xl); }\r\n        .hero-icon { font-size: 5rem; margin-bottom: 1rem; }\r\n        .hero-title { font-size: 3rem; margin-bottom: 0.5rem; color: var(--color-text-primary); }\r\n        .hero-subtitle { font-size: 1.3rem; color: var(--color-text-secondary); font-style: italic; }\r\n        .glass-card { background: rgba(var(--color-surface-rgb), 0.6); backdrop-filter: blur(10px); border: 1px solid rgba(var(--color-primary-rgb), 0.2); border-radius: var(--radius-lg); padding: 2rem; margin: 2rem 0; box-shadow: var(--shadow-lg); }\r\n        .section-title { color: var(--color-primary); font-size: 2rem; margin-bottom: 1.5rem; border-bottom: 2px solid var(--color-border); padding-bottom: 0.5rem; }\r\n        .subsection-title { color: var(--color-primary); font-size: 1.5rem; margin-top: 2rem; margin-bottom: 1rem; }\r\n        .info-grid { display: grid; grid-template-columns: repeat(auto-fit, minmax(250px, 1fr)); gap: 1.5rem; margin: 2rem 0; }\r\n        .info-item { background: rgba(var(--color-primary-rgb), 0.1); padding: 1.5rem; border-radius: var(--radius-lg); border: 1px solid var(--color-border); }\r\n        .info-label { font-weight: 600; color: var(--color-primary); margin-bottom: 0.5rem; font-size: 0.9rem; text-transform: uppercase; letter-spacing: 0.05em; }\r\n        .info-value { color: var(--color-text-primary); font-size: 1.1rem; }\r\n        .tradition-tags { display: flex; gap: 0.75rem; flex-wrap: wrap; margin: 1rem 0; justify-content: center; }\r\n        .tradition-tag { background: var(--color-primary); color: white; padding: 0.5rem 1.2rem; border-radius: var(--radius-full); font-size: 0.9rem; font-weight: 500; }\r\n        .related-links { display: grid; grid-template-columns: repeat(auto-fill, minmax(200px, 1fr)); gap: 1rem; margin: 2rem 0; }\r\n        .related-link { background: rgba(var(--color-primary-rgb), 0.1); padding: 1rem; border-radius: var(--radius-lg); border: 1px solid var(--color-border); text-decoration: none; color: var(--color-text-primary); transition: all 0.3s ease; text-align: center; }\r\n        .related-link:hover { background: rgba(var(--color-primary-rgb), 0.2); border-color: var(--color-primary); transform: translateY(-3px); box-shadow: var(--shadow-lg); }\r\n        .quote-box { background: rgba(var(--color-secondary-rgb), 0.1); border-left: 4px solid var(--color-secondary); padding: 1.5rem; margin: 2rem 0; font-style: italic; border-radius: 0 var(--radius-lg) var(--radius-lg) 0; }\r\n        .content-text { line-height: 1.8; color: var(--color-text-secondary); margin-bottom: 1.5rem; }\r\n        .content-text p { margin-bottom: 1rem; }\r\n        .highlight-box { background: linear-gradient(135deg, rgba(var(--color-primary-rgb), 0.2), rgba(var(--color-secondary-rgb), 0.2)); border: 2px solid var(--color-primary); border-radius: var(--radius-lg); padding: 1.5rem; margin: 2rem 0; }\r\n        ul, ol { margin-left: 2rem; margin-bottom: 1.5rem; line-height: 1.8; color: var(--color-text-secondary); }\r\n        li { margin-bottom: 0.5rem; }\r\n        .bibliography { background: rgba(var(--color-surface-rgb), 0.4); padding: 2rem; border-radius: var(--radius-lg); margin-top: 3rem; }\r\n        .power-list { display: grid; grid-template-columns: repeat(auto-fit, minmax(300px, 1fr)); gap: 1rem; margin: 1.5rem 0; }\r\n        .power-item { background: rgba(var(--color-primary-rgb), 0.05); padding: 1rem; border-radius: var(--radius-md); border-left: 4px solid var(--color-primary); }\r\n        .power-item strong { color: var(--color-primary); display: block; margin-bottom: 0.5rem; }\r\n    </style>\r\n</head>\r\n<body>\r\n    <div id=\"theme-picker-container\"></div>\r\n\r\n    <header>\r\n    <div class=\"header-content\">\r\n        <h1>Totsuka-no-Tsurugi</h1>\r\n    </div>\r\n</header>\r\n<nav class=\"breadcrumb\" aria-label=\"Breadcrumb\">\r\n    <a href=\"../../index.html\">Home</a> &rarr;\r\n    <a href=\"../index.html\">Sacred Items</a> &rarr;\r\n    <a href=\"../../archetypes/celestial/index.html\">Weapons</a> &rarr;\r\n    <span>Totsuka-no-Tsurugi</span>\r\n</nav>\r\n\r\n    <main>\r\n        <!-- HERO SECTION -->\r\n        <div class=\"hero-section\" data-item=\"totsuka-no-tsurugi\" data-tradition=\"Japanese,Shinto\" data-type=\"weapon\">\r\n            <div class=\"hero-icon\">&#9876;</div>\r\n            <h2 class=\"hero-title\">Totsuka-no-Tsurugi</h2>\r\n            <p class=\"hero-subtitle\">The Sword of Ten Hand-Breadths - Slayer of Serpents and Fire</p>\r\n            <div class=\"tradition-tags\">\r\n                <span class=\"tradition-tag\">Japanese</span>\r\n                <span class=\"tradition-tag\">Shinto</span>\r\n                <span class=\"tradition-tag\">Kojiki</span>\r\n                <span class=\"tradition-tag\">Divine Weapon</span>\r\n            </div>\r\n        </div>\r\n\r\n        <!-- QUICK INFO -->\r\n        <div class=\"glass-card\">\r\n            <div class=\"info-grid\">\r\n                <div class=\"info-item\">\r\n                    <div class=\"info-label\">Weapon Type</div>\r\n                    <div class=\"info-value\">Divine Sword</div>\r\n                </div>\r\n                <div class=\"info-item\">\r\n                    <div class=\"info-label\">Notable Wielders</div>\r\n                    <div class=\"info-value\">Izanagi, Susanoo</div>\r\n                </div>\r\n                <div class=\"info-item\">\r\n                    <div class=\"info-label\">Famous Victims</div>\r\n                    <div class=\"info-value\">Kagutsuchi, Yamata no Orochi</div>\r\n                </div>\r\n                <div class=\"info-item\">\r\n                    <div class=\"info-label\">Alternative Names</div>\r\n                    <div class=\"info-value\">Ama-no-Habakiri, Worochi-no-Aratsurugi</div>\r\n                </div>\r\n            </div>\r\n        </div>\r\n\r\n        <!-- DESCRIPTION -->\r\n        <div class=\"glass-card\">\r\n            <h3 class=\"section-title\">Description and Nature</h3>\r\n            <div class=\"content-text\">\r\n                <p>\r\n                    Totsuka-no-Tsurugi (Japanese: \"Sword of Ten Hand-Breadths\" or \"Ten-Span Sword\")\r\n                    is a class of divine swords in Japanese Shinto mythology, with several legendary\r\n                    blades bearing this designation. The name describes not a single weapon but a\r\n                    type - a sword whose blade measures ten fists (approximately 75-80 centimeters)\r\n                    in length. These swords appear at crucial moments in Japanese mythology, wielded\r\n                    by the most powerful deities to accomplish deeds that shaped the cosmic order.\r\n                </p>\r\n                <p>\r\n                    The most famous Totsuka-no-Tsurugi is the Ama-no-Habakiri (\"Slash of Heavenly\r\n                    Wings\" or \"Heaven's Tail-Feathers-Cutter\"), the sword used by Susanoo to slay\r\n                    the eight-headed serpent Yamata no Orochi. Another is the Ama-no-Ohabari\r\n                    (\"Divine Blade of Heaven\"), used by Izanagi to kill the fire god Kagutsuchi.\r\n                </p>\r\n                <p>\r\n                    These divine swords represent the power of the kami to impose order upon chaos,\r\n                    to slay monsters and rebellious spirits, and to establish the sacred authority\r\n                    of the heavenly lineage.\r\n                </p>\r\n            </div>\r\n\r\n            <div class=\"highlight-box\">\r\n                <h4 class=\"subsection-title\">Notable Totsuka-no-Tsurugi:</h4>\r\n                <ul>\r\n                    <li><strong>Ama-no-Ohabari:</strong> Izanagi's sword, used to slay Kagutsuchi;\r\n                    from its blood were born numerous kami</li>\r\n                    <li><strong>Ama-no-Habakiri:</strong> Susanoo's sword, used to slay Yamata no\r\n                    Orochi; from this battle came the Kusanagi</li>\r\n                    <li><strong>Futsunomitama:</strong> A divine sword associated with Takemikazuchi;\r\n                    possibly another name for the same weapon type</li>\r\n                </ul>\r\n            </div>\r\n        </div>\r\n\r\n        <!-- IZANAGI'S SWORD -->\r\n        <div class=\"glass-card\">\r\n            <h3 class=\"section-title\">The Slaying of Kagutsuchi</h3>\r\n            <div class=\"content-text\">\r\n                <p>\r\n                    The first major mythological use of a Totsuka-no-Tsurugi occurs in the tragic\r\n                    story of Izanami's death. The creator goddess, wife of Izanagi, died giving\r\n                    birth to Kagutsuchi, the god of fire. The flames of his birth burned her fatally,\r\n                    and she descended to Yomi, the land of the dead.\r\n                </p>\r\n                <p>\r\n                    In his grief and rage, Izanagi drew his Totsuka-no-Tsurugi (called Ama-no-Ohabari\r\n                    in some versions) and struck down his own son. With three strokes, he cut\r\n                    Kagutsuchi into pieces. From the god's body and blood sprang numerous new kami,\r\n                    including gods of thunder, mountains, and various aspects of fire itself.\r\n                </p>\r\n                <p>\r\n                    This act demonstrates the creative-destructive nature of divine violence in\r\n                    Shinto mythology. Even the murder of a god by his father leads to new creation -\r\n                    the universe continues to expand and differentiate through such sacred violence.\r\n                </p>\r\n            </div>\r\n        </div>\r\n\r\n        <!-- SUSANOO'S SWORD -->\r\n        <div class=\"glass-card\">\r\n            <h3 class=\"section-title\">The Slaying of Yamata no Orochi</h3>\r\n            <div class=\"content-text\">\r\n                <p>\r\n                    The most famous story involving a Totsuka-no-Tsurugi is Susanoo's battle with\r\n                    Yamata no Orochi, the eight-headed, eight-tailed serpent that terrorized the\r\n                    land of Izumo. This myth contains one of Japanese mythology's most beloved\r\n                    heroic narratives.\r\n                </p>\r\n\r\n                <h4 class=\"subsection-title\">The Setup</h4>\r\n                <p>\r\n                    After being expelled from heaven for his tempestuous behavior, Susanoo descended\r\n                    to the mortal realm. There he encountered an elderly couple weeping beside a\r\n                    beautiful young woman, Kushinadahime. They explained that each year for seven\r\n                    years, the Orochi had come to devour one of their eight daughters. Kushinadahime\r\n                    was the last, and the serpent was coming for her.\r\n                </p>\r\n\r\n                <h4 class=\"subsection-title\">The Battle</h4>\r\n                <p>\r\n                    Susanoo devised a plan. He had the couple prepare eight vats of sake (rice wine)\r\n                    and a fence with eight gates. When the Orochi arrived, it found the sake and\r\n                    drank greedily from each vat with each of its eight heads. Drunk and stupefied,\r\n                    the serpent was helpless when Susanoo attacked.\r\n                </p>\r\n                <p>\r\n                    With his Totsuka-no-Tsurugi (the Ama-no-Habakiri), Susanoo cut the serpent to\r\n                    pieces. As he carved through one of the tails, his blade struck something hard\r\n                    and chipped. Cutting open the tail, he discovered another sword - the legendary\r\n                    Kusanagi (Grass-Cutting Sword), which would become one of the Three Imperial\r\n                    Regalia of Japan.\r\n                </p>\r\n            </div>\r\n\r\n            <div class=\"quote-box\">\r\n                \"Then His Swift-Impetuous-Male-Augustness drew the ten-grasp sword that was\r\n                augustly girded on him, and cut the serpent in pieces, so that the River Hi\r\n                flowed on changed into a river of blood.\"\r\n                <br><br>- Kojiki\r\n            </div>\r\n        </div>\r\n\r\n        <!-- SIGNIFICANCE -->\r\n        <div class=\"glass-card\">\r\n            <h3 class=\"section-title\">Symbolism and Significance</h3>\r\n            <div class=\"content-text\">\r\n                <h4 class=\"subsection-title\">Divine Justice</h4>\r\n                <p>\r\n                    The Totsuka-no-Tsurugi represents the power of the kami to enforce cosmic order.\r\n                    Both Izanagi's slaying of Kagutsuchi and Susanoo's defeat of the Orochi demonstrate\r\n                    that even divine beings are subject to consequences for disrupting the proper\r\n                    order of things.\r\n                </p>\r\n\r\n                <h4 class=\"subsection-title\">Monster-Slaying</h4>\r\n                <p>\r\n                    As a serpent-slaying sword, the Totsuka-no-Tsurugi connects to a worldwide\r\n                    pattern of dragon/serpent-slaying myths. Susanoo's victory over the Orochi\r\n                    parallels stories like St. George and the Dragon, Siegfried and Fafnir, and\r\n                    Indra's defeat of Vritra.\r\n                </p>\r\n\r\n                <h4 class=\"subsection-title\">Imperial Authority</h4>\r\n                <p>\r\n                    The discovery of Kusanagi within the Orochi's body, found using a Totsuka-no-Tsurugi,\r\n                    links these divine swords to the foundation of Japanese imperial authority. The\r\n                    sword of divine justice literally produces the sword of imperial sovereignty.\r\n                </p>\r\n            </div>\r\n        </div>\r\n\r\n        <!-- RELATED LINKS -->\r\n        <div class=\"glass-card\">\r\n            <h3 class=\"section-title\">Related Articles</h3>\r\n            <div class=\"related-links\">\r\n                <a href=\"kusanagi.html\" class=\"related-link\">Kusanagi</a>\r\n                <a href=\"ame-no-murakumo.html\" class=\"related-link\">Ame-no-Murakumo</a>\r\n                <a href=\"amenonuhoko.html\" class=\"related-link\">Amenonuhoko</a>\r\n                <a href=\"../../mythos/japanese/deities/susanoo.html\" class=\"related-link\">Susanoo</a>\r\n                <a href=\"../../mythos/japanese/deities/izanagi.html\" class=\"related-link\">Izanagi</a>\r\n            </div>\r\n        </div>\r\n\r\n        <!-- BIBLIOGRAPHY -->\r\n        <div class=\"bibliography glass-card\">\r\n            <h3 class=\"section-title\">Bibliography</h3>\r\n            <ol>\r\n                <li>Chamberlain, Basil Hall (trans.). <em>The Kojiki</em>. Tuttle Publishing.</li>\r\n                <li>Philippi, Donald L. <em>Kojiki</em>. Princeton University Press, 1969.</li>\r\n                <li>Aston, W.G. (trans.). <em>Nihongi: Chronicles of Japan</em>. Tuttle Publishing.</li>\r\n            </ol>\r\n        </div>\r\n\r\n        <!-- INTERLINK PANEL -->\r\n        <section class=\"interlink-panel glass-card\">\r\n            <h3 class=\"interlink-header\">Explore Connections</h3>\r\n            <div class=\"interlink-grid\">\r\n                <div class=\"interlink-section\">\r\n                    <h4 class=\"interlink-section-title\">Wielders</h4>\r\n                    <a href=\"../../mythos/japanese/deities/susanoo.html\" class=\"item-link-card\">\r\n                        <span class=\"link-icon\">god</span>\r\n                        <span class=\"link-name\">Susanoo</span>\r\n                        <span class=\"link-desc\">Storm god, serpent-slayer</span>\r\n                    </a>\r\n                    <a href=\"../../mythos/japanese/deities/izanagi.html\" class=\"item-link-card\">\r\n                        <span class=\"link-icon\">god</span>\r\n                        <span class=\"link-name\">Izanagi</span>\r\n                        <span class=\"link-desc\">Creator deity</span>\r\n                    </a>\r\n                </div>\r\n                <div class=\"interlink-section\">\r\n                    <h4 class=\"interlink-section-title\">Source Tradition</h4>\r\n                    <a href=\"../../mythos/japanese/deities/index.html\" class=\"item-link-card\">\r\n                        <span class=\"link-icon\">tradition</span>\r\n                        <span class=\"link-name\">Japanese Mythology</span>\r\n                        <span class=\"link-desc\">Shinto tradition</span>\r\n                    </a>\r\n                </div>\r\n            </div>\r\n        </section>\r\n    </main>\r\n</body>\r\n</html>\r\n",
    "htmlTextContent": "Totsuka-no-Tsurugi - Divine Weapons - World Mythos Explorer .hero-section { background: linear-gradient(135deg, rgba(var(--color-primary-rgb), 0.8), rgba(var(--color-secondary-rgb), 0.8)); backdrop-filter: blur(10px); border: 2px solid var(--color-primary); color: var(--color-text-primary); padding: 3rem 2rem; text-align: center; border-radius: var(--radius-xl); margin-bottom: 2rem; box-shadow: var(--shadow-xl); } .hero-icon { font-size: 5rem; margin-bottom: 1rem; } .hero-title { font-size: 3rem; margin-bottom: 0.5rem; color: var(--color-text-primary); } .hero-subtitle { font-size: 1.3rem; color: var(--color-text-secondary); font-style: italic; } .glass-card { background: rgba(var(--color-surface-rgb), 0.6); backdrop-filter: blur(10px); border: 1px solid rgba(var(--color-primary-rgb), 0.2); border-radius: var(--radius-lg); padding: 2rem; margin: 2rem 0; box-shadow: var(--shadow-lg); } .section-title { color: var(--color-primary); font-size: 2rem; margin-bottom: 1.5rem; border-bottom: 2px solid var(--color-border); padding-bottom: 0.5rem; } .subsection-title { color: var(--color-primary); font-size: 1.5rem; margin-top: 2rem; margin-bottom: 1rem; } .info-grid { display: grid; grid-template-columns: repeat(auto-fit, minmax(250px, 1fr)); gap: 1.5rem; margin: 2rem 0; } .info-item { background: rgba(var(--color-primary-rgb), 0.1); padding: 1.5rem; border-radius: var(--radius-lg); border: 1px solid var(--color-border); } .info-label { font-weight: 600; color: var(--color-primary); margin-bottom: 0.5rem; font-size: 0.9rem; text-transform: uppercase; letter-spacing: 0.05em; } .info-value { color: var(--color-text-primary); font-size: 1.1rem; } .tradition-tags { display: flex; gap: 0.75rem; flex-wrap: wrap; margin: 1rem 0; justify-content: center; } .tradition-tag { background: var(--color-primary); color: white; padding: 0.5rem 1.2rem; border-radius: var(--radius-full); font-size: 0.9rem; font-weight: 500; } .related-links { display: grid; grid-template-columns: repeat(auto-fill, minmax(200px, 1fr)); gap: 1rem; margin: 2rem 0; } .related-link { background: rgba(var(--color-primary-rgb), 0.1); padding: 1rem; border-radius: var(--radius-lg); border: 1px solid var(--color-border); text-decoration: none; color: var(--color-text-primary); transition: all 0.3s ease; text-align: center; } .related-link:hover { background: rgba(var(--color-primary-rgb), 0.2); border-color: var(--color-primary); transform: translateY(-3px); box-shadow: var(--shadow-lg); } .quote-box { background: rgba(var(--color-secondary-rgb), 0.1); border-left: 4px solid var(--color-secondary); padding: 1.5rem; margin: 2rem 0; font-style: italic; border-radius: 0 var(--radius-lg) var(--radius-lg) 0; } .content-text { line-height: 1.8; color: var(--color-text-secondary); margin-bottom: 1.5rem; } .content-text p { margin-bottom: 1rem; } .highlight-box { background: linear-gradient(135deg, rgba(var(--color-primary-rgb), 0.2), rgba(var(--color-secondary-rgb), 0.2)); border: 2px solid var(--color-primary); border-radius: var(--radius-lg); padding: 1.5rem; margin: 2rem 0; } ul, ol { margin-left: 2rem; margin-bottom: 1.5rem; line-height: 1.8; color: var(--color-text-secondary); } li { margin-bottom: 0.5rem; } .bibliography { background: rgba(var(--color-surface-rgb), 0.4); padding: 2rem; border-radius: var(--radius-lg); margin-top: 3rem; } .power-list { display: grid; grid-template-columns: repeat(auto-fit, minmax(300px, 1fr)); gap: 1rem; margin: 1.5rem 0; } .power-item { background: rgba(var(--color-primary-rgb), 0.05); padding: 1rem; border-radius: var(--radius-md); border-left: 4px solid var(--color-primary); } .power-item strong { color: var(--color-primary); display: block; margin-bottom: 0.5rem; } Totsuka-no-Tsurugi Home &rarr; Sacred Items &rarr; Weapons &rarr; Totsuka-no-Tsurugi &#9876; Totsuka-no-Tsurugi The Sword of Ten Hand-Breadths - Slayer of Serpents and Fire Japanese Shinto Kojiki Divine Weapon Weapon Type Divine Sword Notable Wielders Izanagi, Susanoo Famous Victims Kagutsuchi, Yamata no Orochi Alternative Names Ama-no-Habakiri, Worochi-no-Aratsurugi Description and Nature Totsuka-no-Tsurugi (Japanese: \"Sword of Ten Hand-Breadths\" or \"Ten-Span Sword\") is a class of divine swords in Japanese Shinto mythology, with several legendary blades bearing this designation. The name describes not a single weapon but a type - a sword whose blade measures ten fists (approximately 75-80 centimeters) in length. These swords appear at crucial moments in Japanese mythology, wielded by the most powerful deities to accomplish deeds that shaped the cosmic order. The most famous Totsuka-no-Tsurugi is the Ama-no-Habakiri (\"Slash of Heavenly Wings\" or \"Heaven's Tail-Feathers-Cutter\"), the sword used by Susanoo to slay the eight-headed serpent Yamata no Orochi. Another is the Ama-no-Ohabari (\"Divine Blade of Heaven\"), used by Izanagi to kill the fire god Kagutsuchi. These divine swords represent the power of the kami to impose order upon chaos, to slay monsters and rebellious spirits, and to establish the sacred authority of the heavenly lineage. Notable Totsuka-no-Tsurugi: Ama-no-Ohabari: Izanagi's sword, used to slay Kagutsuchi; from its blood were born numerous kami Ama-no-Habakiri: Susanoo's sword, used to slay Yamata no Orochi; from this battle came the Kusanagi Futsunomitama: A divine sword associated with Takemikazuchi; possibly another name for the same weapon type The Slaying of Kagutsuchi The first major mythological use of a Totsuka-no-Tsurugi occurs in the tragic story of Izanami's death. The creator goddess, wife of Izanagi, died giving birth to Kagutsuchi, the god of fire. The flames of his birth burned her fatally, and she descended to Yomi, the land of the dead. In his grief and rage, Izanagi drew his Totsuka-no-Tsurugi (called Ama-no-Ohabari in some versions) and struck down his own son. With three strokes, he cut Kagutsuchi into pieces. From the god's body and blood sprang numerous new kami, including gods of thunder, mountains, and various aspects of fire itself. This act demonstrates the creative-destructive nature of divine violence in Shinto mythology. Even the murder of a god by his father leads to new creation - the universe continues to expand and differentiate through such sacred violence. The Slaying of Yamata no Orochi The most famous story involving a Totsuka-no-Tsurugi is Susanoo's battle with Yamata no Orochi, the eight-headed, eight-tailed serpent that terrorized the land of Izumo. This myth contains one of Japanese mythology's most beloved heroic narratives. The Setup After being expelled from heaven for his tempestuous behavior, Susanoo descended to the mortal realm. There he encountered an elderly couple weeping beside a beautiful young woman, Kushinadahime. They explained that each year for seven years, the Orochi had come to devour one of their eight daughters. Kushinadahime was the last, and the serpent was coming for her. The Battle Susanoo devised a plan. He had the couple prepare eight vats of sake (rice wine) and a fence with eight gates. When the Orochi arrived, it found the sake and drank greedily from each vat with each of its eight heads. Drunk and stupefied, the serpent was helpless when Susanoo attacked. With his Totsuka-no-Tsurugi (the Ama-no-Habakiri), Susanoo cut the serpent to pieces. As he carved through one of the tails, his blade struck something hard and chipped. Cutting open the tail, he discovered another sword - the legendary Kusanagi (Grass-Cutting Sword), which would become one of the Three Imperial Regalia of Japan. \"Then His Swift-Impetuous-Male-Augustness drew the ten-grasp sword that was augustly girded on him, and cut the serpent in pieces, so that the River Hi flowed on changed into a river of blood.\" - Kojiki Symbolism and Significance Divine Justice The Totsuka-no-Tsurugi represents the power of the kami to enforce cosmic order. Both Izanagi's slaying of Kagutsuchi and Susanoo's defeat of the Orochi demonstrate that even divine beings are subject to consequences for disrupting the proper order of things. Monster-Slaying As a serpent-slaying sword, the Totsuka-no-Tsurugi connects to a worldwide pattern of dragon/serpent-slaying myths. Susanoo's victory over the Orochi parallels stories like St. George and the Dragon, Siegfried and Fafnir, and Indra's defeat of Vritra. Imperial Authority The discovery of Kusanagi within the Orochi's body, found using a Totsuka-no-Tsurugi, links these divine swords to the foundation of Japanese imperial authority. The sword of divine justice literally produces the sword of imperial sovereignty. Related Articles Kusanagi Ame-no-Murakumo Amenonuhoko Susanoo Izanagi Bibliography Chamberlain, Basil Hall (trans.). The Kojiki . Tuttle Publishing. Philippi, Donald L. Kojiki . Princeton University Press, 1969. Aston, W.G. (trans.). Nihongi: Chronicles of Japan . Tuttle Publishing. Explore Connections Wielders god Susanoo Storm god, serpent-slayer god Izanagi Creator deity Source Tradition tradition Japanese Mythology Shinto tradition",
    "migratedFrom": "spiritual-items/weapons/totsuka-no-tsurugi.html",
    "migrationPercentage": 29.58,
    "originalWordCount": 798,
    "migrationDate": {
      "_seconds": 1766795186,
      "_nanoseconds": 597000000
    }
  },
  "batch4_migration_status": "completed",
  "extracted_lists": [
    "Izanami - Creator goddess, death ruler",
    "Amaterasu - Sun goddess (born from purification)",
    "Susanoo - Storm god (born from purification)",
    "Tsukuyomi - Moon god (born from purification)",
    "Japanese Myths - Other Shinto tales",
    "Orpheus and Eurydice - Greek parallel (failed rescue)",
    "Inanna's Descent - Sumerian underworld journey",
    "Death Archetype - Cross-cultural death myths",
    "Yomi - The Japanese underworld",
    "Misogi - Shinto purification ritual",
    "Kegare - Pollution/impurity concept",
    "Forbidden gaze motif - Universal mythic theme"
  ],
  "extracted_title": "Aztec Mythology - World Mythos Explorer",
  "extracted_headings": [
    "🌞 Aztec Mythology",
    "Aztec Mythology",
    "⚡ Deities",
    "🦸 Heroes & Legendary Mortals",
    "🐉 Creatures & Monsters",
    "🌌 Cosmology & Sacred Places",
    "📚 Sacred Texts",
    "🌿 Sacred Plants & Herbalism",
    "🔮 Rituals & Practices",
    "🔱 Sacred Symbols",
    "💭 Mystical Concepts",
    "📖 Myths & Legends",
    "🔗 Related Traditions",
    "Explore Other Mythologies"
  ],
  "batch4_migration_timestamp": {
    "_seconds": 1766801100,
    "_nanoseconds": 187000000
  },
  "_created": "2025-12-27T07:06:13.730Z",
  "icon": "<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 64 64\">\n  <circle cx=\"32\" cy=\"32\" r=\"28.8\" fill=\"#6a5acd\" opacity=\"0.2\"/>\n  <circle cx=\"32\" cy=\"32\" r=\"16\" fill=\"none\" stroke=\"#6a5acd\" stroke-width=\"2\"/>\n  <text x=\"32\" y=\"44.8\" text-anchor=\"middle\" font-size=\"22.4\" fill=\"#6a5acd\">💎</text>\n</svg>",
  "mythology": "japanese"
}