{
  "geographical": null,
  "createdBy": [],
  "migratedFrom": "legacy-repository",
  "subtype": "sacred-object",
  "migrationDate": "2025-12-13T10:16:35.286Z",
  "mythologyContexts": [],
  "slug": "crown-of-thorns",
  "_uploadedAt": "2025-12-25T15:46:34.132370",
  "extendedContent": [
    {
      "content": "The Crown of Thorns is one of the most significant relics in Christian tradition, believed to be the\n                    woven crown of thorny branches placed upon Jesus Christ's head by Roman soldiers during his Passion.\n                    This instrument of mockery and torture, intended to ridicule Christ's claim to kingship, has become\n                    one of the most powerful symbols of Christian devotion, representing the suffering Christ endured\n                    for humanity's salvation.\n                \n                \n                    The relic currently preserved at Notre-Dame de Paris (temporarily housed at the Louvre following\n                    the 2019 fire) consists of a ring of woven rushes or reeds, approximately 21 centimeters in diameter,\n                    bound together without visible thorns. The thorns themselves were distributed as separate relics\n                    throughout medieval Christendom, with various churches claiming to possess individual thorns from\n                    the original crown.",
      "title": "Description and Physical Characteristics"
    },
    {
      "content": "The Gospel accounts describe the crowning with thorns as part of the mockery Jesus endured following\n                    his condemnation by Pontius Pilate. Roman soldiers, aware that Jesus had been accused of claiming\n                    to be King of the Jews, fashioned a crown from thorny branches as a cruel parody of royal regalia.",
      "title": "Biblical Origin and Passion Narrative"
    },
    {
      "content": "Unlike some relics associated with miraculous powers, the Crown of Thorns has primarily served\n                    as an object of devotion and meditation rather than a source of reported miracles. Its power\n                    lies in its capacity to inspire contemplation of Christ's suffering and to deepen the spiritual\n                    lives of the faithful.",
      "title": "Spiritual Powers and Veneration"
    },
    {
      "content": "From Jerusalem to Constantinople\n                \n                    The earliest references to the Crown of Thorns as a preserved relic date from the fourth century.\n                    Paulinus of Nola mentions it around 409 CE, and subsequent pilgrims to Jerusalem report seeing\n                    it displayed at various holy sites. The crown apparently remained in the Byzantine capital after\n                    the fall of the Western Roman Empire, housed in the imperial chapel.\n                \n\n                Saint Louis and the Sainte-Chapelle\n                \n                    The acquisition of the Crown of Thorns became the defining achievement of Saint Louis IX's reign.\n                    When Baldwin II offered the crown in 1238, Louis saw an opportunity to bring the most precious\n                    relic of Christendom to France. He paid 135,000 livres (about half the annual revenue of the\n                    French crown) to Venetian bankers who held it as collateral.\n                \n                \n                    Louis personally carried the crown barefoot into Paris, wearing only a simple tunic, in a display\n                    of humble piety. He then commissioned the construction of Sainte-Chapelle, completed in 1248,\n                    which cost more than the relic itself. The chapel's soaring stained glass windows told the story\n                    of the relics it contained and became a masterpiece of Rayonnant Gothic architecture.\n                \n\n                Revolutionary Peril and Survival\n                \n                    During the French Revolution, the Crown of Thorns faced destruction along with other religious\n                    treasures. The revolutionaries melted down its golden reliquary and scattered its contents.\n                    However, local believers secretly preserved the crown itself, hiding it until religious practice\n                    was restored under Napoleon. The relic was given a new reliquary and eventually transferred to\n                    the treasury of Notre-Dame de Paris.\n                \n\n                The 2019 Fire and Rescue\n                \n                    When fire engulfed Notre-Dame de Paris on April 15, 2019, the Crown of Thorns faced its greatest\n                    modern peril. Father Jean-Marc Fournier, chaplain of the Paris Fire Brigade, entered the burning\n                    cathedral and retrieved the crown from its chapel, ensuring its survival. The relic is currently\n                    stored safely at the Louvre until Notre-Dame's restoration is complete.",
      "title": "Historical Journey and Preservation"
    },
    {
      "content": "The Crown of Thorns is traditionally grouped with other relics from Christ's Passion, many of\n                    which were allegedly discovered by Saint Helena or preserved through similar channels.\n                \n                \n                    The True Cross: Fragments of the cross upon which Christ was crucified\n                    The Holy Lance: The spear that pierced Christ's side (Spear of Longinus)\n                    The Holy Nails: The nails used in the crucifixion\n                    The Titulus Crucis: The sign placed above Christ's head on the cross\n                    The Holy Sponge: The sponge offered to Christ with vinegar\n                    The Shroud of Turin: The burial cloth bearing Christ's image\n                    The Veil of Veronica: The cloth bearing Christ's face",
      "title": "Related Passion Relics"
    }
  ],
  "id": "crown-of-thorns",
  "colors": null,
  "name": "Crown of Thorns",
  "icon": "⚔️",
  "longDescription": "The Sacred Wreath of Christ's Passion and Suffering The Crown of Thorns is one of the most significant relics in Christian tradition, believed to be the\n                    woven crown of thorny branches placed upon Jesus Christ's head by Roman soldiers during his Passion.\n                    This instrument of mockery and torture, intended to ridicule Christ's claim to kingship, has become\n                    one of the most powerful symbols of Christian devotion, representing the suffering Christ endured\n                    for humanity's salvation.",
  "type": "item",
  "cultural": null,
  "wielders": [],
  "linguistic": null,
  "shortDescription": "The Sacred Wreath of Christ's Passion and Suffering",
  "itemType": "artifact",
  "sources": [],
  "visibility": "public",
  "status": "published",
  "searchTerms": [
    "crown of thorns",
    "crown-of-thorns",
    "christian",
    "catholic",
    "orthodox",
    "passion relic",
    "relic"
  ],
  "usage": "Unlike some relics associated with miraculous powers, the Crown of Thorns has primarily served\n                    as an object of devotion and meditation rather than a source of reported miracles. Its power\n                    lies in its capacity to inspire contemplation of Christ's suffering and to deepen the spiritual\n                    lives of the faithful.",
  "tags": [
    "christian",
    "catholic",
    "orthodox",
    "passion relic",
    "relic",
    "crown-of-thorns"
  ],
  "primaryMythology": "christian",
  "metaphysicalProperties": null,
  "powers": [],
  "_enhanced": true,
  "materials": [
    "Thorny branches (Ziziphus spina-christi)"
  ],
  "mythologies": [
    "christian",
    "orthodox",
    "passion relic"
  ],
  "relatedEntities": null,
  "temporal": null,
  "mediaReferences": {
    "diagrams": [],
    "images": []
  },
  "subtitle": "Ancient item",
  "sortName": "crownofthorns",
  "importance": 50,
  "popularity": 80,
  "_version": "2.0",
  "_modified": "2025-12-25T08:13:25.253Z",
  "_metadataEnhanced": true,
  "_enhancedAt": "2025-12-25T08:13:25.253Z"
}