{
  "_enhanced": true,
  "relatedEntities": null,
  "status": "published",
  "type": "item",
  "name": "Necklace of Harmonia",
  "linguistic": null,
  "wielders": [
    "Harmonia, daughter of Ares and Aphrodite"
  ],
  "slug": "necklace-of-harmonia",
  "extendedContent": [
    {
      "title": "Description and Origin",
      "content": "The Necklace of Harmonia is one of Greek mythology's most famous cursed objects, a\n                    magnificent piece of jewelry that brought beauty and grace to its wearer but also\n                    terrible misfortune. Crafted by Hephaestus, the divine smith, the necklace was given\n                    as a wedding gift when Harmonia married Cadmus, the founder of Thebes.\n                \n                \n                    However, the necklace was created in bitter vengeance. Hephaestus had discovered his\n                    wife Aphrodite's affair with Ares, and Harmonia was the product of that illicit union.\n                    The smith-god fashioned the necklace to be irresistibly beautiful but imbued it with\n                    a curse that would bring doom to all who possessed it."
    },
    {
      "content": "The Wedding of Cadmus and Harmonia\n                \n                    The wedding of Cadmus and Harmonia was one of the great divine celebrations, attended\n                    by all the Olympian gods. Among the gifts were two items from Hephaestus: the necklace\n                    and a magical robe. Both were beautiful beyond measure, and both were cursed.\n                \n                \n                    Despite their happy marriage and the founding of Thebes, the curse took hold. Their\n                    descendants suffered terribly: their daughter Semele was burned to death by Zeus's\n                    divine radiance, their daughter Ino went mad and killed her children, and their\n                    grandson Pentheus was torn apart by his own mother. Eventually, Cadmus and Harmonia\n                    themselves were transformed into serpents.\n                \n\n                Eriphyle's Treachery\n                \n                    The necklace next appears in the story of the Seven Against Thebes. Polynices, seeking\n                    allies for his war against his brother Eteocles, bribed Eriphyle with the necklace\n                    to convince her husband Amphiaraus to join the doomed expedition. Amphiaraus was a\n                    seer who knew he would die if he went, but Eriphyle's greed for the necklace sealed\n                    his fate. Their son Alcmaeon later killed Eriphyle in revenge, inheriting both the\n                    necklace and its curse.\n                \n\n                Final Dedication\n                \n                    The curse-laden necklace passed through many hands, bringing destruction to each owner,\n                    until it was finally dedicated at the sanctuary of Apollo at Delphi. Some versions\n                    say it was later stolen by tyrants or destroyed in the Sacred Wars, while others\n                    claim it remained, its power contained by the god's sanctuary.",
      "title": "Trail of Tragedy"
    }
  ],
  "id": "necklace-of-harmonia",
  "mediaReferences": {
    "images": [],
    "diagrams": []
  },
  "visibility": "public",
  "shortDescription": "The Cursed Jewel of Divine Beauty and Tragic Fate",
  "geographical": null,
  "cultural": null,
  "subtype": "sacred-object",
  "migrationDate": "2025-12-13T10:16:35.774Z",
  "metaphysicalProperties": null,
  "materials": [],
  "tags": [
    "greek",
    "theban",
    "cursed",
    "divine craft",
    "relic",
    "necklace-of-harmonia"
  ],
  "createdBy": [],
  "migratedFrom": "legacy-repository",
  "mythologyContexts": [],
  "colors": null,
  "longDescription": "The Cursed Jewel of Divine Beauty and Tragic Fate The Necklace of Harmonia is one of Greek mythology's most famous cursed objects, a\n                    magnificent piece of jewelry that brought beauty and grace to its wearer but also\n                    terrible misfortune. Crafted by Hephaestus, the divine smith, the necklace was given\n                    as a wedding gift when Harmonia married Cadmus, the founder of Thebes.",
  "itemType": "artifact",
  "icon": "⚔️",
  "powers": [],
  "sources": [],
  "searchTerms": [
    "necklace of harmonia",
    "necklace-of-harmonia",
    "greek",
    "theban",
    "cursed",
    "divine craft",
    "relic"
  ],
  "temporal": null,
  "primaryMythology": "cursed",
  "_uploadedAt": "2025-12-25T15:46:34.143285",
  "mythologies": [
    "cursed",
    "greek",
    "theban",
    "divine craft"
  ],
  "subtitle": "Ancient item",
  "sortName": "necklaceofharmonia",
  "importance": 50,
  "popularity": 50,
  "_version": "2.0",
  "_modified": "2025-12-25T08:15:40.232Z",
  "_metadataEnhanced": true,
  "_enhancedAt": "2025-12-25T08:15:40.232Z"
}