{
  "id": "hindu_sri-yantra",
  "name": "Sri Yantra",
  "displayName": "Sri Yantra - Sacred Geometry",
  "type": "symbol",
  "mythology": "hindu",
  "contentType": "symbols",
  "filename": "sri-yantra",
  "slug": "sri-yantra",
  "visibility": "public",
  "status": "published",
  "shortDescription": "The supreme yantra of Hindu Tantra, consisting of nine interlocking triangles representing the union of Shiva and Shakti and the entire cosmos",
  "description": "The Sri Yantra (also called Shri Yantra or Sri Chakra) is the most revered and complex of all Hindu yantras, representing the goddess Tripura Sundari (Lalita Devi) and the entire process of cosmic creation. Composed of nine interlocking triangles surrounded by lotus petals and enclosed in a square frame, it is considered the visual representation of the mantra 'OM' and the geometric form of the goddess herself. The yantra serves as a powerful meditation tool in the Shri Vidya tradition and is believed to contain the blueprint of all creation within its precise geometric proportions.",
  "longDescription": "The Sri Yantra stands as the pinnacle of sacred geometry in Hindu Tantric tradition, representing nothing less than the complete map of the cosmos and the human psyche. Its name derives from 'Sri' (auspiciousness, wealth, beauty) and 'Yantra' (instrument, machine), making it the 'Instrument of Auspiciousness' or the 'Machine of Wealth.'\n\nAt its core, the yantra consists of nine interlocking triangles (navayoni chakra). Four triangles point upward, representing Shiva (masculine consciousness, the unchanging absolute), while five triangles point downward, representing Shakti (feminine creative power, dynamic energy). Their intersection creates 43 smaller triangles, forming the cosmic web of creation. This interplay symbolizes the eternal dance of consciousness and energy, the union from which all existence emerges.\n\nThe central point (Bindu) represents the source of all creation - the dimensionless point from which the entire universe unfolds. In meditation, this bindu is identified with the sahasrara chakra (crown center) and pure consciousness. Moving outward, each layer of the yantra represents progressive stages of manifestation, from the subtle to the gross, from unity to multiplicity.\n\nThe surrounding elements include two rings of lotus petals (8 and 16 petals representing the eightfold and sixteenfold aspects of creative power), three circles representing the three gunas (sattva, rajas, tamas), and the square outer frame (bhupura) with four gates representing the manifest world and the four directions.\n\nThe mathematical precision of the Sri Yantra is remarkable. Its construction requires extraordinary accuracy - even slight deviations disrupt its sacred proportions. The ratios embedded within the yantra correspond to natural phenomena, the golden ratio, and principles that modern mathematics and physics have only recently begun to appreciate. Some researchers have noted correlations between the yantra's geometry and wave interference patterns, suggesting it may represent fundamental vibrational structures of reality.\n\nIn the Shri Vidya tradition, the Sri Yantra is the external form of the goddess Lalita Tripura Sundari, also known as Shodashi (the Sixteen-Year-Old) and Raja Rajeshwari (Queen of Queens). Practitioners visualize the goddess seated upon the bindu and progressively meditate through each layer of the yantra, corresponding to the fifteen syllables of the Panchadashi mantra plus the final sixteenth syllable representing transcendence.\n\nThe yantra is used in various ways: as a meditation focus (dharana), as an object of worship with offerings (puja), as a tool for mantric practice, and as a sacred presence installed in temples and homes. Large-scale Sri Yantras are installed in important Shakta temples, and the yantra can be made of various materials including gold, silver, copper, crystal, or even drawn with sacred powders.\n\nThe nine triangles also correspond to the nine chakras in advanced Tantric anatomy, the nine forms of the goddess (Navadurga), and the nine nights of Navaratri. The 43 subsidiary triangles are associated with various deities, cosmic principles, and letters of the Sanskrit alphabet, making the yantra a complete encyclopedia of Hindu metaphysics encoded in geometric form.",
  "meanings": [
    "Supreme representation of the Divine Feminine (Shakti) in geometric form",
    "The complete cosmogram showing all stages of creation from unity to multiplicity",
    "Union of Shiva (consciousness) and Shakti (energy) - the fundamental polarity underlying existence",
    "Visual representation of the sacred sound 'OM' and the Panchadashi mantra",
    "Map of the subtle body, with each layer corresponding to chakras and energy centers",
    "Blueprint of creation containing the mathematical principles underlying the universe",
    "The body of the goddess Lalita Tripura Sundari / Tripura Sundari",
    "Symbol of prosperity, auspiciousness, and spiritual liberation"
  ],
  "visualDescription": "A complex geometric figure consisting of nine interlocking triangles arranged around a central point (bindu). Four triangles point upward and five point downward, creating 43 subsidiary triangles through their intersection. This central configuration is enclosed by two concentric rings of lotus petals (inner ring of 8 petals, outer ring of 16 petals), three concentric circles, and a square outer frame (bhupura) with T-shaped gates on each side. The entire design demonstrates precise mathematical proportions and perfect symmetry around its vertical axis.",
  "ritualUsage": "The Sri Yantra is central to Shri Vidya worship and Tantric meditation practices. It is used for daily puja with offerings of flowers, incense, and water. Practitioners perform nyasa (ritual touch), placing mantras and deities at specific points of the yantra. Advanced practitioners use it for dharana (concentration meditation), gazing at the center while mentally traversing the yantra from outside to inside (samhara krama - dissolution) or from inside to outside (srishti krama - creation). The yantra is often installed in homes and temples facing east, and special rituals are performed during Navaratri, Diwali, and other Shakta festivals.",
  "usage": "Used in Tantric meditation, mantra practice, temple worship, and as a sacred presence in homes and sacred spaces. The yantra is believed to attract prosperity, spiritual growth, and divine grace when properly consecrated and worshipped.",
  "attributes": [
    "Nine interlocking triangles (Navayoni Chakra)",
    "Central bindu (point of origin)",
    "43 subsidiary triangles",
    "8-petaled lotus (ashtadala padma)",
    "16-petaled lotus (shodashadala padma)",
    "Three concentric circles (trivritta)",
    "Square frame with four gates (bhupura)"
  ],
  "variations": [
    {
      "name": "Meru Sri Yantra",
      "description": "Three-dimensional pyramidal form of the Sri Yantra, where the triangles rise in stepped levels toward the central bindu. Considered especially powerful for worship and meditation."
    },
    {
      "name": "Kurma (Tortoise) Prishta Sri Yantra",
      "description": "Curved three-dimensional form resembling a tortoise shell, with the surface curved like the back of Kurma, Vishnu's tortoise avatar."
    },
    {
      "name": "Bhupura Sri Yantra",
      "description": "Flat two-dimensional form, most common for meditation and wall display."
    },
    {
      "name": "Sarvatobhadra Sri Yantra",
      "description": "Elaborate form including additional sacred geometry and all auspicious symbols."
    }
  ],
  "components": {
    "bindu": {
      "name": "Bindu",
      "description": "The central point representing the source of all creation, pure consciousness, the goddess herself, and the point of unity before manifestation",
      "significance": "Seat of the goddess Tripura Sundari, represents sahasrara chakra, the state of samadhi, and the source from which the universe emanates"
    },
    "trikona": {
      "name": "Primary Triangle (Trikona)",
      "description": "The innermost triangle surrounding the bindu, pointing downward, representing the yoni and the primordial creative power",
      "significance": "First manifestation from the bindu, the womb of creation, associated with Kamakala (the triangle of desire)"
    },
    "ashtakona": {
      "name": "Eight-Pointed Star (Ashtakona)",
      "description": "Formed by two interlocking triangles, creating an eight-pointed configuration",
      "significance": "Represents the eight forms of the goddess (Ashta Lakshmi), eight subtle elements, and the octave of creation"
    },
    "antardasara": {
      "name": "Inner Ten Triangles (Antar Dashara)",
      "description": "Ten triangles formed in the inner region by the intersection of the nine primary triangles",
      "significance": "Associated with ten vital energies (pranas), ten directions, and ten forms of the goddess"
    },
    "bahirdasara": {
      "name": "Outer Ten Triangles (Bahir Dashara)",
      "description": "Ten triangles in the outer region of the central configuration",
      "significance": "Represents the ten senses (five jnanendriyas and five karmendriyas) and cosmic functions"
    },
    "chaturdashakona": {
      "name": "Fourteen Triangles (Chaturdashara)",
      "description": "Fourteen triangles forming the outermost layer of the triangular configuration",
      "significance": "Represents the fourteen worlds (lokas), fourteen principal nadis, and fourteen forms of desire"
    },
    "ashtadalapadma": {
      "name": "Eight-Petaled Lotus (Ashtadala Padma)",
      "description": "Ring of eight lotus petals surrounding the triangular complex",
      "significance": "Represents eight forms of Lakshmi, eight yogic powers (siddhis), and eight directions plus center"
    },
    "shodashadalapadma": {
      "name": "Sixteen-Petaled Lotus (Shodashadala Padma)",
      "description": "Outer ring of sixteen lotus petals",
      "significance": "Represents sixteen vowels of Sanskrit, sixteen phases of the moon, sixteen kalas (arts/aspects) of the goddess"
    },
    "trivritta": {
      "name": "Three Circles (Trivritta)",
      "description": "Three concentric circles surrounding the lotus petals",
      "significance": "Represents the three gunas (sattva, rajas, tamas), three states of consciousness, and three principal nadis"
    },
    "bhupura": {
      "name": "Square Frame (Bhupura)",
      "description": "The outermost square boundary with four T-shaped gates",
      "significance": "Represents the earth element, the manifest physical world, the four directions, and the temple structure. The gates represent entry points into the sacred space"
    }
  },
  "triangleConfiguration": {
    "upwardTriangles": {
      "count": 4,
      "name": "Shiva Trikonas",
      "represents": "Masculine principle, consciousness, fire element, upward spiritual aspiration, the unchanging absolute"
    },
    "downwardTriangles": {
      "count": 5,
      "name": "Shakti Trikonas",
      "represents": "Feminine principle, creative energy, water element, material manifestation, dynamic power"
    },
    "subsidiaryTriangles": {
      "count": 43,
      "description": "Created by the intersection of the nine primary triangles, these form distinct zones each associated with specific deities, energies, and cosmic principles"
    }
  },
  "sacredGeometry": {
    "mathematicalProperties": [
      "Contains ratios approximating the golden ratio (phi = 1.618...)",
      "Demonstrates precise angular relationships and proportional harmonics",
      "The nine triangles must be drawn with exact precision to create proper intersections",
      "Contains within it the numerical sequences found throughout nature",
      "Some researchers note similarities to wave interference patterns and cymatics"
    ],
    "constructionMethod": "Traditional construction requires starting with the bindu, then carefully drawing each triangle so that all intersection points align perfectly. Various texts describe different methods, but achieving correct proportions is extraordinarily difficult - a perfect Sri Yantra is said to be nearly impossible to draw by hand without divine grace. Computer analysis has shown that the traditional constructions involve sophisticated mathematical relationships.",
    "numericalSignificance": {
      "nine": "Nine primary triangles, representing the nine chakras, nine forms of Durga, and the completed cycle of creation",
      "fortythree": "Subsidiary triangles representing 43 aspects of consciousness and 43 cosmic principles",
      "twentyfour": "Twenty-four corners of the inner star, associated with 24 letters of the Gayatri mantra",
      "eight": "Eight primary points in the outer lotus, representing the eight directions and eight siddhis",
      "sixteen": "Sixteen petals of the outer lotus, corresponding to sixteen vowels and sixteen kalas"
    }
  },
  "shriVidyaTradition": {
    "description": "Shri Vidya is one of the most influential schools of Hindu Tantra, centered on the worship of the goddess Lalita Tripura Sundari through the Sri Yantra and its associated mantras.",
    "mainMantra": "Panchadashi (15-syllable mantra) and Shodashi (16-syllable mantra)",
    "lineages": [
      {
        "name": "Samayachara",
        "description": "Internal worship tradition emphasizing meditation on the chakras as seats of the goddess"
      },
      {
        "name": "Kaulachara",
        "description": "External ritualistic tradition with elaborate worship ceremonies"
      },
      {
        "name": "Mishra",
        "description": "Combined approach integrating both internal and external practices"
      }
    ],
    "keyTexts": [
      "Saundaryalahari (attributed to Shankaracharya)",
      "Lalita Sahasranama",
      "Parashurama Kalpasutra",
      "Tantraraja Tantra",
      "Vamakeshvara Tantra",
      "Yogini Hridaya"
    ],
    "centralDeity": {
      "name": "Lalita Tripura Sundari",
      "alternateNames": [
        "Shodashi",
        "Raja Rajeshwari",
        "Kameshwari",
        "Lalita Devi",
        "Maha Tripura Sundari"
      ],
      "description": "The supreme goddess of beauty, the 'Beauty of the Three Worlds,' who presides over the Sri Yantra from its central bindu"
    }
  },
  "spiritualSignificance": {
    "meditationBenefits": [
      "Leads to expanded states of consciousness and spiritual awakening",
      "Harmonizes the subtle energy body and activates kundalini",
      "Brings mental peace, clarity, and one-pointed concentration",
      "Facilitates the experience of non-dual awareness",
      "Opens access to intuitive knowledge and inner guidance"
    ],
    "worldlyBenefits": [
      "Attracts prosperity, abundance, and material well-being",
      "Removes obstacles and negative influences",
      "Brings harmony to relationships and environment",
      "Protects from malefic energies and influences",
      "Enhances creativity and intellectual abilities"
    ],
    "symbolism": {
      "cosmicCreation": "The yantra maps the entire process of creation from the unmanifest bindu through all stages of manifestation to the gross physical plane represented by the bhupura",
      "innerJourney": "In meditation, the practitioner travels from the outer squares inward to the bindu, representing the spiritual journey from material consciousness to pure awareness",
      "unity": "The interlocking triangles demonstrate that Shiva and Shakti, consciousness and energy, spirit and matter, are ultimately one inseparable reality",
      "microcosm": "The yantra represents the subtle body of both the individual and the cosmos, demonstrating the Tantric principle 'as above, so below'"
    }
  },
  "relatedEntities": {
    "deities": [
      {
        "id": "lalita-tripura-sundari",
        "name": "Lalita Tripura Sundari",
        "type": "deity",
        "mythology": "hindu",
        "icon": "Goddess who presides over the Sri Yantra",
        "_unverified": true,
        "_unverifiedReason": "Entity not found in database"
      },
      {
        "id": "shiva",
        "name": "Shiva",
        "type": "deity",
        "mythology": "hindu",
        "icon": "Represents the four upward-pointing triangles (consciousness)"
      },
      {
        "id": "shakti",
        "name": "Shakti",
        "type": "deity",
        "mythology": "hindu",
        "icon": "Represents the five downward-pointing triangles (energy)",
        "_unverified": true,
        "_unverifiedReason": "Entity not found in database"
      },
      {
        "id": "lakshmi",
        "name": "Lakshmi",
        "type": "deity",
        "mythology": "hindu",
        "icon": "Associated with the yantra's prosperity-granting powers"
      },
      {
        "id": "saraswati",
        "name": "Saraswati",
        "type": "deity",
        "mythology": "hindu",
        "icon": "Associated with the yantra's wisdom aspects"
      }
    ],
    "symbols": [
      {
        "id": "hindu_om",
        "name": "Om",
        "type": "symbol",
        "mythology": "hindu",
        "relationship": "related"
      },
      {
        "id": "hindu_bindu",
        "name": "Bindu",
        "type": "symbol",
        "mythology": "hindu",
        "relationship": "related",
        "_unverified": true,
        "_unverifiedReason": "Entity not found in database"
      },
      {
        "id": "lotus",
        "name": "Lotus",
        "type": "symbol",
        "mythology": "hindu",
        "relationship": "related"
      }
    ],
    "concepts": [
      {
        "id": "kundalini",
        "name": "Kundalini",
        "type": "concept",
        "mythology": "hindu",
        "relationship": "related",
        "_unverified": true,
        "_unverifiedReason": "Entity not found in database"
      },
      {
        "id": "chakras",
        "name": "Chakra System",
        "type": "concept",
        "mythology": "hindu",
        "relationship": "related",
        "_unverified": true,
        "_unverifiedReason": "Entity not found in database"
      },
      {
        "id": "tantra",
        "name": "Tantra",
        "type": "concept",
        "mythology": "hindu",
        "relationship": "related"
      }
    ],
    "places": [
      {
        "id": "sri-chakra-temple",
        "name": "Temples housing Sri Yantra",
        "type": "place",
        "mythology": "hindu",
        "examples": [
          "Kamakshi Temple (Kanchipuram)",
          "Meenakshi Temple (Madurai)",
          "Kollur Mookambika Temple"
        ],
        "_unverified": true,
        "_unverifiedReason": "Entity not found in database"
      }
    ],
    "texts": [
      {
        "id": "saundaryalahari",
        "name": "Saundaryalahari",
        "type": "text",
        "mythology": "hindu",
        "relationship": "related",
        "_unverified": true,
        "_unverifiedReason": "Entity not found in database"
      },
      {
        "id": "lalita-sahasranama",
        "name": "Lalita Sahasranama",
        "type": "text",
        "mythology": "hindu",
        "relationship": "related",
        "_unverified": true,
        "_unverifiedReason": "Entity not found in database"
      }
    ]
  },
  "primarySources": [
    {
      "name": "Saundaryalahari",
      "author": "Attributed to Adi Shankaracharya",
      "description": "Hymn of 100 verses praising the goddess, with extensive references to Sri Yantra meditation",
      "relevance": "Describes the spiritual significance and meditation practices associated with the yantra"
    },
    {
      "name": "Tantraraja Tantra",
      "description": "Major Tantric text of the Shri Vidya tradition",
      "relevance": "Contains detailed instructions for Sri Yantra worship and meditation"
    },
    {
      "name": "Yogini Hridaya",
      "description": "Heart of the Yogini, esoteric Tantric text",
      "relevance": "Explains the inner meaning and meditation technique of the Sri Yantra"
    },
    {
      "name": "Parashurama Kalpasutra",
      "description": "Ritual manual for Shri Vidya practitioners",
      "relevance": "Provides detailed puja procedures and construction methods"
    },
    {
      "name": "Vamakeshvara Tantra",
      "description": "Important Shakta Tantra text",
      "relevance": "Discusses the yantra in relation to mantras and meditation"
    },
    {
      "name": "Lalita Sahasranama",
      "source": "Brahmanda Purana",
      "description": "Thousand names of goddess Lalita",
      "relevance": "Many names directly reference aspects of the Sri Yantra"
    }
  ],
  "temporal": {
    "culturalPeriod": "Medieval Tantric Period (600-1200 CE), though roots extend to earlier Tantric traditions",
    "firstAttestation": {
      "source": "Early Tantric texts",
      "type": "literary",
      "date": {
        "year": 700,
        "confidence": "probable",
        "circa": true,
        "uncertainty": 200,
        "display": "c. 7th century CE"
      }
    },
    "historicalDate": {
      "start": {
        "circa": true,
        "year": 600,
        "uncertainty": 200,
        "display": "c. 6th-7th century CE"
      },
      "end": {
        "circa": false,
        "year": 2025,
        "display": "Present"
      },
      "display": "c. 6th-7th century CE - Present"
    },
    "timelinePosition": "Medieval/Classical"
  },
  "geographical": {
    "originPoint": {
      "coordinates": {
        "accuracy": "approximate",
        "latitude": 13.0827,
        "longitude": 80.2707
      },
      "name": "Tamil Nadu, South India (major center of Shri Vidya tradition)"
    },
    "region": "India",
    "modernCountries": [
      "India",
      "Nepal",
      "Sri Lanka",
      "Indonesia (Bali)"
    ],
    "culturalArea": "Indian Subcontinent, Southeast Asia",
    "majorCenters": [
      "Kanchipuram (Kamakshi Temple)",
      "Madurai (Meenakshi Temple)",
      "Sringeri (Shankaracharya Math)",
      "Varanasi",
      "Kashmir (historical)"
    ]
  },
  "colors": {
    "primary": "#FFD700",
    "primaryRgb": "255, 215, 0",
    "secondary": "#DC143C",
    "symbolism": "Gold represents divine consciousness and prosperity; red/crimson represents Shakti, creative power, and the goddess"
  },
  "iconType": "svg",
  "icon": "<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 64 64\">\n  <rect x=\"8\" y=\"8\" width=\"48\" height=\"48\" fill=\"none\" stroke=\"#FFD700\" stroke-width=\"1.5\"/>\n  <circle cx=\"32\" cy=\"32\" r=\"20\" fill=\"none\" stroke=\"#FFD700\" stroke-width=\"1\"/>\n  <circle cx=\"32\" cy=\"32\" r=\"18\" fill=\"none\" stroke=\"#FFD700\" stroke-width=\"0.5\"/>\n  <polygon points=\"32,14 46,44 18,44\" fill=\"none\" stroke=\"#DC143C\" stroke-width=\"1\"/>\n  <polygon points=\"32,50 46,20 18,20\" fill=\"none\" stroke=\"#FFD700\" stroke-width=\"1\"/>\n  <circle cx=\"32\" cy=\"32\" r=\"2\" fill=\"#DC143C\"/>\n</svg>",
  "tags": [
    "sri-yantra",
    "shri-yantra",
    "sri-chakra",
    "yantra",
    "sacred-geometry",
    "tantra",
    "shri-vidya",
    "lalita",
    "tripura-sundari",
    "shakti",
    "goddess-worship",
    "meditation",
    "mandala",
    "hindu-tantra",
    "bindu",
    "chakra",
    "kundalini",
    "prosperity",
    "nine-triangles",
    "cosmic-diagram"
  ],
  "searchTerms": [
    "sri yantra",
    "shri yantra",
    "sri chakra",
    "shri chakra",
    "sacred geometry hindu",
    "tantra symbol",
    "lalita tripura sundari yantra",
    "hindu mandala",
    "nine triangles yantra",
    "shri vidya",
    "kameshwari yantra",
    "tantric meditation symbol",
    "hindu prosperity symbol",
    "cosmic diagram hindu",
    "bindu yantra"
  ],
  "relationships": {
    "seeAlso": [
      "hindu_om",
      "hindu_lotus",
      "hindu_chakra-system"
    ],
    "relatedTraditions": [
      "shri-vidya",
      "shakta-tantra",
      "kashmir-shaivism"
    ]
  },
  "_enhanced": true,
  "enhancedBy": "claude-comprehensive",
  "createdAt": "2026-01-01T00:00:00.000Z",
  "updatedAt": "2026-01-01T00:00:00.000Z",
  "_uploadedAt": "2026-01-01T00:00:00.000Z",
  "_modified": "2026-01-01T00:00:00.000Z",
  "metadata": {
    "source": "comprehensive-creation",
    "createdBy": "claude",
    "verified": true,
    "createdAt": "2026-01-01T00:00:00.000Z",
    "updatedAt": "2026-01-01T00:00:00.000Z"
  },
  "meaning": "Represents the divine feminine (Shakti) and the union of masculine and feminine principles; symbolizes the structure of the universe and divine creation",
  "origins": "Hindu tantra tradition (medieval period); represents Shiva and Shakti union; used in Devi worship and tantric practice",
  "associations": {
    "symbols": [
      "Chakra diagrams",
      "Lotus (spiritual unfolding)",
      "Bindu (point of creation)",
      "Yoni-Lingam"
    ],
    "deities": [
      "Devi/Shakti (divine feminine)",
      "Shiva (masculine principle)",
      "Various goddesses"
    ],
    "concepts": [
      "Kundalini awakening",
      "Tantra",
      "Sacred union",
      "Creation and cosmos",
      "Shakti (divine energy)"
    ]
  },
  "prohibitions": [
    "Requires proper initiation and guidance for tantric practice",
    "Not to be used casually or for entertainment",
    "Should maintain purity of practice and intention",
    "Respect the sacred and powerful nature of the symbol",
    "Not appropriate to display disrespectfully"
  ],
  "_enriched": true,
  "_enrichedAt": "2026-01-01T03:38:42.008Z",
  "_enrichedBy": "symbol-enrichment-script"
}