{
  "timestamp": "2025-12-27T06:47:43.084Z",
  "totalFixes": 35,
  "fixes": [
    {
      "id": "vali",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\vali.json",
      "fixes": {
        "shortDescription": "Vali is a significant deity from norse mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "tyr",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\tyr.json",
      "fixes": {
        "shortDescription": "Tyr is a significant deity from norse mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "thoth",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\thoth.json",
      "fixes": {
        "shortDescription": "Thoth is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "thor",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\thor.json",
      "fixes": {
        "shortDescription": "Thor is a significant deity from norse mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "tefnut",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\tefnut.json",
      "fixes": {
        "shortDescription": "Tefnut is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "sobek",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\sobek.json",
      "fixes": {
        "shortDescription": "Sobek is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "skadi",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\skadi.json",
      "fixes": {
        "shortDescription": "Skadi is a significant deity from norse mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "set",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\set.json",
      "fixes": {
        "shortDescription": "Set is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "sekhmet",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\sekhmet.json",
      "fixes": {
        "shortDescription": "Sekhmet (Sakhmet) is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "satis",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\satis.json",
      "fixes": {
        "shortDescription": "Satis is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "ra",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\ra.json",
      "fixes": {
        "shortDescription": "Ra is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "ptah",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\ptah.json",
      "fixes": {
        "shortDescription": "Ptah is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "odin",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\odin.json",
      "fixes": {
        "shortDescription": "Odin is a significant deity from norse mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "nut",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\nut.json",
      "fixes": {
        "shortDescription": "Nut is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "nari",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\nari.json",
      "fixes": {
        "shortDescription": "Nari is a significant deity from norse mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "loki",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\loki.json",
      "fixes": {
        "shortDescription": "Loki is a significant deity from norse mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "laufey",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\laufey.json",
      "fixes": {
        "shortDescription": "Laufey is a significant deity from norse mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "jord",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\jord.json",
      "fixes": {
        "shortDescription": "Jord is a significant deity from norse mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "isis",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\isis.json",
      "fixes": {
        "shortDescription": "Isis is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "imhotep",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\imhotep.json",
      "fixes": {
        "shortDescription": "Imhotep is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "horus",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\horus.json",
      "fixes": {
        "shortDescription": "Horus is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "hod",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\hod.json",
      "fixes": {
        "shortDescription": "Hod is a significant deity from norse mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "hel",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\hel.json",
      "fixes": {
        "shortDescription": "Hel is a significant deity from norse mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "heimdall",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\heimdall.json",
      "fixes": {
        "shortDescription": "Heimdall is a significant deity from norse mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "geb",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\geb.json",
      "fixes": {
        "shortDescription": "Geb is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "frigg",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\frigg.json",
      "fixes": {
        "shortDescription": "Frigg is a significant deity from norse mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "freyja",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\freyja.json",
      "fixes": {
        "shortDescription": "Freyja is a significant deity from norse mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "freya",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\freya.json",
      "fixes": {
        "shortDescription": "Freyja is a significant deity from norse mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "eir",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\eir.json",
      "fixes": {
        "shortDescription": "Eir is a significant deity from norse mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "bastet",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\bastet.json",
      "fixes": {
        "shortDescription": "Bastet is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "baldr",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\baldr.json",
      "fixes": {
        "shortDescription": "Baldr is a significant deity from norse mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "atum",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\atum.json",
      "fixes": {
        "shortDescription": "Atum is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "apep",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\apep.json",
      "fixes": {
        "shortDescription": "Apep is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "anhur",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\anhur.json",
      "fixes": {
        "shortDescription": "Anhur (Onuris) is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    },
    {
      "id": "amun-ra",
      "file": "H:\\Github\\EyesOfAzrael\\data\\entities\\deity\\amun-ra.json",
      "fixes": {
        "shortDescription": "Amun-Ra is a significant deity from egyptian mythology. This divine being plays an important role in the pantheon and spiritual..."
      }
    }
  ]
}