{
  "deities": [
    {
      "id": "brahma",
      "name": "Brahma",
      "displayName": "🪷 Brahma",
      "mythology": "hindu",
      "category": "deities",
      "description": "The divine architect who creates the universe at the beginning of each cosmic cycle, bringing forth all worlds, beings, and sacred knowledge from the primordial waters of creation.",
      "attributes": {
        "titles": "Prajapati (Lord of Creatures), Vedanatha (Lord of Vedas), Chaturmukha (Four-Faced)",
        "domains": "Creation, Knowledge, Time, Sacred Speech, Arts",
        "symbols": "Lotus, Four Vedas, Kamandalu (water pot), Prayer beads, Sruva (ladle)",
        "sacred animals": "Hamsa (Swan/Goose), symbolizing wisdom and discernment",
        "sacred plants": "Lotus (Padma), Kusha grass, Sacred fig",
        "colors": "Red, Gold, White - representing creation, knowledge, and purity"
      },
      "myths": [
        {
          "title": "Birth from the Golden Egg:",
          "content": "Birth from the Golden Egg: At the beginning of creation, a golden egg (Hiranyagarbha) floated in the cosmic waters. After a thousand years, Brahma emerged from the egg and split it in two, creating heaven and earth. He then meditated to bring forth the material world, gods, demons, and all living beings."
        },
        {
          "title": "The Fifth Head:",
          "content": "The Fifth Head: Originally, Brahma had five heads. When he became infatuated with his own creation, Shatarupa, and gazed at her inappropriately, Shiva became angry at this impropriety and cut off his fifth head with his trident. This is why Brahma now has four heads and why he is rarely worshipped - cursed by Shiva for his arrogance."
        },
        {
          "title": "The Race with Vishnu:",
          "content": "The Race with Vishnu: Brahma and Vishnu once argued about who was supreme. A massive pillar of fire (Shiva's lingam) appeared before them. They agreed whoever found its end would be greater. Vishnu dove down as a boar, Brahma flew up as a swan. After searching in vain, Vishnu admitted defeat honestly, but Brahma lied, claiming he found the top. Shiva appeared and cursed Brahma to have no temples for his dishonesty."
        }
      ],
      "relationships": {
        "parents": "Self-born from Hiranyagarbha or born from Vishnu's navel lotus",
        "consort": "Saraswati (Goddess of Knowledge, Arts, and Wisdom)",
        "children": "The Prajapatis (lords of creatures), Manu (first man), Four Kumaras (mind-born sons), Daksha, Narada",
        "siblings": "None (self-created), though part of Trimurti with Vishnu and Shiva",
        "allies": "Vishnu (Preserver), Saraswati (his consort and knowledge itself), The Devas (gods he created)",
        "complex relations": "Shiva (who both protects and has cursed him), The Asuras (demons who challenge his creation)"
      },
      "worship": {
        "sacred sites": "Due to his curse, Brahma has very few temples. The most famous is the Brahma Temple at Pushkar, Rajasthan, one of the only major temples dedicated to him in India. Other rare temples include Asotra village in Rajasthan and Khedbrahma in Gujarat. Most worship of Brahma occurs during creation-related ceremonies or when seeking knowledge and creativity.",
        "festivals": "Kartik Purnima: Full moon in Kartik month (October-November), celebrated especially at Pushkar with a grand fair and ritual bathing in Pushkar Lake.\nVasant Panchami: While primarily dedicated to Saraswati, honors Brahma as lord of knowledge and learning.",
        "offerings": "White flowers (especially lotus), fruits, milk, ghee, honey, and white sweets. Offerings of sacred texts, books, and writing implements. Vedic chants and hymns from the four Vedas. Water from the Pushkar lake is particularly sacred.",
        "prayers & invocations": "Brahma is invoked at the beginning of creative endeavors, studies, and new ventures. The Gayatri Mantra, while often associated with Savitri/Surya, is also linked to Brahma as the source of all knowledge. Specific mantras include \"Om Brahmane Namaha\" (salutations to Brahma) and verses from the Brahma Gayatri praising his four faces and creative power."
      },
      "sources": [
        "Sources: Rigveda (Hymn of Creation - Nasadiya Sukta), Brahma Purana, Shiva Purana, Mahabharata, Manusmriti"
      ],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\deities\\brahma.html",
        "extractedAt": "2025-12-13T08:42:42.738Z",
        "verified": false,
        "needsReview": false
      }
    },
    {
      "id": "dhanvantari",
      "name": "Dhanvantari",
      "displayName": "⚕️ Dhanvantari",
      "mythology": "hindu",
      "category": "deities",
      "description": "Dhanvantari is the divine physician and god of Ayurveda, who emerged from the churning of the cosmic ocean holding the pot of amrita (nectar of immortality).",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\deities\\dhanvantari.html",
        "extractedAt": "2025-12-13T08:42:42.742Z",
        "verified": false,
        "needsReview": true
      }
    },
    {
      "id": "durga",
      "name": "Durga",
      "displayName": "🦁 Durga",
      "mythology": "hindu",
      "category": "deities",
      "description": "The fierce warrior goddess born from the combined energies of all the gods to defeat the buffalo demon. She rides a lion, wields weapons in her ten arms, and represents the divine feminine power (Shakti) that protects dharma and destroys evil.",
      "attributes": {
        "titles": "Mahishasura-Mardini (Slayer of Mahishasura), Durgatinashini (Remover of Difficulties), Shakti (Divine Power), Devi (The Goddess)",
        "domains": "Protection, Warfare, Motherhood, Feminine Power, Victory over Evil, Courage",
        "symbols": "Trishula (trident), Chakra (discus), Bow and Arrows, Sword, Lotus, Conch Shell",
        "sacred animals": "Lion (or Tiger) - her vahana, representing courage and royalty",
        "sacred plants": "Bilva leaves, Red Hibiscus, Lotus, Durva grass, Banana plant",
        "colors": "Red (power and passion), Yellow-Gold (divinity), Orange (courage)"
      },
      "myths": [],
      "relationships": {},
      "worship": {
        "major festivals": "Navaratri/Durga Puja: Nine nights celebrating Durga's victory over Mahishasura (September-October). Especially grand in Bengal, Odisha, and Assam. The tenth day, Vijayadashami/Dussehra, celebrates her final victory.\nChaitra Navaratri: Spring celebration of the goddess (March-April), less prominent than autumn Navaratri but equally sacred.\nDurga Ashtami: The eighth day of Navaratri, when the battle reached its climax.",
        "offerings & rituals": "Red hibiscus flowers, red clothing, sweets (especially kheer and halwa), fruits, incense. The Durga Saptashati (700 verses to Durga) is recited. Sandhi Puja performed at the junction between eighth and ninth day. Kumari Puja - worship of young girls as embodiments of the goddess. Non-vegetarian offerings (especially in Bengal) as a warrior goddess.",
        "sacred mantras": "\"Om Dum Durgayei Namaha\" - Primary Durga mantra. Durga Gayatri: \"Om Katyayanyai Vidmahe, Kanyakumari Dhimahi, Tanno Durgi Prachodayat\" (I meditate on Katyayani, I contemplate the virgin goddess, may that Durga illuminate my understanding)."
      },
      "sources": [
        "Devi Mahatmya:Chapter 2:Verse 8-12",
        "Devi Mahatmya:Chapter 2:Verse 30-35",
        "Devi Mahatmya:Chapter 3:Verse 31-34",
        "Devi Upanishad:Verse 1-3",
        "Rig Veda:Mandala 1:Hymn 164:Verse 41",
        "Markandeya Purana:Chapter 81:Verse 41-49"
      ],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\deities\\durga.html",
        "extractedAt": "2025-12-13T08:42:42.745Z",
        "verified": false,
        "needsReview": true
      }
    },
    {
      "id": "dyaus",
      "name": "Dyaus Pita",
      "displayName": "☁️ Dyaus Pita",
      "mythology": "hindu",
      "category": "deities",
      "description": "Dyaus Pita is the ancient Vedic sky father deity, consort of Prithvi (Earth Mother).",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\deities\\dyaus.html",
        "extractedAt": "2025-12-13T08:42:42.746Z",
        "verified": false,
        "needsReview": true
      }
    },
    {
      "id": "ganesha",
      "name": "Ganesha",
      "displayName": "🐘 Ganesha",
      "mythology": "hindu",
      "category": "deities",
      "description": "The beloved elephant-headed god who is invoked at the start of all new ventures, journeys, and sacred rituals. As the guardian of thresholds and the master of intellect, Ganesha clears the path for success while embodying wisdom, arts, and auspicious beginnings.",
      "attributes": {
        "sanskrit titles": "Ganapati (Lord of the Ganas), Vinayaka (Supreme Leader), Vighnaharta (Remover of Obstacles), Ekadanta (Single-Tusked), Lambodara (Pot-Bellied)",
        "domains": "Wisdom, Success, New Beginnings, Intellect, Arts, Writing, Learning, Prosperity, Removal of Obstacles",
        "symbols": "Broken Tusk, Modaka (sweet), Ankusha (elephant goad), Pasha (noose), Axe, Lotus",
        "sacred animals": "Mushika (mouse/shrew - his vahana), Elephant (his head represents cosmic wisdom)",
        "sacred plants": "Durva grass, Red flowers, Hibiscus, Eranda (castor plant)",
        "colors": "Red (auspiciousness), Yellow (knowledge), White (purity)"
      },
      "myths": [
        {
          "title": "The Birth of Ganesha:",
          "content": "The Birth of Ganesha: According to the most popular account in the Shiva Purana, Parvati created Ganesha from the sandalwood paste she used for her bath, breathing life into the figure to guard her privacy while she bathed. When Shiva returned and found a young boy barring his entry, the two clashed. Not recognizing the boy as his son, Shiva severed his head in anger. Upon discovering the truth, Parvati was devastated. To restore his son, Shiva sent his ganas to bring the head of the first creature they encountered facing north - an elephant. Thus Ganesha was reborn with an elephant head, symbolizing wisdom, foresight, and the ability to see beyond obstacles."
        },
        {
          "title": "The Broken Tusk - Ekadanta:",
          "content": "The Broken Tusk - Ekadanta: There are several accounts of how Ganesha lost his tusk. In the most celebrated version, the sage Vyasa approached Ganesha to transcribe the great epic Mahabharata as he dictated it. The task was immense, and Ganesha agreed on the condition that Vyasa never pause. When his writing instrument broke, Ganesha broke off his own tusk to continue writing without interruption, demonstrating his dedication to knowledge and the preservation of sacred texts. In another version, he threw his broken tusk at the moon for laughing at him, which is why the moon waxes and wanes."
        },
        {
          "title": "The Race Around the World:",
          "content": "The Race Around the World: Once, Shiva and Parvati challenged their sons Ganesha and Kartikeya to a race around the world. Kartikeya immediately mounted his peacock and flew around the globe. Ganesha, with his humble mouse vehicle, simply walked around his parents, explaining that they represented his entire world. Pleased by his wisdom, Shiva and Parvati declared him the winner, symbolizing that true knowledge lies in understanding what is most important."
        },
        {
          "title": "Guardian of Thresholds:",
          "content": "Guardian of Thresholds: Ganesha's original role guarding his mother's door established him as the lord of all thresholds - physical, spiritual, and psychological. He stands at the boundary between the known and unknown, the mundane and sacred, helping devotees transition safely between states. This is why he is invoked first in all Hindu ceremonies, weddings, and new undertakings."
        }
      ],
      "relationships": {
        "father": "Shiva - The Destroyer/Transformer of the Trimurti",
        "mother": "Parvati/Uma - The Divine Mother, Shakti personified",
        "brother": "Kartikeya/Skanda/Murugan - God of War, Commander of the Divine Armies",
        "consorts": "Siddhi (Achievement/Spiritual Power), Buddhi (Wisdom/Intellect), Riddhi (Prosperity) - in some traditions",
        "sons": "Kshema (Prosperity) and Labha (Profit) - in some Puranic accounts",
        "allies": "The Ganas (celestial attendants of Shiva, whom he leads), Vishnu, Brahma, Saraswati (goddess of learning)",
        "vahana": "Mushika (mouse/shrew) - representing the ability to overcome obstacles of any size, from the smallest to the greatest",
        "relationship with kartikeya": "The brothers have a complex dynamic, sometimes portrayed as rivals (as in the race around the world), yet deeply loving. In South India, Kartikeya (as Murugan) is often more prominent, while in North India, Ganesha takes precedence."
      },
      "worship": {
        "sacred sites": "Ganesha temples are ubiquitous throughout India and Southeast Asia. The Ashtavinayak - eight ancient temples in Maharashtra - are particularly sacred. Major pilgrimage sites include: Siddhivinayak Temple (Mumbai), Dagdusheth Halwai Ganpati Temple (Pune), Moti Dungri Temple (Jaipur), and Rockfort Ucchi Pillayar Temple (Tiruchirappalli). Every Hindu home typically has a Ganesha murti (image), as he is the most accessible of all deities.",
        "festivals": "Ganesh Chaturthi: The most important Ganesha festival, celebrating his birth. Lasting 10 days (typically August-September), devotees install clay idols of Ganesha in homes and public spaces, worship them with offerings and prayers, and on the final day immerse the idols in water (visarjan) symbolizing his return to Mount Kailash. This festival, particularly grand in Maharashtra, was popularized by Bal Gangadhar Tilak as a way to unite communities.\nSankashti Chaturthi: Monthly observance on the fourth day after full moon, dedicated to Ganesha. Devotees fast during the day and break their fast after sighting the moon.\nVinayaka Chavithi: Celebrated across South India with special prayers, offerings, and community gatherings.",
        "invoked first in all ceremonies": "Ganesha is uniquely positioned as the deity who must be worshipped before any other god and before any new undertaking. Weddings, new businesses, house-warmings, vehicle purchases, academic pursuits, artistic performances - all begin with a prayer to Ganesha. The phrase \"Shri Ganeshaya Namah\" opens most Hindu religious texts, ceremonies, and letters. This practice stems from his role as the lord of beginnings and remover of obstacles.",
        "offerings": "Modaka (sweet dumplings) are Ganesha's favorite offering, symbolizing the sweetness of the liberated soul. Other offerings include: durva grass (21 blades), red flowers (especially hibiscus), coconut, jaggery, bananas, and ladoos (sweet balls). Red sandalwood paste is applied to his image. Unlike most deities, Ganesha accepts food offerings with a broken coconut.",
        "prayers & invocations": "The primary mantra is \"Om Gam Ganapataye Namaha\" (Salutations to Ganapati). The Ganesha Atharvashirsha is a key text chanted for blessings. The Ganapati Stotra and Sankata Nashana Ganesha Stotra are recited for removing obstacles. The 108 Names of Ganesha (Ashtottara Shatanamavali) enumerate his divine qualities and are chanted for comprehensive blessings."
      },
      "sources": [
        "Sources: Shiva Purana, Ganesha Purana, Mudgala Purana, Mahabharata, Brahmanda Purana",
        "Ganapati Atharvashirsha:Verse 1-2",
        "Ganapati Atharvashirsha:Verse 6-7",
        "Shiva Purana:Rudra Samhita:Kumara Khanda:Chapter 13",
        "Ganesha Purana:Upasana Khanda:Chapter 10",
        "Mahabharata:Adi Parva:Chapter 1"
      ],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\deities\\ganesha.html",
        "extractedAt": "2025-12-13T08:42:42.751Z",
        "verified": false,
        "needsReview": false
      }
    },
    {
      "id": "hanuman",
      "name": "Hanuman",
      "displayName": "🐒 Hanuman",
      "mythology": "hindu",
      "category": "deities",
      "description": "The divine vanara (monkey) warrior and supreme devotee of Rama, embodying perfect devotion, courage, strength, and selfless service. Born as the son of the wind god Vayu, Hanuman possesses supernatural powers including flight, shape-shifting, and immense strength. His unwavering dedication to Rama and his heroic exploits in the Ramayana make him one of the most beloved deities in Hinduism - the living symbol of bhakti (devotion) and the power that comes from complete surrender to the divine.",
      "attributes": {
        "sanskrit titles": "Anjaneya (Son of Anjana), Maruti (Son of Maruta/Vayu), Bajrangbali (One with Limbs Strong as Vajra/Thunderbolt), Kesari Nandan (Son of Kesari), Sankat Mochan (Remover of Difficulties), Mahavira (Great Hero), Pawanputra (Son of Wind)",
        "domains": "Devotion (Bhakti), Strength, Courage, Loyalty, Service, Celibacy (Brahmacharya), Protection, Wisdom, Humility, Removal of Obstacles",
        "symbols": "Mace (gada), Mountain (carried to Lanka), Rama's image on his chest (eternal devotion), Orange/red color, Flying/leaping pose",
        "powers": "Flight, Superhuman strength, Size alteration (can become tiny or gigantic), Shape-shifting, Immortality, Invulnerability, Speed (faster than wind)",
        "sacred plants": "Sanjeevani herb (brought from Himalayas), Tulsi (holy basil), Betel leaves",
        "colors": "Orange-red (devotion and strength), Golden (when depicted in powerful forms)"
      },
      "myths": [
        {
          "title": "Divine Birth:",
          "content": "Divine Birth: Hanuman was born to Anjana (an apsara cursed to be born as a vanara) and Kesari (a vanara king), but his true father was Vayu, the wind god. When Anjana prayed intensely to Shiva for a child, the wind god Vayu carried the divine essence to her womb. Thus Hanuman is considered an avatar or son of Shiva in some traditions, and son of Vayu in all traditions. He was born with incredible strength and supernatural abilities, an auspicious birth foretold to be crucial for dharma's victory."
        },
        {
          "title": "Swallowing the Sun:",
          "content": "Swallowing the Sun: As a child, Hanuman was mischievous and unaware of his divine nature. Seeing the rising sun, he mistook it for a ripe fruit and leaped into the sky to eat it. Indra, seeing this threat to cosmic order, struck the child with his thunderbolt, injuring Hanuman's jaw (hence his name, which can mean \"one with a broken jaw\"). Enraged, Vayu withdrew all air from the world, suffocating all beings. The gods quickly apologized and granted young Hanuman numerous boons: immortality from Brahma, invulnerability in battle from Indra, and various powers from other deities. However, due to his mischief, he was cursed to forget his powers until reminded of them at the right time."
        },
        {
          "title": "Meeting Rama - The Purpose Revealed:",
          "content": "Meeting Rama - The Purpose Revealed: When Rama and Lakshmana searched for the abducted Sita, they met Hanuman on Mount Rishyamukha. The moment Hanuman beheld Rama, his life found its purpose. He instantly recognized him as his lord and master, and devoted himself completely to Rama's service. This meeting represents the soul (Hanuman) recognizing the divine (Rama) and surrendering completely. From this moment, Hanuman existed only to serve Rama, finding in this service his ultimate fulfillment."
        },
        {
          "title": "The Leap to Lanka:",
          "content": "The Leap to Lanka: When no one could cross the vast ocean to Lanka to find Sita, the vanaras despaired. Jambavan reminded Hanuman of his forgotten powers. Suddenly remembering his divine strength, Hanuman grew to enormous size and leaped across the ocean in one mighty bound - a distance of 100 yojanas (about 800 miles). This leap is one of the most iconic images in Hindu iconography, symbolizing the power that comes when one acts in service of the divine. During his flight, he was tested by various beings but overcame all obstacles through wit and strength."
        },
        {
          "title": "Finding Sita - The Perfect Messenger:",
          "content": "Finding Sita - The Perfect Messenger: In Lanka, Hanuman made himself tiny to search undetected. He found Sita in the Ashoka grove, gave her Rama's ring as proof, and offered to carry her back. But Sita refused - she wanted Rama himself to rescue her and defeat Ravana, upholding dharma. Hanuman understood this wisdom perfectly. His role was not to solve the problem himself, but to serve Rama's larger purpose. This demonstrates perfect devotion - knowing when to act and when to step back, having no ego about being the hero."
        },
        {
          "title": "Burning of Lanka:",
          "content": "Burning of Lanka: Before leaving, Hanuman allowed himself to be captured to meet Ravana. When the demons tied his tail with oil-soaked cloth and set it on fire, he broke free, made his tail grow enormously long, and used it to set fire to the golden city of Lanka, burning it down except for Sita's location. This act demonstrated his power and delivered a warning to Ravana of the destruction to come. The burning tail became another iconic image of Hanuman's might."
        },
        {
          "title": "Bringing the Sanjeevani Mountain:",
          "content": "Bringing the Sanjeevani Mountain: During the great battle, when Lakshmana lay near death from an arrow, the only cure was the Sanjeevani herb from the Himalayas. Hanuman flew to the mountain, but unable to identify which herb it was in the darkness, he uprooted the entire mountain and carried it to Lanka. This extraordinary feat - carrying a mountain through the air across India - shows that for true devotion, nothing is impossible. His practical solution also demonstrates wisdom: when in doubt, bring everything needed."
        },
        {
          "title": "Rama in the Heart:",
          "content": "Rama in the Heart: After Sita's rescue, when Sita gave Hanuman a pearl necklace as thanks, he broke it apart, examining each pearl. When asked what he was doing, he said he was looking for Rama - anything without Rama's name had no value to him. Some doubted his devotion, so Hanuman tore open his chest to reveal Rama and Sita literally inscribed on his heart. This is the ultimate image of bhakti - the beloved lord residing permanently in the devotee's heart."
        },
        {
          "title": "The Immortal Chiranjivi:",
          "content": "The Immortal Chiranjivi: When the time came for Rama to leave his earthly form, Hanuman was overcome with grief. Rama blessed him to remain on earth for the entire Kali Yuga (current age), living wherever the Ramayana is sung and Rama's name is chanted. Thus Hanuman is considered a Chiranjivi (immortal being), and devotees believe he is invisibly present whenever his name or Rama's name is spoken with devotion."
        },
        {
          "title": "Meeting Krishna:",
          "content": "Meeting Krishna: In the Mahabharata, when Bhima (another son of Vayu) tried to move what appeared to be an old monkey's tail blocking his path, he couldn't budge it. The old monkey revealed himself as Hanuman and blessed Bhima. Later, during the great war, Hanuman resided on Arjuna's chariot flag at Krishna's request, his roar terrifying enemies and protecting the Pandavas. This shows Hanuman serving both major avatars of Vishnu - Rama and Krishna."
        }
      ],
      "relationships": {
        "mother": "Anjana - An apsara who was cursed to be born as a vanara",
        "earthly father": "Kesari - King of the vanaras",
        "divine father": "Vayu - God of wind, granting him speed and flight",
        "lord and master": "Rama - His entire existence is devoted to Rama's service",
        "relationship with sita": "He is her devoted servant and protector, treating her as the divine mother",
        "brother": "Bhima (both are sons of Vayu, though from different mothers)",
        "connection to shiva": "Considered an avatar or aspect of Shiva in some traditions",
        "the vanara army": "Fought alongside the monkey warriors including Sugriva, Angada, Nala, and Nila",
        "jambavan": "The wise bear who reminded Hanuman of his forgotten powers",
        "lakshmana": "Rama's brother, whom Hanuman saved by bringing the Sanjeevani herb",
        "the pandavas": "Protected them during the Mahabharata war at Krishna's request"
      },
      "worship": {
        "worship practices": "Hanuman temples are found throughout India, often located on hilltops or at village entrances as guardians. Unlike many deities worshipped on specific days, Hanuman is traditionally worshipped on Tuesdays and Saturdays. Wrestlers, athletes, and martial artists especially revere him for strength and discipline. Students worship him for wisdom and concentration.",
        "sacred sites": "Major Hanuman temples include: Sankat Mochan Temple (Varanasi), Hanuman Temple (Connaught Place, Delhi - where worship continues 24 hours), Hanuman Garhi (Ayodhya), Balaji Temple (Mehandipur - famous for spirit exorcism), and countless local temples. Naturally occurring Hanuman images on mountains and rocks are considered especially powerful.",
        "festivals": "Hanuman Jayanti: Birthday celebration on the full moon of Chaitra month (March-April). Devotees fast, recite Hanuman Chalisa, and visit temples.\nRam Navami: Also celebrated as Hanuman's birth according to some traditions.\nEvery Tuesday: Special Hanuman worship day throughout the year.",
        "offerings": "Red flowers (especially hibiscus), red cloth, Sindoor (vermillion - devotees smear it on his image and themselves for his blessings), Ladoos (sweet balls), Bananas, Besan ladoo (chickpea flour sweets), coconut, and sesame oil. Physical exercise, wrestling, and martial arts practice are also considered forms of worship, as is reading the Ramayana.",
        "prayers & texts": "The Hanuman Chalisa (40 verses composed by Tulsidas in the 16th century) is the most popular prayer, recited daily by millions. The Bajrang Baan is a powerful hymn for protection. The Sundara Kanda (beautiful chapter) from the Ramayana describing Hanuman's exploits in Lanka is considered especially auspicious. The mantra \"Om Han Hanumate Namah\" and \"Jai Bajrang Bali\" are commonly chanted."
      },
      "sources": [
        "Sources: Valmiki Ramayana, Tulsidas' Ramcharitmanas, Mahabharata, Hanuman Chalisa, Various Puranas",
        "Sundara Kanda:Sarga 1:Verses 150-152",
        "Yuddha Kanda:Sarga 107:Verses 31-33",
        "Hanuman Chalisa:Opening Verses"
      ],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\deities\\hanuman.html",
        "extractedAt": "2025-12-13T08:42:42.756Z",
        "verified": false,
        "needsReview": false
      }
    },
    {
      "id": "indra",
      "name": "Indra",
      "displayName": "⚡ Indra",
      "mythology": "hindu",
      "category": "deities",
      "description": "Indra is the king of the devas and lord of Svarga (heaven), wielding the vajra (thunderbolt) and commanding the rain and storms. A mighty warrior who defeated the demon Vritra to release the cosmic waters, Indra represents kingship, martial prowess, and the power of the storm.",
      "attributes": {
        "titles": "Shakra (Mighty One), Devendra (Lord of Gods), Vajrapani (Wielder of Vajra), Meghavahana (Rider of Clouds)",
        "domains": "Thunder, Lightning, Rain, War, Heaven, Kingship",
        "symbols": "Vajra (thunderbolt weapon), Bow and arrows, Rainbow",
        "sacred animals": "Airavata (white multi-tusked elephant)",
        "colors": "Gold, White (representing lightning and clouds)"
      },
      "myths": [
        {
          "title": "Slaying of Vritra:",
          "content": "Slaying of Vritra: When the demon Vritra enclosed the waters of the world, causing terrible drought, Indra consumed vast amounts of soma (divine nectar) to empower himself. With his vajra crafted by Tvashtri, he struck down Vritra and released the waters, making him the cosmic victor and savior of the world."
        },
        {
          "title": "The Thousand Eyes:",
          "content": "The Thousand Eyes: After committing brahmahatya (killing a brahmin - referring to Vritra who was technically the son of a sage), Indra was cursed. His body became covered with a thousand eyes as a mark of his sin, though later these were transformed into beautiful eyes across his body."
        },
        {
          "title": "Humbled by Krishna:",
          "content": "Humbled by Krishna: In later mythology, when Indra sent torrential rains to punish the people of Vrindavan for worshipping Krishna instead of him, young Krishna lifted Mount Govardhan on his little finger for seven days to shelter them, teaching Indra humility."
        }
      ],
      "relationships": {
        "parents": "Son of Dyaus (Sky Father) and Prithvi (Earth Mother) in some accounts; son of Aditi in others",
        "consort": "Shachi (also called Indrani), goddess of jealousy and beauty",
        "children": "Jayanta (warrior son), Jayanti (daughter), Chitragupta (recorder of karma in some traditions)",
        "allies": "The Devas, Agni (fire god), Vayu (wind god), Maruts (storm gods who are his companions)",
        "enemies": "Asuras (demons), especially Vritra, and later demons who challenge his authority",
        "complex relationship": "Sometimes appears prideful and jealous in later epics, contrasting with his heroic Vedic portrayal"
      },
      "worship": {
        "sacred sites": "Indra has fewer dedicated temples in modern Hinduism compared to his prominence in Vedic times, though he remains important in ritual contexts.",
        "offerings": "Soma (sacred drink), ghee, offerings to fire (through Agni as intermediary)",
        "prayers & invocations": "Many hymns in the Rigveda are dedicated to Indra, praising his strength and victory over Vritra. He is invoked for protection, victory in battle, and bringing rain."
      },
      "sources": [
        "Sources: Rigveda, Atharvaveda, Mahabharata, Ramayana, Puranas"
      ],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\deities\\indra.html",
        "extractedAt": "2025-12-13T08:42:42.761Z",
        "verified": false,
        "needsReview": false
      }
    },
    {
      "id": "kali",
      "name": "Kali",
      "displayName": "🗡️ Kali",
      "mythology": "hindu",
      "category": "deities",
      "description": "The most fearsome and powerful form of the Divine Mother, Kali is the goddess who dances on corpses, wears a garland of skulls, and drinks the blood of demons. Yet paradoxically, she is also the ultimate liberator - the loving mother who destroys the ego and illusion to free souls from the cycle of rebirth. Dark as the night, tongue dripping blood, four-armed and wild-eyed, she represents time itself (Kala), which devours all things. Her fierce form terrifies the wicked but protects devoted children with boundless maternal love. She is Parvati's most intense manifestation, the raw power of Shakti unleashed for cosmic transformation.",
      "attributes": {
        "sanskrit titles": "Kalika (The Black One), Mahakali (The Great Kali), Bhavatarini (Redeemer of the Universe), Adya Kali (The Primordial Kali), Dakshina Kali (Benevolent Form), Chamunda (Destroyer of Chanda and Munda demons)",
        "domains": "Time, Death, Destruction, Transformation, Liberation (Moksha), Dissolution of Ego, Protection, Tantric Power, Ultimate Reality Beyond Form",
        "symbols": "Severed head, Sword (Khadga), Skull bowl (Kapala), Garland of skulls, Blood, Tongue protruding, Dark skin, Corpses, Cremation grounds",
        "sacred places": "Kalighat (Kolkata - one of 51 Shakti Peethas), Dakshineswar Temple, Cremation grounds (she dwells where death is present)",
        "offerings": "Red hibiscus, Meat and fish (in certain Tantric traditions), Alcohol (representing transformed poison), Blood substitutes",
        "colors": "Black/Dark blue (primordial void, infinite time), Red (blood, energy, transformation)"
      },
      "myths": [
        {
          "title": "Emergence from Durga:",
          "content": "Emergence from Durga: The most famous origin story comes from the Devi Mahatmya. During the battle with demons, the asuras Chanda and Munda attacked Durga. In her fury, she knit her brows and from her forehead emerged Kali - black as night, with a lolling tongue, hollow eyes, and carrying a skull-topped staff. She instantly devoured the demon army, crushing skulls with her teeth and drinking their blood. After destroying Chanda and Munda, she earned the name Chamunda. This shows Kali as the ultimate destructive aspect that emerges when evil becomes intolerable."
        },
        {
          "title": "The Battle with Raktabija:",
          "content": "The Battle with Raktabija: The demon Raktabija had a boon that whenever a drop of his blood touched the earth, a new demon identical to him would spring up. As Durga fought him, thousands of Raktabijas multiplied from his spilled blood, threatening to overwhelm the gods. Durga summoned Kali, who spread her tongue across the battlefield like a carpet, catching every drop of blood before it hit the ground and drinking it. Meanwhile, she devoured all the duplicate demons. Her blood-drinking is not vampirism but a cosmic function - preventing the multiplication of evil, consuming negativity before it can reproduce. This story explains her protruding tongue, one of her most distinctive features."
        },
        {
          "title": "The Dance of Destruction (Tandava):",
          "content": "The Dance of Destruction (Tandava): After slaughtering all the demons, Kali became intoxicated with bloodlust and began her terrible dance of destruction, the Tandava, dancing wildly on the battlefield littered with corpses. The earth shook, the cosmos trembled, and it seemed she would destroy everything in her fury. The gods despaired. Hoping to stop her, Shiva lay down among the corpses. When Kali stepped on him, she suddenly recognized her beloved husband. Shocked at what she had done, she bit her tongue in shame (another explanation for her protruding tongue), and the destruction ceased. This famous image - Kali standing on Shiva's chest - represents multiple profound teachings: that Shakti (power/energy) standing on Shiva (consciousness) creates and destroys the world; that unlimited power must be tempered by consciousness and love; that even the fiercest divinity responds to devotion; that the active feminine principle animates the passive masculine principle."
        },
        {
          "title": "Kali and Shiva's Relationship:",
          "content": "Kali and Shiva's Relationship: Unlike other goddesses who are consorts to their male counterparts, Kali's relationship with Shiva is unique. While she is technically Parvati's fierce form, when manifested as Kali, she appears more powerful than Shiva himself. She stands atop him, and in some traditions, they engage in a dance competition where she eventually wins by lifting her leg higher than modesty would permit (which Shiva, bound by dharma, cannot do). She represents the supreme power beyond all conventional limits, even those of her consort."
        },
        {
          "title": "Kali Yuga - The Age of Kali:",
          "content": "Kali Yuga - The Age of Kali: The current cosmic age is called Kali Yuga (age of Kali) - though this Kali is grammatically masculine and refers to the demon Kali, not the goddess. However, the association is meaningful: we live in the age of dissolution, where the old order breaks down, where materialism and ego dominate, and where the fierce mother must eventually intervene to destroy the old and prepare for renewal. The goddess Kali is especially relevant in this age of darkness."
        },
        {
          "title": "Ramakrishna's Devotion:",
          "content": "Ramakrishna's Devotion: The 19th-century saint Ramakrishna was Kali's greatest modern devotee. He served as a priest at the Dakshineswar Kali Temple and would go into ecstatic trances during her worship. He saw her not as terrifying but as the loving mother, calling her \"Ma\" (Mother). He would weep like a child calling for his mother until he had her vision. Once, driven mad with devotion and suicidal at her absence, he grabbed a sword to kill himself, and she appeared to him, filling him with bliss. His relationship with Kali showed the world her loving maternal nature beneath the terrifying exterior. He taught that her blackness represents the infinite - just as the dark night sky contains all stars, the dark mother contains all existence."
        }
      ],
      "relationships": {},
      "worship": {
        "tantric worship": "Kali is central to Tantric traditions, which embrace the fierce and transgressive aspects of divinity. Tantric Kali worship sometimes involves practices considered taboo in mainstream Hinduism (meat, alcohol, sexuality) as means of transcending dualistic thinking and ego boundaries. The goal is to confront and integrate what society fears or rejects, recognizing the divine in all aspects of reality, not just the pleasant ones.",
        "popular worship": "In Bengal especially, Kali is worshipped as \"Ma\" (Mother) - the loving mother who may appear fierce but protects her children absolutely. Kali Puja is celebrated on the new moon of Kartik (October-November), coinciding with Diwali. Devotees stay up all night worshipping her. She is invoked for protection, removal of obstacles, destruction of enemies, and most importantly, for liberation from the cycle of rebirth.",
        "famous temples": "Kalighat Temple (Kolkata) - One of the 51 Shakti Peethas, where Sati's toes fell. Dakshineswar Kali Temple (near Kolkata) - Made famous by Ramakrishna. Kamakhya Temple (Assam) - Another Shakti Peetha with Tantric worship. Numerous village shrines and cremation ground temples throughout India.",
        "mantras": "\"Om Krim Kalikayai Namaha\" - Primary mantra. \"Om Kali, Kali! Om Kali, Kali! / Namostute, namostute, namo! / Prasida, prasida, prasida!\" (O Kali! Salutations to you! Be gracious!) Various Tantric mantras and the Kali Kavach (armor of Kali) for protection."
      },
      "sources": [
        "Sources: Devi Mahatmya (Markandeya Purana), Kalika Purana, Devi Bhagavata Purana, Mahabhagavata Purana, Tantric texts"
      ],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\deities\\kali.html",
        "extractedAt": "2025-12-13T08:42:42.765Z",
        "verified": false,
        "needsReview": false
      }
    },
    {
      "id": "kartikeya",
      "name": "Kartikeya",
      "displayName": "🦚 Kartikeya",
      "mythology": "hindu",
      "category": "deities",
      "description": "Kartikeya (Skanda, Murugan) is the god of war and commander of divine armies.",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\deities\\kartikeya.html",
        "extractedAt": "2025-12-13T08:42:42.766Z",
        "verified": false,
        "needsReview": true
      }
    },
    {
      "id": "krishna",
      "name": "Krishna",
      "displayName": "🪈 Krishna",
      "mythology": "hindu",
      "category": "deities",
      "description": "Krishna is the eighth avatar of Vishnu, the divine cowherd who revealed the Bhagavad Gita.",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\deities\\krishna.html",
        "extractedAt": "2025-12-13T08:42:42.767Z",
        "verified": false,
        "needsReview": true
      }
    },
    {
      "id": "lakshmi",
      "name": "Lakshmi",
      "displayName": "🌸 Lakshmi",
      "mythology": "hindu",
      "category": "deities",
      "description": "The radiant goddess of wealth, prosperity, and abundance who emerges eternally from the churning of the cosmic ocean. Seated upon a lotus with gold coins flowing from her hands, Lakshmi is the divine consort of Vishnu and the embodiment of material and spiritual fortune. She represents not only worldly success but also the grace, beauty, and auspiciousness that illuminate life.",
      "attributes": {
        "sanskrit titles": "Sri (Auspiciousness), Shridevi (Goddess of Fortune), Padma (Lotus), Kamala (Lotus-Dwelling), Indira (Radiant), Lokamata (Mother of the World), Narayani (Consort of Narayana/Vishnu)",
        "domains": "Wealth, Prosperity, Fortune, Beauty, Fertility, Abundance, Material Success, Spiritual Fulfillment, Generosity, Auspiciousness",
        "symbols": "Lotus flower (purity rising from mud), Gold coins (wealth), Conch shell (purity), Pot of gold (abundance), Rice/grain (nourishment)",
        "sacred animals": "White elephants (two elephants often flank her, bathing her in water - Gajalakshmi form), Owl (in some traditions - representing wealth coming in darkness)",
        "sacred plants": "Lotus (especially pink and white), Tulsi (holy basil), Bilva leaves, Coconut, Betel leaves",
        "colors": "Gold (wealth and radiance), Pink (grace and compassion), Red (auspiciousness), White (purity)"
      },
      "myths": [
        {
          "title": "The Churning of the Cosmic Ocean (Samudra Manthan):",
          "content": "The Churning of the Cosmic Ocean (Samudra Manthan): The most famous origin story of Lakshmi comes from the churning of the cosmic ocean, Kshira Sagara. The devas (gods) and asuras (demons) joined forces to churn the ocean of milk using Mount Mandara as a churning rod and the serpent Vasuki as a rope, seeking the nectar of immortality (amrita). From this cosmic churning emerged fourteen precious treasures, and among them arose Lakshmi, seated upon a fully bloomed lotus, radiating beauty and light. She held lotuses in her hands, and two elephants bathed her with sacred water from golden vessels. The gods and sages sang hymns in her praise. Lakshmi chose Vishnu as her eternal consort, garlanding him and taking her place beside him. This story establishes her as the goddess who emerges from the depths of the cosmic process, bringing abundance to the world."
        },
        {
          "title": "Eternal Consort of Vishnu:",
          "content": "Eternal Consort of Vishnu: Lakshmi is inseparably connected to Vishnu, the preserver of the universe. While he lies upon the cosmic serpent Shesha in the ocean of milk, she massages his feet, symbolizing their eternal partnership. Whenever Vishnu incarnates on earth as an avatar to restore dharma, Lakshmi incarnates alongside him as his companion: as Sita when he was Rama, as Rukmini and Radha when he was Krishna, and as Padmavati when he was Venkateswara. This eternal partnership represents the union of preservation (Vishnu) with prosperity (Lakshmi) - the cosmos cannot be sustained without both."
        },
        {
          "title": "The Fickleness and Stability of Fortune:",
          "content": "The Fickleness and Stability of Fortune: Though Lakshmi is benevolent, Hindu philosophy recognizes that fortune is unstable - she is said to be \"chanchala\" (restless), never staying in one place long. Stories tell of her leaving those who become proud, greedy, or unrighteous. The demon king Bali, despite his devotion, lost her favor when he became arrogant. The Pandava brothers in the Mahabharata maintained her favor through their adherence to dharma, even in exile. This teaching emphasizes that wealth and prosperity must be earned and maintained through virtue, humility, and generosity. Lakshmi favors those who work hard, remain ethical, and use their prosperity for the benefit of others."
        },
        {
          "title": "Lakshmi and the Lotus:",
          "content": "Lakshmi and the Lotus: The lotus is Lakshmi's primary symbol, representing purity and spiritual perfection rising from the mud of material existence. She is often depicted sitting or standing on a fully bloomed lotus, holding lotus buds in her hands. This symbolizes that true prosperity blooms beautifully even amidst worldly challenges, and that spiritual wealth is the highest form of abundance. The lotus also never gets wet despite growing in water, teaching that one should live in the world of wealth without becoming attached to or corrupted by it."
        },
        {
          "title": "Alakshmi - The Shadow Side:",
          "content": "Alakshmi - The Shadow Side: In some traditions, Lakshmi has a shadow counterpart called Alakshmi or Jyeshtha, the goddess of misfortune and poverty who dwells in quarrelsome households, dirty places, and where dharma is violated. This duality teaches that prosperity and misfortune are two faces of the same force - one must actively create conditions that attract Lakshmi (cleanliness, harmony, generosity, hard work) and repel Alakshmi (conflict, laziness, uncleanliness, greed)."
        },
        {
          "title": "Kubera's Lesson:",
          "content": "Kubera's Lesson: Kubera, the god of wealth and treasurer of the gods, once became arrogant about his riches. Lakshmi visited him in disguise as a humble woman. Kubera failed to show her proper respect and honor. She revealed herself and left him, teaching that wealth without humility and grace is hollow. True prosperity includes inner qualities: generosity, respect, beauty of character, and compassion."
        }
      ],
      "relationships": {
        "eternal consort": "Vishnu - The Preserver, Lord of Vaikuntha",
        "father": "Bhrigu (in some traditions) or born directly from the cosmic ocean",
        "sister": "Alakshmi/Jyeshtha (goddess of misfortune, her shadow counterpart)",
        "incarnations": "Sita (wife of Rama), Rukmini/Radha (consorts of Krishna), Padmavati (wife of Venkateswara)",
        "relationship with saraswati": "The three primary goddesses - Lakshmi (wealth), Saraswati (knowledge), and Parvati (power) - are sometimes depicted together, representing the completeness of divine feminine energy. There's a teaching that complete devotion to Saraswati (knowledge) may distance Lakshmi (wealth), while obsession with Lakshmi may distance Saraswati - the wise balance both.",
        "relationship with ganesha": "Lakshmi is often worshipped alongside Ganesha, as he removes obstacles to prosperity while she provides the prosperity itself.",
        "presence in vaikuntha": "She eternally resides with Vishnu in his celestial abode, Vaikuntha, where she is depicted massaging his feet as he reclines on the serpent Shesha."
      },
      "worship": {
        "sacred sites": "Lakshmi is worshipped throughout India, often in conjunction with Vishnu. Major sites include: Mahalakshmi Temple (Mumbai), Ashtalakshmi Temple (Chennai - dedicated to her eight forms), Kolhapur Mahalakshmi Temple (one of the Shakti Peethas), and Tirupati (where she is worshipped as Padmavati alongside Venkateswara). Every Hindu home has a designated place for worshipping Lakshmi, often near the entrance or in a clean, sacred corner.",
        "festivals": "Diwali (Deepavali): The most important Lakshmi festival, celebrated on the new moon night in October/November. On this night, homes are cleaned, lit with oil lamps (diyas), and decorated with rangoli to welcome Lakshmi. It's believed she visits clean, well-lit homes and blesses them with prosperity for the year ahead. Business account books are blessed, new ventures begun, and gambling is considered auspicious as it attracts fortune.\nVaralakshmi Vratam: Celebrated by married women (primarily in South India) on the Friday before the full moon in the month of Shravana (July-August). Women pray for the wellbeing of their families and worship the goddess with elaborate offerings.\nKojagari Purnima/Sharad Purnima: The autumn full moon when Lakshmi is believed to descend to earth and visit homes, bestowing blessings on those who stay awake all night.\nMahalakshmi Vrat: An eight-day festival in the month of Bhadrapada (August-September) dedicated to propitiating the goddess.",
        "daily worship practices": "Devotees maintain cleanliness in their homes, especially at the entrance and places of worship. Friday is particularly auspicious for Lakshmi worship. Footprints of the goddess (Lakshmi Pada) are drawn at entrances to invite her in. Lighting lamps (especially ghee lamps) in the evening is believed to please her. Keeping the home clean, harmonious, and free from quarrels maintains her presence.",
        "offerings": "Lotus flowers (pink or white), gold ornaments, coins, sweets (especially kheer - rice pudding), coconut, betel leaves and nuts, turmeric, kumkum (red powder), sandalwood paste, fruits (particularly bananas), and rice. Silver or gold coins are traditional offerings. Offering food to the poor and practicing generosity are considered the highest forms of Lakshmi worship.",
        "prayers & invocations": "The primary mantra is \"Om Shreem Mahalakshmiyei Namaha\" (Salutations to the Great Goddess Lakshmi). The Sri Sukta from the Rigveda is the most ancient and powerful hymn to Lakshmi. Mahalakshmi Ashtakam (eight verses) and Kanakadhara Stotram (composed by Adi Shankaracharya) are popular prayers. The Lakshmi Sahasranama (thousand names) enumerates her divine qualities."
      },
      "sources": [
        "Sources: Vishnu Purana, Bhagavata Purana, Padma Purana, Ramayana, Mahabharata, Sri Sukta (Rigveda), Lakshmi Tantra",
        "Sri Sukta:Verses 1-2",
        "Vishnu Purana:Book 1:Chapter 9",
        "Bhagavata Purana:Canto 8:Chapter 8:Verses 8-12"
      ],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\deities\\lakshmi.html",
        "extractedAt": "2025-12-13T08:42:42.771Z",
        "verified": false,
        "needsReview": false
      }
    },
    {
      "id": "parvati",
      "name": "Parvati",
      "displayName": "🌺 Parvati",
      "mythology": "hindu",
      "category": "deities",
      "description": "The supreme mother goddess and embodiment of Shakti, the divine feminine creative power that animates the universe. As Shiva's eternal consort, she completes the cosmic dance of creation and destruction. Known by many names - Uma, Gauri, Ambika - she manifests in forms ranging from the gentle, nurturing mother to the fierce warrior goddesses Durga and Kali. She is the divine mother of Ganesha and Kartikeya, the mountain princess who won the ascetic god through devotion.",
      "attributes": {
        "sanskrit titles": "Uma (Light, Peace), Gauri (The Fair One), Ambika (Mother), Aparna (Leafless - she who fasted without even eating leaves), Lalita (The Playful One), Bhavani (Giver of Life), Shailaja/Shailaputri (Daughter of Mountains)",
        "domains": "Divine Feminine Power (Shakti), Motherhood, Love, Devotion, Fertility, Harmony, Beauty, Marital Felicity, Asceticism, Power, Nourishment",
        "symbols": "Trishula (trident when in Durga form), Lotus, Mirror, Rosary beads, Kamandalu (water pot), Red silk sari, Vermillion (sindoor)",
        "sacred animals": "Lion (in Durga form), Tiger (in fierce forms), Bull Nandi (Shiva's mount, shared symbolism)",
        "sacred plants": "Bilva leaves (sacred to Shiva, offered by Parvati), Lotus, Red flowers, Turmeric, Sandalwood, Durva grass",
        "colors": "Golden (as Gauri), Green (association with nature and fertility), Red (as Shakti/power), White (purity as Uma)"
      },
      "myths": [
        {
          "title": "Reincarnation of Sati:",
          "content": "Reincarnation of Sati: Parvati is the reincarnation of Sati, Shiva's first wife. Sati had immolated herself in her father Daksha's sacrificial fire after he insulted Shiva by not inviting him to a great yajna. Grief-stricken, Shiva withdrew from the world into deep meditation. Sati was reborn as Parvati, daughter of Himavan (the personified Himalayas) and Mena. Even as a child, she was devoted to Shiva, having memories of her previous life. This story establishes Parvati as the eternal feminine principle that is Shiva's inseparable complement across lifetimes."
        },
        {
          "title": "Winning Shiva Through Tapas:",
          "content": "Winning Shiva Through Tapas: The gods needed Shiva to marry and produce a son who could defeat the demon Taraka. Knowing Parvati's devotion, they sent Kamadeva (god of desire) to shoot his flower arrow at the meditating Shiva. Disturbed, Shiva opened his third eye and burned Kamadeva to ash. Parvati then undertook severe austerities herself - standing on one leg, fasting for years, exposed to harsh elements, earning the name Aparna (\"leafless\") because she abstained even from eating leaves. Her devotion and tapas (spiritual austerity) were so intense that even the ascetic Shiva was compelled to acknowledge her. He tested her in disguise, criticizing himself to see if her devotion was true. When she defended him fiercely, he revealed himself and accepted her as his wife. This story demonstrates that the divine feminine wins the divine masculine not through mere beauty but through spiritual power, devotion, and determination."
        },
        {
          "title": "Creation of Ganesha:",
          "content": "Creation of Ganesha: While Shiva wandered as an ascetic, Parvati desired a child of her own. From the sandalwood paste and turmeric she used for her bath, she fashioned a beautiful boy and breathed life into him - Ganesha. She instructed him to guard the door while she bathed. When Shiva returned and the boy refused him entry, Shiva beheaded him in anger. Parvati's grief and rage were so terrible that the entire universe trembled. Shiva, recognizing the power of her maternal love and fury, immediately agreed to restore the child with an elephant's head. This story reveals Parvati as the creative mother goddess whose power rivals even Shiva's, and whose love and protection for her children is absolute."
        },
        {
          "title": "Manifestation as Durga:",
          "content": "Manifestation as Durga: When the demon Mahishasura terrorized the three worlds with a boon that no man or god could kill him, the gods pooled their energies, which manifested as the warrior goddess Durga - an emanation of Parvati's Shakti. Riding a lion, wielding weapons from all the gods, she battled Mahishasura for nine days before slaying him. This demonstrates that when evil becomes too great, the gentle mother transforms into the fierce warrior to protect dharma. Durga is not a separate goddess but Parvati herself manifesting her protective, martial aspect."
        },
        {
          "title": "Transformation into Kali:",
          "content": "Transformation into Kali: In some accounts, during the battle with demons, Durga's fury became so intense that she manifested Kali from her forehead - the darkest, most terrifying form of Shakti. Kali went into a destructive frenzy, dancing on corpses, drinking blood, threatening to destroy the entire universe. Only when Shiva lay down among the corpses and she realized she was stepping on her husband did she stop, biting her tongue in shock. This shows the ultimate power of the goddess - she can destroy everything, but love and relationship bring her back to balance."
        },
        {
          "title": "The Divine Play at Kailash:",
          "content": "The Divine Play at Kailash: Numerous stories depict the domestic life of Parvati and Shiva on Mount Kailash - they play dice, argue playfully, raise their children, and demonstrate an ideal marriage partnership. Once, Parvati playfully covered Shiva's eyes, plunging the universe into darkness, showing that she holds equal cosmic power. When she won all his possessions in a dice game, Shiva bet himself and lost, becoming her possession. These stories humanize the divine couple while revealing deep philosophical truths about the balance and complementarity of masculine and feminine principles."
        },
        {
          "title": "Teaching Shiva to Dance:",
          "content": "Teaching Shiva to Dance: While Shiva is known as Nataraja (Lord of Dance), some traditions say that Parvati taught him the arts of music and dance. As Shivakami, she is the consort who brings culture, beauty, and refinement to the wild ascetic god. She civilizes him without diminishing his power, bringing him from the cremation grounds to the family home, from solitary meditation to engaged relationship."
        }
      ],
      "relationships": {
        "eternal consort": "Shiva - The Destroyer/Transformer, Lord of Kailash",
        "father": "Himavan/Himavat - Personification of the Himalaya mountains",
        "mother": "Mena/Menaka - Queen of the mountains",
        "sister": "Ganga - The sacred river goddess (in some traditions)",
        "sons": "Ganesha (remover of obstacles) and Kartikeya/Skanda (god of war)",
        "previous life": "Sati - First wife of Shiva, daughter of Daksha",
        "relationship with shiva": "Theirs is the archetypal divine marriage, representing the union of consciousness (Shiva) and energy (Shakti). Neither is complete without the other - she provides the dynamic power while he provides the static awareness. Together they create, sustain, and destroy the universe in an eternal cycle. In Tantric traditions, they are depicted as Ardhanarishvara - a form that is half-Shiva, half-Parvati, showing their essential unity.",
        "mother of ganesha and kartikeya": "Her fierce protection and love for her sons demonstrates the maternal aspect of Shakti. She created Ganesha independently, showing her creative power. Kartikeya was born from Shiva's seed but raised by the Krittikas (Pleiades) at her request, showing her wisdom in divine management.",
        "relationship with other goddesses": "All goddess forms in Hinduism are understood as manifestations of Parvati's supreme Shakti - Lakshmi, Saraswati, Durga, Kali are all her forms. She is the Adi Shakti - the primordial power from which all feminine divinity flows."
      },
      "worship": {
        "sacred sites": "Parvati is worshipped alongside Shiva in almost every Shiva temple. As the supreme goddess, she has numerous dedicated temples: Meenakshi Temple (Madurai - one of India's greatest temples), Kamakshi Temple (Kanchipuram), various Shakti Peethas across India (108 sacred sites where parts of Sati's body fell), Vaishno Devi (Jammu - pilgrimage to a cave shrine), and countless mountain shrines in the Himalayas, her father's domain.",
        "festivals": "Navaratri: Nine nights celebrating the goddess in all her forms, culminating in Durga Puja (worship of her warrior form) and Vijayadashami (victory day).\nTeej Festival: Celebrated by married women, especially in North India, for marital happiness and the wellbeing of husbands. Unmarried girls pray for a husband like Shiva.\nGauri Tritiya: Celebrating her auspicious Gauri form, especially in Maharashtra and Karnataka.\nGangaur: Rajasthani festival celebrating Gauri (Parvati) alongside Gan (Shiva), honoring marital love and fidelity.",
        "worship practices": "Married women worship Parvati for a blessed marriage and family life. She is the ideal of the devoted wife and loving mother. Fasts are undertaken on Mondays (Shiva's day) by women seeking her blessings. The Solah Shringar (sixteen adornments) are offered to her image, representing the complete ornamentation of the divine feminine.",
        "offerings": "Red flowers (hibiscus, rose), turmeric, kumkum (vermillion), sandalwood paste, bilva leaves (sacred to Shiva, offered by her), fruits, sweets, coconut, incense. Fasting and austerities are considered particularly pleasing to her, as she herself won Shiva through tapas.",
        "prayers & invocations": "\"Om Parvatyai Namaha\" - Basic salutation. Devi Mahatmya (Glory of the Goddess) recounts her exploits as Durga. Lalita Sahasranama (thousand names of the goddess) is a profound hymn. Soundarya Lahari (Wave of Beauty) composed by Adi Shankaracharya is a beautiful prayer to her. Various region-specific hymns celebrate her different forms."
      },
      "sources": [
        "Sources: Shiva Purana, Devi Bhagavata Purana, Skanda Purana, Linga Purana, Kalika Purana, Devi Mahatmya",
        "Shiva Purana:Rudra Samhita:Parvati Khanda:Chapter 20",
        "Shiva Purana:Rudra Samhita:Kumara Khanda:Chapter 18",
        "Devi Bhagavata Purana:Book 7:Chapter 30"
      ],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\deities\\parvati.html",
        "extractedAt": "2025-12-13T08:42:42.774Z",
        "verified": false,
        "needsReview": false
      }
    },
    {
      "id": "prithvi",
      "name": "Prithvi",
      "displayName": "🌍 Prithvi",
      "mythology": "hindu",
      "category": "deities",
      "description": "Prithvi (Bhudevi) is the Earth Mother goddess representing fertility and abundance.",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\deities\\prithvi.html",
        "extractedAt": "2025-12-13T08:42:42.775Z",
        "verified": false,
        "needsReview": true
      }
    },
    {
      "id": "rati",
      "name": "Rati",
      "displayName": "💕 Rati",
      "mythology": "hindu",
      "category": "deities",
      "description": "Rati is the goddess of love, desire, and passion, consort of Kamadeva (god of love).",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\deities\\rati.html",
        "extractedAt": "2025-12-13T08:42:42.776Z",
        "verified": false,
        "needsReview": true
      }
    },
    {
      "id": "saraswati",
      "name": "Saraswati",
      "displayName": "🎨 Saraswati",
      "mythology": "hindu",
      "category": "deities",
      "description": "Saraswati is the goddess of knowledge, music, arts, wisdom, and learning. Dressed in pure white, she rides a white swan or peacock and plays the veena (a stringed musical instrument). As the consort of Brahma, she represents the creative power of knowledge that shapes the universe.",
      "attributes": {
        "titles": "Vak Devi (Goddess of Speech), Sharada (Giver of Essence), Brahmi (Consort of Brahma), Mahavidya (Great Knowledge)",
        "domains": "Knowledge, Music, Arts, Learning, Wisdom, Speech, Memory",
        "symbols": "Veena (musical instrument), Books, Prayer beads, Lotus",
        "sacred animals": "Hamsa (swan or goose), Peacock",
        "colors": "White (representing purity, knowledge, and truth)"
      },
      "myths": [
        {
          "title": "Creation of the Vedas:",
          "content": "Creation of the Vedas: Saraswati is credited with creating Sanskrit, the sacred language, and the Vedas themselves flowed from her essence. She gave Brahma the knowledge to create the universe in an ordered, meaningful way."
        },
        {
          "title": "The Sacred River:",
          "content": "The Sacred River: The ancient Saraswati River, now largely dried up, was said to be her earthly manifestation. Where it joins the Ganges and Yamuna at Prayagraj (Allahabad), it forms the Triveni Sangam, a most sacred confluence."
        },
        {
          "title": "Rivalry with Lakshmi:",
          "content": "Rivalry with Lakshmi: In some tales, Saraswati and Lakshmi (goddess of wealth) compete for devotees' attention, representing the eternal tension between spiritual knowledge and material prosperity."
        }
      ],
      "relationships": {
        "consort": "Brahma (the Creator god)",
        "forms": "Sometimes identified with Gayatri and other knowledge deities",
        "allies": "Students, scholars, artists, musicians, all seekers of knowledge",
        "complementary": "Works alongside Lakshmi (wealth) and Parvati (power) as a divine feminine triad"
      },
      "worship": {
        "sacred sites": "Major temples include the Saraswati Temple at Basara (Telangana), Mookambika Temple (Karnataka), and temples at educational institutions across India.",
        "festivals": "Vasant Panchami: The spring festival celebrating Saraswati, when students place their books and instruments before her for blessings\nNavratri: She is worshipped during the final days as one of the divine feminine aspects",
        "offerings": "White flowers, especially jasmine and lotus, fruits, honey, milk, and yellow/white colored sweets. Students offer their books and educational tools.",
        "prayers & invocations": "The most common prayer is \"Om Aim Saraswatyai Namah\" (salutations to Saraswati). Students invoke her blessing before exams and when beginning studies."
      },
      "sources": [
        "Sources: Rigveda, Puranas, Devi Mahatmya"
      ],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\deities\\saraswati.html",
        "extractedAt": "2025-12-13T08:42:42.778Z",
        "verified": false,
        "needsReview": false
      }
    },
    {
      "id": "shiva",
      "name": "Shiva",
      "displayName": "🔱 Shiva",
      "mythology": "hindu",
      "category": "deities",
      "description": "The cosmic dancer who dissolves the universe at the end of each cycle, yet embodies both destruction and regeneration. The great ascetic who meditates in the Himalayas, wearing ashes and draped with serpents, the ultimate yogi from whom all transformation flows.",
      "attributes": {
        "titles": "Mahadeva (Great God), Nataraja (Lord of Dance), Mahakal (Lord of Time), Bholenath (Simple/Innocent Lord), Neelkanth (Blue-Throated)",
        "domains": "Destruction, Transformation, Yoga, Meditation, Time, Death, Regeneration, Asceticism",
        "symbols": "Trishula (trident), Damaru (drum), Third Eye, Crescent Moon, Ganga (river), Lingam",
        "sacred animals": "Nandi (bull - his vahana), Serpents (worn as ornaments), Tiger (skin used as seat)",
        "sacred plants": "Bilva (bael) leaves, Datura, Cannabis, Rudraksha seeds",
        "colors": "White (ashes), Blue (his throat), Black (matted hair)"
      },
      "myths": [
        {
          "title": "The Drinking of Halahala:",
          "content": "The Drinking of Halahala: During the churning of the cosmic ocean, the deadly poison halahala emerged before the nectar. It threatened to destroy all creation. Shiva, to save the universe, drank the poison but held it in his throat with yogic power, turning his throat blue. This earned him the name Neelkanth (Blue-Throated) and demonstrated his role as the protector who takes on the world's suffering."
        },
        {
          "title": "The Tandava - Dance of Destruction:",
          "content": "The Tandava - Dance of Destruction: As Nataraja, Shiva performs the Tandava, the cosmic dance that destroys the universe at the end of each cycle. He dances within a ring of fire (representing cosmic energy), standing on the demon Apasmara (representing ignorance). His drum beats out the rhythm of time, his hand gestures promise protection and liberation. This dance is not mere destruction but transformation - clearing away the old so the new can emerge."
        },
        {
          "title": "The Burning of Kamadeva:",
          "content": "The Burning of Kamadeva: When the god of love Kamadeva shot his arrow at Shiva to break his deep meditation and make him notice Parvati, Shiva opened his third eye in anger and reduced Kamadeva to ashes. This demonstrated Shiva's power over desire and attachment. Later, moved by Kamadeva's wife's grief and Parvati's devotion, Shiva allowed Kamadeva to be reborn, showing his compassion alongside his fierceness."
        }
      ],
      "relationships": {
        "parents": "Born from Brahma's forehead or self-manifested; Rudra in the Vedas",
        "first consort": "Sati (daughter of Daksha) - who self-immolated when her father insulted Shiva",
        "current consort": "Parvati/Uma (Sati reborn) - The Divine Mother, Shakti personified",
        "children": "Ganesha (elephant-headed remover of obstacles), Kartikeya/Skanda (god of war), Ashokasundari (daughter)",
        "siblings": "Part of Trimurti with Brahma and Vishnu",
        "allies": "Vishnu (complementary force), Parvati (his Shakti/power), Nandi (devoted vahana), Ganesha (beloved son)",
        "complex relations": "Brahma (whom he both protects and has punished), Daksha (father-in-law who insulted him)",
        "enemies": "Various asuras (demons), including Andhaka, Jalandhara, Tripurasura - though Shiva often grants them boons before ultimately destroying them"
      },
      "worship": {
        "sacred sites": "Shiva has thousands of temples, but the most sacred are the Jyotirlingas - twelve temples where Shiva is said to have manifested as a pillar of light. These include: Kedarnath (Uttarakhand), Kashi Vishwanath (Varanasi), Somnath (Gujarat), Mallikarjuna (Andhra Pradesh), and others. Mount Kailash (Tibet) is considered his eternal abode. The sacred city of Varanasi (Kashi) is especially dear to Shiva.",
        "festivals": "Maha Shivaratri: \"The Great Night of Shiva\" - the most important Shiva festival, celebrating his marriage to Parvati or the night he performed the Tandava. Devotees fast and keep vigil all night, offering bilva leaves and milk to the Shiva Lingam.\nPradosham: The 13th day after new/full moon, twilight time sacred to Shiva. Special pujas performed.\nShravan Month: The entire month (July-August) is sacred to Shiva. Devotees observe Monday fasts and offer water to Lingam.",
        "offerings": "Bilva (bael) leaves in sets of three (representing the Trimurti or three eyes of Shiva), milk, honey, yogurt, ghee, water (especially Ganga water), vibhuti (sacred ash), rudraksha beads, white flowers, datura flowers. Shiva accepts simple offerings from sincere devotees - even water is enough. The Rudra Abhishekam (ritual bathing of the Lingam) is particularly sacred.",
        "prayers & invocations": "The primary mantra is \"Om Namah Shivaya\" (I bow to Shiva) - one of the most powerful mantras in Hinduism. The Maha Mrityunjaya Mantra (Great Death-Conquering Mantra) is chanted for protection and healing. The Rudram from the Yajurveda praises Shiva's many forms. The Shiva Tandava Stotram describes his cosmic dance. Devotees also chant the 108 or 1008 names of Shiva."
      },
      "sources": [
        "Sources: Rigveda, Shiva Purana, Linga Purana, Skanda Purana, Mahabharata, various Agamas (Shaivite texts)"
      ],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\deities\\shiva.html",
        "extractedAt": "2025-12-13T08:42:42.782Z",
        "verified": false,
        "needsReview": false
      }
    },
    {
      "id": "vishnu",
      "name": "Vishnu",
      "displayName": "🦚 Vishnu",
      "mythology": "hindu",
      "category": "deities",
      "description": "The sustainer of the universe who maintains cosmic order and descends to earth in various avatars whenever dharma is threatened. Blue-skinned deity of infinite compassion and divine protection.",
      "attributes": {
        "titles": "Narayana (Cosmic Man), Hari (Remover of Sins), Madhava (Lord of Knowledge), Vasudeva (Indwelling Spirit)",
        "domains": "Preservation, Dharma, Compassion, Protection, Cosmic Order, Divine Love",
        "symbols": "Sudarshana Chakra (discus), Panchajanya (conch), Kaumodaki (mace), Padma (lotus)",
        "sacred animals": "Garuda (divine eagle), Shesha/Ananta (cosmic serpent), Kamadhenu (wish-granting cow)",
        "sacred plants": "Tulsi (holy basil), Lotus, Bilva leaves",
        "colors": "Blue (representing infinity), Yellow-Gold (divine radiance)"
      },
      "myths": [
        {
          "title": "The Churning of the Cosmic Ocean:",
          "content": "The Churning of the Cosmic Ocean: When the gods lost their immortality, Vishnu advised them to churn the ocean of milk to obtain amrita (nectar of immortality). Taking the form of a giant turtle (Kurma avatar), he supported Mount Mandara as the churning rod. During the churning, many treasures emerged including Lakshmi (who chose Vishnu as her consort), the deadly poison halahala (swallowed by Shiva), and finally the amrita."
        },
        {
          "title": "The Cosmic Sleep:",
          "content": "The Cosmic Sleep: Between each cycle of creation, Vishnu sleeps on the thousand-headed serpent Shesha, floating on the cosmic ocean. During this yoga-nidra (cosmic sleep), the universe is in potential form. When he awakens, a new cycle of creation begins with a lotus sprouting from his navel, upon which Brahma sits to create the world anew."
        },
        {
          "title": "The Three Strides of Vamana:",
          "content": "The Three Strides of Vamana: When the demon king Bali conquered the three worlds, the gods appealed to Vishnu. He incarnated as Vamana, a dwarf brahmin, and asked Bali for just three paces of land. When Bali agreed, Vamana expanded to cosmic size and covered earth with one step, the heavens with another, and asked Bali where to place the third. Humbled, Bali offered his own head, and Vamana pushed him to the netherworld, restoring cosmic balance while honoring Bali's devotion."
        }
      ],
      "relationships": {
        "parents": "Son of Sage Kashyapa and Aditi (in some traditions); self-existent in others",
        "consort": "Lakshmi (Goddess of Prosperity and Fortune) - incarnates with him in various forms",
        "children": "Kamadeva (God of Love), and various children through his avatars",
        "siblings": "Part of Trimurti with Brahma and Shiva",
        "allies": "Brahma (Creator), Lakshmi (his eternal consort), Garuda (his vahana), Hanuman (devoted servant), All Devas",
        "enemies": "Asuras (demons) who threaten dharma - Ravana, Hiranyakashipu, Kamsa, and countless others",
        "complex relationship": "Shiva - they are complementary forces, sometimes allies, occasionally in friendly competition"
      },
      "worship": {
        "sacred sites": "Vishnu has numerous temples across India and Southeast Asia. Major sites include: Badrinath (Uttarakhand), Tirupati Balaji (Andhra Pradesh - world's most visited temple), Jagannath Temple (Puri, Odisha), Ranganathaswamy Temple (Srirangam, Tamil Nadu), and Angkor Wat (Cambodia - world's largest religious monument, originally dedicated to Vishnu).",
        "festivals": "Vaikuntha Ekadashi: The day when the gates to Vaikuntha (Vishnu's abode) are believed to be open. Devotees fast and keep vigil.\nRama Navami: Birthday of Lord Rama (9th day of Chaitra month, March-April).\nKrishna Janmashtami: Birthday of Lord Krishna (8th day of Bhadrapada, August-September), celebrated with fasting, singing, and reenacting Krishna's childhood.\nDiwali: Celebrates Rama's return to Ayodhya after 14 years of exile.",
        "offerings": "Tulsi leaves (most sacred to Vishnu), yellow flowers, butter, milk, honey, fruits (especially bananas), betel leaves, panchamrita (mixture of milk, yogurt, ghee, honey, sugar). Devotional songs, recitation of Vishnu Sahasranama (1000 names), reading of Bhagavad Gita or Vishnu Purana.",
        "prayers & invocations": "The most common mantra is \"Om Namo Narayanaya\" (salutations to the divine spirit). The Vishnu Sahasranama (thousand names of Vishnu) is chanted for blessings and protection. For specific avatars: \"Om Ram Ramaya Namaha\" for Rama, \"Om Namo Bhagavate Vasudevaya\" for Krishna. Vishnu is associated with the Ekadashi (11th day after new/full moon) - devotees fast on these days."
      },
      "sources": [
        "Sources: Rigveda, Vishnu Purana, Bhagavata Purana, Bhagavad Gita, Ramayana, Mahabharata",
        "Rig Veda:Mandala 1:Hymn 154:Verse 1-5",
        "Rig Veda:Mandala 1:Hymn 22:Verse 20",
        "Bhagavad Gita:Chapter 4:Verse 7-8",
        "Bhagavad Gita:Chapter 9:Verse 22",
        "Bhagavad Gita:Chapter 11:Verse 7",
        "Vishnu Purana:Book 1:Chapter 2:Verse 66-67",
        "Vishnu Purana:Book 1:Chapter 9:Verse 1-5",
        "Bhagavata Purana:Canto 1:Chapter 3:Verse 28",
        "Ramayana:Bala Kanda:Sarga 15:Verse 11",
        "Mahabharata:Shanti Parva:Chapter 47:Verse 53"
      ],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\deities\\vishnu.html",
        "extractedAt": "2025-12-13T08:42:42.789Z",
        "verified": false,
        "needsReview": false
      }
    },
    {
      "id": "vritra",
      "name": "Vritra",
      "displayName": "🐉 Vritra",
      "mythology": "hindu",
      "category": "deities",
      "description": "Vritra is the serpentine demon who imprisoned the cosmic waters, slain by Indra.",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\deities\\vritra.html",
        "extractedAt": "2025-12-13T08:42:42.790Z",
        "verified": false,
        "needsReview": true
      }
    },
    {
      "id": "yama",
      "name": "Yama",
      "displayName": "⚖️ Yama",
      "mythology": "hindu",
      "category": "deities",
      "description": "Yama is the god of death and the lord of dharma, presiding over the afterlife and judging souls based on their karmic deeds. Riding a black buffalo and wielding a noose to capture souls, he maintains cosmic justice and the cycle of rebirth. He is both feared and respected as the inevitable force that brings every life to its conclusion.",
      "attributes": {
        "titles": "Dharmaraja (King of Dharma), Kala (Time), Antaka (The Ender), Mrityu (Death)",
        "domains": "Death, Judgment, Justice, Dharma, Afterlife, Time",
        "symbols": "Noose (pasha), Staff (danda), Book of destiny",
        "sacred animals": "Black buffalo (vahana), sometimes depicted with dogs",
        "realm": "Yamaloka or Pitriloka (realm of the dead)"
      },
      "myths": [
        {
          "title": "The First Mortal:",
          "content": "The First Mortal: Yama chose mortality, exploring the path of death to guide future souls. His twin sister Yami (later the river goddess Yamuna) pleaded with him not to die, but he accepted his fate."
        },
        {
          "title": "Savitri and Satyavan:",
          "content": "Savitri and Satyavan: When Yama came to claim Satyavan's soul, his devoted wife Savitri followed them. Impressed by her devotion and wisdom, Yama granted her boons, ultimately returning her husband to life."
        },
        {
          "title": "Testing Yudhishthira:",
          "content": "Testing Yudhishthira: In the Mahabharata, Yama tested Yudhishthira's adherence to dharma through various trials, including appearing as a dog and a yaksha with philosophical questions."
        }
      ],
      "relationships": {
        "parents": "Son of Surya (sun god) and Saranyu",
        "twin sister": "Yami (goddess of the Yamuna river)",
        "consort": "Dhumorna (representing smoke from funeral pyres)",
        "siblings": "Manu (first man), Ashvins (divine physicians)",
        "chitragupta": "Divine recorder who maintains the book of karma for all souls",
        "yamadutas": "His messenger servants who retrieve souls at the time of death"
      },
      "worship": {
        "sacred sites": "Yama is rarely worshipped in dedicated temples, though shrines exist in South India. He is honored during ancestor worship rituals and funeral rites.",
        "festivals": "Yama Dwitiya (Bhai Dooj): The day celebrating the bond between brothers and sisters, commemorating Yama's visit to his sister Yami",
        "offerings": "Black sesame seeds, food offerings for ancestors (shraddha), water libations"
      },
      "sources": [
        "Sources: Rigveda, Atharvaveda, Mahabharata, Puranas, Garuda Purana"
      ],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\deities\\yama.html",
        "extractedAt": "2025-12-13T08:42:42.793Z",
        "verified": false,
        "needsReview": false
      }
    },
    {
      "id": "yami",
      "name": "Yami",
      "displayName": "🌊 Yami",
      "mythology": "hindu",
      "category": "deities",
      "description": "Yami is the goddess of the sacred Yamuna River and the twin sister of Yama, the god of death. In Vedic mythology, she represents the feminine principle of life and continuity, contrasting with her brother's role as death. After Yama became the first to die, Yami grieved so deeply that the gods created night to help her forget.",
      "attributes": {
        "titles": "Yamuna (River Goddess), Sister of Death",
        "domains": "Rivers, Life, Continuity, Sisterly Love",
        "symbols": "Yamuna River, Water pot, Lotus",
        "sacred animals": "Tortoise",
        "colors": "Blue-green (representing flowing water)"
      },
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\deities\\yami.html",
        "extractedAt": "2025-12-13T08:42:42.794Z",
        "verified": false,
        "needsReview": true
      }
    }
  ],
  "heroes": [
    {
      "id": "krishna",
      "name": "Krishna",
      "displayName": "🪈 Krishna",
      "mythology": "hindu",
      "category": "heroes",
      "description": "Eighth avatar of Vishnu, teacher of the Bhagavad Gita, and one of Hinduism's most beloved deities. See also Krishna as Deity.",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\heroes\\krishna.html",
        "extractedAt": "2025-12-13T08:42:42.799Z",
        "verified": false,
        "needsReview": true
      }
    },
    {
      "id": "rama",
      "name": "Rama",
      "displayName": "🏹 Rama",
      "mythology": "hindu",
      "category": "heroes",
      "description": "Maryada Purushottama - The Perfect Man",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [
        "Ramayana:Bala Kanda:Sarga 1:Verse 6-9",
        "Ramayana:Ayodhya Kanda:Sarga 21:Verse 3",
        "Ramayana:Aranya Kanda:Sarga 10:Verse 18-20",
        "Ramayana:Yuddha Kanda:Sarga 115:Verse 11-13",
        "Ramayana:Yuddha Kanda:Sarga 118:Verse 12",
        "Mahabharata:Vana Parva:Chapter 277:Verse 38-41",
        "Adhyatma Ramayana:Bala Kanda:Sarga 1:Verse 44-46",
        "Bhagavata Purana:Canto 9:Chapter 10:Verse 10-11"
      ],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\heroes\\rama.html",
        "extractedAt": "2025-12-13T08:42:42.803Z",
        "verified": false,
        "needsReview": true
      }
    }
  ],
  "creatures": [
    {
      "id": "brahma",
      "name": "Redirecting",
      "displayName": "🔄 Redirecting...",
      "mythology": "hindu",
      "category": "creatures",
      "description": "",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\creatures\\brahma.html",
        "extractedAt": "2025-12-13T08:42:42.720Z",
        "verified": false,
        "needsReview": true
      }
    },
    {
      "id": "garuda",
      "name": "Garuda",
      "displayName": "🦅 Garuda",
      "mythology": "hindu",
      "category": "creatures",
      "description": "King of Birds, Vahana of Vishnu [View in Corpus →]",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [
        "Mahabharata:Adi Parva:Chapter 30:Verse 1-5",
        "Mahabharata:Adi Parva:Chapter 33:Verse 10-15",
        "Mahabharata:Adi Parva:Chapter 34:Verse 1-8",
        "Vishnu Purana:Book 1:Chapter 9:Verse 64-70",
        "Bhagavata Purana:Canto 8:Chapter 6:Verse 35",
        "Garuda Purana:Purva Khanda:Chapter 1:Verse 1-5"
      ],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\creatures\\garuda.html",
        "extractedAt": "2025-12-13T08:42:42.723Z",
        "verified": false,
        "needsReview": true
      }
    },
    {
      "id": "makara",
      "name": "Makara",
      "displayName": "🦁 Makara",
      "mythology": "hindu",
      "category": "creatures",
      "description": "Mythical sea creature combining features of crocodile, elephant, fish, and dolphin. Guardian of waters and thresholds.",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\creatures\\makara.html",
        "extractedAt": "2025-12-13T08:42:42.725Z",
        "verified": false,
        "needsReview": true
      }
    },
    {
      "id": "nagas",
      "name": "Nagas",
      "displayName": "🐍 Nagas",
      "mythology": "hindu",
      "category": "creatures",
      "description": "Semi-divine serpent beings inhabiting Patala, guardians of treasures and sacred waters. Major nagas include Shesha, Vasuki, Takshaka, and Kaliya.",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\creatures\\nagas.html",
        "extractedAt": "2025-12-13T08:42:42.726Z",
        "verified": false,
        "needsReview": true
      }
    },
    {
      "id": "shiva",
      "name": "Redirecting",
      "displayName": "🔄 Redirecting...",
      "mythology": "hindu",
      "category": "creatures",
      "description": "",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\creatures\\shiva.html",
        "extractedAt": "2025-12-13T08:42:42.726Z",
        "verified": false,
        "needsReview": true
      }
    },
    {
      "id": "vishnu",
      "name": "Redirecting",
      "displayName": "🔄 Redirecting...",
      "mythology": "hindu",
      "category": "creatures",
      "description": "",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\creatures\\vishnu.html",
        "extractedAt": "2025-12-13T08:42:42.727Z",
        "verified": false,
        "needsReview": true
      }
    }
  ],
  "beings": [
    {
      "id": "yamadutas",
      "name": "Yamadutas",
      "displayName": "👤 Yamadutas",
      "mythology": "hindu",
      "category": "beings",
      "description": "The servants and messengers of Yama who retrieve souls at the time of death and escort them to Yamaloka for judgment.",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\beings\\yamadutas.html",
        "extractedAt": "2025-12-13T08:42:42.677Z",
        "verified": false,
        "needsReview": true
      }
    }
  ],
  "cosmology": [
    {
      "id": "afterlife",
      "name": "Hindu Afterlife  Rebirth",
      "displayName": "🔄 Hindu Afterlife & Rebirth",
      "mythology": "hindu",
      "category": "cosmology",
      "description": "In Hindu cosmology, death is not an ending but a transition. The eternal soul (Atman) migrates through\n                countless lifetimes, driven by karma, until achieving moksha - liberation from the cycle itself and\n                union with the divine. This is the journey every soul undertakes through the vast expanse of time.",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\cosmology\\afterlife.html",
        "extractedAt": "2025-12-13T08:42:42.697Z",
        "verified": false,
        "needsReview": true
      }
    },
    {
      "id": "creation",
      "name": "Hindu Creation Myth",
      "displayName": "🌀 Hindu Creation Myth",
      "mythology": "hindu",
      "category": "cosmology",
      "description": "Hindu creation is not a single event but an eternal cycle. The universe emerges from the cosmic\n                waters, flourishes for billions of years, then dissolves back into the unmanifest, only to be\n                reborn again. Creation, preservation, and destruction dance in endless rhythm.",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\cosmology\\creation.html",
        "extractedAt": "2025-12-13T08:42:42.707Z",
        "verified": false,
        "needsReview": true
      }
    },
    {
      "id": "karma",
      "name": "Karma",
      "displayName": "⚖️ Karma",
      "mythology": "hindu",
      "category": "cosmology",
      "description": "The Law of Action and Consequence",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [
        "Bhagavad Gita:Chapter 2:Verse 47",
        "Bhagavad Gita:Chapter 3:Verse 5",
        "Bhagavad Gita:Chapter 3:Verse 19",
        "Bhagavad Gita:Chapter 4:Verse 17",
        "Bhagavad Gita:Chapter 18:Verse 23-25",
        "Brihadaranyaka Upanishad:Chapter 4:Section 4:Verse 5",
        "Chandogya Upanishad:Chapter 5:Section 10:Verse 7",
        "Katha Upanishad:Chapter 1:Section 2:Verse 14",
        "Yoga Sutras:Chapter 2:Sutra 12-14",
        "Mahabharata:Vana Parva:Chapter 207:Verse 13",
        "Mahabharata:Shanti Parva:Chapter 174:Verse 44"
      ],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\cosmology\\karma.html",
        "extractedAt": "2025-12-13T08:42:42.715Z",
        "verified": false,
        "needsReview": true
      }
    },
    {
      "id": "kshira-sagara",
      "name": "Kshira Sagara",
      "displayName": "🌊 Kshira Sagara",
      "mythology": "hindu",
      "category": "cosmology",
      "description": "The cosmic ocean of milk that was churned by gods and demons to obtain the nectar of immortality (amrita). Vishnu rests on the serpent Shesha floating on this ocean.",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\cosmology\\kshira-sagara.html",
        "extractedAt": "2025-12-13T08:42:42.718Z",
        "verified": false,
        "needsReview": true
      }
    },
    {
      "id": "shiva",
      "name": "Redirecting to Shiva Deity Page",
      "displayName": "Redirecting to Shiva Deity Page...",
      "mythology": "hindu",
      "category": "cosmology",
      "description": "",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\cosmology\\shiva.html",
        "extractedAt": "2025-12-13T08:42:42.719Z",
        "verified": false,
        "needsReview": true
      }
    }
  ],
  "texts": [],
  "herbs": [
    {
      "id": "soma",
      "name": "Soma",
      "displayName": "🍃 Soma",
      "mythology": "hindu",
      "category": "herbs",
      "description": "",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\herbs\\soma.html",
        "extractedAt": "2025-12-13T08:42:42.798Z",
        "verified": false,
        "needsReview": true
      }
    }
  ],
  "symbols": [],
  "rituals": [
    {
      "id": "diwali",
      "name": "Diwali",
      "displayName": "🪔 Diwali",
      "mythology": "hindu",
      "category": "rituals",
      "description": "The festival celebrating Rama's return to Ayodhya after 14 years of exile and his victory over Ravana. Celebrated with lights, fireworks, sweets, and worship of Lakshmi.",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\rituals\\diwali.html",
        "extractedAt": "2025-12-13T08:42:42.804Z",
        "verified": false,
        "needsReview": true
      }
    }
  ],
  "magic": [],
  "paths": [],
  "figures": [
    {
      "id": "chitragupta",
      "name": "Chitragupta",
      "displayName": "📝 Chitragupta",
      "mythology": "hindu",
      "category": "figures",
      "description": "The divine accountant who maintains the book of karma, recording all deeds of every soul. Assists Yama in judging the dead.",
      "attributes": {},
      "myths": [],
      "relationships": {},
      "worship": {},
      "sources": [],
      "metadata": {
        "sourceFile": "H:\\Github\\EyesOfAzrael2\\EyesOfAzrael\\mythos\\hindu\\figures\\chitragupta.html",
        "extractedAt": "2025-12-13T08:42:42.795Z",
        "verified": false,
        "needsReview": true
      }
    }
  ]
}