{
  "id": "greek_olive",
  "filename": "olive",
  "displayName": "🫒 Olive",
  "name": "Greek Mythology",
  "primarySources": [],
  "uses": [
    "Olympic Crowns: Olive wreaths from Athena's sacred grove crowned victors at the Olympic Games",
    "Sacred Oil: Olive oil anointed athletes, fueled temple lamps, and was offered to the gods",
    "Panathenaic Prize: Winners of Athens' great festival received amphorae filled with sacred olive oil",
    "Peace Symbol: Olive branches extended as signs of truce and supplication",
    "Purification: Olive oil used in cleansing and consecration rituals",
    "Funeral Rites: Olive branches and oil honored the dead"
  ],
  "rituals": [
    "Olympic Crowns: Olive wreaths from Athena's sacred grove crowned victors at the Olympic Games",
    "Sacred Oil: Olive oil anointed athletes, fueled temple lamps, and was offered to the gods",
    "Panathenaic Prize: Winners of Athens' great festival received amphorae filled with sacred olive oil",
    "Peace Symbol: Olive branches extended as signs of truce and supplication",
    "Purification: Olive oil used in cleansing and consecration rituals",
    "Funeral Rites: Olive branches and oil honored the dead"
  ],
  "properties": [],
  "mythology": "greek",
  "preparation": [],
  "enhancedBy": "agent8-v2",
  "symbolism": "",
  "deities": [
    "-athena",
    "-poseidon"
  ],
  "updatedAt": "2025-12-26T05:15:08.838Z",
  "iconType": "svg",
  "icon": "<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 64 64\">\n  <circle cx=\"32\" cy=\"32\" r=\"28.8\" fill=\"#9370DB\" opacity=\"0.2\"/>\n  <circle cx=\"32\" cy=\"32\" r=\"19.2\" fill=\"none\" stroke=\"#9370DB\" stroke-width=\"2\" stroke-dasharray=\"5,5\"/>\n  <text x=\"32\" y=\"44.8\" text-anchor=\"middle\" font-size=\"22.4\" fill=\"#9370DB\">✨</text>\n</svg>",
  "_modified": "2025-12-27T07:07:06.849Z",
  "createdAt": "2025-12-27T07:06:55.967Z",
  "metadata": {
    "createdAt": "2025-12-13T02:38:13.035Z",
    "createdBy": "system",
    "verified": false,
    "source": "html_parser",
    "sourceFile": "mythos/greek/herbs/olive.html",
    "finalEnrichment": true,
    "updatedAt": {
      "_seconds": 1766539879,
      "_nanoseconds": 77000000
    },
    "created": {
      "_seconds": 1766819244,
      "_nanoseconds": 101000000
    }
  },
  "updated_at": "2025-12-27T07:06:55.967Z",
  "description": "The Olive (Olea europaea) stands as the most sacred tree of the Mediterranean world, a gift of Athena to Athens in Greek tradition, and equally central to biblical faith. In Christianity, the olive is profoundly significant: Jesus prayed in Gethsemane ('oil press'), taught on the Mount of Olives, and made His triumphal entry from there. Olive oil is essential to Christian sacraments - anointing the sick (James 5:14), baptism, confirmation, and ordination. The olive branch brought by Noah's dove (Genesis 8:11) signifies God's peace after judgment. St. Paul's allegory of the olive tree (Romans 11:17-24) teaches Gentile Christians' grafting into Israel's covenantal heritage.",
  "type": "herb",
  "name": "Olive",
  "displayName": "Olive Tree",
  "botanicalName": "Olea europaea",
  "linguistic": {
    "originalName": "ελαία (Greek), זית (Hebrew: zayit)",
    "transliteration": "Elaia (Greek), Zayit (Hebrew)",
    "pronunciation": "/ˈɒlɪv/",
    "etymology": {
      "rootLanguage": "Greek/Latin",
      "meaning": "olive tree, oil",
      "derivation": "Latin 'oliva' from Greek 'elaia'"
    }
  },
  "biblicalReferences": {
    "oldTestament": [
      {
        "reference": "Genesis 8:11",
        "context": "Noah's Dove",
        "text": "And the dove came back to him in the evening, and behold, in her mouth was a freshly plucked olive leaf. So Noah knew that the waters had subsided from the earth.",
        "significance": "The olive branch becomes the universal symbol of peace and hope - God's judgment ended, new life begins. This image pervades Western culture to this day."
      },
      {
        "reference": "Exodus 27:20; 30:24",
        "context": "Tabernacle Oil and Anointing",
        "text": "You shall command the people of Israel to bring you pure beaten olive oil for the light, that a lamp may regularly be set up to burn.",
        "significance": "Olive oil fueled the eternal lamp (ner tamid) in the Tabernacle and Temple, and was the base for the Holy Anointing Oil."
      },
      {
        "reference": "Psalm 52:8",
        "context": "The Righteous as Olive Tree",
        "text": "But I am like a green olive tree in the house of God. I trust in the steadfast love of God forever and ever.",
        "significance": "The olive tree symbolizes the righteous person rooted in God's house, flourishing and fruitful."
      },
      {
        "reference": "Zechariah 4:3, 11-14",
        "context": "The Two Olive Trees",
        "text": "Two olive trees are by it, one on the right of the bowl and the other on its left... These are the two anointed ones who stand by the Lord of the whole earth.",
        "significance": "Prophetic vision of two witnesses (interpreted as royal and priestly figures) who channel divine oil/spirit. Referenced in Revelation 11:4."
      },
      {
        "reference": "Judges 9:8-9",
        "context": "Jotham's Parable",
        "text": "The trees once went out to anoint a king over them, and they said to the olive tree, 'Reign over us.' But the olive tree said to them, 'Shall I leave my abundance, by which gods and men are honored?'",
        "significance": "The olive's nobility - it honors both gods and men through its oil - makes it too dignified to seek political power."
      }
    ],
    "newTestament": [
      {
        "reference": "Matthew 26:36-46; Mark 14:32-42; Luke 22:39-46",
        "context": "Gethsemane - The Garden of the Oil Press",
        "text": "Then Jesus went with them to a place called Gethsemane... And being in agony he prayed more earnestly; and his sweat became like great drops of blood falling down to the ground.",
        "significance": "The name 'Gethsemane' means 'oil press' - where olives are crushed to yield oil. Jesus was 'pressed' in agony, yielding obedience to the Father's will. The olive imagery of suffering producing anointing is profound."
      },
      {
        "reference": "Matthew 21:1; 24:3; 26:30; Acts 1:12",
        "context": "The Mount of Olives",
        "text": "When they drew near to Jerusalem and came to Bethphage, to the Mount of Olives...",
        "significance": "Jesus' triumphal entry began from the Mount of Olives; He taught eschatological prophecies there; He ascended to heaven from there. This olive-covered hill is central to salvation history."
      },
      {
        "reference": "Romans 11:17-24",
        "context": "Paul's Olive Tree Allegory",
        "text": "But if some of the branches were broken off, and you, although a wild olive shoot, were grafted in among the others and now share in the nourishing root of the olive tree, do not be arrogant toward the branches.",
        "significance": "Paul's most developed botanical allegory. Israel is the cultivated olive tree; Gentile believers are wild olive branches grafted in. Both share the 'nourishing root' of the patriarchal promises. A warning against Gentile arrogance."
      },
      {
        "reference": "James 5:14",
        "context": "Anointing the Sick",
        "text": "Is anyone among you sick? Let him call for the elders of the church, and let them pray over him, anointing him with oil in the name of the Lord.",
        "significance": "The scriptural basis for the Sacrament of the Anointing of the Sick. Olive oil, blessed by the bishop, is used in this sacrament."
      },
      {
        "reference": "Revelation 11:4",
        "context": "The Two Witnesses",
        "text": "These are the two olive trees and the two lampstands that stand before the Lord of the earth.",
        "significance": "Echoing Zechariah's vision, the apocalyptic witnesses are identified with olive trees - sources of anointing and light."
      }
    ]
  },
  "liturgicalUse": {
    "sacramentalOils": {
      "chrism": "Sacred Chrism, a mixture of olive oil and balsam, is used in Baptism (anointing after water), Confirmation (sealing with the Holy Spirit), and Holy Orders (anointing of priests' hands and bishops' heads).",
      "oilOfCatechumens": "Pure olive oil used to anoint those preparing for Baptism, strengthening them for spiritual combat.",
      "oilOfTheSick": "Olive oil blessed by the bishop is used in the Sacrament of Anointing of the Sick (Extreme Unction)."
    },
    "chrismMass": {
      "holyThursday": "On Holy Thursday morning, the bishop blesses the three oils (Chrism, Oil of Catechumens, Oil of the Sick) for the entire diocese.",
      "blessing": "The prayer of blessing recalls the olive's biblical significance and invokes the Holy Spirit upon the oil."
    },
    "easternChristianity": {
      "myron": "Eastern churches use Holy Myron (Chrism) with many additional ingredients, but olive oil remains the base.",
      "lampOil": "Olive oil traditionally fuels sanctuary lamps before icons and the tabernacle."
    },
    "palmSunday": {
      "branches": "While palm branches are the primary symbol, olive branches are also used in some traditions for Palm Sunday processions, recalling the Mount of Olives."
    }
  },
  "christianTypology": {
    "peaceAndReconciliation": {
      "noahsDove": "The olive branch signifies God's peace after judgment, foreshadowing Christ who brings peace between God and humanity (Ephesians 2:14).",
      "universalSymbol": "The olive branch has become the preeminent symbol of peace in Western civilization, derived from the biblical narrative."
    },
    "gethsemane": {
      "pressed": "As olives are pressed to yield oil, Christ was pressed in agony to yield perfect obedience and redemption.",
      "anointing": "From Christ's suffering flows the anointing of the Holy Spirit poured out on the Church."
    },
    "grafting": {
      "paulineTheology": "The Church is composed of both Jewish and Gentile believers, united in one olive tree rooted in the promises to Abraham.",
      "continuity": "Christianity does not replace Israel but is grafted into Israel's covenantal heritage.",
      "humility": "Gentile believers must not boast over natural branches (Romans 11:18)."
    },
    "chrismation": {
      "anointing": "Just as olive oil was used to anoint kings, priests, and prophets, Christians are anointed to share in Christ's threefold office.",
      "holySpirit": "The oil of Chrism signifies the outpouring of the Holy Spirit upon the baptized."
    }
  },
  "patristics": {
    "cyrilOfJerusalem": "In his Mystagogical Catecheses, Cyril explains baptismal anointing with olive oil as participation in Christ's anointing.",
    "augustine": "St. Augustine interpreted Paul's olive tree allegory extensively, emphasizing the unity of Jewish and Gentile believers in Christ.",
    "johnChrysostom": "Preached on the olive as symbol of peace and the anointing of Christ (Christos = 'Anointed One').",
    "gregoryNazianzus": "Used olive imagery in his theological orations on the Holy Spirit and anointing."
  },
  "monasticTradition": {
    "oliveCultivation": {
      "monasteries": "Mediterranean monasteries have cultivated olives for centuries, providing oil for liturgy, food, and medicine.",
      "tradition": "Monks and nuns continue ancient methods of olive pressing, maintaining heritage varieties."
    },
    "lampOil": {
      "vigil": "Monastic vigil lamps before the Blessed Sacrament and icons traditionally burn olive oil.",
      "symbolism": "The flame represents prayer; the olive oil represents the Holy Spirit sustaining that prayer."
    },
    "herbalism": {
      "medicine": "Monastic infirmaries used olive oil as a base for salves and medicinal preparations.",
      "nutrition": "Olive oil has been central to monastic diet, especially during fasting periods."
    }
  },
  "greekMythologyConnection": {
    "athena": "In Greek tradition, Athena created the olive tree as her gift to Athens, winning the city's patronage over Poseidon. The olive symbolized civilization, peace, and wisdom.",
    "olympicWreaths": "Victors at the Olympic Games were crowned with olive wreaths from Athena's sacred grove.",
    "christianAdaptation": "Early Christians in Greek lands readily embraced olive symbolism, seeing continuity with biblical tradition and transforming pagan associations into Christian meanings."
  },
  "comparativeNotes": {
    "christian": {
      "continuity": "The olive is one of the few plants with equally profound significance in both Testaments, demonstrating theological continuity.",
      "transformation": "Greek olive symbolism (peace, wisdom, victory) was easily adapted to Christian meanings centered on Christ.",
      "sacramental": "Olive oil became the material basis for key Christian sacraments, continuing and fulfilling Old Testament anointing practices.",
      "eschatology": "The Mount of Olives' role in Christ's first and anticipated second coming gives the olive eschatological significance."
    }
  },
  "sources": [
    {
      "title": "Dictionary of Biblical Imagery",
      "editors": "Leland Ryken, James C. Wilhoit, Tremper Longman III",
      "relevance": "Comprehensive treatment of olive symbolism in Scripture"
    },
    {
      "title": "The Catechism of the Catholic Church",
      "relevance": "Sacramental theology of holy oils"
    },
    {
      "title": "Mystagogical Catecheses",
      "author": "St. Cyril of Jerusalem",
      "relevance": "Early Church teaching on baptismal anointing"
    },
    {
      "title": "Romans (Word Biblical Commentary)",
      "author": "James D.G. Dunn",
      "relevance": "Scholarly exegesis of Romans 11 olive tree allegory"
    },
    {
      "title": "Plants of the Bible",
      "author": "Michael Zohary",
      "relevance": "Botanical and cultural context of biblical olive"
    }
  ],
  "polishedBy": "agent12-christian-scholarly"
}