{
  "id": "greek_pomegranate",
  "filename": "pomegranate",
  "displayName": "Pomegranate - Fruit of the Underworld",
  "name": "Pomegranate",
  "primarySources": [
    {
      "title": "Homeric Hymn to Demeter",
      "author": "Anonymous",
      "date": "7th-6th century BCE",
      "description": "Primary source for the Persephone abduction myth and pomegranate consumption"
    },
    {
      "title": "Metamorphoses",
      "author": "Ovid",
      "date": "8 CE",
      "description": "Roman retelling of the Persephone myth emphasizing the pomegranate's role"
    },
    {
      "title": "Theogony",
      "author": "Hesiod",
      "date": "c. 700 BCE",
      "description": "Early Greek cosmogony mentioning underworld connections"
    },
    {
      "title": "De Materia Medica",
      "author": "Dioscorides",
      "date": "1st century CE",
      "description": "Ancient medical text documenting pomegranate's medicinal uses"
    }
  ],
  "uses": [
    "Eleusinian Mysteries: Central symbol in secret rites honoring Demeter and Persephone; initiates learned the 'true' meaning of the pomegranate",
    "Wedding Ceremonies: Brides wore pomegranate crowns or carried pomegranates to ensure fertility and prosperity",
    "Offerings to the Dead: Pomegranates left at graves as food for the deceased, connecting them to Persephone's realm",
    "Fertility Rituals: Seeds scattered or consumed in rites seeking conception or abundant harvest",
    "Temple Decorations: Pomegranate motifs adorned temples of Hera, Aphrodite, and Demeter",
    "Libations: Pomegranate juice poured as offering to chthonic (underworld) deities",
    "Funerary Rites: Included in burial offerings as symbol of cyclical rebirth",
    "Medicine: Rind used to treat intestinal parasites and diarrhea",
    "Nutrition: Seeds eaten fresh or made into juice and wine",
    "Dye: Rind produced yellow and black dyes for textiles",
    "Ink: Used in creating permanent writing ink",
    "Leather Tanning: High tannin content made rind valuable for leather work",
    "Cosmetics: Juice used as natural rouge for cheeks and lips"
  ],
  "rituals": [
    "Eleusinian Mysteries: Central symbol in secret rites honoring Demeter and Persephone; initiates learned the 'true' meaning of the pomegranate as symbol of death and rebirth",
    "Wedding Ceremonies: Brides wore pomegranate crowns or carried pomegranates to ensure fertility, prosperity, and sexual abundance",
    "Offerings to the Dead: Pomegranates left at graves as food for the deceased, connecting them to Persephone's realm and ensuring safe passage",
    "Fertility Rituals: Seeds scattered or consumed in rites seeking conception, abundant harvest, and generative power",
    "Temple Offerings: Pomegranate motifs and fruits offered at temples of Hera (marriage), Aphrodite (love), and Demeter (fertility)",
    "Libations: Pomegranate juice poured as offering to chthonic (underworld) deities, especially Hades and Persephone",
    "Funerary Rites: Included in burial offerings as symbol of cyclical rebirth and hope of regeneration",
    "Thesmophoria: Women's festival honoring Demeter featuring pomegranates as symbols of fertility"
  ],
  "properties": [
    "Fertility - Numerous seeds symbolize abundance and procreation",
    "Death and Rebirth - Connection to underworld and seasonal cycles",
    "Blood Symbolism - Deep red juice represents life force and sacrifice",
    "Binding - Eating underworld food creates unbreakable ties",
    "Immortality - Associated with divine realms and eternal life",
    "Sexual Power - Symbol of Aphrodite and erotic love"
  ],
  "mythology": "greek",
  "preparation": [
    "Fresh Consumption: Seeds eaten directly for ritual and nutritional purposes",
    "Juice Extraction: Pressed for libations and offerings",
    "Wine Making: Fermented into sacred ceremonial wine",
    "Garlands: Woven into crowns for brides and priestesses",
    "Dried Preservation: Stored for off-season ritual use",
    "Medicinal Decoctions: Rind boiled for medicinal preparations"
  ],
  "enhancedBy": "agent_batch6_enrichment",
  "symbolism": "The pomegranate stands as one of the most potent and multivalent symbols in Greek religion, embodying the paradoxical unity of life and death, fertility and the grave. Its blood-red seeds, numbering in the hundreds within a single fruit, speak simultaneously of abundance and sacrifice, of the life-giving potential locked within death's embrace. In the foundational myth of Persephone's abduction, the pomegranate becomes the instrument of binding - by eating its seeds in the underworld, the goddess is forever tied to Hades' realm, spending part of each year below the earth. This myth encodes agricultural reality (the seed must 'die' underground to bring forth new life) while also expressing profound truths about transformation, the cyclical nature of existence, and the impossibility of complete separation between the realms of the living and the dead. The fruit's association with Hera emphasizes its fertility aspects, while its connection to Aphrodite highlights its erotic symbolism. For the Greeks, the pomegranate was never simply a fruit but always a mystery - a visible sign of invisible realities operating at the heart of existence.",
  "deities": [
    {
      "id": "greek_persephone",
      "name": "Persephone",
      "relationship": "Central to her myth - eating pomegranate seeds bound her to the underworld"
    },
    {
      "id": "greek_hades",
      "name": "Hades",
      "relationship": "Offered pomegranate to Persephone; associated with his realm"
    },
    {
      "id": "greek_demeter",
      "name": "Demeter",
      "relationship": "Central to Eleusinian Mysteries honoring mother and daughter"
    },
    {
      "id": "greek_hera",
      "name": "Hera",
      "relationship": "Symbol of marriage and fertility in her cult"
    },
    {
      "id": "greek_aphrodite",
      "name": "Aphrodite",
      "relationship": "Associated with love, sexuality, and erotic power"
    },
    {
      "id": "greek_dionysus",
      "name": "Dionysus",
      "relationship": "Connected through wine-making and mystery cult associations"
    }
  ],
  "updatedAt": "2026-01-10T00:00:00.000Z",
  "iconType": "svg",
  "icon": "<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 64 64\">\n  <circle cx=\"32\" cy=\"32\" r=\"28.8\" fill=\"#8B0000\" opacity=\"0.2\"/>\n  <circle cx=\"32\" cy=\"32\" r=\"19.2\" fill=\"#8B0000\" opacity=\"0.6\"/>\n  <circle cx=\"28\" cy=\"28\" r=\"3\" fill=\"#DC143C\"/>\n  <circle cx=\"36\" cy=\"28\" r=\"3\" fill=\"#DC143C\"/>\n  <circle cx=\"32\" cy=\"35\" r=\"3\" fill=\"#DC143C\"/>\n  <circle cx=\"26\" cy=\"34\" r=\"2.5\" fill=\"#DC143C\"/>\n  <circle cx=\"38\" cy=\"34\" r=\"2.5\" fill=\"#DC143C\"/>\n</svg>",
  "_modified": "2026-01-10T00:00:00.000Z",
  "createdAt": "2025-12-27T07:06:55.967Z",
  "metadata": {
    "createdAt": "2025-12-13T02:38:13.077Z",
    "createdBy": "system",
    "verified": false,
    "source": "html_parser",
    "sourceFile": "mythos/greek/herbs/pomegranate.html",
    "finalEnrichment": true,
    "updatedAt": {
      "_seconds": 1766539879,
      "_nanoseconds": 138000000
    },
    "created": {
      "_seconds": 1766819244,
      "_nanoseconds": 101000000
    },
    "enrichmentVersion": "3.0",
    "polishedBy": "agent_batch6_enrichment",
    "polishedAt": "2026-01-10T00:00:00.000Z",
    "historicalPeriod": "Bronze Age through Classical Antiquity (2000 BCE - 400 CE)",
    "primaryRegion": "Greece, Mediterranean, Near East (original cultivation from Persia)"
  },
  "updated_at": "2026-01-10T00:00:00.000Z",
  "description": "The pomegranate (Greek: rhoa or side) occupies a unique position in Greek mythology and religion as the quintessential fruit of the underworld, forever associated with the abduction of Persephone and the mysterious rites of Eleusis. According to the Homeric Hymn to Demeter, when Hades seized Persephone and carried her to his underground kingdom, he offered her pomegranate seeds to eat. By consuming this food of the dead - whether four, six, or seven seeds depending on the telling - Persephone became eternally bound to the underworld, destined to spend part of each year as Queen of the Dead while returning to the upper world for the remaining months. This myth encoded the Greeks' understanding of agricultural cycles, with the pomegranate representing the seed that must descend into darkness before rising again with new life. Beyond this foundational narrative, the pomegranate carried dense symbolic weight across Greek religious practice. Its blood-red juice suggested sacrifice and life force; its hundreds of seeds spoke of fertility, abundance, and sexual potency. Brides carried pomegranates at weddings, and the fruit adorned temples of Hera (goddess of marriage) and Aphrodite (goddess of love). In funerary contexts, pomegranates accompanied the dead as both sustenance for the journey and symbols of hoped-for rebirth. The Eleusinian Mysteries, the most sacred rites of ancient Greece, featured the pomegranate prominently, though the precise ritual significance remains secret even today. Medicinally, Greeks employed pomegranate rind as an astringent and vermifuge, while the juice served cosmetic purposes and the whole fruit provided important nutrition. The pomegranate thus stands as a perfect example of how the ancient Greeks wove together the practical, the symbolic, and the sacred into unified cultural understanding.",
  "type": "herb",
  "botanicalName": "Punica granatum",
  "commonNames": [
    "Pomegranate",
    "Rhoa",
    "Side",
    "Grain apple"
  ],
  "habitat": "Native to Persia (Iran), cultivated throughout Mediterranean",
  "relatedEntities": [
    {
      "id": "greek_persephone",
      "type": "deity",
      "relationship": "central mythological connection"
    },
    {
      "id": "greek_hades",
      "type": "deity",
      "relationship": "underworld association",
      "_unverified": true,
      "_unverifiedReason": "Referenced entity not found in database"
    },
    {
      "id": "greek_demeter",
      "type": "deity",
      "relationship": "Eleusinian Mysteries",
      "_unverified": true,
      "_unverifiedReason": "Referenced entity not found in database"
    },
    {
      "id": "greek_eleusinian_mysteries",
      "type": "ritual",
      "relationship": "sacred symbol",
      "_unverified": true,
      "_unverifiedReason": "Referenced entity not found in database"
    },
    {
      "id": "greek_underworld",
      "type": "place",
      "relationship": "fruit of the dead"
    }
  ],
  "corpusQueries": [
    "Pomegranate Greek mythology Persephone",
    "Eleusinian Mysteries sacred symbols",
    "Persephone underworld pomegranate seeds",
    "Greek fertility symbols sacred plants",
    "Demeter Persephone abduction myth",
    "Ancient Greek funeral offerings plants",
    "Hera Aphrodite pomegranate fertility"
  ],
  "sources": [
    {
      "type": "primary",
      "title": "Homeric Hymn to Demeter",
      "author": "Anonymous",
      "date": "7th-6th century BCE"
    },
    {
      "type": "primary",
      "title": "Metamorphoses",
      "author": "Ovid",
      "date": "8 CE"
    },
    {
      "type": "primary",
      "title": "De Materia Medica",
      "author": "Dioscorides",
      "date": "1st century CE"
    },
    {
      "type": "academic",
      "title": "The Road to Eleusis",
      "author": "R. Gordon Wasson, Albert Hofmann, Carl A. P. Ruck",
      "date": "1978"
    },
    {
      "type": "academic",
      "title": "Greek Religion",
      "author": "Walter Burkert",
      "date": "1985"
    }
  ]
}