{
  "id": "fatima",
  "type": "place",
  "name": "Fátima",
  "icon": "🌟",
  "slug": "fatima",
  "mythologies": [
    "christian",
    "catholic",
    "marian"
  ],
  "primaryMythology": "catholic",
  "shortDescription": "Major Marian apparition site in Portugal where the Virgin Mary appeared to three shepherd children in 1917, delivering prophetic messages including the famous Three Secrets of Fátima",
  "fullDescription": "Fátima is one of the most significant Marian apparition sites in Catholic history, rivaling Lourdes in importance and drawing millions of pilgrims annually. Between May 13 and October 13, 1917, the Virgin Mary appeared six times to three shepherd children—Lúcia dos Santos (10) and her younger cousins Francisco (9) and Jacinta Marto (7)—in the Cova da Iria near the village of Fátima, Portugal. The Virgin identified herself as 'Our Lady of the Rosary' and delivered messages emphasizing prayer, penance, conversion, and devotion to her Immaculate Heart. The apparitions included three prophetic secrets: a vision of hell, prediction of World War II and communism's spread, and a mysterious third secret involving persecution of the Church and an assassination attempt on a pope (later interpreted as the 1981 attack on Pope John Paul II). The final apparition on October 13, 1917, was witnessed by an estimated 70,000 people who observed the 'Miracle of the Sun'—the sun appearing to dance, spin, and plunge toward earth in vivid colors, witnessed across a 40-kilometer radius. This public miracle, unprecedented in modern Marian apparitions, provided extraordinary validation of the children's claims. The Church officially recognized the apparitions in 1930. The Sanctuary of Fátima now encompasses a massive basilica complex, the Chapel of Apparitions at the exact site, and hosts over 6 million pilgrims annually. Fátima's messages profoundly influenced 20th-century Catholicism, emphasizing Marian devotion, the Rosary, First Saturday devotions, and consecration of Russia to Mary's Immaculate Heart as spiritual response to atheistic communism.",
  "category": "pilgrimage",
  "subCategory": "marian-apparition-shrine",
  "colors": {
    "primary": "#FFD700",
    "secondary": "#FFFFFF",
    "primaryRgb": "255, 215, 0"
  },
  "tags": [
    "fatima",
    "virgin-mary",
    "marian-apparition",
    "our-lady-of-fatima",
    "three-secrets",
    "miracle-of-sun",
    "lucia-santos",
    "francisco-marto",
    "jacinta-marto",
    "rosary",
    "immaculate-heart",
    "pilgrimage",
    "portugal",
    "catholic",
    "prophecy",
    "first-saturday",
    "russia-consecration"
  ],
  "geography": {
    "realm": "Earth / Sacred Marian Apparition Site",
    "location": "Cova da Iria, Fátima, Santarém District, Portugal",
    "coordinates": {
      "lat": 39.6317,
      "lng": -8.6725
    },
    "accessibility": "public"
  },
  "metaphysicalProperties": {
    "element": "light-fire",
    "energyType": "prophetic-devotion",
    "planet": "earth"
  },
  "inhabitants": [
    {
      "id": "virgin-mary",
      "name": "Virgin Mary (Our Lady of Fátima)",
      "type": "blessed-virgin",
      "mythology": "catholic",
      "icon": "👸",
      "description": "Mother of Jesus who appeared six times to three children, delivering prophetic messages and calling for prayer and conversion"
    },
    {
      "id": "lucia-santos",
      "name": "Sister Lúcia dos Santos",
      "type": "visionary-religious",
      "mythology": "catholic",
      "icon": "📿",
      "description": "Principal visionary (1907-2005) who saw, heard, and spoke with Our Lady; later became Carmelite nun and recorded messages"
    },
    {
      "id": "francisco-marto",
      "name": "Blessed Francisco Marto",
      "type": "visionary-blessed",
      "mythology": "catholic",
      "icon": "🙏",
      "description": "Younger cousin of Lúcia who saw but could not hear the Virgin; died 1919 at age 10; beatified 2000"
    },
    {
      "id": "jacinta-marto",
      "name": "Blessed Jacinta Marto",
      "type": "visionary-blessed",
      "mythology": "catholic",
      "icon": "🌸",
      "description": "Youngest visionary who saw and heard the Virgin; suffered greatly; died 1920 at age 9; beatified 2000"
    }
  ],
  "events": [
    {
      "name": "First Apparition (May 13, 1917)",
      "description": "The Virgin Mary first appears to Lúcia, Francisco, and Jacinta at Cova da Iria, dressed in white and shining with brilliant light, asking them to return for six consecutive months",
      "participants": [
        {
          "id": "virgin-mary",
          "name": "Virgin Mary",
          "type": "blessed-virgin"
        },
        {
          "id": "lucia-santos",
          "name": "Lúcia dos Santos",
          "type": "visionary"
        },
        {
          "id": "francisco-marto",
          "name": "Francisco Marto",
          "type": "visionary"
        },
        {
          "id": "jacinta-marto",
          "name": "Jacinta Marto",
          "type": "visionary"
        }
      ]
    },
    {
      "name": "Second Apparition (June 13, 1917)",
      "description": "Our Lady promises to take Francisco and Jacinta to heaven soon, but tells Lúcia she must remain to spread devotion to the Immaculate Heart of Mary",
      "participants": [
        {
          "id": "virgin-mary",
          "name": "Virgin Mary",
          "type": "blessed-virgin"
        },
        {
          "id": "lucia-santos",
          "name": "Lúcia dos Santos",
          "type": "visionary"
        },
        {
          "id": "francisco-marto",
          "name": "Francisco Marto",
          "type": "visionary"
        },
        {
          "id": "jacinta-marto",
          "name": "Jacinta Marto",
          "type": "visionary"
        }
      ]
    },
    {
      "name": "Third Apparition - First Two Secrets (July 13, 1917)",
      "description": "The Virgin reveals the first two secrets: a terrifying vision of hell, and prophecy of World War II and communism's spread if humanity doesn't convert. She requests consecration of Russia to her Immaculate Heart",
      "participants": [
        {
          "id": "virgin-mary",
          "name": "Virgin Mary",
          "type": "blessed-virgin"
        },
        {
          "id": "lucia-santos",
          "name": "Lúcia dos Santos",
          "type": "visionary"
        },
        {
          "id": "francisco-marto",
          "name": "Francisco Marto",
          "type": "visionary"
        },
        {
          "id": "jacinta-marto",
          "name": "Jacinta Marto",
          "type": "visionary"
        }
      ]
    },
    {
      "name": "Children's Imprisonment (August 13, 1917)",
      "description": "Local administrator kidnaps children to coerce them to reveal secrets and renounce visions. They refuse despite threats. Our Lady appears to them three days later on August 19",
      "participants": [
        {
          "id": "lucia-santos",
          "name": "Lúcia dos Santos",
          "type": "visionary"
        },
        {
          "id": "francisco-marto",
          "name": "Francisco Marto",
          "type": "visionary"
        },
        {
          "id": "jacinta-marto",
          "name": "Jacinta Marto",
          "type": "visionary"
        }
      ]
    },
    {
      "name": "Fifth Apparition (September 13, 1917)",
      "description": "Our Lady promises a miracle in October so all may believe, and emphasizes continuing the Rosary to end the war (World War I was raging)",
      "participants": [
        {
          "id": "virgin-mary",
          "name": "Virgin Mary",
          "type": "blessed-virgin"
        },
        {
          "id": "lucia-santos",
          "name": "Lúcia dos Santos",
          "type": "visionary"
        },
        {
          "id": "francisco-marto",
          "name": "Francisco Marto",
          "type": "visionary"
        },
        {
          "id": "jacinta-marto",
          "name": "Jacinta Marto",
          "type": "visionary"
        }
      ]
    },
    {
      "name": "Miracle of the Sun (October 13, 1917)",
      "description": "Final apparition where Virgin identifies herself as 'Our Lady of the Rosary.' Approximately 70,000 witnesses observe the sun appearing to dance, spin, change colors, and plunge toward earth—witnessed across 40 km radius despite rain",
      "participants": [
        {
          "id": "virgin-mary",
          "name": "Virgin Mary",
          "type": "blessed-virgin"
        },
        {
          "id": "lucia-santos",
          "name": "Lúcia dos Santos",
          "type": "visionary"
        },
        {
          "id": "francisco-marto",
          "name": "Francisco Marto",
          "type": "visionary"
        },
        {
          "id": "jacinta-marto",
          "name": "Jacinta Marto",
          "type": "visionary"
        }
      ]
    },
    {
      "name": "Death of Francisco (April 4, 1919)",
      "description": "Francisco Marto dies at age 10 during influenza pandemic, as Our Lady had foretold, after months of patient suffering offered for sinners",
      "participants": [
        {
          "id": "francisco-marto",
          "name": "Francisco Marto",
          "type": "visionary"
        }
      ]
    },
    {
      "name": "Death of Jacinta (February 20, 1920)",
      "description": "Jacinta Marto dies at age 9 in Lisbon hospital after prolonged suffering from influenza and tuberculosis, which she accepted as reparation for sins",
      "participants": [
        {
          "id": "jacinta-marto",
          "name": "Jacinta Marto",
          "type": "visionary"
        }
      ]
    },
    {
      "name": "Episcopal Approval (October 13, 1930)",
      "description": "Bishop of Leiria officially declares apparitions worthy of belief, authorizing devotion to Our Lady of Fátima",
      "participants": []
    },
    {
      "name": "Consecration of World to Immaculate Heart (October 31, 1942)",
      "description": "Pope Pius XII consecrates the world to the Immaculate Heart of Mary, partially fulfilling Our Lady's request",
      "participants": []
    },
    {
      "name": "Assassination Attempt on Pope John Paul II (May 13, 1981)",
      "description": "Pope John Paul II shot in St. Peter's Square on Fátima anniversary. He credits Our Lady of Fátima with saving his life. Bullet placed in crown of Fátima statue",
      "participants": []
    },
    {
      "name": "Beatification of Francisco and Jacinta (May 13, 2000)",
      "description": "Pope John Paul II beatifies Francisco and Jacinta Marto, making them the youngest non-martyred beati in Church history",
      "participants": []
    },
    {
      "name": "Third Secret Revealed (June 26, 2000)",
      "description": "Vatican publicly reveals the Third Secret: a vision of persecution of Christians and assassination of a 'bishop dressed in white' (interpreted as the 1981 papal attack)",
      "participants": []
    },
    {
      "name": "Death of Sister Lúcia (February 13, 2005)",
      "description": "Last surviving visionary Sister Lúcia dos Santos dies at age 97 in Coimbra Carmelite convent, having dedicated her life to spreading Fátima's message",
      "participants": [
        {
          "id": "lucia-santos",
          "name": "Sister Lúcia dos Santos",
          "type": "visionary"
        }
      ]
    },
    {
      "name": "Canonization of Francisco and Jacinta (May 13, 2017)",
      "description": "Pope Francis canonizes Francisco and Jacinta Marto on Fátima's centenary, making them the youngest non-martyred saints",
      "participants": []
    }
  ],
  "mythologyContexts": [
    {
      "mythology": "catholic",
      "usage": "Major Marian apparition site; Our Lady of Fátima devotion; prophetic messages for 20th century; emphasis on Rosary, penance, First Saturday devotions; consecration of Russia to Immaculate Heart; response to atheistic communism; papal devotion site",
      "names": [
        "Fátima",
        "Our Lady of Fátima",
        "Our Lady of the Rosary of Fátima",
        "Cova da Iria",
        "Sanctuary of Fátima"
      ],
      "associatedDeities": [
        {
          "id": "virgin-mary",
          "name": "Virgin Mary (Mother of God)",
          "type": "blessed-virgin",
          "mythology": "catholic",
          "icon": "👸"
        },
        {
          "id": "jesus-christ",
          "name": "Jesus Christ",
          "type": "messiah",
          "mythology": "catholic",
          "icon": "✝️"
        }
      ],
      "textReferences": [
        {
          "text": "Memoirs of Sister Lúcia",
          "passage": "Complete account of apparitions and secrets",
          "context": "Lúcia's detailed written accounts of the visions, messages, and spiritual experiences",
          "corpusUrl": "/mythos/christian/corpus-search.html?term=lucia+memoirs"
        },
        {
          "text": "The Message of Fatima (Vatican Document, 2000)",
          "passage": "Official interpretation and revelation of Third Secret",
          "context": "Congregation for the Doctrine of the Faith's theological commentary on Fátima",
          "corpusUrl": "/mythos/christian/corpus-search.html?term=fatima+third+secret"
        },
        {
          "text": "Episcopal Declaration of Bishop da Silva (1930)",
          "passage": "Official Church approval of apparitions",
          "context": "Bishop of Leiria declares visions worthy of belief and authorizes cult",
          "corpusUrl": "/mythos/christian/corpus-search.html?term=fatima+approval"
        }
      ],
      "symbolism": "Fátima symbolizes Mary's maternal concern for humanity during the catastrophic 20th century—appearing in 1917 amid World War I, the Bolshevik Revolution, and approaching global crises. The Three Secrets represent divine revelation of historical events and spiritual realities: the vision of hell emphasizes eternal consequences of sin; the prophecy of WWII and communism demonstrates heaven's foreknowledge and call for conversion; the third secret reveals the Church's suffering under persecution. The Miracle of the Sun symbolizes divine authentication of the message and God's power over creation. The children's suffering and early deaths symbolize redemptive suffering—offering pain for conversion of sinners. The Rosary, emphasized in every apparition, symbolizes Marian intercession and meditation on Christ's mysteries as path to peace. The Immaculate Heart of Mary represents Mary's perfect love, her maternal care, and refuge for humanity. Consecration of Russia (and world) to the Immaculate Heart symbolizes spiritual warfare against atheism through Marian devotion. First Saturday devotions symbolize reparation for sins against Mary and time set aside for spiritual renewal. Fátima represents Mary's active role in salvation history, not just biblical past but continuing heavenly intervention in human affairs.",
      "culturalSignificance": "Fátima profoundly shaped 20th-century Catholicism, elevating Marian devotion to unprecedented prominence. The apparitions occurred during WWI, offering hope amid catastrophe. The Second Secret's prediction of WWII and communism's spread was seen as prophetically fulfilled, validating the visions. The call for Russia's consecration made Fátima central to Cold War Catholic spirituality—spiritual combat against atheistic communism through prayer rather than military force. Pope John Paul II's intense devotion to Fátima (crediting Mary with saving him from assassination) brought papal authority to the site. The 1981 shooting on Fátima's anniversary created powerful symbolic connection. Revelation of the Third Secret in 2000 ended decades of speculation while generating new debates. Fátima legitimized apparition devotion within mainstream Catholicism. The Miracle of the Sun, witnessed by thousands including skeptics and anti-clerical journalists, provided public validation unprecedented in modern Marian apparitions. Fátima's emphasis on children as visionaries affirmed their spiritual receptivity. The beatification and canonization of Francisco and Jacinta (youngest non-martyred saints) established childhood sanctity model. Fátima spawned global First Saturday devotion movement, Rosary revivals, and Marian consecrations. The site represents Catholic response to secular modernity through intensified Marian piety. Over 6 million annual pilgrims make Fátima a major pilgrimage economy and Portuguese cultural icon."
    },
    {
      "mythology": "marian",
      "usage": "Supreme 20th-century Marian apparition; Our Lady of Fátima as major Marian title; Immaculate Heart devotion; prophetic role of Mary in salvation history; Marian co-redemption theology",
      "names": [
        "Our Lady of Fátima",
        "Our Lady of the Rosary",
        "The Immaculate Heart of Mary",
        "Queen of the Holy Rosary"
      ],
      "associatedDeities": [
        {
          "id": "virgin-mary",
          "name": "Virgin Mary",
          "type": "blessed-virgin",
          "mythology": "catholic",
          "icon": "👸"
        }
      ],
      "textReferences": [],
      "symbolism": "Within Marian theology, Fátima represents Mary's prophetic role—not passive recipient of God's will but active intercessor warning humanity and offering paths to peace. The Immaculate Heart becomes central symbol, paralleling the Sacred Heart of Jesus but representing Mary's perfect, sorrowful, triumphant love. The emphasis on consecration to Mary's Immaculate Heart elevates Marian devotion to essential salvific practice. Fátima reinforces Mary as mediatrix of all graces, co-redemptrix sharing in Christ's salvific work through her suffering. The children's visions of Mary suffering from sins committed against her develops theology of reparation to Mary herself, not just through Mary to God.",
      "culturalSignificance": "Fátima became the defining Marian apparition of the 20th century, rivaling or surpassing Lourdes in influence. The site established template for modern Marian movements emphasizing prophecy, secrets, and end-times themes. Fátima inspired subsequent apparition claims (Medjugorje, Garabandal, Akita) following similar patterns. The emphasis on children as especially receptive to Mary influenced apparition expectations. Fátima's political dimensions (Russia consecration, anti-communism) showed how Marian devotion intersects with geopolitics. The Third Secret's delayed revelation created conspiracy theories and traditionalist movements demanding its full disclosure. Fátima represents tension between institutional Church control and popular Marian devotion. The feast of Our Lady of Fátima (May 13) became globally celebrated. Fátima imagery—the Immaculate Heart, the children, the dancing sun—became iconic in Catholic visual culture."
    }
  ],
  "relatedEntities": {
    "places": [
      {
        "id": "lourdes",
        "name": "Lourdes",
        "type": "place",
        "mythology": "catholic",
        "icon": "💧",
        "url": "/data/entities/place/lourdes.json"
      },
      {
        "id": "guadalupe",
        "name": "Guadalupe",
        "type": "place",
        "mythology": "catholic",
        "icon": "🌹",
        "url": "/mythos/christian/places/guadalupe.html"
      },
      {
        "id": "medjugorje",
        "name": "Medjugorje",
        "type": "place",
        "mythology": "catholic",
        "icon": "⛰️",
        "url": "/data/entities/place/medjugorje.json"
      },
      {
        "id": "vatican",
        "name": "Vatican City",
        "type": "place",
        "mythology": "catholic",
        "icon": "⛪",
        "url": "/mythos/christian/places/vatican.html"
      }
    ],
    "deities": [
      {
        "id": "virgin-mary",
        "name": "Virgin Mary",
        "type": "deity",
        "mythology": "catholic",
        "icon": "👸",
        "url": "/data/entities/deity/virgin-mary.json"
      }
    ],
    "archetypes": [
      {
        "id": "divine-mother",
        "name": "Divine Mother",
        "type": "archetype",
        "mythology": "universal",
        "icon": "👸",
        "url": "/shared/archetypes/divine-mother.html"
      },
      {
        "id": "prophet",
        "name": "Prophet / Seer",
        "type": "archetype",
        "mythology": "universal",
        "icon": "🔮",
        "url": "/shared/archetypes/prophet.html"
      },
      {
        "id": "pilgrimage",
        "name": "Pilgrimage",
        "type": "archetype",
        "mythology": "universal",
        "icon": "🚶",
        "url": "/shared/archetypes/pilgrimage.html"
      },
      {
        "id": "child-visionary",
        "name": "Child Visionary",
        "type": "archetype",
        "mythology": "universal",
        "icon": "👧",
        "url": "/shared/archetypes/child-visionary.html"
      }
    ],
    "concepts": [
      {
        "id": "marian-apparition",
        "name": "Marian Apparition",
        "type": "concept",
        "mythology": "catholic",
        "icon": "✨",
        "url": "/mythos/christian/concepts/marian-apparition.html"
      },
      {
        "id": "prophecy",
        "name": "Prophecy",
        "type": "concept",
        "mythology": "catholic",
        "icon": "📜",
        "url": "/mythos/christian/concepts/prophecy.html"
      },
      {
        "id": "immaculate-heart",
        "name": "Immaculate Heart of Mary",
        "type": "concept",
        "mythology": "catholic",
        "icon": "💝",
        "url": "/mythos/christian/concepts/immaculate-heart.html"
      }
    ]
  },
  "sources": [
    {
      "text": "Fatima in Lucia's Own Words: Sister Lucia's Memoirs",
      "author": "Sister Lúcia dos Santos (edited by Fr. Louis Kondor)",
      "passage": "First-person account of apparitions and messages",
      "mythology": "catholic"
    },
    {
      "text": "The Message of Fatima",
      "author": "Congregation for the Doctrine of the Faith (Vatican)",
      "passage": "Official theological commentary and revelation of Third Secret",
      "mythology": "catholic"
    },
    {
      "text": "Fatima: The Great Sign",
      "author": "Francis Johnston",
      "passage": "Comprehensive historical and spiritual analysis",
      "mythology": "catholic"
    },
    {
      "text": "The Whole Truth About Fatima (3 volumes)",
      "author": "Brother Michel de la Sainte Trinité",
      "passage": "Exhaustive documentary history",
      "mythology": "catholic"
    },
    {
      "text": "Our Lady of Fátima: Prophecies of Tragedy or Hope?",
      "author": "Fr. Andrew Apostoli, CFR",
      "passage": "Analysis of messages and their fulfillment",
      "mythology": "catholic"
    },
    {
      "text": "The Miracle of the Sun (Eyewitness Accounts)",
      "author": "Various contemporary sources",
      "passage": "Secular newspaper reports and witness testimonies from October 13, 1917",
      "mythology": "catholic"
    },
    {
      "text": "Jacinta: The Flower of Fatima",
      "author": "Mary Fabyan Windeatt",
      "passage": "Biography of Jacinta Marto",
      "mythology": "catholic"
    },
    {
      "text": "The World's First Love: Mary, Mother of God",
      "author": "Archbishop Fulton J. Sheen",
      "passage": "Theological reflection on Fátima and Marian devotion",
      "mythology": "catholic"
    }
  ],
  "linguistic": {
    "originalName": "Fátima",
    "originalScript": "Latin alphabet (Portuguese)",
    "transliteration": "Fátima",
    "pronunciation": "FAH-tee-mah (Portuguese), fuh-TEE-muh (English)",
    "etymology": {
      "origin": "The town is named after Fátima bint Muhammad, daughter of the Islamic Prophet Muhammad. According to legend, a Moorish princess named Fátima converted to Christianity during the Reconquista and married a local nobleman. The name derives from Arabic فاطمة (Fāṭimah) meaning 'one who weans' or 'abstainer.' The choice of this town for Marian apparitions creates symbolic connection between Christianity and Islam through shared reverence for Mary (Maryam in Islam).",
      "development": "Arabic فاطمة (Fāṭimah, 7th century) → Moorish occupation of Iberia → Portuguese village name Fátima (medieval) → Our Lady of Fátima (1917) as Marian title → Global devotion to Our Lady of Fátima",
      "historicalForms": [
        {
          "period": "Arabic",
          "form": "فاطمة (Fāṭimah)",
          "script": "Arabic",
          "date": "7th century CE"
        },
        {
          "period": "Portuguese village",
          "form": "Fátima",
          "script": "Latin",
          "date": "Medieval to present"
        },
        {
          "period": "Marian title (post-1917)",
          "form": "Nossa Senhora de Fátima (Our Lady of Fátima)",
          "script": "Latin/Portuguese",
          "date": "1917-present"
        }
      ]
    },
    "cognates": [
      {
        "language": "Portuguese",
        "term": "Fátima",
        "meaning": "Town in Santarém District, Portugal"
      },
      {
        "language": "Arabic",
        "term": "فاطمة (Fāṭimah)",
        "meaning": "Daughter of Prophet Muhammad; popular female name"
      },
      {
        "language": "Portuguese",
        "term": "Nossa Senhora de Fátima",
        "meaning": "Our Lady of Fátima"
      },
      {
        "language": "Spanish",
        "term": "Nuestra Señora de Fátima",
        "meaning": "Our Lady of Fátima"
      },
      {
        "language": "Latin",
        "term": "Beatae Mariae Virginis de Fatima",
        "meaning": "Blessed Virgin Mary of Fátima"
      }
    ]
  },
  "geographical": {
    "region": "Santarém District, Central Portugal",
    "culturalArea": "Ribatejo region, Portugal",
    "originPoint": {
      "name": "Cova da Iria, Sanctuary of Our Lady of Fátima, Fátima, Portugal",
      "coordinates": {
        "latitude": 39.6317,
        "longitude": -8.6725,
        "accuracy": "precise"
      },
      "description": "Located in Cova da Iria ('Irene's Cove'), near the town of Fátima, Santarém District, central Portugal. The sanctuary encompasses the Chapel of Apparitions at the exact site, Basilica of Our Lady of the Rosary, Basilica of the Holy Trinity (one of world's largest churches), and extensive pilgrimage facilities. Elevation approximately 350 meters. About 130 km north of Lisbon. Rural agricultural setting with extensive sanctuary development."
    }
  },
  "temporal": {
    "firstAttestation": {
      "date": {
        "year": 1917,
        "month": 5,
        "day": 13,
        "display": "May 13, 1917",
        "confidence": "historical-documented"
      },
      "type": "historical",
      "description": "First Marian apparition occurred May 13, 1917, to three shepherd children. Series of six apparitions continued through October 13, 1917. Events documented through children's testimonies, ecclesiastical investigations, and witness accounts of the Miracle of the Sun.",
      "source": "Testimony of Lúcia dos Santos, Francisco and Jacinta Marto; witness accounts of 70,000+ people; contemporary newspaper reports; ecclesiastical investigation records"
    },
    "historicalDate": {
      "start": {
        "year": 1917,
        "month": 5,
        "day": 13,
        "display": "May 13, 1917"
      },
      "end": {
        "year": 2025,
        "display": "Present"
      },
      "display": "May 13, 1917 - Present (108 years of devotion)"
    },
    "timelinePosition": {
      "period": "Modern era / World War I / 20th century",
      "specificDate": {
        "year": 1917,
        "month": 5,
        "day": 13,
        "display": "May 13, 1917"
      },
      "era": "World War I / Russian Revolution / Modern Marian Age",
      "context": "The Fátima apparitions occurred during World War I (1914-1918), amid catastrophic global conflict. The Bolshevik Revolution began in Russia in November 1917, months after Fátima's prophecy of communism's spread. Portugal was politically unstable following the 1910 republican revolution that established anti-clerical government. The apparitions represented Catholic resurgence amid secularization. The 20th century became the 'Age of Marian Apparitions' with Fátima as the most influential, addressing modern crises of world wars, totalitarianism, and atheism through calls for prayer and conversion.",
      "keyMoments": [
        {
          "date": {
            "year": 1917,
            "month": 5,
            "day": 13,
            "display": "May 13, 1917"
          },
          "event": "First apparition",
          "significance": "Virgin Mary appears to three children at Cova da Iria"
        },
        {
          "date": {
            "year": 1917,
            "month": 7,
            "day": 13,
            "display": "July 13, 1917"
          },
          "event": "Three Secrets revealed",
          "significance": "Vision of hell, prophecy of WWII and communism, third secret given"
        },
        {
          "date": {
            "year": 1917,
            "month": 10,
            "day": 13,
            "display": "October 13, 1917"
          },
          "event": "Miracle of the Sun",
          "significance": "70,000 witnesses observe solar phenomenon validating apparitions"
        },
        {
          "date": {
            "year": 1919,
            "month": 4,
            "day": 4,
            "display": "April 4, 1919"
          },
          "event": "Francisco's death",
          "significance": "First visionary dies at age 10, as prophesied"
        },
        {
          "date": {
            "year": 1920,
            "month": 2,
            "day": 20,
            "display": "February 20, 1920"
          },
          "event": "Jacinta's death",
          "significance": "Youngest visionary dies at age 9, as prophesied"
        },
        {
          "date": {
            "year": 1930,
            "month": 10,
            "day": 13,
            "display": "October 13, 1930"
          },
          "event": "Episcopal approval",
          "significance": "Bishop of Leiria officially recognizes apparitions as authentic"
        },
        {
          "date": {
            "year": 1942,
            "month": 10,
            "day": 31,
            "display": "October 31, 1942"
          },
          "event": "Pius XII consecrates world to Immaculate Heart",
          "significance": "First papal consecration partially fulfilling Fátima request"
        },
        {
          "date": {
            "year": 1981,
            "month": 5,
            "day": 13,
            "display": "May 13, 1981"
          },
          "event": "Assassination attempt on John Paul II",
          "significance": "Pope shot on Fátima anniversary; credits Our Lady with saving his life"
        },
        {
          "date": {
            "year": 2000,
            "month": 5,
            "day": 13,
            "display": "May 13, 2000"
          },
          "event": "Beatification of Francisco and Jacinta",
          "significance": "John Paul II beatifies the two younger visionaries"
        },
        {
          "date": {
            "year": 2000,
            "month": 6,
            "day": 26,
            "display": "June 26, 2000"
          },
          "event": "Third Secret revealed",
          "significance": "Vatican publicly discloses the Third Secret's content"
        },
        {
          "date": {
            "year": 2005,
            "month": 2,
            "day": 13,
            "display": "February 13, 2005"
          },
          "event": "Death of Sister Lúcia",
          "significance": "Last surviving visionary dies at age 97"
        },
        {
          "date": {
            "year": 2017,
            "month": 5,
            "day": 13,
            "display": "May 13, 2017"
          },
          "event": "Canonization of Francisco and Jacinta",
          "significance": "Pope Francis canonizes the Marto children on centenary of first apparition"
        }
      ]
    }
  }
}
