{
  "id": "christian_salvation",
  "filename": "salvation",
  "displayName": "Salvation",
  "connections": [
    "Teshuvah - Repentance and return to God",
    "Kippur - Day of Atonement traditions",
    "Brit - Covenant relationship with God",
    "Suffering Servant - Isaiah 53 prophecy",
    "Gnosis - Salvation through knowledge",
    "Sophia's Redemption - Divine wisdom restored",
    "Return to Pleroma - Soul's liberation",
    "Archon Liberation - Freedom from cosmic powers",
    "Moksha (Hindu) - Liberation from cycle",
    "Nirvana (Buddhist) - Liberation from suffering",
    "Frashokereti (Zoroastrian) - Final renovation",
    "Ma'at (Egyptian) - Judgment and eternal life"
  ],
  "type": "cosmology",
  "_enhanced": true,
  "cosmologicalType": "realm_or_plane",
  "primarySources": [],
  "description": "Christian theology teaches that all humanity stands in need of salvation because of sin. Since the fall of Adam and Eve in the Garden of Eden, humanity has been separated from God by sin, which the Bible describes as both inherited guilt (original sin) and personal transgressions. Sin results in spiritual death and separation from God's presence, making salvation necessary for restoration.",
  "_uploadedAt": "2025-12-25T15:46:32.586489",
  "inhabitants": [],
  "features": [],
  "mythology": "christian",
  "metadata": {
    "polishedBy": "agent_10_cosmology",
    "createdBy": "system",
    "sourceFile": "mythos/christian/cosmology/salvation.html",
    "verified": false,
    "source": "html_parser",
    "createdAt": "2025-12-13T02:38:08.011Z",
    "enrichmentVersion": "1.0",
    "polishedAt": "2025-12-25T04:49:57.078Z",
    "updatedAt": "2025-12-13T02:38:08.011Z"
  },
  "layers": [],
  "name": "Christian Cosmology",
  "batch4_migration_status": "completed",
  "extracted_title": "Yaldabaoth - The Demiurge and False God in Gnostic Christianity",
  "extracted_headings": [
    "Yaldabaoth - The Demiurge",
    "Yaldabaoth - The Ignorant Creator",
    "The Birth from Sophia's Grief",
    "Born from Passion Without Union",
    "Ashamed and Hidden",
    "The Declaration of Ignorance",
    "\"I am God, and there is no other!\"",
    "Ignorance, Not Evil",
    "The Monstrous Form",
    "Lion-Faced Serpent",
    "The Lion Face",
    "The Serpent Body",
    "Eyes of Lightning",
    "Monstrous Composite",
    "The Seven Archons - Children of the Blind God",
    "The Planetary Rulers",
    "Athoth",
    "Eloaiou (Elohim)",
    "Astaphaios (Ashtaroth)",
    "Yao (YHWH)",
    "Sabaoth",
    "Adonin (Adonai)",
    "Sabbataios",
    "Names of the Old Testament God",
    "The Old Testament \"God\" Reinterpreted",
    "YHWH as the Demiurge",
    "The Forbidden Tree",
    "Law vs. Grace",
    "Christ's Revelation of the True Father",
    "The Unknown God",
    "Key Gospel Passages Reinterpreted",
    "Liberation from the Prison of Law",
    "Breaking the Chains",
    "Yaldabaoth as the Human Ego",
    "The Inner Demiurge",
    "The Material World as Classroom",
    "Even the Demiurge Will Be Redeemed",
    "The Final Awakening",
    "Proof of Universal Salvation",
    "Primary Sources on Yaldabaoth",
    "Key Gnostic Texts",
    "Related Topics",
    "Explore More"
  ],
  "batch4_migration_timestamp": {
    "_seconds": 1766801091,
    "_nanoseconds": 753000000
  },
  "extracted_lists": [
    "Anger and Wrath: The god who destroys cities, sends plagues, commands genocide - this is archontic violence, not divine love",
    "Demand for Blood Sacrifice: Animal and grain offerings, the scent of burning flesh - the true God needs nothing",
    "Legalism: 613 commandments, ritual purity laws, endless regulations - the law as a cage rather than liberation",
    "Punishment of Curiosity: \"Do not eat of the tree of knowledge\" - the Demiurge forbids gnosis!",
    "Creation of Material World: Genesis 1 describes Yaldabaoth's work, not the Monad's emanation",
    "Ignorance of Higher Realms: YHWH never mentions the Pleroma, Sophia, or the true Father - because he doesn't know them",
    "The Law (Demiurge): External rules, judgment, punishment, sacrifice, fear, bondage",
    "Grace (True Father): Internal knowledge, mercy, love, freedom, gnosis, liberation",
    "\"The Sabbath was made for man, not man for the Sabbath\" (Mark 2:27) - Human freedom over archontic law",
    "\"It is not what goes into the mouth that defiles\" (Matthew 15:11) - Rejection of purity regulations",
    "\"Woe to you lawyers!\" (Luke 11:52) - Condemnation of those who bind people with legal burdens",
    "\"Neither do I condemn you\" (John 8:11) - Grace replaces judgment",
    "\"The truth will set you free\" (John 8:32) - Gnosis as liberation from archontic bondage",
    "Ignorance of Greater Reality: The ego mistakes its limited perspective for absolute truth",
    "Arrogant Self-Declaration: \"I am right, everyone else is wrong\" echoes Yaldabaoth's cry",
    "Creation of Private Prison: The ego constructs a world-view that imprisons the divine spark within",
    "Fear-Based Control: Like Yaldabaoth's archons, the ego rules through fear, shame, and limitation",
    "Resistance to Gnosis: The ego fights against knowledge that would reveal its non-supremacy",
    "Jealousy of Spirit: The ego is threatened by the divine spark within, just as archons fear awakened souls",
    "If the Demiurge can be saved, no sinner is too far gone",
    "If the archons can be enlightened, no ignorance is permanent",
    "If even the enemy of gnosis can receive knowledge, all darkness will eventually be illuminated",
    "If he who declared \"there is no other\" can recognize the Father above, every ego can surrender",
    "If the creator of the prison can be freed, no bondage is eternal",
    "The Apocryphon (Secret Book) of John: The most complete description of Yaldabaoth's birth and nature",
    "On the Origin of the World: Detailed cosmogony including Yaldabaoth's creation of archons and humanity",
    "Hypostasis of the Archons: Focus on the archons' rule and their opposition to gnosis",
    "The Gospel of Judas: Refers to the Demiurge as \"Saklas\" (The Fool)",
    "Ptolemy's Letter to Flora: Valentinian explanation of the Old Testament god as Demiurge",
    "Irenaeus, Against Heresies: Orthodox polemic preserving Gnostic teachings about the Demiurge",
    "Sophia - Divine Wisdom and Mother of Yaldabaoth",
    "Sabaoth - The Repentant Archon",
    "The Archons - Rulers of the Planetary Spheres",
    "Demiurge vs. Monad - Comparing the False God and the True Father",
    "Gnostic Cosmology - The Pleroma and the Fall",
    "Christ the Redeemer - Revealer of the Unknown Father",
    "Universal Salvation - Even the Archons Will Be Redeemed"
  ],
  "subType": "realm"
}