{
  "id": "greek_titans",
  "name": "The Titans",
  "features": [
    "Primordial Divine Beings: The Titans were the first generation of gods, born from Gaia (Earth) and Uranus (Sky)",
    "Cosmic Scale: Each Titan embodied fundamental cosmic forces - time, memory, light, ocean, and celestial bodies",
    "Golden Age Rule: Under Cronus, the Titans presided over a mythological Golden Age of humanity",
    "Tartarus Imprisonment: After the Titanomachy, most Titans were cast into Tartarus beneath the underworld"
  ],
  "metadata": {
    "enrichmentVersion": "2.0",
    "updatedAt": {
      "_seconds": 1766539869,
      "_nanoseconds": 974000000
    },
    "verified": false,
    "sourceFile": "mythos/greek/cosmology/titans.html",
    "polishedAt": "2025-12-25T04:49:57.078Z",
    "createdBy": "system",
    "source": "html_parser",
    "createdAt": "2025-12-13T02:38:06.896Z",
    "finalEnrichment": true,
    "polishedBy": "agent_10_cosmology",
    "historicalPeriod": "Bronze Age Greece (c. 1600-1100 BCE) through Classical Period",
    "primaryRegion": "Ancient Greece, Mediterranean"
  },
  "layers": [
    "The Twelve Original Titans: Oceanus, Coeus, Crius, Hyperion, Iapetus, Cronus, Theia, Rhea, Themis, Mnemosyne, Phoebe, Tethys",
    "Second Generation Titans: Atlas, Prometheus, Epimetheus, Menoetius, Helios, Selene, Eos, Leto, Asteria",
    "Titan Domains: Time (Cronus), Memory (Mnemosyne), Ocean (Oceanus), Sun (Hyperion), Moon (Phoebe), Earth (Rhea)"
  ],
  "connections": [
    "Olympians: Children and successors who overthrew the Titans",
    "Tartarus: Prison realm where defeated Titans were imprisoned",
    "Giants: Allies in later conflicts against Zeus",
    "Humanity: Prometheus created and championed mortals"
  ],
  "filename": "titans",
  "mythology": "greek",
  "_enhanced": true,
  "cosmologicalType": "divine_generation",
  "displayName": "The Titans",
  "_uploadedAt": "2025-12-25T15:46:32.600941",
  "type": "cosmology",
  "description": "The Titans represent the primordial generation of divine beings in Greek mythology, preceding the Olympian gods. Born from the union of Gaia (Earth) and Uranus (Sky), these twelve original Titans and their descendants embodied the fundamental forces of the cosmos - time, memory, ocean, light, and celestial phenomena. Under the rule of Cronus, the Titans presided over the mythological Golden Age before being overthrown by Zeus and the Olympians in the cataclysmic Titanomachy. The defeated Titans were cast into Tartarus, though some like Prometheus and Atlas received individual punishments. Their mythology explores themes of generational conflict, cosmic succession, and the transition from primordial chaos to ordered divine rule that shaped Greek religious thought.",
  "primarySources": [
    "Hesiod's Theogony (c. 700 BCE)",
    "Homer's Iliad and Odyssey",
    "Apollodorus' Bibliotheca",
    "Ovid's Metamorphoses"
  ],
  "subType": "divine_beings",
  "sections": {
    "origins": "The Titans emerged from the primordial union of Gaia (Earth) and Uranus (Sky), representing the first generation of anthropomorphic gods in Greek cosmology. Gaia, weary of Uranus imprisoning her monstrous children (the Cyclopes and Hundred-Handed Ones) in her depths, conspired with her youngest Titan son Cronus to overthrow his father. Using an adamantine sickle provided by Gaia, Cronus castrated Uranus, separating sky from earth and establishing Titan dominion over the cosmos.",
    "attributes": "Each Titan personified cosmic forces: Oceanus embodied the world-encircling river, Hyperion represented celestial light, Mnemosyne was memory itself, and Cronus wielded power over time and agriculture. Their immense size and power exceeded that of later Olympians, with Atlas capable of bearing the weight of the heavens and Prometheus possessing the foresight to see the future of gods and men.",
    "significance": "The Titans represent a transitional phase in Greek cosmogony between primordial chaos and ordered Olympian rule. Their mythology established the pattern of divine succession through conflict that defined Greek religious thought. Prometheus' creation and protection of humanity made the Titans essential to human origins, while their fall illustrated the inevitability of change and the dangers of tyrannical rule.",
    "impact": "Titan mythology profoundly influenced Western literature, from Milton's Paradise Lost to Shelley's Prometheus Unbound. The term 'titanic' entered common usage to describe anything of enormous size or power. Their stories continue to resonate in modern fantasy literature, films, and games, representing themes of rebellion against authority and the cost of defying divine order."
  },
  "relatedEntities": [
    {
      "type": "deity",
      "id": "greek_zeus",
      "relationship": "chief adversary and successor",
      "_unverified": true,
      "_unverifiedReason": "Referenced entity not found in database"
    },
    {
      "type": "deity",
      "id": "greek_cronus",
      "relationship": "leader and king",
      "_unverified": true,
      "_unverifiedReason": "Referenced entity not found in database"
    },
    {
      "type": "deity",
      "id": "greek_prometheus",
      "relationship": "member, humanity's champion",
      "_unverified": true,
      "_unverifiedReason": "Referenced entity not found in database"
    },
    {
      "type": "cosmology",
      "id": "greek_tartarus",
      "relationship": "prison realm",
      "_unverified": true,
      "_unverifiedReason": "Referenced entity not found in database"
    },
    {
      "type": "cosmology",
      "id": "greek_olympus",
      "relationship": "successor domain",
      "_unverified": true,
      "_unverifiedReason": "Referenced entity not found in database"
    },
    {
      "type": "creature",
      "id": "greek_cyclopes",
      "relationship": "siblings, Titan allies",
      "_unverified": true,
      "_unverifiedReason": "Referenced entity not found in database"
    }
  ],
  "corpusQueries": [
    "Titanomachy war between Titans and Olympians",
    "Cronus devouring children Greek myth",
    "Prometheus fire theft punishment",
    "Atlas holding sky punishment",
    "Greek cosmogony divine succession",
    "Golden Age Cronus rule mythology"
  ],
  "sources": [
    {
      "title": "Theogony",
      "author": "Hesiod",
      "type": "primary"
    },
    {
      "title": "Bibliotheca",
      "author": "Apollodorus",
      "type": "primary"
    },
    {
      "title": "Greek Religion",
      "author": "Walter Burkert",
      "type": "scholarly"
    },
    {
      "title": "The Greek Myths",
      "author": "Robert Graves",
      "type": "reference"
    }
  ]
}