{
  "id": "hindu_creation",
  "type": "cosmology",
  "cosmologicalType": "creation_myth",
  "name": "Hindu Creation Cosmology",
  "displayName": "Hindu Creation - The Eternal Cycle",
  "mythology": "hindu",
  "filename": "creation",
  "_enhanced": true,
  "_uploadedAt": "2025-12-25T15:46:32.606895",
  "description": "Hindu creation cosmology presents one of the most sophisticated and philosophically rich accounts of cosmic origins in world religion. Unlike linear creation narratives, Hindu cosmology describes creation as an eternal, cyclical process without ultimate beginning or end. The universe emerges from the cosmic waters, flourishes for billions of years through elaborate time cycles (yugas and kalpas), then dissolves back into the unmanifest (pralaya), only to be reborn again in an endless dance of manifestation and dissolution. Multiple creation accounts coexist within Hindu tradition, each illuminating different aspects of the cosmic mystery: the Purusha Sukta describes the universe arising from the sacrifice of the Cosmic Person; the Hiranyagarbha (Golden Embryo) narrative tells of Brahma emerging from a cosmic egg; the Nasadiya Sukta philosophically questions the very possibility of describing creation. This diversity reflects Hinduism's embrace of multiple valid perspectives (anekantavada) on ultimate reality, with creation, preservation, and destruction dancing in endless rhythm through the divine interplay of the Trimurti - Brahma, Vishnu, and Shiva.",
  "sections": {
    "origins": "Hindu creation narratives develop across several textual traditions spanning over two millennia. The earliest accounts appear in the Rig Veda (c. 1500-1200 BCE), including the famous Nasadiya Sukta (Hymn of Creation, RV 10.129) which philosophically contemplates existence before creation, and the Purusha Sukta (RV 10.90) describing cosmic sacrifice. The Brahmanas (c. 900-700 BCE) elaborate ritual and cosmological connections. The Upanishads (c. 800-200 BCE) develop philosophical interpretations, identifying Brahman as the ultimate source. The Puranas (c. 300-1500 CE) systematize the cosmological timeline with precise calculations of yugas and kalpas. Each era contributed distinctive emphases: Vedic hymns stress primordial sacrifice and divine speech; Upanishads emphasize emanation from Brahman; Puranas elaborate detailed cosmic architecture.",
    "attributes": "Hindu creation cosmology exhibits several distinctive attributes. First, cyclicality: the universe eternally alternates between manifestation (srishti) and dissolution (pralaya), without absolute beginning or end. Second, multiplicity: various creation accounts coexist as complementary perspectives, not competing claims. Third, hierarchy: creation proceeds through emanation, from subtle to gross, from unity to multiplicity, through progressive stages. Fourth, correspondence: macrocosm and microcosm mirror each other - the universe's structure reflects in the human body and psyche. Fifth, divinity: creation is not separate from the divine but is Brahman's self-expression, the play (lila) of consciousness. Sixth, temporality: elaborate time schemes (yugas, manvantaras, kalpas) provide cosmic context for human existence within vast cycles.",
    "significance": "Hindu creation cosmology carries profound spiritual, philosophical, and practical significance. Spiritually, it situates human existence within a vast cosmic drama, giving meaning to individual life as part of eternal divine play. Philosophically, it addresses fundamental questions about existence, consciousness, and causation while acknowledging the limits of human comprehension (as in the Nasadiya Sukta's acknowledgment that even the gods may not know the ultimate origin). Practically, the cosmological framework grounds Hindu ethics (dharma) in cosmic order, establishes the ritual calendar through alignment with cosmic cycles, and provides context for understanding karma and reincarnation across multiple world-ages. The teaching that all emerges from and returns to Brahman supports non-dual (Advaita) philosophy, while the elaboration of divine beings supports devotional (Bhakti) practice.",
    "culturalImpact": "Hindu creation cosmology has influenced religious thought, scientific speculation, and artistic expression across millennia and continents. Within Hinduism, it provides the conceptual framework for temple architecture (representing the cosmic mountain), ritual timing (aligned with cosmic cycles), and spiritual practice (moving from multiplicity to unity). The concepts influenced Buddhism's cosmological schemes, Jainism's eternal universe, and later Sikh thought. In the modern period, Hindu cosmological time scales impressed Western scientists; Carl Sagan famously noted Hinduism as the only religion whose time scales correspond to modern scientific cosmology. The concepts of eternal cycles, creation through sound (Om), and reality as divine play continue to influence contemporary spirituality, physics (multiverse theories), and popular culture worldwide."
  },
  "connections": [
    {
      "id": "vishnu",
      "type": "deity",
      "name": "Vishnu",
      "relationship": "Preserver from whom Brahma emerges"
    },
    {
      "id": "brahma",
      "type": "deity",
      "name": "Brahma",
      "relationship": "Creator deity"
    },
    {
      "id": "shiva",
      "type": "deity",
      "name": "Shiva",
      "relationship": "Destroyer who enables renewal"
    }
  ],
  "layers": [
    {
      "name": "Satya-loka",
      "description": "Realm of Brahma, highest heaven"
    },
    {
      "name": "Tapa-loka",
      "description": "Realm of austerities"
    },
    {
      "name": "Jana-loka",
      "description": "Realm of celestial beings"
    },
    {
      "name": "Mahar-loka",
      "description": "Great realm of sages"
    },
    {
      "name": "Svar-loka",
      "description": "Heaven realm"
    },
    {
      "name": "Bhuvar-loka",
      "description": "Atmospheric realm"
    },
    {
      "name": "Bhur-loka",
      "description": "Earth realm"
    }
  ],
  "features": [
    "Seven upper worlds (lokas)",
    "Seven lower worlds (patalas)",
    "Mount Meru as cosmic axis",
    "Four yugas cycling through time",
    "Cosmic ocean of milk",
    "World-supporting serpent Shesha",
    "Cosmic egg (Brahmanda)"
  ],
  "creationDetails": {
    "purushaHymn": {
      "concept": "Universe created from cosmic being Purusha",
      "sacrifice": "Gods sacrifice Purusha to create world",
      "source": "Rig Veda 10.90",
      "details": "From Purusha's mouth came Brahmins, from arms the Kshatriyas, from thighs the Vaishyas, from feet the Shudras"
    },
    "themes": [
      "Eternal cycles (samsara)",
      "Trimurti (Brahma-Vishnu-Shiva)",
      "Maya (illusion/creative power)",
      "Brahman as ultimate reality",
      "Sound (Om) as creative force"
    ],
    "cycles": {
      "kalpa": "Day of Brahma (4.32 billion years)",
      "manvantara": "14 per kalpa, each ruled by a Manu",
      "yuga": "Four ages: Satya (golden), Treta, Dvapara, Kali (current age)",
      "mahayuga": "Complete cycle of four yugas (4.32 million years)"
    },
    "cosmicEgg": {
      "name": "Brahmanda",
      "hiranyagarbha": "Golden embryo floating on cosmic waters",
      "brahma": "Emerges from lotus growing from Vishnu's navel",
      "creation": "Brahma creates from cosmic egg, dividing it into heaven and earth"
    },
    "worldStructure": {
      "lokas": [
        "Satya-loka (Brahma's realm)",
        "Tapa-loka (realm of austerity)",
        "Jana-loka (celestial beings)",
        "Mahar-loka (great sages)",
        "Svar-loka (heaven/Indra's realm)",
        "Bhuvar-loka (atmosphere)",
        "Bhur-loka (earth)"
      ],
      "underworlds": [
        "Atala",
        "Vitala",
        "Sutala",
        "Talatala",
        "Mahatala",
        "Rasatala",
        "Patala"
      ]
    }
  },
  "primarySources": [
    {
      "title": "Rig Veda",
      "hymns": "10.90 (Purusha Sukta), 10.129 (Nasadiya Sukta)",
      "date": "c. 1500-1200 BCE",
      "description": "Earliest Vedic creation hymns"
    },
    {
      "title": "Brihadaranyaka Upanishad",
      "date": "c. 700 BCE",
      "description": "Philosophical cosmological speculation"
    },
    {
      "title": "Vishnu Purana",
      "date": "c. 400 CE",
      "description": "Detailed cosmological and creation narratives"
    },
    {
      "title": "Bhagavata Purana",
      "date": "c. 800-1000 CE",
      "description": "Creation through Vishnu's avatars"
    }
  ],
  "relatedEntities": [
    {
      "id": "brahma",
      "type": "deity",
      "name": "Brahma",
      "relationship": "related"
    },
    {
      "id": "vishnu",
      "type": "deity",
      "name": "Vishnu",
      "relationship": "related"
    },
    {
      "id": "shiva",
      "type": "deity",
      "name": "Shiva",
      "relationship": "related"
    },
    {
      "id": "mount_meru",
      "type": "place",
      "name": "Mount Meru",
      "relationship": "related",
      "_unverified": true,
      "_unverifiedReason": "Referenced entity not found in database"
    },
    {
      "id": "manu",
      "type": "hero",
      "name": "Manu",
      "relationship": "related",
      "_unverified": true,
      "_unverifiedReason": "Referenced entity not found in database"
    }
  ],
  "corpusQueries": [
    "Hindu creation cosmology Purusha Sukta Nasadiya",
    "Brahma Vishnu Shiva Trimurti creation preservation destruction",
    "Yuga kalpa manvantara Hindu cosmic time cycles",
    "Hiranyagarbha golden embryo cosmic egg Brahmanda",
    "Hindu seven lokas upper lower worlds cosmology",
    "Vedic Puranic creation myths comparison"
  ],
  "metadata": {
    "polishedAt": "2025-12-25T04:49:57.078Z",
    "source": "html_parser",
    "sourceFile": "mythos/hindu/cosmology/creation.html",
    "createdAt": "2025-12-13T02:38:07.365Z",
    "createdBy": "system",
    "polishedBy": "agent_10_cosmology",
    "updatedAt": "2025-12-13T02:38:07.365Z",
    "verified": false,
    "enrichmentVersion": "2.0",
    "typeFixedAt": "2025-12-31T09:42:55.082Z",
    "typeFixedBy": "fix-cosmology-types.js",
    "enrichedBy": "asset_enrichment_agent",
    "historicalPeriod": "Vedic period through present (c. 1500 BCE - present)",
    "primaryRegion": "Indian subcontinent"
  }
}