{
  "id": "greek_hero_orpheus",
  "name": "Orpheus",
  "icon": "🎶",
  "subtitle": "The Divine Musician, Prophet of the Mysteries",
  "description": "The greatest musician the world has ever known, Orpheus was born of divine and muse parentage—either Apollo himself or the Thracian king Oeagrus, and the Muse Calliope. His music could charm beasts, move stones, and even sway the lords of death. His tragic descent to the Underworld for his beloved Eurydice remains one of mythology's most poignant tales of love and loss.",
  "mythology": "greek",
  "type": "hero",
  "status": "published",
  "authorId": "official",
  "createdAt": {
    "_seconds": 1765797566,
    "_nanoseconds": 711000000
  },
  "updatedAt": {
    "_seconds": 1765797566,
    "_nanoseconds": 711000000
  },
  "titles": [
    "Son of Apollo/Oeagrus and Calliope",
    "Prophet of the Mysteries",
    "Prince of Thrace",
    "The Enchanter"
  ],
  "domains": [
    "Music",
    "poetry",
    "prophecy",
    "mysteries",
    "healing through song",
    "eloquence"
  ],
  "symbols": [
    "Lyre (seven-stringed)",
    "laurel wreath",
    "tortoise (lyre's shell origin)"
  ],
  "sacredAnimals": [
    "All creatures were subject to his music—lions",
    "serpents",
    "birds",
    "even the beasts of the wild"
  ],
  "associated_colors": [
    "Purple (mystery)",
    "gold (divine music)",
    "white (prophetic purity)"
  ],
  "cult_centers": [
    "Thrace",
    "Lesbos (where his head washed ashore)",
    "various Orphic temples"
  ],
  "mythsAndLegends": [
    {
      "title": "🔮 The Orphic Mysteries",
      "summary": "Orpheus was credited as the founder of the Orphic Mysteries, one of ancient Greece's most influential religious movements. These mysteries taught doctrines radically different from standard Greek religion: The Orphic Mysteries influenced later philosophical schools, particularly Pythagoreanism and Platonism, and elements of Orphic belief were absorbed into early Christianity."
    }
  ],
  "sources": [
    "Ovid, Metamorphoses X-XI: The most complete and literary account of the Orpheus and Eurydice myth, including his descent to the Underworld, the fatal backward glance, and his death at the hands of the Maenads.",
    "Virgil, Georgics IV: Places the Orpheus myth within the story of Aristaeus and his bees, providing the backstory of Eurydice's death and a deeply moving account of Orpheus's grief.",
    "Apollonius Rhodius, Argonautica: Describes Orpheus's crucial role in the Argonaut expedition, including his defeat of the Sirens.",
    "Apollodorus, Bibliotheca: Provides mythographic summary of Orpheus's genealogy and adventures.",
    "Plato, Symposium and Republic: References Orpheus as an example of mythological love and discusses the nature of Orphic teachings.",
    "Orphic Hymns: Ancient collection of 87 hymns attributed to Orpheus, used in Orphic religious rites."
  ],
  "completeness": 66.7,
  "searchTerms": [
    "orpheus",
    "greek_hero_orpheus",
    "greek",
    "hero",
    "son of apollo/oeagrus and calliope",
    "prophet of the mysteries",
    "prince of thrace",
    "the enchanter",
    "music",
    "poetry",
    "prophecy",
    "mysteries",
    "healing through song",
    "eloquence"
  ],
  "feats": [],
  "metadata": {
    "enrichedBy": "completeness_analyzer",
    "finalEnrichment": true,
    "updatedAt": {
      "_seconds": 1766551142,
      "_nanoseconds": 256000000
    }
  }
}